#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActivityBrowserTag

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function ActivityBrowserTag.ActivityBrowserTag_C.HandleStyling
// 0x0028 (0x0028 - 0x0000)
struct ActivityBrowserTag_C_HandleStyling final
{
public:
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0000(0x0028)()
};
static_assert(alignof(ActivityBrowserTag_C_HandleStyling) == 0x000008, "Wrong alignment on ActivityBrowserTag_C_HandleStyling");
static_assert(sizeof(ActivityBrowserTag_C_HandleStyling) == 0x000028, "Wrong size on ActivityBrowserTag_C_HandleStyling");
static_assert(offsetof(ActivityBrowserTag_C_HandleStyling, K2Node_MakeStruct_SlateColor) == 0x000000, "Member 'ActivityBrowserTag_C_HandleStyling::K2Node_MakeStruct_SlateColor' has a wrong offset!");

// Function ActivityBrowserTag.ActivityBrowserTag_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct ActivityBrowserTag_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ActivityBrowserTag_C_PreConstruct) == 0x000001, "Wrong alignment on ActivityBrowserTag_C_PreConstruct");
static_assert(sizeof(ActivityBrowserTag_C_PreConstruct) == 0x000001, "Wrong size on ActivityBrowserTag_C_PreConstruct");
static_assert(offsetof(ActivityBrowserTag_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'ActivityBrowserTag_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function ActivityBrowserTag.ActivityBrowserTag_C.ExecuteUbergraph_ActivityBrowserTag
// 0x0008 (0x0008 - 0x0000)
struct ActivityBrowserTag_C_ExecuteUbergraph_ActivityBrowserTag final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ActivityBrowserTag_C_ExecuteUbergraph_ActivityBrowserTag) == 0x000004, "Wrong alignment on ActivityBrowserTag_C_ExecuteUbergraph_ActivityBrowserTag");
static_assert(sizeof(ActivityBrowserTag_C_ExecuteUbergraph_ActivityBrowserTag) == 0x000008, "Wrong size on ActivityBrowserTag_C_ExecuteUbergraph_ActivityBrowserTag");
static_assert(offsetof(ActivityBrowserTag_C_ExecuteUbergraph_ActivityBrowserTag, EntryPoint) == 0x000000, "Member 'ActivityBrowserTag_C_ExecuteUbergraph_ActivityBrowserTag::EntryPoint' has a wrong offset!");
static_assert(offsetof(ActivityBrowserTag_C_ExecuteUbergraph_ActivityBrowserTag, K2Node_Event_IsDesignTime) == 0x000004, "Member 'ActivityBrowserTag_C_ExecuteUbergraph_ActivityBrowserTag::K2Node_Event_IsDesignTime' has a wrong offset!");

}

