#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActivityBrowserTag

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ActivityBrowserTag.ActivityBrowserTag_C
// 0x0040 (0x0268 - 0x0228)
class UActivityBrowserTag_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0228(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonBorder*                          BorderTagContainer;                                // 0x0230(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_TagName;                                      // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           TagColor;                                          // 0x0240(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   TagText;                                           // 0x0250(0x0018)(Edit, BlueprintVisible)

public:
	void HandleStyling();
	void PreConstruct(bool IsDesignTime);
	void Construct();
	void ExecuteUbergraph_ActivityBrowserTag(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ActivityBrowserTag_C">();
	}
	static class UActivityBrowserTag_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActivityBrowserTag_C>();
	}
};
static_assert(alignof(UActivityBrowserTag_C) == 0x000008, "Wrong alignment on UActivityBrowserTag_C");
static_assert(sizeof(UActivityBrowserTag_C) == 0x000268, "Wrong size on UActivityBrowserTag_C");
static_assert(offsetof(UActivityBrowserTag_C, UberGraphFrame) == 0x000228, "Member 'UActivityBrowserTag_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UActivityBrowserTag_C, BorderTagContainer) == 0x000230, "Member 'UActivityBrowserTag_C::BorderTagContainer' has a wrong offset!");
static_assert(offsetof(UActivityBrowserTag_C, Text_TagName) == 0x000238, "Member 'UActivityBrowserTag_C::Text_TagName' has a wrong offset!");
static_assert(offsetof(UActivityBrowserTag_C, TagColor) == 0x000240, "Member 'UActivityBrowserTag_C::TagColor' has a wrong offset!");
static_assert(offsetof(UActivityBrowserTag_C, TagText) == 0x000250, "Member 'UActivityBrowserTag_C::TagText' has a wrong offset!");

}

