#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActivityBrowserTile

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ActivityBrowserTile.ActivityBrowserTile_C
// 0x0030 (0x0B98 - 0x0B68)
class UActivityBrowserTile_C final : public UFortActivityBrowserTile
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B68(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Intro;                                             // 0x0B70(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SetDisabled;                                       // 0x0B78(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SetEnabled;                                        // 0x0B80(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnHover;                                           // 0x0B88(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	bool                                          NewVar_0;                                          // 0x0B90(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void Set_Enabled();
	void Set_Disabled();
	void PreConstruct(bool IsDesignTime);
	void ExecuteUbergraph_ActivityBrowserTile(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ActivityBrowserTile_C">();
	}
	static class UActivityBrowserTile_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActivityBrowserTile_C>();
	}
};
static_assert(alignof(UActivityBrowserTile_C) == 0x000008, "Wrong alignment on UActivityBrowserTile_C");
static_assert(sizeof(UActivityBrowserTile_C) == 0x000B98, "Wrong size on UActivityBrowserTile_C");
static_assert(offsetof(UActivityBrowserTile_C, UberGraphFrame) == 0x000B68, "Member 'UActivityBrowserTile_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UActivityBrowserTile_C, Intro) == 0x000B70, "Member 'UActivityBrowserTile_C::Intro' has a wrong offset!");
static_assert(offsetof(UActivityBrowserTile_C, SetDisabled) == 0x000B78, "Member 'UActivityBrowserTile_C::SetDisabled' has a wrong offset!");
static_assert(offsetof(UActivityBrowserTile_C, SetEnabled) == 0x000B80, "Member 'UActivityBrowserTile_C::SetEnabled' has a wrong offset!");
static_assert(offsetof(UActivityBrowserTile_C, OnHover) == 0x000B88, "Member 'UActivityBrowserTile_C::OnHover' has a wrong offset!");
static_assert(offsetof(UActivityBrowserTile_C, NewVar_0) == 0x000B90, "Member 'UActivityBrowserTile_C::NewVar_0' has a wrong offset!");

}

