#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActivityMatchmakingPlay

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ActivityMatchmakingPlay.ActivityMatchmakingPlay_C
// 0x00A8 (0x04F8 - 0x0450)
class UActivityMatchmakingPlay_C final : public UFortActivityMatchmakingWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0450(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       NewModeViolation;                                  // 0x0458(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UAthenaGenericLobbyViolator_C*          AthenaGenericLobbyViolator;                        // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      DebugCreativeServerSelect;                         // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MatchmakingSpinner;                                // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          NewModeBorder;                                     // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShowdownLobbyViolator_C*               ShowdownLobbyViolator;                             // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               ViolatorContent;                                   // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        ViolatorSwitcher;                                  // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              PlaylistsUpdated;                                  // 0x0498(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FTimerHandle                           ShowNewPlaylistTimer;                              // 0x04A8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(const struct FPlaylistFrontEndData& Playlist_Data, class FText Playlist_CMS_Override, EFortLobbyType Lobby_Type)> OnPlaylistChanged;                                 // 0x04B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class USoundBase*                             MatchmakingSucceededSound;                         // 0x04C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   CreativeOptionsSoftClass;                          // 0x04C8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UClass*                                 CreativeOptionsClass;                              // 0x04F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OpenPlayOptions();
	void OnLoaded_10C9F5C84A5049E53E89BA94CDCA8F26(class UClass* Loaded);
	void Construct();
	void OnAvailablePlaylistsUpdated();
	void OnSetPlayButtonText(const class FText& PlayButtonText);
	void OnSetCancelButtonText(const class FText& CancelButtonText);
	void PlaylistChanged(const struct FPlaylistFrontEndData& NewPlaylist, const class FText& PlaylistCMSOverrideName, EFortLobbyType LobbyType);
	void BndEvt__AthenaMatchmakingModeButton_K2Node_ComponentBoundEvent_42_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void SetSquadFillText(bool InCurrentSquadFill);
	void OnNewModeViolatorUpdated(bool bShouldShow);
	void UpdateCustomViolatorText(const class FText& ModeName, const class FText& SubText);
	void Animate();
	void OnMatchmakingFinishedBlueprint(bool bSuccess);
	void OpenCreativeOptions_NativizeMe();
	void BndEvt__PlayButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void ExecuteUbergraph_ActivityMatchmakingPlay(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ActivityMatchmakingPlay_C">();
	}
	static class UActivityMatchmakingPlay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActivityMatchmakingPlay_C>();
	}
};
static_assert(alignof(UActivityMatchmakingPlay_C) == 0x000008, "Wrong alignment on UActivityMatchmakingPlay_C");
static_assert(sizeof(UActivityMatchmakingPlay_C) == 0x0004F8, "Wrong size on UActivityMatchmakingPlay_C");
static_assert(offsetof(UActivityMatchmakingPlay_C, UberGraphFrame) == 0x000450, "Member 'UActivityMatchmakingPlay_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UActivityMatchmakingPlay_C, NewModeViolation) == 0x000458, "Member 'UActivityMatchmakingPlay_C::NewModeViolation' has a wrong offset!");
static_assert(offsetof(UActivityMatchmakingPlay_C, AthenaGenericLobbyViolator) == 0x000460, "Member 'UActivityMatchmakingPlay_C::AthenaGenericLobbyViolator' has a wrong offset!");
static_assert(offsetof(UActivityMatchmakingPlay_C, DebugCreativeServerSelect) == 0x000468, "Member 'UActivityMatchmakingPlay_C::DebugCreativeServerSelect' has a wrong offset!");
static_assert(offsetof(UActivityMatchmakingPlay_C, MatchmakingSpinner) == 0x000470, "Member 'UActivityMatchmakingPlay_C::MatchmakingSpinner' has a wrong offset!");
static_assert(offsetof(UActivityMatchmakingPlay_C, NewModeBorder) == 0x000478, "Member 'UActivityMatchmakingPlay_C::NewModeBorder' has a wrong offset!");
static_assert(offsetof(UActivityMatchmakingPlay_C, ShowdownLobbyViolator) == 0x000480, "Member 'UActivityMatchmakingPlay_C::ShowdownLobbyViolator' has a wrong offset!");
static_assert(offsetof(UActivityMatchmakingPlay_C, ViolatorContent) == 0x000488, "Member 'UActivityMatchmakingPlay_C::ViolatorContent' has a wrong offset!");
static_assert(offsetof(UActivityMatchmakingPlay_C, ViolatorSwitcher) == 0x000490, "Member 'UActivityMatchmakingPlay_C::ViolatorSwitcher' has a wrong offset!");
static_assert(offsetof(UActivityMatchmakingPlay_C, PlaylistsUpdated) == 0x000498, "Member 'UActivityMatchmakingPlay_C::PlaylistsUpdated' has a wrong offset!");
static_assert(offsetof(UActivityMatchmakingPlay_C, ShowNewPlaylistTimer) == 0x0004A8, "Member 'UActivityMatchmakingPlay_C::ShowNewPlaylistTimer' has a wrong offset!");
static_assert(offsetof(UActivityMatchmakingPlay_C, OnPlaylistChanged) == 0x0004B0, "Member 'UActivityMatchmakingPlay_C::OnPlaylistChanged' has a wrong offset!");
static_assert(offsetof(UActivityMatchmakingPlay_C, MatchmakingSucceededSound) == 0x0004C0, "Member 'UActivityMatchmakingPlay_C::MatchmakingSucceededSound' has a wrong offset!");
static_assert(offsetof(UActivityMatchmakingPlay_C, CreativeOptionsSoftClass) == 0x0004C8, "Member 'UActivityMatchmakingPlay_C::CreativeOptionsSoftClass' has a wrong offset!");
static_assert(offsetof(UActivityMatchmakingPlay_C, CreativeOptionsClass) == 0x0004F0, "Member 'UActivityMatchmakingPlay_C::CreativeOptionsClass' has a wrong offset!");

}

