#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimNotifyState_MechStopMontagePlayEarlyInMotion

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function AnimNotifyState_MechStopMontagePlayEarlyInMotion.AnimNotifyState_MechStopMontagePlayEarlyInMotion_C.Received_NotifyTick
// 0x00B0 (0x00B0 - 0x0000)
struct AnimNotifyState_MechStopMontagePlayEarlyInMotion_C_Received_NotifyTick final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FrameDeltaTime;                                    // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           K2Node_DynamicCast_AsAnim_Montage;                 // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMech_Veh_AnimBP_C*                     K2Node_DynamicCast_AsMech_Veh_Anim_BP;             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActor_ReturnValue;               // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0xC];                                       // 0x0054(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0060(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_InverseTransformDirection_ReturnValue;    // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSizeXYSquared_ReturnValue;               // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AnimNotifyState_MechStopMontagePlayEarlyInMotion_C_Received_NotifyTick) == 0x000010, "Wrong alignment on AnimNotifyState_MechStopMontagePlayEarlyInMotion_C_Received_NotifyTick");
static_assert(sizeof(AnimNotifyState_MechStopMontagePlayEarlyInMotion_C_Received_NotifyTick) == 0x0000B0, "Wrong size on AnimNotifyState_MechStopMontagePlayEarlyInMotion_C_Received_NotifyTick");
static_assert(offsetof(AnimNotifyState_MechStopMontagePlayEarlyInMotion_C_Received_NotifyTick, MeshComp) == 0x000000, "Member 'AnimNotifyState_MechStopMontagePlayEarlyInMotion_C_Received_NotifyTick::MeshComp' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_MechStopMontagePlayEarlyInMotion_C_Received_NotifyTick, Animation) == 0x000008, "Member 'AnimNotifyState_MechStopMontagePlayEarlyInMotion_C_Received_NotifyTick::Animation' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_MechStopMontagePlayEarlyInMotion_C_Received_NotifyTick, FrameDeltaTime) == 0x000010, "Member 'AnimNotifyState_MechStopMontagePlayEarlyInMotion_C_Received_NotifyTick::FrameDeltaTime' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_MechStopMontagePlayEarlyInMotion_C_Received_NotifyTick, ReturnValue) == 0x000014, "Member 'AnimNotifyState_MechStopMontagePlayEarlyInMotion_C_Received_NotifyTick::ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_MechStopMontagePlayEarlyInMotion_C_Received_NotifyTick, K2Node_DynamicCast_AsAnim_Montage) == 0x000018, "Member 'AnimNotifyState_MechStopMontagePlayEarlyInMotion_C_Received_NotifyTick::K2Node_DynamicCast_AsAnim_Montage' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_MechStopMontagePlayEarlyInMotion_C_Received_NotifyTick, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'AnimNotifyState_MechStopMontagePlayEarlyInMotion_C_Received_NotifyTick::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_MechStopMontagePlayEarlyInMotion_C_Received_NotifyTick, CallFunc_GetAnimInstance_ReturnValue) == 0x000028, "Member 'AnimNotifyState_MechStopMontagePlayEarlyInMotion_C_Received_NotifyTick::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_MechStopMontagePlayEarlyInMotion_C_Received_NotifyTick, K2Node_DynamicCast_AsMech_Veh_Anim_BP) == 0x000030, "Member 'AnimNotifyState_MechStopMontagePlayEarlyInMotion_C_Received_NotifyTick::K2Node_DynamicCast_AsMech_Veh_Anim_BP' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_MechStopMontagePlayEarlyInMotion_C_Received_NotifyTick, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'AnimNotifyState_MechStopMontagePlayEarlyInMotion_C_Received_NotifyTick::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_MechStopMontagePlayEarlyInMotion_C_Received_NotifyTick, CallFunc_GetOwningActor_ReturnValue) == 0x000040, "Member 'AnimNotifyState_MechStopMontagePlayEarlyInMotion_C_Received_NotifyTick::CallFunc_GetOwningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_MechStopMontagePlayEarlyInMotion_C_Received_NotifyTick, CallFunc_GetVelocity_ReturnValue) == 0x000048, "Member 'AnimNotifyState_MechStopMontagePlayEarlyInMotion_C_Received_NotifyTick::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_MechStopMontagePlayEarlyInMotion_C_Received_NotifyTick, CallFunc_GetTransform_ReturnValue) == 0x000060, "Member 'AnimNotifyState_MechStopMontagePlayEarlyInMotion_C_Received_NotifyTick::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_MechStopMontagePlayEarlyInMotion_C_Received_NotifyTick, CallFunc_InverseTransformDirection_ReturnValue) == 0x000090, "Member 'AnimNotifyState_MechStopMontagePlayEarlyInMotion_C_Received_NotifyTick::CallFunc_InverseTransformDirection_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_MechStopMontagePlayEarlyInMotion_C_Received_NotifyTick, CallFunc_VSizeXYSquared_ReturnValue) == 0x00009C, "Member 'AnimNotifyState_MechStopMontagePlayEarlyInMotion_C_Received_NotifyTick::CallFunc_VSizeXYSquared_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_MechStopMontagePlayEarlyInMotion_C_Received_NotifyTick, CallFunc_Greater_FloatFloat_ReturnValue) == 0x0000A0, "Member 'AnimNotifyState_MechStopMontagePlayEarlyInMotion_C_Received_NotifyTick::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");

}

