#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaDirectAquisitionStyleScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaDirectAquisitionStyleScreen.AthenaDirectAquisitionStyleScreen_C
// 0x0070 (0x0568 - 0x04F8)
class UAthenaDirectAquisitionStyleScreen_C final : public UFortStoreFrontOfferDetailsWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPanelButton_C*                         Button_Next;                                       // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPanelButton_C*                         Button_Previous;                                   // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               CameraFramingWidget;                               // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UItemInfoHeaderWidget_C*                ItemInfoHeader;                                    // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaLockedStyleNotification_C*       LockedNotification;                                // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPanelButton_C*                         MobileCloseButton;                                 // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_CloseButton;                               // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       StyleDisclaimer;                                   // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          OfferSet;                                          // 0x0548(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_549[0x3];                                      // 0x0549(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         IndexIntoOffersWithVariantsList;                   // 0x054C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 OfferSubIndicesWithVariants;                       // 0x0550(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class UFortItemDefinition*                    InitialTriggeringItemDef;                          // 0x0560(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	class UFortAccountItemDefinition* GetOfferGrantedItemDef();
	void RebuildStylesFromOffer();
	void SwitchToNextItemInOffer(int32 Direction);
	void ScanOfferForVariants();
	void UpdateFromVariant(const struct FGameplayTag& VariantChannelTag, const struct FGameplayTag& VariantTag, bool IsOwned);
	class UWidget* GetWidgetForFramingViewedItem();
	void HandleBack(bool* bPassThrough);
	void Construct();
	void OnOfferSet();
	void OnActivated();
	void OnDeactivated();
	void BndEvt__Button_Previous_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__Button_Next_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__MobileCloseButton_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void OnVariantChanged(const struct FGameplayTag& VariantChannel, const struct FGameplayTag& VariantTag, bool IsOwned);
	void ExecuteUbergraph_AthenaDirectAquisitionStyleScreen(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaDirectAquisitionStyleScreen_C">();
	}
	static class UAthenaDirectAquisitionStyleScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaDirectAquisitionStyleScreen_C>();
	}
};
static_assert(alignof(UAthenaDirectAquisitionStyleScreen_C) == 0x000008, "Wrong alignment on UAthenaDirectAquisitionStyleScreen_C");
static_assert(sizeof(UAthenaDirectAquisitionStyleScreen_C) == 0x000568, "Wrong size on UAthenaDirectAquisitionStyleScreen_C");
static_assert(offsetof(UAthenaDirectAquisitionStyleScreen_C, UberGraphFrame) == 0x0004F8, "Member 'UAthenaDirectAquisitionStyleScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAquisitionStyleScreen_C, Button_Next) == 0x000500, "Member 'UAthenaDirectAquisitionStyleScreen_C::Button_Next' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAquisitionStyleScreen_C, Button_Previous) == 0x000508, "Member 'UAthenaDirectAquisitionStyleScreen_C::Button_Previous' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAquisitionStyleScreen_C, CameraFramingWidget) == 0x000510, "Member 'UAthenaDirectAquisitionStyleScreen_C::CameraFramingWidget' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAquisitionStyleScreen_C, Image_1) == 0x000518, "Member 'UAthenaDirectAquisitionStyleScreen_C::Image_1' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAquisitionStyleScreen_C, ItemInfoHeader) == 0x000520, "Member 'UAthenaDirectAquisitionStyleScreen_C::ItemInfoHeader' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAquisitionStyleScreen_C, LockedNotification) == 0x000528, "Member 'UAthenaDirectAquisitionStyleScreen_C::LockedNotification' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAquisitionStyleScreen_C, MobileCloseButton) == 0x000530, "Member 'UAthenaDirectAquisitionStyleScreen_C::MobileCloseButton' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAquisitionStyleScreen_C, Overlay_CloseButton) == 0x000538, "Member 'UAthenaDirectAquisitionStyleScreen_C::Overlay_CloseButton' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAquisitionStyleScreen_C, StyleDisclaimer) == 0x000540, "Member 'UAthenaDirectAquisitionStyleScreen_C::StyleDisclaimer' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAquisitionStyleScreen_C, OfferSet) == 0x000548, "Member 'UAthenaDirectAquisitionStyleScreen_C::OfferSet' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAquisitionStyleScreen_C, IndexIntoOffersWithVariantsList) == 0x00054C, "Member 'UAthenaDirectAquisitionStyleScreen_C::IndexIntoOffersWithVariantsList' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAquisitionStyleScreen_C, OfferSubIndicesWithVariants) == 0x000550, "Member 'UAthenaDirectAquisitionStyleScreen_C::OfferSubIndicesWithVariants' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAquisitionStyleScreen_C, InitialTriggeringItemDef) == 0x000560, "Member 'UAthenaDirectAquisitionStyleScreen_C::InitialTriggeringItemDef' has a wrong offset!");

}

