#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaMatchmakingPlayLegacy

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaMatchmakingPlayLegacy.AthenaMatchmakingPlayLegacy_C
// 0x00A8 (0x0538 - 0x0490)
class UAthenaMatchmakingPlayLegacy_C final : public UFortAthenaMatchmakingWidgetLegacy
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0490(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       NewModeViolation;                                  // 0x0498(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UAthenaGenericLobbyViolator_C*          AthenaGenericLobbyViolator;                        // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      DebugCreativeServerSelect;                         // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MatchmakingSpinner;                                // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          NewModeBorder;                                     // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShowdownLobbyViolator_C*               ShowdownLobbyViolator;                             // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               ViolatorContent;                                   // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        ViolatorSwitcher;                                  // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              PlaylistsUpdated;                                  // 0x04D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FTimerHandle                           ShowNewPlaylistTimer;                              // 0x04E8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(const struct FPlaylistFrontEndData& Playlist_Data, class FText Playlist_CMS_Override, EFortLobbyType Lobby_Type)> OnPlaylistChanged;                                 // 0x04F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class USoundBase*                             MatchmakingSucceededSound;                         // 0x0500(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   CreativeOptionsSoftClass;                          // 0x0508(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UClass*                                 CreativeOptionsClass;                              // 0x0530(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OpenPlayOptions();
	void OnLoaded_624287AB42851447B4164286AAD2D464(class UClass* Loaded);
	void OnEventEnded_F383E56A48B455AA313486B6EC801D0D(const class FString& EventName, const struct FTimespan& TimeUntilEnd, const struct FTimespan& TimeSinceBegin, float TimespanRatio);
	void OnEventUpdated_F383E56A48B455AA313486B6EC801D0D(const class FString& EventName, const struct FTimespan& TimeUntilEnd, const struct FTimespan& TimeSinceBegin, float TimespanRatio);
	void OnEventActive_F383E56A48B455AA313486B6EC801D0D(const class FString& EventName, const struct FTimespan& TimeUntilEnd, const struct FTimespan& TimeSinceBegin, float TimespanRatio);
	void OnAvailablePlaylistsUpdated();
	void OnSetPlayButtonText(const class FText& PlayButtonText);
	void OnSetCancelButtonText(const class FText& CancelButtonText);
	void PlaylistChanged(const struct FPlaylistFrontEndData& NewPlaylist, const class FText& PlaylistCMSOverrideName, EFortLobbyType LobbyType);
	void BndEvt__AthenaMatchmakingModeButton_K2Node_ComponentBoundEvent_42_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void SetSquadFillText(bool InCurrentSquadFill);
	void OnNewModeViolatorUpdated(bool bShouldShow);
	void UpdateCustomViolatorText(const class FText& ModeName, const class FText& SubText);
	void Animate();
	void OnMatchmakingFinishedBlueprint(bool bSuccess);
	void OpenCreativeOptions_NativizeMe();
	void Construct();
	void BndEvt__PlayButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void kevin_says_hello();
	void ExecuteUbergraph_AthenaMatchmakingPlayLegacy(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaMatchmakingPlayLegacy_C">();
	}
	static class UAthenaMatchmakingPlayLegacy_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaMatchmakingPlayLegacy_C>();
	}
};
static_assert(alignof(UAthenaMatchmakingPlayLegacy_C) == 0x000008, "Wrong alignment on UAthenaMatchmakingPlayLegacy_C");
static_assert(sizeof(UAthenaMatchmakingPlayLegacy_C) == 0x000538, "Wrong size on UAthenaMatchmakingPlayLegacy_C");
static_assert(offsetof(UAthenaMatchmakingPlayLegacy_C, UberGraphFrame) == 0x000490, "Member 'UAthenaMatchmakingPlayLegacy_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingPlayLegacy_C, NewModeViolation) == 0x000498, "Member 'UAthenaMatchmakingPlayLegacy_C::NewModeViolation' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingPlayLegacy_C, AthenaGenericLobbyViolator) == 0x0004A0, "Member 'UAthenaMatchmakingPlayLegacy_C::AthenaGenericLobbyViolator' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingPlayLegacy_C, DebugCreativeServerSelect) == 0x0004A8, "Member 'UAthenaMatchmakingPlayLegacy_C::DebugCreativeServerSelect' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingPlayLegacy_C, MatchmakingSpinner) == 0x0004B0, "Member 'UAthenaMatchmakingPlayLegacy_C::MatchmakingSpinner' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingPlayLegacy_C, NewModeBorder) == 0x0004B8, "Member 'UAthenaMatchmakingPlayLegacy_C::NewModeBorder' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingPlayLegacy_C, ShowdownLobbyViolator) == 0x0004C0, "Member 'UAthenaMatchmakingPlayLegacy_C::ShowdownLobbyViolator' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingPlayLegacy_C, ViolatorContent) == 0x0004C8, "Member 'UAthenaMatchmakingPlayLegacy_C::ViolatorContent' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingPlayLegacy_C, ViolatorSwitcher) == 0x0004D0, "Member 'UAthenaMatchmakingPlayLegacy_C::ViolatorSwitcher' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingPlayLegacy_C, PlaylistsUpdated) == 0x0004D8, "Member 'UAthenaMatchmakingPlayLegacy_C::PlaylistsUpdated' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingPlayLegacy_C, ShowNewPlaylistTimer) == 0x0004E8, "Member 'UAthenaMatchmakingPlayLegacy_C::ShowNewPlaylistTimer' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingPlayLegacy_C, OnPlaylistChanged) == 0x0004F0, "Member 'UAthenaMatchmakingPlayLegacy_C::OnPlaylistChanged' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingPlayLegacy_C, MatchmakingSucceededSound) == 0x000500, "Member 'UAthenaMatchmakingPlayLegacy_C::MatchmakingSucceededSound' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingPlayLegacy_C, CreativeOptionsSoftClass) == 0x000508, "Member 'UAthenaMatchmakingPlayLegacy_C::CreativeOptionsSoftClass' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingPlayLegacy_C, CreativeOptionsClass) == 0x000530, "Member 'UAthenaMatchmakingPlayLegacy_C::CreativeOptionsClass' has a wrong offset!");

}

