#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaBattlePassReward

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaBattlePassReward.AthenaBattlePassReward_C
// 0x0048 (0x0B98 - 0x0B50)
class UAthenaBattlePassReward_C final : public UBattlePassScreenTierListReward
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B50(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Intro;                                             // 0x0B58(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonBorder*                          BorderOwned;                                       // 0x0B60(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Check;                                             // 0x0B68(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Hovered;                                           // 0x0B70(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Background;                                  // 0x0B78(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       OwnedText;                                         // 0x0B80(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RevealOverlay;                                     // 0x0B88(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Styles;                                    // 0x0B90(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BPSetup(class UFortItem* InReward);
	void BP_OnUnhovered();
	void BP_OnHovered();
	void ExecuteUbergraph_AthenaBattlePassReward(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaBattlePassReward_C">();
	}
	static class UAthenaBattlePassReward_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaBattlePassReward_C>();
	}
};
static_assert(alignof(UAthenaBattlePassReward_C) == 0x000008, "Wrong alignment on UAthenaBattlePassReward_C");
static_assert(sizeof(UAthenaBattlePassReward_C) == 0x000B98, "Wrong size on UAthenaBattlePassReward_C");
static_assert(offsetof(UAthenaBattlePassReward_C, UberGraphFrame) == 0x000B50, "Member 'UAthenaBattlePassReward_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaBattlePassReward_C, Intro) == 0x000B58, "Member 'UAthenaBattlePassReward_C::Intro' has a wrong offset!");
static_assert(offsetof(UAthenaBattlePassReward_C, BorderOwned) == 0x000B60, "Member 'UAthenaBattlePassReward_C::BorderOwned' has a wrong offset!");
static_assert(offsetof(UAthenaBattlePassReward_C, Check) == 0x000B68, "Member 'UAthenaBattlePassReward_C::Check' has a wrong offset!");
static_assert(offsetof(UAthenaBattlePassReward_C, Hovered) == 0x000B70, "Member 'UAthenaBattlePassReward_C::Hovered' has a wrong offset!");
static_assert(offsetof(UAthenaBattlePassReward_C, Image_Background) == 0x000B78, "Member 'UAthenaBattlePassReward_C::Image_Background' has a wrong offset!");
static_assert(offsetof(UAthenaBattlePassReward_C, OwnedText) == 0x000B80, "Member 'UAthenaBattlePassReward_C::OwnedText' has a wrong offset!");
static_assert(offsetof(UAthenaBattlePassReward_C, RevealOverlay) == 0x000B88, "Member 'UAthenaBattlePassReward_C::RevealOverlay' has a wrong offset!");
static_assert(offsetof(UAthenaBattlePassReward_C, SizeBox_Styles) == 0x000B90, "Member 'UAthenaBattlePassReward_C::SizeBox_Styles' has a wrong offset!");

}

