#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaCustomizationPicker

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaCustomizationPicker.AthenaCustomizationPicker_C
// 0x0040 (0x03D8 - 0x0398)
class UAthenaCustomizationPicker_C final : public UAthenaCustomizationPicker
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0398(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonTextBlock*                       Text_FilterName;                                   // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         TextBlock_NoItemAvailable;                         // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_DisplayItemAvailability;            // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnDisableSaveButton;                               // 0x03B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnEnableSaveButton;                                // 0x03C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void OnNoItemsAvailableInFilter(const class FText& EmptyDisplayText);
	void OnItemsAvailableInFilter();
	void HandleDifferentFilterSetBP();
	void ExecuteUbergraph_AthenaCustomizationPicker(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaCustomizationPicker_C">();
	}
	static class UAthenaCustomizationPicker_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaCustomizationPicker_C>();
	}
};
static_assert(alignof(UAthenaCustomizationPicker_C) == 0x000008, "Wrong alignment on UAthenaCustomizationPicker_C");
static_assert(sizeof(UAthenaCustomizationPicker_C) == 0x0003D8, "Wrong size on UAthenaCustomizationPicker_C");
static_assert(offsetof(UAthenaCustomizationPicker_C, UberGraphFrame) == 0x000398, "Member 'UAthenaCustomizationPicker_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaCustomizationPicker_C, Text_FilterName) == 0x0003A0, "Member 'UAthenaCustomizationPicker_C::Text_FilterName' has a wrong offset!");
static_assert(offsetof(UAthenaCustomizationPicker_C, TextBlock_NoItemAvailable) == 0x0003A8, "Member 'UAthenaCustomizationPicker_C::TextBlock_NoItemAvailable' has a wrong offset!");
static_assert(offsetof(UAthenaCustomizationPicker_C, WidgetSwitcher_DisplayItemAvailability) == 0x0003B0, "Member 'UAthenaCustomizationPicker_C::WidgetSwitcher_DisplayItemAvailability' has a wrong offset!");
static_assert(offsetof(UAthenaCustomizationPicker_C, OnDisableSaveButton) == 0x0003B8, "Member 'UAthenaCustomizationPicker_C::OnDisableSaveButton' has a wrong offset!");
static_assert(offsetof(UAthenaCustomizationPicker_C, OnEnableSaveButton) == 0x0003C8, "Member 'UAthenaCustomizationPicker_C::OnEnableSaveButton' has a wrong offset!");

}

