#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaSeasonLevelPaidRewardsWidget

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function AthenaSeasonLevelPaidRewardsWidget.AthenaSeasonLevelPaidRewardsWidget_C.PopulateAnim
// 0x0008 (0x0008 - 0x0000)
struct AthenaSeasonLevelPaidRewardsWidget_C_PopulateAnim final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaSeasonLevelPaidRewardsWidget_C_PopulateAnim) == 0x000008, "Wrong alignment on AthenaSeasonLevelPaidRewardsWidget_C_PopulateAnim");
static_assert(sizeof(AthenaSeasonLevelPaidRewardsWidget_C_PopulateAnim) == 0x000008, "Wrong size on AthenaSeasonLevelPaidRewardsWidget_C_PopulateAnim");
static_assert(offsetof(AthenaSeasonLevelPaidRewardsWidget_C_PopulateAnim, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'AthenaSeasonLevelPaidRewardsWidget_C_PopulateAnim::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function AthenaSeasonLevelPaidRewardsWidget.AthenaSeasonLevelPaidRewardsWidget_C.UpdateStyling
// 0x0048 (0x0048 - 0x0000)
struct AthenaSeasonLevelPaidRewardsWidget_C_UpdateStyling final
{
public:
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_2;                             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortSeasonPassLevelInfo*               CallFunc_GetLevelInfo_ReturnValue;                 // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetLevel_ReturnValue;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortSeasonPassLevelInfo*               CallFunc_GetLevelInfo_ReturnValue_1;               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFreeUnlocked_ReturnValue;               // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPaidClaimed_ReturnValue;                // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B[0x1];                                       // 0x003B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default_1;                           // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default_3;                           // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaSeasonLevelPaidRewardsWidget_C_UpdateStyling) == 0x000008, "Wrong alignment on AthenaSeasonLevelPaidRewardsWidget_C_UpdateStyling");
static_assert(sizeof(AthenaSeasonLevelPaidRewardsWidget_C_UpdateStyling) == 0x000048, "Wrong size on AthenaSeasonLevelPaidRewardsWidget_C_UpdateStyling");
static_assert(offsetof(AthenaSeasonLevelPaidRewardsWidget_C_UpdateStyling, Temp_byte_Variable) == 0x000000, "Member 'AthenaSeasonLevelPaidRewardsWidget_C_UpdateStyling::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaSeasonLevelPaidRewardsWidget_C_UpdateStyling, Temp_bool_Variable) == 0x000001, "Member 'AthenaSeasonLevelPaidRewardsWidget_C_UpdateStyling::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaSeasonLevelPaidRewardsWidget_C_UpdateStyling, Temp_byte_Variable_1) == 0x000002, "Member 'AthenaSeasonLevelPaidRewardsWidget_C_UpdateStyling::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaSeasonLevelPaidRewardsWidget_C_UpdateStyling, Temp_byte_Variable_2) == 0x000003, "Member 'AthenaSeasonLevelPaidRewardsWidget_C_UpdateStyling::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(AthenaSeasonLevelPaidRewardsWidget_C_UpdateStyling, Temp_bool_Variable_1) == 0x000004, "Member 'AthenaSeasonLevelPaidRewardsWidget_C_UpdateStyling::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaSeasonLevelPaidRewardsWidget_C_UpdateStyling, Temp_float_Variable) == 0x000008, "Member 'AthenaSeasonLevelPaidRewardsWidget_C_UpdateStyling::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(AthenaSeasonLevelPaidRewardsWidget_C_UpdateStyling, Temp_float_Variable_1) == 0x00000C, "Member 'AthenaSeasonLevelPaidRewardsWidget_C_UpdateStyling::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaSeasonLevelPaidRewardsWidget_C_UpdateStyling, Temp_bool_Variable_2) == 0x000010, "Member 'AthenaSeasonLevelPaidRewardsWidget_C_UpdateStyling::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(AthenaSeasonLevelPaidRewardsWidget_C_UpdateStyling, Temp_float_Variable_2) == 0x000014, "Member 'AthenaSeasonLevelPaidRewardsWidget_C_UpdateStyling::Temp_float_Variable_2' has a wrong offset!");
static_assert(offsetof(AthenaSeasonLevelPaidRewardsWidget_C_UpdateStyling, Temp_byte_Variable_3) == 0x000018, "Member 'AthenaSeasonLevelPaidRewardsWidget_C_UpdateStyling::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(AthenaSeasonLevelPaidRewardsWidget_C_UpdateStyling, Temp_bool_Variable_3) == 0x000019, "Member 'AthenaSeasonLevelPaidRewardsWidget_C_UpdateStyling::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(AthenaSeasonLevelPaidRewardsWidget_C_UpdateStyling, CallFunc_GetLevelInfo_ReturnValue) == 0x000020, "Member 'AthenaSeasonLevelPaidRewardsWidget_C_UpdateStyling::CallFunc_GetLevelInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonLevelPaidRewardsWidget_C_UpdateStyling, CallFunc_GetLevel_ReturnValue) == 0x000028, "Member 'AthenaSeasonLevelPaidRewardsWidget_C_UpdateStyling::CallFunc_GetLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonLevelPaidRewardsWidget_C_UpdateStyling, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00002C, "Member 'AthenaSeasonLevelPaidRewardsWidget_C_UpdateStyling::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonLevelPaidRewardsWidget_C_UpdateStyling, CallFunc_GetLevelInfo_ReturnValue_1) == 0x000030, "Member 'AthenaSeasonLevelPaidRewardsWidget_C_UpdateStyling::CallFunc_GetLevelInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaSeasonLevelPaidRewardsWidget_C_UpdateStyling, CallFunc_IsFreeUnlocked_ReturnValue) == 0x000038, "Member 'AthenaSeasonLevelPaidRewardsWidget_C_UpdateStyling::CallFunc_IsFreeUnlocked_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonLevelPaidRewardsWidget_C_UpdateStyling, CallFunc_IsPaidClaimed_ReturnValue) == 0x000039, "Member 'AthenaSeasonLevelPaidRewardsWidget_C_UpdateStyling::CallFunc_IsPaidClaimed_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonLevelPaidRewardsWidget_C_UpdateStyling, K2Node_Select_Default) == 0x00003A, "Member 'AthenaSeasonLevelPaidRewardsWidget_C_UpdateStyling::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaSeasonLevelPaidRewardsWidget_C_UpdateStyling, K2Node_Select_Default_1) == 0x00003C, "Member 'AthenaSeasonLevelPaidRewardsWidget_C_UpdateStyling::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(AthenaSeasonLevelPaidRewardsWidget_C_UpdateStyling, K2Node_Select_Default_2) == 0x000040, "Member 'AthenaSeasonLevelPaidRewardsWidget_C_UpdateStyling::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(AthenaSeasonLevelPaidRewardsWidget_C_UpdateStyling, K2Node_Select_Default_3) == 0x000044, "Member 'AthenaSeasonLevelPaidRewardsWidget_C_UpdateStyling::K2Node_Select_Default_3' has a wrong offset!");

// Function AthenaSeasonLevelPaidRewardsWidget.AthenaSeasonLevelPaidRewardsWidget_C.OnLockedStatusChanged
// 0x0002 (0x0002 - 0x0000)
struct AthenaSeasonLevelPaidRewardsWidget_C_OnLockedStatusChanged final
{
public:
	bool                                          FreeUnlocked;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          PaidUnlocked;                                      // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaSeasonLevelPaidRewardsWidget_C_OnLockedStatusChanged) == 0x000001, "Wrong alignment on AthenaSeasonLevelPaidRewardsWidget_C_OnLockedStatusChanged");
static_assert(sizeof(AthenaSeasonLevelPaidRewardsWidget_C_OnLockedStatusChanged) == 0x000002, "Wrong size on AthenaSeasonLevelPaidRewardsWidget_C_OnLockedStatusChanged");
static_assert(offsetof(AthenaSeasonLevelPaidRewardsWidget_C_OnLockedStatusChanged, FreeUnlocked) == 0x000000, "Member 'AthenaSeasonLevelPaidRewardsWidget_C_OnLockedStatusChanged::FreeUnlocked' has a wrong offset!");
static_assert(offsetof(AthenaSeasonLevelPaidRewardsWidget_C_OnLockedStatusChanged, PaidUnlocked) == 0x000001, "Member 'AthenaSeasonLevelPaidRewardsWidget_C_OnLockedStatusChanged::PaidUnlocked' has a wrong offset!");

// Function AthenaSeasonLevelPaidRewardsWidget.AthenaSeasonLevelPaidRewardsWidget_C.ExecuteUbergraph_AthenaSeasonLevelPaidRewardsWidget
// 0x00F0 (0x00F0 - 0x0000)
struct AthenaSeasonLevelPaidRewardsWidget_C_ExecuteUbergraph_AthenaSeasonLevelPaidRewardsWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaSeasonReward_C*                  CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortSeasonPassLevelInfo*               CallFunc_GetLevelInfo_ReturnValue;                 // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortSeasonPassLevelInfo*               CallFunc_GetLevelInfo_ReturnValue_1;               // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UFortItem*>                      CallFunc_GetRewardItems_ReturnValue;               // 0x0040(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_GetLevel_ReturnValue;                     // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItem*                              CallFunc_Array_Get_Item_1;                         // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFreeClaimed_ReturnValue;                // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPaidUnlocked_ReturnValue;               // 0x006E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x006F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPaidClaimed_ReturnValue;                // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_FreeUnlocked;                         // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_PaidUnlocked;                         // 0x0073(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaSeasonReward_C*                  CallFunc_Array_Get_Item_2;                         // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortUINavigationManager*               CallFunc_GetUINavigationManager_ReturnValue;       // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaSeasonReward_C*                  CallFunc_Array_Get_Item_3;                         // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0098(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaSeasonReward_C*                  CallFunc_Create_ReturnValue;                       // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortSeasonPassLevelInfo*               CallFunc_GetLevelInfo_ReturnValue_2;               // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFreeClaimed_ReturnValue_1;              // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPaidUnlocked_ReturnValue_1;             // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPaidClaimed_ReturnValue_1;              // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x00CB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGridSlot*                              CallFunc_AddChildToGrid_ReturnValue;               // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaSeasonLevelPaidRewardsWidget_C_ExecuteUbergraph_AthenaSeasonLevelPaidRewardsWidget) == 0x000008, "Wrong alignment on AthenaSeasonLevelPaidRewardsWidget_C_ExecuteUbergraph_AthenaSeasonLevelPaidRewardsWidget");
static_assert(sizeof(AthenaSeasonLevelPaidRewardsWidget_C_ExecuteUbergraph_AthenaSeasonLevelPaidRewardsWidget) == 0x0000F0, "Wrong size on AthenaSeasonLevelPaidRewardsWidget_C_ExecuteUbergraph_AthenaSeasonLevelPaidRewardsWidget");
static_assert(offsetof(AthenaSeasonLevelPaidRewardsWidget_C_ExecuteUbergraph_AthenaSeasonLevelPaidRewardsWidget, EntryPoint) == 0x000000, "Member 'AthenaSeasonLevelPaidRewardsWidget_C_ExecuteUbergraph_AthenaSeasonLevelPaidRewardsWidget::EntryPoint' has a wrong offset!");
