#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaLeaderboardTabButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaLeaderboardTabButton.AthenaLeaderboardTabButton_C
// 0x00F8 (0x0C38 - 0x0B40)
class UAthenaLeaderboardTabButton_C final : public UCommonButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B40(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonTextBlock*                       CenterButtonTextWidget;                            // 0x0B48(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         ContentHB;                                         // 0x0B50(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LeftSideImage;                                     // 0x0B58(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   ButtonText;                                        // 0x0B60(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	struct FSlateBrush                            IconBrush;                                         // 0x0B78(0x0088)(Edit, BlueprintVisible, ExposeOnSpawn)
	bool                                          UseText;                                           // 0x0C00(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C01[0x3];                                      // 0x0C01(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           SelectedIconTint;                                  // 0x0C04(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           DeselectedIconTint;                                // 0x0C14(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           HoveredIconTint;                                   // 0x0C24(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bBangEnabled;                                      // 0x0C34(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ShowText();
	void Set_Icon(const struct FSlateBrush& IconBrush_0);
	void Set_Text(const class FText& ButtonText_0);
	void PreConstruct(bool IsDesignTime);
	void OnCurrentTextStyleChanged();
	void SetTabLabelInfo(const struct FFortTabButtonLabelInfo& TabLabelInfo);
	void BP_OnSelected();
	void BP_OnDeselected();
	void Construct();
	void BP_OnHovered();
	void BP_OnUnhovered();
	void ExecuteUbergraph_AthenaLeaderboardTabButton(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaLeaderboardTabButton_C">();
	}
	static class UAthenaLeaderboardTabButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaLeaderboardTabButton_C>();
	}
};
static_assert(alignof(UAthenaLeaderboardTabButton_C) == 0x000008, "Wrong alignment on UAthenaLeaderboardTabButton_C");
static_assert(sizeof(UAthenaLeaderboardTabButton_C) == 0x000C38, "Wrong size on UAthenaLeaderboardTabButton_C");
static_assert(offsetof(UAthenaLeaderboardTabButton_C, UberGraphFrame) == 0x000B40, "Member 'UAthenaLeaderboardTabButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaLeaderboardTabButton_C, CenterButtonTextWidget) == 0x000B48, "Member 'UAthenaLeaderboardTabButton_C::CenterButtonTextWidget' has a wrong offset!");
static_assert(offsetof(UAthenaLeaderboardTabButton_C, ContentHB) == 0x000B50, "Member 'UAthenaLeaderboardTabButton_C::ContentHB' has a wrong offset!");
static_assert(offsetof(UAthenaLeaderboardTabButton_C, LeftSideImage) == 0x000B58, "Member 'UAthenaLeaderboardTabButton_C::LeftSideImage' has a wrong offset!");
static_assert(offsetof(UAthenaLeaderboardTabButton_C, ButtonText) == 0x000B60, "Member 'UAthenaLeaderboardTabButton_C::ButtonText' has a wrong offset!");
static_assert(offsetof(UAthenaLeaderboardTabButton_C, IconBrush) == 0x000B78, "Member 'UAthenaLeaderboardTabButton_C::IconBrush' has a wrong offset!");
static_assert(offsetof(UAthenaLeaderboardTabButton_C, UseText) == 0x000C00, "Member 'UAthenaLeaderboardTabButton_C::UseText' has a wrong offset!");
static_assert(offsetof(UAthenaLeaderboardTabButton_C, SelectedIconTint) == 0x000C04, "Member 'UAthenaLeaderboardTabButton_C::SelectedIconTint' has a wrong offset!");
static_assert(offsetof(UAthenaLeaderboardTabButton_C, DeselectedIconTint) == 0x000C14, "Member 'UAthenaLeaderboardTabButton_C::DeselectedIconTint' has a wrong offset!");
static_assert(offsetof(UAthenaLeaderboardTabButton_C, HoveredIconTint) == 0x000C24, "Member 'UAthenaLeaderboardTabButton_C::HoveredIconTint' has a wrong offset!");
static_assert(offsetof(UAthenaLeaderboardTabButton_C, bBangEnabled) == 0x000C34, "Member 'UAthenaLeaderboardTabButton_C::bBangEnabled' has a wrong offset!");

}

