#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaLockerTab

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaLockerTab.AthenaLockerTab_C
// 0x01E0 (0x09F0 - 0x0810)
class UAthenaLockerTab_C final : public UAthenaCustomizationScreenBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0810(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ItemInfoIntroOutro;                                // 0x0818(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x0820(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OutroToPicker;                                     // 0x0828(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UOverlay*                               AccountOvr;                                        // 0x0830(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* BackpackSlot;                                      // 0x0838(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationBannerButton_C*     BannerSlot;                                        // 0x0840(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* BattleBusSlot;                                     // 0x0848(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* CallingCardSlot;                                   // 0x0850(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               CameraFramingWidget;                               // 0x0858(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* CharacterSlot;                                     // 0x0860(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* ContrailSlot;                                      // 0x0868(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* DanceSlot1;                                        // 0x0870(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* DanceSlot2;                                        // 0x0878(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* DanceSlot3;                                        // 0x0880(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* DanceSlot4;                                        // 0x0888(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* DanceSlot5;                                        // 0x0890(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* DanceSlot6;                                        // 0x0898(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               EmotesOvr;                                         // 0x08A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               GearOvr;                                           // 0x08A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* GliderSlot;                                        // 0x08B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* HarvestToolSlot;                                   // 0x08B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* HatSlot;                                           // 0x08C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UItemInfoHeaderWidget_C*                ItemInfoHeaderWidget;                              // 0x08C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* ItemWrapSlot1;                                     // 0x08D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* ItemWrapSlot2;                                     // 0x08D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* ItemWrapSlot3;                                     // 0x08E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* ItemWrapSlot4;                                     // 0x08E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* ItemWrapSlot5;                                     // 0x08F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* ItemWrapSlot6;                                     // 0x08F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* ItemWrapSlot7;                                     // 0x0900(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               ItemWrapsOvr;                                      // 0x0908(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* LoadScreenSlot;                                    // 0x0910(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* MapMarkerSlot;                                     // 0x0918(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* MusicPackSlot;                                     // 0x0920(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       ShortDescriptionText;                              // 0x0928(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       StatsHeader;                                       // 0x0930(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* TauntSlot;                                         // 0x0938(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* VehicleSkinSlot;                                   // 0x0940(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* VictoryPoseSlot;                                   // 0x0948(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressModalWidget_C*                 ProgressModal;                                     // 0x0950(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UAthenaCustomizationSlotButtonWrapper_C*> AllSlots;                                          // 0x0958(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	EAthenaCustomizationCategory                  CurrentCustomizationType;                          // 0x0968(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_969[0x3];                                      // 0x0969(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CurrentSubslotIndex;                               // 0x096C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaItemCustomizationSelector_C*     ItemCustomizationSelector;                         // 0x0970(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAthenaCustomizationCategory                  CustomizationCategoryLastChanged;                  // 0x0978(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_979[0x3];                                      // 0x0979(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CustimizationSubSlotLastChanged;                   // 0x097C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CustomizationSelectionBeingProcessed;              // 0x0980(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_981[0x7];                                      // 0x0981(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaCustomizationSlotButton_C*       CustomizationSlotButtonToPlayConfirmationOn;       // 0x0988(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           AutoHideDetailsForDances;                          // 0x0990(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* FirstSlotInMenu;                                   // 0x0998(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAthenaCustomizationCategory                  FirstCustomizationCategory;                        // 0x09A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsFirstSlotBannerSlot;                            // 0x09A1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A2[0x6];                                      // 0x09A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAthenaCustomizationParams             CustomizationParams;                               // 0x09A8(0x0048)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void SetCustomizationSelectionBeingProcessed(bool InProcessed);
	void PlaySlotAnimationAndCenterSlot();
	void SetupWarningForSlot(class UAthenaCustomizationSlotButtonWrapper_C* InSlot);
	void SetupNavigation();
	void PlayEquippedLockerMusic_STW();
	void EnableSlotsForSTW();
	void OkToReshowOnHover(EAthenaCustomizationCategory Type, int32 Index_0, bool* Ok);
	void PlaySlotClickedAnimation(class UAthenaCustomizationSlotButton_C* SlotToPlayAnimOn);
	void CanShowEmptyForType(EAthenaCustomizationCategory CustomizationType, bool* bCanShowEmpty);
	void SelectWidget(class UAthenaCustomizationSlotButtonWrapper_C* InSelection);
	void SetHeaderToBanner();
	void BeginPickingCustomization(class UCommonButton* WidgetToReturnFocusTo, const struct FAthenaCustomizationParams& CustomizationParams_0);
	class UWidget* GetWidgetForFramingViewedItem();
	void SetItemDetailsToDisplay(class UFortItem* InputPin);
	void ShowVaultItemByCategory(EAthenaCustomizationCategory CustomizationType, int32 SubslotIndex, bool CanShowEmpty);
	void HandleSlotHovered(class UAthenaCustomizationSlotButtonWrapper_C* HoveredSlot, EAthenaCustomizationCategory Type, const class FText& HeaderText, const class FText& DescriptionText, int32 SubslotIndex);
	void SelectFirstWidget();
	void ShowSavingModal();
	void SelectInitialWidgetForGamepad();
	void RegisterInputActions();
	void OnActivated();
	void OnInputModeChanged(bool bUsingGamepad);
	void OnDeactivated();
	void Construct();
	void Destruct();
	void ProcessLoadoutChanged();
	void BndEvt__AthenaCustomizationBannerButton_490_K2Node_ComponentBoundEvent_205_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__BannerSlot_K2Node_ComponentBoundEvent_547_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void ProccesTransitionToSelector();
	void HideDetailsForDances();
	void SetSlotToBannerSlot();
	void ExecuteUbergraph_AthenaLockerTab(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaLockerTab_C">();
	}
	static class UAthenaLockerTab_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaLockerTab_C>();
	}
};
static_assert(alignof(UAthenaLockerTab_C) == 0x000008, "Wrong alignment on UAthenaLockerTab_C");
static_assert(sizeof(UAthenaLockerTab_C) == 0x0009F0, "Wrong size on UAthenaLockerTab_C");
static_assert(offsetof(UAthenaLockerTab_C, UberGraphFrame) == 0x000810, "Member 'UAthenaLockerTab_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, ItemInfoIntroOutro) == 0x000818, "Member 'UAthenaLockerTab_C::ItemInfoIntroOutro' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, Intro) == 0x000820, "Member 'UAthenaLockerTab_C::Intro' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, OutroToPicker) == 0x000828, "Member 'UAthenaLockerTab_C::OutroToPicker' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, AccountOvr) == 0x000830, "Member 'UAthenaLockerTab_C::AccountOvr' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, BackpackSlot) == 0x000838, "Member 'UAthenaLockerTab_C::BackpackSlot' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, BannerSlot) == 0x000840, "Member 'UAthenaLockerTab_C::BannerSlot' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, BattleBusSlot) == 0x000848, "Member 'UAthenaLockerTab_C::BattleBusSlot' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, CallingCardSlot) == 0x000850, "Member 'UAthenaLockerTab_C::CallingCardSlot' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, CameraFramingWidget) == 0x000858, "Member 'UAthenaLockerTab_C::CameraFramingWidget' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, CharacterSlot) == 0x000860, "Member 'UAthenaLockerTab_C::CharacterSlot' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, ContrailSlot) == 0x000868, "Member 'UAthenaLockerTab_C::ContrailSlot' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, DanceSlot1) == 0x000870, "Member 'UAthenaLockerTab_C::DanceSlot1' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, DanceSlot2) == 0x000878, "Member 'UAthenaLockerTab_C::DanceSlot2' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, DanceSlot3) == 0x000880, "Member 'UAthenaLockerTab_C::DanceSlot3' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, DanceSlot4) == 0x000888, "Member 'UAthenaLockerTab_C::DanceSlot4' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, DanceSlot5) == 0x000890, "Member 'UAthenaLockerTab_C::DanceSlot5' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, DanceSlot6) == 0x000898, "Member 'UAthenaLockerTab_C::DanceSlot6' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, EmotesOvr) == 0x0008A0, "Member 'UAthenaLockerTab_C::EmotesOvr' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, GearOvr) == 0x0008A8, "Member 'UAthenaLockerTab_C::GearOvr' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, GliderSlot) == 0x0008B0, "Member 'UAthenaLockerTab_C::GliderSlot' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, HarvestToolSlot) == 0x0008B8, "Member 'UAthenaLockerTab_C::HarvestToolSlot' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, HatSlot) == 0x0008C0, "Member 'UAthenaLockerTab_C::HatSlot' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, ItemInfoHeaderWidget) == 0x0008C8, "Member 'UAthenaLockerTab_C::ItemInfoHeaderWidget' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, ItemWrapSlot1) == 0x0008D0, "Member 'UAthenaLockerTab_C::ItemWrapSlot1' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, ItemWrapSlot2) == 0x0008D8, "Member 'UAthenaLockerTab_C::ItemWrapSlot2' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, ItemWrapSlot3) == 0x0008E0, "Member 'UAthenaLockerTab_C::ItemWrapSlot3' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, ItemWrapSlot4) == 0x0008E8, "Member 'UAthenaLockerTab_C::ItemWrapSlot4' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, ItemWrapSlot5) == 0x0008F0, "Member 'UAthenaLockerTab_C::ItemWrapSlot5' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, ItemWrapSlot6) == 0x0008F8, "Member 'UAthenaLockerTab_C::ItemWrapSlot6' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, ItemWrapSlot7) == 0x000900, "Member 'UAthenaLockerTab_C::ItemWrapSlot7' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, ItemWrapsOvr) == 0x000908, "Member 'UAthenaLockerTab_C::ItemWrapsOvr' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, LoadScreenSlot) == 0x000910, "Member 'UAthenaLockerTab_C::LoadScreenSlot' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, MapMarkerSlot) == 0x000918, "Member 'UAthenaLockerTab_C::MapMarkerSlot' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, MusicPackSlot) == 0x000920, "Member 'UAthenaLockerTab_C::MusicPackSlot' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, ShortDescriptionText) == 0x000928, "Member 'UAthenaLockerTab_C::ShortDescriptionText' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, StatsHeader) == 0x000930, "Member 'UAthenaLockerTab_C::StatsHeader' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, TauntSlot) == 0x000938, "Member 'UAthenaLockerTab_C::TauntSlot' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, VehicleSkinSlot) == 0x000940, "Member 'UAthenaLockerTab_C::VehicleSkinSlot' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, VictoryPoseSlot) == 0x000948, "Member 'UAthenaLockerTab_C::VictoryPoseSlot' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, ProgressModal) == 0x000950, "Member 'UAthenaLockerTab_C::ProgressModal' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, AllSlots) == 0x000958, "Member 'UAthenaLockerTab_C::AllSlots' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, CurrentCustomizationType) == 0x000968, "Member 'UAthenaLockerTab_C::CurrentCustomizationType' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, CurrentSubslotIndex) == 0x00096C, "Member 'UAthenaLockerTab_C::CurrentSubslotIndex' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, ItemCustomizationSelector) == 0x000970, "Member 'UAthenaLockerTab_C::ItemCustomizationSelector' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, CustomizationCategoryLastChanged) == 0x000978, "Member 'UAthenaLockerTab_C::CustomizationCategoryLastChanged' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, CustimizationSubSlotLastChanged) == 0x00097C, "Member 'UAthenaLockerTab_C::CustimizationSubSlotLastChanged' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, CustomizationSelectionBeingProcessed) == 0x000980, "Member 'UAthenaLockerTab_C::CustomizationSelectionBeingProcessed' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, CustomizationSlotButtonToPlayConfirmationOn) == 0x000988, "Member 'UAthenaLockerTab_C::CustomizationSlotButtonToPlayConfirmationOn' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, AutoHideDetailsForDances) == 0x000990, "Member 'UAthenaLockerTab_C::AutoHideDetailsForDances' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, FirstSlotInMenu) == 0x000998, "Member 'UAthenaLockerTab_C::FirstSlotInMenu' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, FirstCustomizationCategory) == 0x0009A0, "Member 'UAthenaLockerTab_C::FirstCustomizationCategory' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, bIsFirstSlotBannerSlot) == 0x0009A1, "Member 'UAthenaLockerTab_C::bIsFirstSlotBannerSlot' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, CustomizationParams) == 0x0009A8, "Member 'UAthenaLockerTab_C::CustomizationParams' has a wrong offset!");

}

