#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaBattlePassReward

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function AthenaBattlePassReward.AthenaBattlePassReward_C.BPSetup
// 0x0008 (0x0008 - 0x0000)
struct AthenaBattlePassReward_C_BPSetup final
{
public:
	class UFortItem*                              InReward;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaBattlePassReward_C_BPSetup) == 0x000008, "Wrong alignment on AthenaBattlePassReward_C_BPSetup");
static_assert(sizeof(AthenaBattlePassReward_C_BPSetup) == 0x000008, "Wrong size on AthenaBattlePassReward_C_BPSetup");
static_assert(offsetof(AthenaBattlePassReward_C_BPSetup, InReward) == 0x000000, "Member 'AthenaBattlePassReward_C_BPSetup::InReward' has a wrong offset!");

// Function AthenaBattlePassReward.AthenaBattlePassReward_C.ExecuteUbergraph_AthenaBattlePassReward
// 0x0068 (0x0068 - 0x0000)
struct AthenaBattlePassReward_C_ExecuteUbergraph_AthenaBattlePassReward final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItem*                              K2Node_Event_InReward;                             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItemDefinition*                    CallFunc_GetItemDefinitionBP_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetRarityColor_ReturnValue;               // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaCosmeticItemDefinition*          K2Node_DynamicCast_AsAthena_Cosmetic_Item_Definition; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0038(0x0028)()
	bool                                          CallFunc_HasModifiableVariants_ReturnValue;        // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaBattlePassReward_C_ExecuteUbergraph_AthenaBattlePassReward) == 0x000008, "Wrong alignment on AthenaBattlePassReward_C_ExecuteUbergraph_AthenaBattlePassReward");
static_assert(sizeof(AthenaBattlePassReward_C_ExecuteUbergraph_AthenaBattlePassReward) == 0x000068, "Wrong size on AthenaBattlePassReward_C_ExecuteUbergraph_AthenaBattlePassReward");
static_assert(offsetof(AthenaBattlePassReward_C_ExecuteUbergraph_AthenaBattlePassReward, EntryPoint) == 0x000000, "Member 'AthenaBattlePassReward_C_ExecuteUbergraph_AthenaBattlePassReward::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaBattlePassReward_C_ExecuteUbergraph_AthenaBattlePassReward, K2Node_Event_InReward) == 0x000008, "Member 'AthenaBattlePassReward_C_ExecuteUbergraph_AthenaBattlePassReward::K2Node_Event_InReward' has a wrong offset!");
static_assert(offsetof(AthenaBattlePassReward_C_ExecuteUbergraph_AthenaBattlePassReward, CallFunc_GetItemDefinitionBP_ReturnValue) == 0x000010, "Member 'AthenaBattlePassReward_C_ExecuteUbergraph_AthenaBattlePassReward::CallFunc_GetItemDefinitionBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaBattlePassReward_C_ExecuteUbergraph_AthenaBattlePassReward, CallFunc_GetRarityColor_ReturnValue) == 0x000018, "Member 'AthenaBattlePassReward_C_ExecuteUbergraph_AthenaBattlePassReward::CallFunc_GetRarityColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaBattlePassReward_C_ExecuteUbergraph_AthenaBattlePassReward, K2Node_DynamicCast_AsAthena_Cosmetic_Item_Definition) == 0x000028, "Member 'AthenaBattlePassReward_C_ExecuteUbergraph_AthenaBattlePassReward::K2Node_DynamicCast_AsAthena_Cosmetic_Item_Definition' has a wrong offset!");
static_assert(offsetof(AthenaBattlePassReward_C_ExecuteUbergraph_AthenaBattlePassReward, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'AthenaBattlePassReward_C_ExecuteUbergraph_AthenaBattlePassReward::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaBattlePassReward_C_ExecuteUbergraph_AthenaBattlePassReward, K2Node_MakeStruct_SlateColor) == 0x000038, "Member 'AthenaBattlePassReward_C_ExecuteUbergraph_AthenaBattlePassReward::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(AthenaBattlePassReward_C_ExecuteUbergraph_AthenaBattlePassReward, CallFunc_HasModifiableVariants_ReturnValue) == 0x000060, "Member 'AthenaBattlePassReward_C_ExecuteUbergraph_AthenaBattlePassReward::CallFunc_HasModifiableVariants_ReturnValue' has a wrong offset!");

}

