#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaLeaveButton

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function AthenaLeaveButton.AthenaLeaveButton_C.UnbindDelegates
// 0x0070 (0x0070 - 0x0000)
struct AthenaLeaveButton_C_UnbindDelegates final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(int32 PlayerIndex)>            K2Node_CreateDelegate_OutputDelegate_1;            // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(const struct FFortTeamMemberInfo& NewTeamMemberInfo)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue;                   // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue_1;                 // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FFortTeamMemberInfo& PlayerInfo)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x0050(0x0010)(ZeroConstructor, NoDestructor)
	class UFortUITeamInfo*                        CallFunc_GetLocalPlayerTeam_ReturnValue;           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortMatchmakingContext*                CallFunc_GetContext_ReturnValue_2;                 // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaLeaveButton_C_UnbindDelegates) == 0x000008, "Wrong alignment on AthenaLeaveButton_C_UnbindDelegates");
static_assert(sizeof(AthenaLeaveButton_C_UnbindDelegates) == 0x000070, "Wrong size on AthenaLeaveButton_C_UnbindDelegates");
static_assert(offsetof(AthenaLeaveButton_C_UnbindDelegates, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'AthenaLeaveButton_C_UnbindDelegates::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaLeaveButton_C_UnbindDelegates, K2Node_CreateDelegate_OutputDelegate_1) == 0x000010, "Member 'AthenaLeaveButton_C_UnbindDelegates::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(AthenaLeaveButton_C_UnbindDelegates, K2Node_CreateDelegate_OutputDelegate_2) == 0x000020, "Member 'AthenaLeaveButton_C_UnbindDelegates::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(AthenaLeaveButton_C_UnbindDelegates, K2Node_CreateDelegate_OutputDelegate_3) == 0x000030, "Member 'AthenaLeaveButton_C_UnbindDelegates::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(AthenaLeaveButton_C_UnbindDelegates, CallFunc_GetContext_ReturnValue) == 0x000040, "Member 'AthenaLeaveButton_C_UnbindDelegates::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLeaveButton_C_UnbindDelegates, CallFunc_GetContext_ReturnValue_1) == 0x000048, "Member 'AthenaLeaveButton_C_UnbindDelegates::CallFunc_GetContext_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaLeaveButton_C_UnbindDelegates, K2Node_CreateDelegate_OutputDelegate_4) == 0x000050, "Member 'AthenaLeaveButton_C_UnbindDelegates::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(AthenaLeaveButton_C_UnbindDelegates, CallFunc_GetLocalPlayerTeam_ReturnValue) == 0x000060, "Member 'AthenaLeaveButton_C_UnbindDelegates::CallFunc_GetLocalPlayerTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLeaveButton_C_UnbindDelegates, CallFunc_GetContext_ReturnValue_2) == 0x000068, "Member 'AthenaLeaveButton_C_UnbindDelegates::CallFunc_GetContext_ReturnValue_2' has a wrong offset!");

// Function AthenaLeaveButton.AthenaLeaveButton_C.BindDelegates
// 0x0070 (0x0070 - 0x0000)
struct AthenaLeaveButton_C_BindDelegates final
{
public:
	TDelegate<void(struct FFortTeamMemberInfo& PlayerInfo)> K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(int32 PlayerIndex)>            K2Node_CreateDelegate_OutputDelegate_1;            // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(const struct FFortTeamMemberInfo& NewTeamMemberInfo)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	class UFortMatchmakingContext*                CallFunc_GetContext_ReturnValue;                   // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0048(0x0010)(ZeroConstructor, NoDestructor)
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue_1;                 // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue_2;                 // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortUITeamInfo*                        CallFunc_GetLocalPlayerTeam_ReturnValue;           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaLeaveButton_C_BindDelegates) == 0x000008, "Wrong alignment on AthenaLeaveButton_C_BindDelegates");
static_assert(sizeof(AthenaLeaveButton_C_BindDelegates) == 0x000070, "Wrong size on AthenaLeaveButton_C_BindDelegates");
static_assert(offsetof(AthenaLeaveButton_C_BindDelegates, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'AthenaLeaveButton_C_BindDelegates::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaLeaveButton_C_BindDelegates, K2Node_CreateDelegate_OutputDelegate_1) == 0x000010, "Member 'AthenaLeaveButton_C_BindDelegates::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(AthenaLeaveButton_C_BindDelegates, K2Node_CreateDelegate_OutputDelegate_2) == 0x000020, "Member 'AthenaLeaveButton_C_BindDelegates::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(AthenaLeaveButton_C_BindDelegates, CallFunc_GetContext_ReturnValue) == 0x000030, "Member 'AthenaLeaveButton_C_BindDelegates::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLeaveButton_C_BindDelegates, K2Node_CreateDelegate_OutputDelegate_3) == 0x000038, "Member 'AthenaLeaveButton_C_BindDelegates::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(AthenaLeaveButton_C_BindDelegates, K2Node_CreateDelegate_OutputDelegate_4) == 0x000048, "Member 'AthenaLeaveButton_C_BindDelegates::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(AthenaLeaveButton_C_BindDelegates, CallFunc_GetContext_ReturnValue_1) == 0x000058, "Member 'AthenaLeaveButton_C_BindDelegates::CallFunc_GetContext_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaLeaveButton_C_BindDelegates, CallFunc_GetContext_ReturnValue_2) == 0x000060, "Member 'AthenaLeaveButton_C_BindDelegates::CallFunc_GetContext_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AthenaLeaveButton_C_BindDelegates, CallFunc_GetLocalPlayerTeam_ReturnValue) == 0x000068, "Member 'AthenaLeaveButton_C_BindDelegates::CallFunc_GetLocalPlayerTeam_ReturnValue' has a wrong offset!");

// Function AthenaLeaveButton.AthenaLeaveButton_C.GetBRConfirmationDialogText
// 0x0248 (0x0248 - 0x0000)
struct AthenaLeaveButton_C_GetBRConfirmationDialogText final
{
public:
	class FText                                   TitleText;                                         // 0x0000(0x0018)(Parm, OutParm)
	class FText                                   MessagText;                                        // 0x0018(0x0018)(Parm, OutParm)
	bool                                          IsInParty;                                         // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0038(0x0018)()
	EFortPlaylistType                             Temp_byte_Variable;                                // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortPlaylistType                             Temp_byte_Variable_1;                              // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_1;                              // 0x0058(0x0018)()
	class FText                                   Temp_text_Variable_2;                              // 0x0070(0x0018)()
	class FText                                   Temp_text_Variable_3;                              // 0x0088(0x0018)()
	class FText                                   Temp_text_Variable_4;                              // 0x00A0(0x0018)()
	bool                                          Temp_bool_Variable;                                // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_5;                              // 0x00C0(0x0018)()
	class FText                                   Temp_text_Variable_6;                              // 0x00D8(0x0018)()
	bool                                          Temp_bool_Variable_1;                              // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_7;                              // 0x00F8(0x0018)()
	class FText                                   Temp_text_Variable_8;                              // 0x0110(0x0018)()
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue;                   // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x3];                                      // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumPlayersInLocalParty_ReturnValue;    // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable_9;                              // 0x0138(0x0018)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_10;                             // 0x0158(0x0018)()
	class FText                                   Temp_text_Variable_11;                             // 0x0170(0x0018)()
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortGameStateAthena*                   K2Node_DynamicCast_AsFort_Game_State_Athena;       // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x01A0(0x0018)()
	EFortPlaylistType                             CallFunc_GetPlaylistType_ReturnValue;              // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x01B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1BA[0x6];                                      // 0x01BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_1;                           // 0x01C0(0x0018)()
	class FText                                   K2Node_Select_Default_2;                           // 0x01D8(0x0018)()
	class FText                                   K2Node_Select_Default_3;                           // 0x01F0(0x0018)()
	class FText                                   K2Node_Select_Default_4;                           // 0x0208(0x0018)()
	bool                                          CallFunc_IsPartyInProgressEnabled_ReturnValue;     // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_221[0x7];                                      // 0x0221(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_5;                           // 0x0228(0x0018)()
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0241(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaLeaveButton_C_GetBRConfirmationDialogText) == 0x000008, "Wrong alignment on AthenaLeaveButton_C_GetBRConfirmationDialogText");
static_assert(sizeof(AthenaLeaveButton_C_GetBRConfirmationDialogText) == 0x000248, "Wrong size on AthenaLeaveButton_C_GetBRConfirmationDialogText");
static_assert(offsetof(AthenaLeaveButton_C_GetBRConfirmationDialogText, TitleText) == 0x000000, "Member 'AthenaLeaveButton_C_GetBRConfirmationDialogText::TitleText' has a wrong offset!");
static_assert(offsetof(AthenaLeaveButton_C_GetBRConfirmationDialogText, MessagText) == 0x000018, "Member 'AthenaLeaveButton_C_GetBRConfirmationDialogText::MessagText' has a wrong offset!");
static_assert(offsetof(AthenaLeaveButton_C_GetBRConfirmationDialogText, IsInParty) == 0x000030, "Member 'AthenaLeaveButton_C_GetBRConfirmationDialogText::IsInParty' has a wrong offset!");
static_assert(offsetof(AthenaLeaveButton_C_GetBRConfirmationDialogText, Temp_text_Variable) == 0x000038, "Member 'AthenaLeaveButton_C_GetBRConfirmationDialogText::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(AthenaLeaveButton_C_GetBRConfirmationDialogText, Temp_byte_Variable) == 0x000050, "Member 'AthenaLeaveButton_C_GetBRConfirmationDialogText::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaLeaveButton_C_GetBRConfirmationDialogText, Temp_byte_Variable_1) == 0x000051, "Member 'AthenaLeaveButton_C_GetBRConfirmationDialogText::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaLeaveButton_C_GetBRConfirmationDialogText, Temp_text_Variable_1) == 0x000058, "Member 'AthenaLeaveButton_C_GetBRConfirmationDialogText::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaLeaveButton_C_GetBRConfirmationDialogText, Temp_text_Variable_2) == 0x000070, "Member 'AthenaLeaveButton_C_GetBRConfirmationDialogText::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(AthenaLeaveButton_C_GetBRConfirmationDialogText, Temp_text_Variable_3) == 0x000088, "Member 'AthenaLeaveButton_C_GetBRConfirmationDialogText::Temp_text_Variable_3' has a wrong offset!");
static_assert(offsetof(AthenaLeaveButton_C_GetBRConfirmationDialogText, Temp_text_Variable_4) == 0x0000A0, "Member 'AthenaLeaveButton_C_GetBRConfirmationDialogText::Temp_text_Variable_4' has a wrong offset!");
static_assert(offsetof(AthenaLeaveButton_C_GetBRConfirmationDialogText, Temp_bool_Variable) == 0x0000B8, "Member 'AthenaLeaveButton_C_GetBRConfirmationDialogText::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaLeaveButton_C_GetBRConfirmationDialogText, Temp_text_Variable_5) == 0x0000C0, "Member 'AthenaLeaveButton_C_GetBRConfirmationDialogText::Temp_text_Variable_5' has a wrong offset!");
static_assert(offsetof(AthenaLeaveButton_C_GetBRConfirmationDialogText, Temp_text_Variable_6) == 0x0000D8, "Member 'AthenaLeaveButton_C_GetBRConfirmationDialogText::Temp_text_Variable_6' has a wrong offset!");
static_assert(offsetof(AthenaLeaveButton_C_GetBRConfirmationDialogText, Temp_bool_Variable_1) == 0x0000F0, "Member 'AthenaLeaveButton_C_GetBRConfirmationDialogText::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaLeaveButton_C_GetBRConfirmationDialogText, Temp_text_Variable_7) == 0x0000F8, "Member 'AthenaLeaveButton_C_GetBRConfirmationDialogText::Temp_text_Variable_7' has a wrong offset!");
static_assert(offsetof(AthenaLeaveButton_C_GetBRConfirmationDialogText, Temp_text_Variable_8) == 0x000110, "Member 'AthenaLeaveButton_C_GetBRConfirmationDialogText::Temp_text_Variable_8' has a wrong offset!");
static_assert(offsetof(AthenaLeaveButton_C_GetBRConfirmationDialogText, CallFunc_GetContext_ReturnValue) == 0x000128, "Member 'AthenaLeaveButton_C_GetBRConfirmationDialogText::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLeaveButton_C_GetBRConfirmationDialogText, Temp_bool_Variable_2) == 0x000130, "Member 'AthenaLeaveButton_C_GetBRConfirmationDialogText::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(AthenaLeaveButton_C_GetBRConfirmationDialogText, CallFunc_GetNumPlayersInLocalParty_ReturnValue) == 0x000134, "Member 'AthenaLeaveButton_C_GetBRConfirmationDialogText::CallFunc_GetNumPlayersInLocalParty_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLeaveButton_C_GetBRConfirmationDialogText, Temp_text_Variable_9) == 0x000138, "Member 'AthenaLeaveButton_C_GetBRConfirmationDialogText::Temp_text_Variable_9' has a wrong offset!");
static_assert(offsetof(AthenaLeaveButton_C_GetBRConfirmationDialogText, CallFunc_Greater_IntInt_ReturnValue) == 0x000150, "Member 'AthenaLeaveButton_C_GetBRConfirmationDialogText::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLeaveButton_C_GetBRConfirmationDialogText, Temp_text_Variable_10) == 0x000158, "Member 'AthenaLeaveButton_C_GetBRConfirmationDialogText::Temp_text_Variable_10' has a wrong offset!");
static_assert(offsetof(AthenaLeaveButton_C_GetBRConfirmationDialogText, Temp_text_Variable_11) == 0x000170, "Member 'AthenaLeaveButton_C_GetBRConfirmationDialogText::Temp_text_Variable_11' has a wrong offset!");
static_assert(offsetof(AthenaLeaveButton_C_GetBRConfirmationDialogText, CallFunc_GetGameState_ReturnValue) == 0x000188, "Member 'AthenaLeaveButton_C_GetBRConfirmationDialogText::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLeaveButton_C_GetBRConfirmationDialogText, K2Node_DynamicCast_AsFort_Game_State_Athena) == 0x000190, "Member 'AthenaLeaveButton_C_GetBRConfirmationDialogText::K2Node_DynamicCast_AsFort_Game_State_Athena' has a wrong offset!");
static_assert(offsetof(AthenaLeaveButton_C_GetBRConfirmationDialogText, K2Node_DynamicCast_bSuccess) == 0x000198, "Member 'AthenaLeaveButton_C_GetBRConfirmationDialogText::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaLeaveButton_C_GetBRConfirmationDialogText, K2Node_Select_Default) == 0x0001A0, "Member 'AthenaLeaveButton_C_GetBRConfirmationDialogText::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaLeaveButton_C_GetBRConfirmationDialogText, CallFunc_GetPlaylistType_ReturnValue) == 0x0001B8, "Member 'AthenaLeaveButton_C_GetBRConfirmationDialogText::CallFunc_GetPlaylistType_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLeaveButton_C_GetBRConfirmationDialogText, Temp_bool_Variable_3) == 0x0001B9, "Member 'AthenaLeaveButton_C_GetBRConfirmationDialogText::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(AthenaLeaveButton_C_GetBRConfirmationDialogText, K2Node_Select_Default_1) == 0x0001C0, "Member 'AthenaLeaveButton_C_GetBRConfirmationDialogText::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(AthenaLeaveButton_C_GetBRConfirmationDialogText, K2Node_Select_Default_2) == 0x0001D8, "Member 'AthenaLeaveButton_C_GetBRConfirmationDialogText::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(AthenaLeaveButton_C_GetBRConfirmationDialogText, K2Node_Select_Default_3) == 0x0001F0, "Member 'AthenaLeaveButton_C_GetBRConfirmationDialogText::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(AthenaLeaveButton_C_GetBRConfirmationDialogText, K2Node_Select_Default_4) == 0x000208, "Member 'AthenaLeaveButton_C_GetBRConfirmationDialogText::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(AthenaLeaveButton_C_GetBRConfirmationDialogText, CallFunc_IsPartyInProgressEnabled_ReturnValue) == 0x000220, "Member 'AthenaLeaveButton_C_GetBRConfirmationDialogText::CallFunc_IsPartyInProgressEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLeaveButton_C_GetBRConfirmationDialogText, K2Node_Select_Default_5) == 0x000228, "Member 'AthenaLeaveButton_C_GetBRConfirmationDialogText::K2Node_Select_Default_5' has a wrong offset!");
static_assert(offsetof(AthenaLeaveButton_C_GetBRConfirmationDialogText, CallFunc_Not_PreBool_ReturnValue) == 0x000240, "Member 'AthenaLeaveButton_C_GetBRConfirmationDialogText::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLeaveButton_C_GetBRConfirmationDialogText, CallFunc_BooleanAND_ReturnValue) == 0x000241, "Member 'AthenaLeaveButton_C_GetBRConfirmationDialogText::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function AthenaLeaveButton.AthenaLeaveButton_C.GetDescriptionText
// 0x0028 (0x0028 - 0x0000)
struct AthenaLeaveButton_C_GetDescriptionText final
{
public:
	class FText                                   DescriptionText;                                   // 0x0000(0x0018)(Parm, OutParm)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESubGame                                      CallFunc_GetSubGame_ReturnValue;                   // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaLeaveButton_C_GetDescriptionText) == 0x000008, "Wrong alignment on AthenaLeaveButton_C_GetDescriptionText");
static_assert(sizeof(AthenaLeaveButton_C_GetDescriptionText) == 0x000028, "Wrong size on AthenaLeaveButton_C_GetDescriptionText");
static_assert(offsetof(AthenaLeaveButton_C_GetDescriptionText, DescriptionText) == 0x000000, "Member 'AthenaLeaveButton_C_GetDescriptionText::DescriptionText' has a wrong offset!");
static_assert(offsetof(AthenaLeaveButton_C_GetDescriptionText, CallFunc_GetContext_ReturnValue) == 0x000018, "Member 'AthenaLeaveButton_C_GetDescriptionText::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLeaveButton_C_GetDescriptionText, CallFunc_GetSubGame_ReturnValue) == 0x000020, "Member 'AthenaLeaveButton_C_GetDescriptionText::CallFunc_GetSubGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLeaveButton_C_GetDescriptionText, K2Node_SwitchEnum_CmpSuccess) == 0x000021, "Member 'AthenaLeaveButton_C_GetDescriptionText::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function AthenaLeaveButton.AthenaLeaveButton_C.SetText
// 0x0018 (0x0018 - 0x0000)
struct AthenaLeaveButton_C_SetText final
{
public:
	class FText                                   TextOverride;                                      // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(AthenaLeaveButton_C_SetText) == 0x000008, "Wrong alignment on AthenaLeaveButton_C_SetText");
static_assert(sizeof(AthenaLeaveButton_C_SetText) == 0x000018, "Wrong size on AthenaLeaveButton_C_SetText");
static_assert(offsetof(AthenaLeaveButton_C_SetText, TextOverride) == 0x000000, "Member 'AthenaLeaveButton_C_SetText::TextOverride' has a wrong offset!");

// Function AthenaLeaveButton.AthenaLeaveButton_C.GetButton
// 0x0008 (0x0008 - 0x0000)
struct AthenaLeaveButton_C_GetButton final
{
public:
	class UIconTextButton_C*                      Leave_0;                                           // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaLeaveButton_C_GetButton) == 0x000008, "Wrong alignment on AthenaLeaveButton_C_GetButton");
static_assert(sizeof(AthenaLeaveButton_C_GetButton) == 0x000008, "Wrong size on AthenaLeaveButton_C_GetButton");
static_assert(offsetof(AthenaLeaveButton_C_GetButton, Leave_0) == 0x000000, "Member 'AthenaLeaveButton_C_GetButton::Leave_0' has a wrong offset!");

// Function AthenaLeaveButton.AthenaLeaveButton_C.LeaveParty
// 0x0008 (0x0008 - 0x0000)
struct AthenaLeaveButton_C_LeaveParty final
{
public:
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue;                   // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaLeaveButton_C_LeaveParty) == 0x000008, "Wrong alignment on AthenaLeaveButton_C_LeaveParty");
static_assert(sizeof(AthenaLeaveButton_C_LeaveParty) == 0x000008, "Wrong size on AthenaLeaveButton_C_LeaveParty");
static_assert(offsetof(AthenaLeaveButton_C_LeaveParty, CallFunc_GetContext_ReturnValue) == 0x000000, "Member 'AthenaLeaveButton_C_LeaveParty::CallFunc_GetContext_ReturnValue' has a wrong offset!");

// Function AthenaLeaveButton.AthenaLeaveButton_C.UpdateState
// 0x0030 (0x0030 - 0x0000)
struct AthenaLeaveButton_C_UpdateState final
{
public:
	class FText                                   CallFunc_GetLeaveActionText_Text;                  // 0x0000(0x0018)()
	bool                                          CallFunc_IsConsideredInGame_InGame;                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue;                   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumPlayersInLocalParty_ReturnValue;    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaLeaveButton_C_UpdateState) == 0x000008, "Wrong alignment on AthenaLeaveButton_C_UpdateState");
static_assert(sizeof(AthenaLeaveButton_C_UpdateState) == 0x000030, "Wrong size on AthenaLeaveButton_C_UpdateState");
static_assert(offsetof(AthenaLeaveButton_C_UpdateState, CallFunc_GetLeaveActionText_Text) == 0x000000, "Member 'AthenaLeaveButton_C_UpdateState::CallFunc_GetLeaveActionText_Text' has a wrong offset!");
static_assert(offsetof(AthenaLeaveButton_C_UpdateState, CallFunc_IsConsideredInGame_InGame) == 0x000018, "Member 'AthenaLeaveButton_C_UpdateState::CallFunc_IsConsideredInGame_InGame' has a wrong offset!");
static_assert(offsetof(AthenaLeaveButton_C_UpdateState, CallFunc_GetContext_ReturnValue) == 0x000020, "Member 'AthenaLeaveButton_C_UpdateState::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLeaveButton_C_UpdateState, CallFunc_GetNumPlayersInLocalParty_ReturnValue) == 0x000028, "Member 'AthenaLeaveButton_C_UpdateState::CallFunc_GetNumPlayersInLocalParty_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLeaveButton_C_UpdateState, CallFunc_Greater_IntInt_ReturnValue) == 0x00002C, "Member 'AthenaLeaveButton_C_UpdateState::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLeaveButton_C_UpdateState, CallFunc_BooleanOR_ReturnValue) == 0x00002D, "Member 'AthenaLeaveButton_C_UpdateState::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function AthenaLeaveButton.AthenaLeaveButton_C.IsConsideredInGame
// 0x0020 (0x0020 - 0x0000)
struct AthenaLeaveButton_C_IsConsideredInGame final
{
public:
	bool                                          InGame;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortMatchmakingContext*                CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue_1;                 // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInLobby_ReturnValue;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInZone_ReturnValue;                     // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaLeaveButton_C_IsConsideredInGame) == 0x000008, "Wrong alignment on AthenaLeaveButton_C_IsConsideredInGame");
static_assert(sizeof(AthenaLeaveButton_C_IsConsideredInGame) == 0x000020, "Wrong size on AthenaLeaveButton_C_IsConsideredInGame");
static_assert(offsetof(AthenaLeaveButton_C_IsConsideredInGame, InGame) == 0x000000, "Member 'AthenaLeaveButton_C_IsConsideredInGame::InGame' has a wrong offset!");
static_assert(offsetof(AthenaLeaveButton_C_IsConsideredInGame, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'AthenaLeaveButton_C_IsConsideredInGame::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLeaveButton_C_IsConsideredInGame, CallFunc_GetContext_ReturnValue_1) == 0x000010, "Member 'AthenaLeaveButton_C_IsConsideredInGame::CallFunc_GetContext_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaLeaveButton_C_IsConsideredInGame, CallFunc_IsInLobby_ReturnValue) == 0x000018, "Member 'AthenaLeaveButton_C_IsConsideredInGame::CallFunc_IsInLobby_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLeaveButton_C_IsConsideredInGame, CallFunc_IsInZone_ReturnValue) == 0x000019, "Member 'AthenaLeaveButton_C_IsConsideredInGame::CallFunc_IsInZone_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLeaveButton_C_IsConsideredInGame, CallFunc_BooleanOR_ReturnValue) == 0x00001A, "Member 'AthenaLeaveButton_C_IsConsideredInGame::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function AthenaLeaveButton.AthenaLeaveButton_C.GetLeaveActionText
// 0x01F8 (0x01F8 - 0x0000)
struct AthenaLeaveButton_C_GetLeaveActionText final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(Parm, OutParm)
	class FText                                   Temp_text_Variable;                                // 0x0018(0x0018)()
	bool                                          Temp_bool_Variable;                                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_1;                              // 0x0038(0x0018)()
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESubGame                                      CallFunc_GetSubGame_ReturnValue;                   // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortPlaylistType                             Temp_byte_Variable;                                // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B[0x5];                                       // 0x005B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_2;                              // 0x0060(0x0018)()
	class FText                                   Temp_text_Variable_3;                              // 0x0078(0x0018)()
	class FText                                   Temp_text_Variable_4;                              // 0x0090(0x0018)()
	class FText                                   Temp_text_Variable_5;                              // 0x00A8(0x0018)()
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue_1;                 // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInOutpostZone_ReturnValue;              // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CA[0x6];                                       // 0x00CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_6;                              // 0x00D0(0x0018)()
	class FText                                   Temp_text_Variable_7;                              // 0x00E8(0x0018)()
	bool                                          Temp_bool_Variable_2;                              // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_8;                              // 0x0108(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x0120(0x0018)()
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsConsideredInGame_InGame;                // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortGameStateAthena*                   K2Node_DynamicCast_AsFort_Game_State_Athena;       // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsConsideredInGame_InGame_1;              // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortPlaylistType                             CallFunc_GetPlaylistType_ReturnValue;              // 0x0152(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_153[0x5];                                      // 0x0153(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_9;                              // 0x0158(0x0018)()
	class FText                                   K2Node_Select_Default_1;                           // 0x0170(0x0018)()
	class FText                                   K2Node_Select_Default_2;                           // 0x0188(0x0018)()
	bool                                          Temp_bool_Variable_3;                              // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerControllerOutpost*           K2Node_DynamicCast_AsFort_Player_Controller_Outpost; // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B9[0x7];                                      // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_3;                           // 0x01C0(0x0018)()
	bool                                          CallFunc_IsOutpostOwner_ReturnValue;               // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsConsideredInGame_InGame_2;              // 0x01D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1DA[0x6];                                      // 0x01DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_4;                           // 0x01E0(0x0018)()
};
static_assert(alignof(AthenaLeaveButton_C_GetLeaveActionText) == 0x000008, "Wrong alignment on AthenaLeaveButton_C_GetLeaveActionText");
static_assert(sizeof(AthenaLeaveButton_C_GetLeaveActionText) == 0x0001F8, "Wrong size on AthenaLeaveButton_C_GetLeaveActionText");
static_assert(offsetof(AthenaLeaveButton_C_GetLeaveActionText, Text) == 0x000000, "Member 'AthenaLeaveButton_C_GetLeaveActionText::Text' has a wrong offset!");
static_assert(offsetof(AthenaLeaveButton_C_GetLeaveActionText, Temp_text_Variable) == 0x000018, "Member 'AthenaLeaveButton_C_GetLeaveActionText::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(AthenaLeaveButton_C_GetLeaveActionText, Temp_bool_Variable) == 0x000030, "Member 'AthenaLeaveButton_C_GetLeaveActionText::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaLeaveButton_C_GetLeaveActionText, Temp_text_Variable_1) == 0x000038, "Member 'AthenaLeaveButton_C_GetLeaveActionText::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaLeaveButton_C_GetLeaveActionText, CallFunc_GetContext_ReturnValue) == 0x000050, "Member 'AthenaLeaveButton_C_GetLeaveActionText::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLeaveButton_C_GetLeaveActionText, CallFunc_GetSubGame_ReturnValue) == 0x000058, "Member 'AthenaLeaveButton_C_GetLeaveActionText::CallFunc_GetSubGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLeaveButton_C_GetLeaveActionText, Temp_byte_Variable) == 0x000059, "Member 'AthenaLeaveButton_C_GetLeaveActionText::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaLeaveButton_C_GetLeaveActionText, K2Node_SwitchEnum_CmpSuccess) == 0x00005A, "Member 'AthenaLeaveButton_C_GetLeaveActionText::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(AthenaLeaveButton_C_GetLeaveActionText, Temp_text_Variable_2) == 0x000060, "Member 'AthenaLeaveButton_C_GetLeaveActionText::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(AthenaLeaveButton_C_GetLeaveActionText, Temp_text_Variable_3) == 0x000078, "Member 'AthenaLeaveButton_C_GetLeaveActionText::Temp_text_Variable_3' has a wrong offset!");
static_assert(offsetof(AthenaLeaveButton_C_GetLeaveActionText, Temp_text_Variable_4) == 0x000090, "Member 'AthenaLeaveButton_C_GetLeaveActionText::Temp_text_Variable_4' has a wrong offset!");
static_assert(offsetof(AthenaLeaveButton_C_GetLeaveActionText, Temp_text_Variable_5) == 0x0000A8, "Member 'AthenaLeaveButton_C_GetLeaveActionText::Temp_text_Variable_5' has a wrong offset!");
static_assert(offsetof(AthenaLeaveButton_C_GetLeaveActionText, CallFunc_GetContext_ReturnValue_1) == 0x0000C0, "Member 'AthenaLeaveButton_C_GetLeaveActionText::CallFunc_GetContext_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaLeaveButton_C_GetLeaveActionText, Temp_bool_Variable_1) == 0x0000C8, "Member 'AthenaLeaveButton_C_GetLeaveActionText::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaLeaveButton_C_GetLeaveActionText, CallFunc_IsInOutpostZone_ReturnValue) == 0x0000C9, "Member 'AthenaLeaveButton_C_GetLeaveActionText::CallFunc_IsInOutpostZone_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLeaveButton_C_GetLeaveActionText, Temp_text_Variable_6) == 0x0000D0, "Member 'AthenaLeaveButton_C_GetLeaveActionText::Temp_text_Variable_6' has a wrong offset!");
static_assert(offsetof(AthenaLeaveButton_C_GetLeaveActionText, Temp_text_Variable_7) == 0x0000E8, "Member 'AthenaLeaveButton_C_GetLeaveActionText::Temp_text_Variable_7' has a wrong offset!");
static_assert(offsetof(AthenaLeaveButton_C_GetLeaveActionText, Temp_bool_Variable_2) == 0x000100, "Member 'AthenaLeaveButton_C_GetLeaveActionText::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(AthenaLeaveButton_C_GetLeaveActionText, Temp_text_Variable_8) == 0x000108, "Member 'AthenaLeaveButton_C_GetLeaveActionText::Temp_text_Variable_8' has a wrong offset!");
static_assert(offsetof(AthenaLeaveButton_C_GetLeaveActionText, K2Node_Select_Default) == 0x000120, "Member 'AthenaLeaveButton_C_GetLeaveActionText::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaLeaveButton_C_GetLeaveActionText, CallFunc_GetGameState_ReturnValue) == 0x000138, "Member 'AthenaLeaveButton_C_GetLeaveActionText::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLeaveButton_C_GetLeaveActionText, CallFunc_IsConsideredInGame_InGame) == 0x000140, "Member 'AthenaLeaveButton_C_GetLeaveActionText::CallFunc_IsConsideredInGame_InGame' has a wrong offset!");
static_assert(offsetof(AthenaLeaveButton_C_GetLeaveActionText, K2Node_DynamicCast_AsFort_Game_State_Athena) == 0x000148, "Member 'AthenaLeaveButton_C_GetLeaveActionText::K2Node_DynamicCast_AsFort_Game_State_Athena' has a wrong offset!");
static_assert(offsetof(AthenaLeaveButton_C_GetLeaveActionText, K2Node_DynamicCast_bSuccess) == 0x000150, "Member 'AthenaLeaveButton_C_GetLeaveActionText::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaLeaveButton_C_GetLeaveActionText, CallFunc_IsConsideredInGame_InGame_1) == 0x000151, "Member 'AthenaLeaveButton_C_GetLeaveActionText::CallFunc_IsConsideredInGame_InGame_1' has a wrong offset!");
static_assert(offsetof(AthenaLeaveButton_C_GetLeaveActionText, CallFunc_GetPlaylistType_ReturnValue) == 0x000152, "Member 'AthenaLeaveButton_C_GetLeaveActionText::CallFunc_GetPlaylistType_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLeaveButton_C_GetLeaveActionText, Temp_text_Variable_9) == 0x000158, "Member 'AthenaLeaveButton_C_GetLeaveActionText::Temp_text_Variable_9' has a wrong offset!");
static_assert(offsetof(AthenaLeaveButton_C_GetLeaveActionText, K2Node_Select_Default_1) == 0x000170, "Member 'AthenaLeaveButton_C_GetLeaveActionText::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(AthenaLeaveButton_C_GetLeaveActionText, K2Node_Select_Default_2) == 0x000188, "Member 'AthenaLeaveButton_C_GetLeaveActionText::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(AthenaLeaveButton_C_GetLeaveActionText, Temp_bool_Variable_3) == 0x0001A0, "Member 'AthenaLeaveButton_C_GetLeaveActionText::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(AthenaLeaveButton_C_GetLeaveActionText, CallFunc_GetOwningPlayer_ReturnValue) == 0x0001A8, "Member 'AthenaLeaveButton_C_GetLeaveActionText::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLeaveButton_C_GetLeaveActionText, K2Node_DynamicCast_AsFort_Player_Controller_Outpost) == 0x0001B0, "Member 'AthenaLeaveButton_C_GetLeaveActionText::K2Node_DynamicCast_AsFort_Player_Controller_Outpost' has a wrong offset!");
static_assert(offsetof(AthenaLeaveButton_C_GetLeaveActionText, K2Node_DynamicCast_bSuccess_1) == 0x0001B8, "Member 'AthenaLeaveButton_C_GetLeaveActionText::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(AthenaLeaveButton_C_GetLeaveActionText, K2Node_Select_Default_3) == 0x0001C0, "Member 'AthenaLeaveButton_C_GetLeaveActionText::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(AthenaLeaveButton_C_GetLeaveActionText, CallFunc_IsOutpostOwner_ReturnValue) == 0x0001D8, "Member 'AthenaLeaveButton_C_GetLeaveActionText::CallFunc_IsOutpostOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLeaveButton_C_GetLeaveActionText, CallFunc_IsConsideredInGame_InGame_2) == 0x0001D9, "Member 'AthenaLeaveButton_C_GetLeaveActionText::CallFunc_IsConsideredInGame_InGame_2' has a wrong offset!");
static_assert(offsetof(AthenaLeaveButton_C_GetLeaveActionText, K2Node_Select_Default_4) == 0x0001E0, "Member 'AthenaLeaveButton_C_GetLeaveActionText::K2Node_Select_Default_4' has a wrong offset!");

// Function AthenaLeaveButton.AthenaLeaveButton_C.DialogResult_F529ABF747FF6F18A54323B6174EC070
// 0x000C (0x000C - 0x0000)
struct AthenaLeaveButton_C_DialogResult_F529ABF747FF6F18A54323B6174EC070 final
{
public:
	EFortDialogResult                             Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ResultName;                                        // 0x0004(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaLeaveButton_C_DialogResult_F529ABF747FF6F18A54323B6174EC070) == 0x000004, "Wrong alignment on AthenaLeaveButton_C_DialogResult_F529ABF747FF6F18A54323B6174EC070");
static_assert(sizeof(AthenaLeaveButton_C_DialogResult_F529ABF747FF6F18A54323B6174EC070) == 0x00000C, "Wrong size on AthenaLeaveButton_C_DialogResult_F529ABF747FF6F18A54323B6174EC070");
static_assert(offsetof(AthenaLeaveButton_C_DialogResult_F529ABF747FF6F18A54323B6174EC070, Result) == 0x000000, "Member 'AthenaLeaveButton_C_DialogResult_F529ABF747FF6F18A54323B6174EC070::Result' has a wrong offset!");
static_assert(offsetof(AthenaLeaveButton_C_DialogResult_F529ABF747FF6F18A54323B6174EC070, ResultName) == 0x000004, "Member 'AthenaLeaveButton_C_DialogResult_F529ABF747FF6F18A54323B6174EC070::ResultName' has a wrong offset!");

// Function AthenaLeaveButton.AthenaLeaveButton_C.HandleTeamMemberAdded
// 0x0200 (0x0200 - 0x0000)
struct AthenaLeaveButton_C_HandleTeamMemberAdded final
{
public:
	struct FFortTeamMemberInfo                    NewTeamMemberInfo;                                 // 0x0000(0x0200)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(AthenaLeaveButton_C_HandleTeamMemberAdded) == 0x000008, "Wrong alignment on AthenaLeaveButton_C_HandleTeamMemberAdded");
static_assert(sizeof(AthenaLeaveButton_C_HandleTeamMemberAdded) == 0x000200, "Wrong size on AthenaLeaveButton_C_HandleTeamMemberAdded");
static_assert(offsetof(AthenaLeaveButton_C_HandleTeamMemberAdded, NewTeamMemberInfo) == 0x000000, "Member 'AthenaLeaveButton_C_HandleTeamMemberAdded::NewTeamMemberInfo' has a wrong offset!");

// Function AthenaLeaveButton.AthenaLeaveButton_C.HandleTeamMemberRemoved
// 0x0004 (0x0004 - 0x0000)
struct AthenaLeaveButton_C_HandleTeamMemberRemoved final
{
public:
	int32                                         PlayerIndex;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaLeaveButton_C_HandleTeamMemberRemoved) == 0x000004, "Wrong alignment on AthenaLeaveButton_C_HandleTeamMemberRemoved");
static_assert(sizeof(AthenaLeaveButton_C_HandleTeamMemberRemoved) == 0x000004, "Wrong size on AthenaLeaveButton_C_HandleTeamMemberRemoved");
static_assert(offsetof(AthenaLeaveButton_C_HandleTeamMemberRemoved, PlayerIndex) == 0x000000, "Member 'AthenaLeaveButton_C_HandleTeamMemberRemoved::PlayerIndex' has a wrong offset!");

// Function AthenaLeaveButton.AthenaLeaveButton_C.BndEvt__Leave_K2Node_ComponentBoundEvent_90_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AthenaLeaveButton_C_BndEvt__Leave_K2Node_ComponentBoundEvent_90_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaLeaveButton_C_BndEvt__Leave_K2Node_ComponentBoundEvent_90_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on AthenaLeaveButton_C_BndEvt__Leave_K2Node_ComponentBoundEvent_90_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(AthenaLeaveButton_C_BndEvt__Leave_K2Node_ComponentBoundEvent_90_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on AthenaLeaveButton_C_BndEvt__Leave_K2Node_ComponentBoundEvent_90_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(AthenaLeaveButton_C_BndEvt__Leave_K2Node_ComponentBoundEvent_90_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'AthenaLeaveButton_C_BndEvt__Leave_K2Node_ComponentBoundEvent_90_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function AthenaLeaveButton.AthenaLeaveButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct AthenaLeaveButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaLeaveButton_C_PreConstruct) == 0x000001, "Wrong alignment on AthenaLeaveButton_C_PreConstruct");
static_assert(sizeof(AthenaLeaveButton_C_PreConstruct) == 0x000001, "Wrong size on AthenaLeaveButton_C_PreConstruct");
static_assert(offsetof(AthenaLeaveButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'AthenaLeaveButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function AthenaLeaveButton.AthenaLeaveButton_C.HandlePlayerStateChanged
// 0x0200 (0x0200 - 0x0000)
struct AthenaLeaveButton_C_HandlePlayerStateChanged final
{
public:
	struct FFortTeamMemberInfo                    TeamMemberInfo;                                    // 0x0000(0x0200)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
};
static_assert(alignof(AthenaLeaveButton_C_HandlePlayerStateChanged) == 0x000008, "Wrong alignment on AthenaLeaveButton_C_HandlePlayerStateChanged");
static_assert(sizeof(AthenaLeaveButton_C_HandlePlayerStateChanged) == 0x000200, "Wrong size on AthenaLeaveButton_C_HandlePlayerStateChanged");
static_assert(offsetof(AthenaLeaveButton_C_HandlePlayerStateChanged, TeamMemberInfo) == 0x000000, "Member 'AthenaLeaveButton_C_HandlePlayerStateChanged::TeamMemberInfo' has a wrong offset!");

// Function AthenaLeaveButton.AthenaLeaveButton_C.ExecuteUbergraph_AthenaLeaveButton
// 0x04A0 (0x04A0 - 0x0000)
struct AthenaLeaveButton_C_ExecuteUbergraph_AthenaLeaveButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortDialogResult                             K2Node_CustomEvent_Result;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_ResultName;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EFortDialogResult Result, class FName ResultName)> K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   Temp_name_Variable;                                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortDialogResult                             Temp_byte_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortTeamMemberInfo                    K2Node_CustomEvent_NewTeamMemberInfo;              // 0x0038(0x0200)(HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_PlayerIndex;                    // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23C[0x4];                                      // 0x023C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x0240(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_249[0x7];                                      // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortUINavigationManager*               CallFunc_GetUINavigationManager_ReturnValue;       // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsConsideredInGame_InGame;                // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_259[0x7];                                      // 0x0259(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortTeamMemberInfo                    K2Node_CustomEvent_TeamMemberInfo;                 // 0x0260(0x0200)(ConstParm, HasGetValueTypeHash)
	class FText                                   CallFunc_GetBRConfirmationDialogText_TitleText;    // 0x0460(0x0018)()
	class FText                                   CallFunc_GetBRConfirmationDialogText_MessagText;   // 0x0478(0x0018)()
	class UFortAsyncAction_ShowConfirmation_NUI*  CallFunc_ShowSimpleConfirmationDialog_CustomInput_ReturnValue; // 0x0490(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0498(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaLeaveButton_C_ExecuteUbergraph_AthenaLeaveButton) == 0x000008, "Wrong alignment on AthenaLeaveButton_C_ExecuteUbergraph_AthenaLeaveButton");
static_assert(sizeof(AthenaLeaveButton_C_ExecuteUbergraph_AthenaLeaveButton) == 0x0004A0, "Wrong size on AthenaLeaveButton_C_ExecuteUbergraph_AthenaLeaveButton");
static_assert(offsetof(AthenaLeaveButton_C_ExecuteUbergraph_AthenaLeaveButton, EntryPoint) == 0x000000, "Member 'AthenaLeaveButton_C_ExecuteUbergraph_AthenaLeaveButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaLeaveButton_C_ExecuteUbergraph_AthenaLeaveButton, K2Node_CustomEvent_Result) == 0x000004, "Member 'AthenaLeaveButton_C_ExecuteUbergraph_AthenaLeaveButton::K2Node_CustomEvent_Result' has a wrong offset!");
