#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaCustomizationSlotButton

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function AthenaCustomizationSlotButton.AthenaCustomizationSlotButton_C.GetSlotDebugName
// 0x0050 (0x0050 - 0x0000)
struct AthenaCustomizationSlotButton_C_GetSlotDebugName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaCustomizationSlotButton_C_GetSlotDebugName) == 0x000008, "Wrong alignment on AthenaCustomizationSlotButton_C_GetSlotDebugName");
static_assert(sizeof(AthenaCustomizationSlotButton_C_GetSlotDebugName) == 0x000050, "Wrong size on AthenaCustomizationSlotButton_C_GetSlotDebugName");
static_assert(offsetof(AthenaCustomizationSlotButton_C_GetSlotDebugName, ReturnValue) == 0x000000, "Member 'AthenaCustomizationSlotButton_C_GetSlotDebugName::ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationSlotButton_C_GetSlotDebugName, CallFunc_Conv_IntToString_ReturnValue) == 0x000010, "Member 'AthenaCustomizationSlotButton_C_GetSlotDebugName::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationSlotButton_C_GetSlotDebugName, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000020, "Member 'AthenaCustomizationSlotButton_C_GetSlotDebugName::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationSlotButton_C_GetSlotDebugName, CallFunc_Concat_StrStr_ReturnValue) == 0x000030, "Member 'AthenaCustomizationSlotButton_C_GetSlotDebugName::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationSlotButton_C_GetSlotDebugName, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000040, "Member 'AthenaCustomizationSlotButton_C_GetSlotDebugName::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");

// Function AthenaCustomizationSlotButton.AthenaCustomizationSlotButton_C.HandleActiveStateChanged
// 0x0030 (0x0030 - 0x0000)
struct AthenaCustomizationSlotButton_C_HandleActiveStateChanged final
{
public:
	bool                                          CosmeticAvailable;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Active;                                            // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     K2Node_Select_Default;                             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSlotFilled_ReturnValue;                 // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaCustomizationSlotButton_C_HandleActiveStateChanged) == 0x000008, "Wrong alignment on AthenaCustomizationSlotButton_C_HandleActiveStateChanged");
static_assert(sizeof(AthenaCustomizationSlotButton_C_HandleActiveStateChanged) == 0x000030, "Wrong size on AthenaCustomizationSlotButton_C_HandleActiveStateChanged");
static_assert(offsetof(AthenaCustomizationSlotButton_C_HandleActiveStateChanged, CosmeticAvailable) == 0x000000, "Member 'AthenaCustomizationSlotButton_C_HandleActiveStateChanged::CosmeticAvailable' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationSlotButton_C_HandleActiveStateChanged, Active) == 0x000001, "Member 'AthenaCustomizationSlotButton_C_HandleActiveStateChanged::Active' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationSlotButton_C_HandleActiveStateChanged, Temp_object_Variable) == 0x000008, "Member 'AthenaCustomizationSlotButton_C_HandleActiveStateChanged::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationSlotButton_C_HandleActiveStateChanged, Temp_object_Variable_1) == 0x000010, "Member 'AthenaCustomizationSlotButton_C_HandleActiveStateChanged::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationSlotButton_C_HandleActiveStateChanged, Temp_bool_Variable) == 0x000018, "Member 'AthenaCustomizationSlotButton_C_HandleActiveStateChanged::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationSlotButton_C_HandleActiveStateChanged, Temp_byte_Variable) == 0x000019, "Member 'AthenaCustomizationSlotButton_C_HandleActiveStateChanged::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationSlotButton_C_HandleActiveStateChanged, Temp_byte_Variable_1) == 0x00001A, "Member 'AthenaCustomizationSlotButton_C_HandleActiveStateChanged::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationSlotButton_C_HandleActiveStateChanged, Temp_bool_Variable_1) == 0x00001B, "Member 'AthenaCustomizationSlotButton_C_HandleActiveStateChanged::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationSlotButton_C_HandleActiveStateChanged, CallFunc_BooleanAND_ReturnValue) == 0x00001C, "Member 'AthenaCustomizationSlotButton_C_HandleActiveStateChanged::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationSlotButton_C_HandleActiveStateChanged, K2Node_Select_Default) == 0x000020, "Member 'AthenaCustomizationSlotButton_C_HandleActiveStateChanged::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationSlotButton_C_HandleActiveStateChanged, CallFunc_BooleanAND_ReturnValue_1) == 0x000028, "Member 'AthenaCustomizationSlotButton_C_HandleActiveStateChanged::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationSlotButton_C_HandleActiveStateChanged, CallFunc_IsSlotFilled_ReturnValue) == 0x000029, "Member 'AthenaCustomizationSlotButton_C_HandleActiveStateChanged::CallFunc_IsSlotFilled_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationSlotButton_C_HandleActiveStateChanged, K2Node_Select_Default_1) == 0x00002A, "Member 'AthenaCustomizationSlotButton_C_HandleActiveStateChanged::K2Node_Select_Default_1' has a wrong offset!");

// Function AthenaCustomizationSlotButton.AthenaCustomizationSlotButton_C.SetCardSizeAndSlotImage
// 0x0230 (0x0230 - 0x0000)
struct AthenaCustomizationSlotButton_C_SetCardSizeAndSlotImage final
{
public:
	EFortItemCardSize                             CardSize;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            SlotImage;                                         // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FVector2D                              Temp_struct_Variable;                              // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable_1;                            // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable_2;                            // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable_3;                            // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable_4;                            // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortItemCardSize                             Temp_byte_Variable;                                // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Temp_struct_Variable_5;                            // 0x00BC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable_6;                            // 0x00C4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable_7;                            // 0x00CC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable_8;                            // 0x00D4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable_9;                            // 0x00DC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable_10;                           // 0x00E4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable_11;                           // 0x00EC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortItemCardSize                             Temp_byte_Variable_1;                              // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F5[0x3];                                       // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              K2Node_Select_Default;                             // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0100(0x0088)()
	struct FVector2D                              Temp_struct_Variable_12;                           // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable_13;                           // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortItemCardSize                             Temp_byte_Variable_2;                              // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_199[0x3];                                      // 0x0199(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              K2Node_Select_Default_1;                           // 0x019C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A4[0x4];                                      // 0x01A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_Select_Default_2;                           // 0x01A8(0x0088)(ConstParm)
};
static_assert(alignof(AthenaCustomizationSlotButton_C_SetCardSizeAndSlotImage) == 0x000008, "Wrong alignment on AthenaCustomizationSlotButton_C_SetCardSizeAndSlotImage");
static_assert(sizeof(AthenaCustomizationSlotButton_C_SetCardSizeAndSlotImage) == 0x000230, "Wrong size on AthenaCustomizationSlotButton_C_SetCardSizeAndSlotImage");
static_assert(offsetof(AthenaCustomizationSlotButton_C_SetCardSizeAndSlotImage, CardSize) == 0x000000, "Member 'AthenaCustomizationSlotButton_C_SetCardSizeAndSlotImage::CardSize' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationSlotButton_C_SetCardSizeAndSlotImage, SlotImage) == 0x000008, "Member 'AthenaCustomizationSlotButton_C_SetCardSizeAndSlotImage::SlotImage' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationSlotButton_C_SetCardSizeAndSlotImage, Temp_struct_Variable) == 0x000090, "Member 'AthenaCustomizationSlotButton_C_SetCardSizeAndSlotImage::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationSlotButton_C_SetCardSizeAndSlotImage, Temp_struct_Variable_1) == 0x000098, "Member 'AthenaCustomizationSlotButton_C_SetCardSizeAndSlotImage::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationSlotButton_C_SetCardSizeAndSlotImage, Temp_struct_Variable_2) == 0x0000A0, "Member 'AthenaCustomizationSlotButton_C_SetCardSizeAndSlotImage::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationSlotButton_C_SetCardSizeAndSlotImage, Temp_struct_Variable_3) == 0x0000A8, "Member 'AthenaCustomizationSlotButton_C_SetCardSizeAndSlotImage::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationSlotButton_C_SetCardSizeAndSlotImage, Temp_struct_Variable_4) == 0x0000B0, "Member 'AthenaCustomizationSlotButton_C_SetCardSizeAndSlotImage::Temp_struct_Variable_4' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationSlotButton_C_SetCardSizeAndSlotImage, Temp_byte_Variable) == 0x0000B8, "Member 'AthenaCustomizationSlotButton_C_SetCardSizeAndSlotImage::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationSlotButton_C_SetCardSizeAndSlotImage, Temp_struct_Variable_5) == 0x0000BC, "Member 'AthenaCustomizationSlotButton_C_SetCardSizeAndSlotImage::Temp_struct_Variable_5' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationSlotButton_C_SetCardSizeAndSlotImage, Temp_struct_Variable_6) == 0x0000C4, "Member 'AthenaCustomizationSlotButton_C_SetCardSizeAndSlotImage::Temp_struct_Variable_6' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationSlotButton_C_SetCardSizeAndSlotImage, Temp_struct_Variable_7) == 0x0000CC, "Member 'AthenaCustomizationSlotButton_C_SetCardSizeAndSlotImage::Temp_struct_Variable_7' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationSlotButton_C_SetCardSizeAndSlotImage, Temp_struct_Variable_8) == 0x0000D4, "Member 'AthenaCustomizationSlotButton_C_SetCardSizeAndSlotImage::Temp_struct_Variable_8' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationSlotButton_C_SetCardSizeAndSlotImage, Temp_struct_Variable_9) == 0x0000DC, "Member 'AthenaCustomizationSlotButton_C_SetCardSizeAndSlotImage::Temp_struct_Variable_9' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationSlotButton_C_SetCardSizeAndSlotImage, Temp_struct_Variable_10) == 0x0000E4, "Member 'AthenaCustomizationSlotButton_C_SetCardSizeAndSlotImage::Temp_struct_Variable_10' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationSlotButton_C_SetCardSizeAndSlotImage, Temp_struct_Variable_11) == 0x0000EC, "Member 'AthenaCustomizationSlotButton_C_SetCardSizeAndSlotImage::Temp_struct_Variable_11' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationSlotButton_C_SetCardSizeAndSlotImage, Temp_byte_Variable_1) == 0x0000F4, "Member 'AthenaCustomizationSlotButton_C_SetCardSizeAndSlotImage::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationSlotButton_C_SetCardSizeAndSlotImage, K2Node_Select_Default) == 0x0000F8, "Member 'AthenaCustomizationSlotButton_C_SetCardSizeAndSlotImage::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationSlotButton_C_SetCardSizeAndSlotImage, K2Node_MakeStruct_SlateBrush) == 0x000100, "Member 'AthenaCustomizationSlotButton_C_SetCardSizeAndSlotImage::K2Node_MakeStruct_SlateBrush' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationSlotButton_C_SetCardSizeAndSlotImage, Temp_struct_Variable_12) == 0x000188, "Member 'AthenaCustomizationSlotButton_C_SetCardSizeAndSlotImage::Temp_struct_Variable_12' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationSlotButton_C_SetCardSizeAndSlotImage, Temp_struct_Variable_13) == 0x000190, "Member 'AthenaCustomizationSlotButton_C_SetCardSizeAndSlotImage::Temp_struct_Variable_13' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationSlotButton_C_SetCardSizeAndSlotImage, Temp_byte_Variable_2) == 0x000198, "Member 'AthenaCustomizationSlotButton_C_SetCardSizeAndSlotImage::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationSlotButton_C_SetCardSizeAndSlotImage, K2Node_Select_Default_1) == 0x00019C, "Member 'AthenaCustomizationSlotButton_C_SetCardSizeAndSlotImage::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationSlotButton_C_SetCardSizeAndSlotImage, K2Node_Select_Default_2) == 0x0001A8, "Member 'AthenaCustomizationSlotButton_C_SetCardSizeAndSlotImage::K2Node_Select_Default_2' has a wrong offset!");

// Function AthenaCustomizationSlotButton.AthenaCustomizationSlotButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct AthenaCustomizationSlotButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaCustomizationSlotButton_C_PreConstruct) == 0x000001, "Wrong alignment on AthenaCustomizationSlotButton_C_PreConstruct");
static_assert(sizeof(AthenaCustomizationSlotButton_C_PreConstruct) == 0x000001, "Wrong size on AthenaCustomizationSlotButton_C_PreConstruct");
static_assert(offsetof(AthenaCustomizationSlotButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'AthenaCustomizationSlotButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function AthenaCustomizationSlotButton.AthenaCustomizationSlotButton_C.OnCustomizationSlotActiveStateChanged
// 0x0002 (0x0002 - 0x0000)
struct AthenaCustomizationSlotButton_C_OnCustomizationSlotActiveStateChanged final
{
public:
	bool                                          bInAttachableCosmeticAvailable;                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bInActive;                                         // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaCustomizationSlotButton_C_OnCustomizationSlotActiveStateChanged) == 0x000001, "Wrong alignment on AthenaCustomizationSlotButton_C_OnCustomizationSlotActiveStateChanged");
static_assert(sizeof(AthenaCustomizationSlotButton_C_OnCustomizationSlotActiveStateChanged) == 0x000002, "Wrong size on AthenaCustomizationSlotButton_C_OnCustomizationSlotActiveStateChanged");
static_assert(offsetof(AthenaCustomizationSlotButton_C_OnCustomizationSlotActiveStateChanged, bInAttachableCosmeticAvailable) == 0x000000, "Member 'AthenaCustomizationSlotButton_C_OnCustomizationSlotActiveStateChanged::bInAttachableCosmeticAvailable' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationSlotButton_C_OnCustomizationSlotActiveStateChanged, bInActive) == 0x000001, "Member 'AthenaCustomizationSlotButton_C_OnCustomizationSlotActiveStateChanged::bInActive' has a wrong offset!");

// Function AthenaCustomizationSlotButton.AthenaCustomizationSlotButton_C.ExecuteUbergraph_AthenaCustomizationSlotButton
// 0x000C (0x000C - 0x0000)
struct AthenaCustomizationSlotButton_C_ExecuteUbergraph_AthenaCustomizationSlotButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCustomizationSlotActiveState_bOutAttachableCosmeticAvailable; // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetCustomizationSlotActiveState_bOutActive; // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bInAttachableCosmeticAvailable;       // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bInActive;                            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaCustomizationSlotButton_C_ExecuteUbergraph_AthenaCustomizationSlotButton) == 0x000004, "Wrong alignment on AthenaCustomizationSlotButton_C_ExecuteUbergraph_AthenaCustomizationSlotButton");
static_assert(sizeof(AthenaCustomizationSlotButton_C_ExecuteUbergraph_AthenaCustomizationSlotButton) == 0x00000C, "Wrong size on AthenaCustomizationSlotButton_C_ExecuteUbergraph_AthenaCustomizationSlotButton");
static_assert(offsetof(AthenaCustomizationSlotButton_C_ExecuteUbergraph_AthenaCustomizationSlotButton, EntryPoint) == 0x000000, "Member 'AthenaCustomizationSlotButton_C_ExecuteUbergraph_AthenaCustomizationSlotButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationSlotButton_C_ExecuteUbergraph_AthenaCustomizationSlotButton, CallFunc_GetCustomizationSlotActiveState_bOutAttachableCosmeticAvailable) == 0x000004, "Member 'AthenaCustomizationSlotButton_C_ExecuteUbergraph_AthenaCustomizationSlotButton::CallFunc_GetCustomizationSlotActiveState_bOutAttachableCosmeticAvailable' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationSlotButton_C_ExecuteUbergraph_AthenaCustomizationSlotButton, CallFunc_GetCustomizationSlotActiveState_bOutActive) == 0x000005, "Member 'AthenaCustomizationSlotButton_C_ExecuteUbergraph_AthenaCustomizationSlotButton::CallFunc_GetCustomizationSlotActiveState_bOutActive' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationSlotButton_C_ExecuteUbergraph_AthenaCustomizationSlotButton, K2Node_Event_IsDesignTime) == 0x000006, "Member 'AthenaCustomizationSlotButton_C_ExecuteUbergraph_AthenaCustomizationSlotButton::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationSlotButton_C_ExecuteUbergraph_AthenaCustomizationSlotButton, K2Node_Event_bInAttachableCosmeticAvailable) == 0x000007, "Member 'AthenaCustomizationSlotButton_C_ExecuteUbergraph_AthenaCustomizationSlotButton::K2Node_Event_bInAttachableCosmeticAvailable' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationSlotButton_C_ExecuteUbergraph_AthenaCustomizationSlotButton, K2Node_Event_bInActive) == 0x000008, "Member 'AthenaCustomizationSlotButton_C_ExecuteUbergraph_AthenaCustomizationSlotButton::K2Node_Event_bInActive' has a wrong offset!");

}

