#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaMatchmakingKnobsModal

#include "Basic.hpp"

#include "CommonInput_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaMatchmakingKnobsModal.AthenaMatchmakingKnobsModal_C
// 0x0070 (0x04D0 - 0x0460)
class UAthenaMatchmakingKnobsModal_C final : public UFortMatchmakingKnobsModal
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Out;                                               // 0x0468(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0470(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UPanelButton_C*                         CloseButton;                                       // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ConfirmSelectionShine;                             // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_8;                                           // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULightbox_C*                            Lightbox;                                          // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          ModalContent;                                      // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               OverlayCloseButton;                                // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class FString>                         DebugOptions;                                      // 0x04A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class UObject*>                        ListItems;                                         // 0x04B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	bool                                          IsUsingGamepad;                                    // 0x04C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	ECommonInputType                              CurrentInputMode;                                  // 0x04C9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnActivated();
	void Construct();
	void OnInputModeChanged(bool bUsingGamepad);
	void Close();
	void BndEvt__AcceptButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__CloseButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void ExecuteUbergraph_AthenaMatchmakingKnobsModal(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaMatchmakingKnobsModal_C">();
	}
	static class UAthenaMatchmakingKnobsModal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaMatchmakingKnobsModal_C>();
	}
};
static_assert(alignof(UAthenaMatchmakingKnobsModal_C) == 0x000008, "Wrong alignment on UAthenaMatchmakingKnobsModal_C");
static_assert(sizeof(UAthenaMatchmakingKnobsModal_C) == 0x0004D0, "Wrong size on UAthenaMatchmakingKnobsModal_C");
static_assert(offsetof(UAthenaMatchmakingKnobsModal_C, UberGraphFrame) == 0x000460, "Member 'UAthenaMatchmakingKnobsModal_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingKnobsModal_C, Out) == 0x000468, "Member 'UAthenaMatchmakingKnobsModal_C::Out' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingKnobsModal_C, In) == 0x000470, "Member 'UAthenaMatchmakingKnobsModal_C::In' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingKnobsModal_C, CloseButton) == 0x000478, "Member 'UAthenaMatchmakingKnobsModal_C::CloseButton' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingKnobsModal_C, ConfirmSelectionShine) == 0x000480, "Member 'UAthenaMatchmakingKnobsModal_C::ConfirmSelectionShine' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingKnobsModal_C, Image_8) == 0x000488, "Member 'UAthenaMatchmakingKnobsModal_C::Image_8' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingKnobsModal_C, Lightbox) == 0x000490, "Member 'UAthenaMatchmakingKnobsModal_C::Lightbox' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingKnobsModal_C, ModalContent) == 0x000498, "Member 'UAthenaMatchmakingKnobsModal_C::ModalContent' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingKnobsModal_C, OverlayCloseButton) == 0x0004A0, "Member 'UAthenaMatchmakingKnobsModal_C::OverlayCloseButton' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingKnobsModal_C, DebugOptions) == 0x0004A8, "Member 'UAthenaMatchmakingKnobsModal_C::DebugOptions' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingKnobsModal_C, ListItems) == 0x0004B8, "Member 'UAthenaMatchmakingKnobsModal_C::ListItems' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingKnobsModal_C, IsUsingGamepad) == 0x0004C8, "Member 'UAthenaMatchmakingKnobsModal_C::IsUsingGamepad' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingKnobsModal_C, CurrentInputMode) == 0x0004C9, "Member 'UAthenaMatchmakingKnobsModal_C::CurrentInputMode' has a wrong offset!");

}

