#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaSeasonTab

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "CommonInput_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function AthenaSeasonTab.AthenaSeasonTab_C.PlayOverviewVideo
// 0x0010 (0x0010 - 0x0000)
struct AthenaSeasonTab_C_PlayOverviewVideo final
{
public:
	class UBattlePassOverviewVideo_C*             CallFunc_Create_ReturnValue;                       // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LoadVideo_ReturnValue;                    // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaSeasonTab_C_PlayOverviewVideo) == 0x000008, "Wrong alignment on AthenaSeasonTab_C_PlayOverviewVideo");
static_assert(sizeof(AthenaSeasonTab_C_PlayOverviewVideo) == 0x000010, "Wrong size on AthenaSeasonTab_C_PlayOverviewVideo");
static_assert(offsetof(AthenaSeasonTab_C_PlayOverviewVideo, CallFunc_Create_ReturnValue) == 0x000000, "Member 'AthenaSeasonTab_C_PlayOverviewVideo::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_PlayOverviewVideo, CallFunc_LoadVideo_ReturnValue) == 0x000008, "Member 'AthenaSeasonTab_C_PlayOverviewVideo::CallFunc_LoadVideo_ReturnValue' has a wrong offset!");

// Function AthenaSeasonTab.AthenaSeasonTab_C.IntroAnim
// 0x0008 (0x0008 - 0x0000)
struct AthenaSeasonTab_C_IntroAnim final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaSeasonTab_C_IntroAnim) == 0x000008, "Wrong alignment on AthenaSeasonTab_C_IntroAnim");
static_assert(sizeof(AthenaSeasonTab_C_IntroAnim) == 0x000008, "Wrong size on AthenaSeasonTab_C_IntroAnim");
static_assert(offsetof(AthenaSeasonTab_C_IntroAnim, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'AthenaSeasonTab_C_IntroAnim::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function AthenaSeasonTab.AthenaSeasonTab_C.SetBattleStarBackingStyle
// 0x0001 (0x0001 - 0x0000)
struct AthenaSeasonTab_C_SetBattleStarBackingStyle final
{
public:
	bool                                          CallFunc_OwnsSeasonPass_ReturnValue;               // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaSeasonTab_C_SetBattleStarBackingStyle) == 0x000001, "Wrong alignment on AthenaSeasonTab_C_SetBattleStarBackingStyle");
static_assert(sizeof(AthenaSeasonTab_C_SetBattleStarBackingStyle) == 0x000001, "Wrong size on AthenaSeasonTab_C_SetBattleStarBackingStyle");
static_assert(offsetof(AthenaSeasonTab_C_SetBattleStarBackingStyle, CallFunc_OwnsSeasonPass_ReturnValue) == 0x000000, "Member 'AthenaSeasonTab_C_SetBattleStarBackingStyle::CallFunc_OwnsSeasonPass_ReturnValue' has a wrong offset!");

// Function AthenaSeasonTab.AthenaSeasonTab_C.AnimatePassLabels
// 0x0008 (0x0008 - 0x0000)
struct AthenaSeasonTab_C_AnimatePassLabels final
{
public:
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue;         // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaSeasonTab_C_AnimatePassLabels) == 0x000004, "Wrong alignment on AthenaSeasonTab_C_AnimatePassLabels");
static_assert(sizeof(AthenaSeasonTab_C_AnimatePassLabels) == 0x000008, "Wrong size on AthenaSeasonTab_C_AnimatePassLabels");
static_assert(offsetof(AthenaSeasonTab_C_AnimatePassLabels, CallFunc_GetActiveWidgetIndex_ReturnValue) == 0x000000, "Member 'AthenaSeasonTab_C_AnimatePassLabels::CallFunc_GetActiveWidgetIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_AnimatePassLabels, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000004, "Member 'AthenaSeasonTab_C_AnimatePassLabels::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_AnimatePassLabels, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000005, "Member 'AthenaSeasonTab_C_AnimatePassLabels::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");

// Function AthenaSeasonTab.AthenaSeasonTab_C.SetRightPaginationVisibility
// 0x000C (0x000C - 0x0000)
struct AthenaSeasonTab_C_SetRightPaginationVisibility final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue;         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaSeasonTab_C_SetRightPaginationVisibility) == 0x000004, "Wrong alignment on AthenaSeasonTab_C_SetRightPaginationVisibility");
static_assert(sizeof(AthenaSeasonTab_C_SetRightPaginationVisibility) == 0x00000C, "Wrong size on AthenaSeasonTab_C_SetRightPaginationVisibility");
static_assert(offsetof(AthenaSeasonTab_C_SetRightPaginationVisibility, Temp_bool_Variable) == 0x000000, "Member 'AthenaSeasonTab_C_SetRightPaginationVisibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_SetRightPaginationVisibility, Temp_byte_Variable) == 0x000001, "Member 'AthenaSeasonTab_C_SetRightPaginationVisibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_SetRightPaginationVisibility, Temp_byte_Variable_1) == 0x000002, "Member 'AthenaSeasonTab_C_SetRightPaginationVisibility::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_SetRightPaginationVisibility, CallFunc_GetActiveWidgetIndex_ReturnValue) == 0x000004, "Member 'AthenaSeasonTab_C_SetRightPaginationVisibility::CallFunc_GetActiveWidgetIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_SetRightPaginationVisibility, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000008, "Member 'AthenaSeasonTab_C_SetRightPaginationVisibility::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_SetRightPaginationVisibility, K2Node_Select_Default) == 0x000009, "Member 'AthenaSeasonTab_C_SetRightPaginationVisibility::K2Node_Select_Default' has a wrong offset!");

// Function AthenaSeasonTab.AthenaSeasonTab_C.ClearPaginationPip
// 0x0020 (0x0020 - 0x0000)
struct AthenaSeasonTab_C_ClearPaginationPip final
{
public:
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue;         // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_Array_Get_Item;                           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaSeasonPaginationPips_C*          K2Node_DynamicCast_AsAthena_Season_Pagination_Pips; // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaSeasonTab_C_ClearPaginationPip) == 0x000008, "Wrong alignment on AthenaSeasonTab_C_ClearPaginationPip");
static_assert(sizeof(AthenaSeasonTab_C_ClearPaginationPip) == 0x000020, "Wrong size on AthenaSeasonTab_C_ClearPaginationPip");
static_assert(offsetof(AthenaSeasonTab_C_ClearPaginationPip, CallFunc_GetActiveWidgetIndex_ReturnValue) == 0x000000, "Member 'AthenaSeasonTab_C_ClearPaginationPip::CallFunc_GetActiveWidgetIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_ClearPaginationPip, CallFunc_Array_Get_Item) == 0x000008, "Member 'AthenaSeasonTab_C_ClearPaginationPip::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_ClearPaginationPip, K2Node_DynamicCast_AsAthena_Season_Pagination_Pips) == 0x000010, "Member 'AthenaSeasonTab_C_ClearPaginationPip::K2Node_DynamicCast_AsAthena_Season_Pagination_Pips' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_ClearPaginationPip, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'AthenaSeasonTab_C_ClearPaginationPip::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function AthenaSeasonTab.AthenaSeasonTab_C.SetCurrentPaginationPip
// 0x0020 (0x0020 - 0x0000)
struct AthenaSeasonTab_C_SetCurrentPaginationPip final
{
public:
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue;         // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_Array_Get_Item;                           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaSeasonPaginationPips_C*          K2Node_DynamicCast_AsAthena_Season_Pagination_Pips; // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaSeasonTab_C_SetCurrentPaginationPip) == 0x000008, "Wrong alignment on AthenaSeasonTab_C_SetCurrentPaginationPip");
static_assert(sizeof(AthenaSeasonTab_C_SetCurrentPaginationPip) == 0x000020, "Wrong size on AthenaSeasonTab_C_SetCurrentPaginationPip");
static_assert(offsetof(AthenaSeasonTab_C_SetCurrentPaginationPip, CallFunc_GetActiveWidgetIndex_ReturnValue) == 0x000000, "Member 'AthenaSeasonTab_C_SetCurrentPaginationPip::CallFunc_GetActiveWidgetIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_SetCurrentPaginationPip, CallFunc_Array_Get_Item) == 0x000008, "Member 'AthenaSeasonTab_C_SetCurrentPaginationPip::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_SetCurrentPaginationPip, K2Node_DynamicCast_AsAthena_Season_Pagination_Pips) == 0x000010, "Member 'AthenaSeasonTab_C_SetCurrentPaginationPip::K2Node_DynamicCast_AsAthena_Season_Pagination_Pips' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_SetCurrentPaginationPip, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'AthenaSeasonTab_C_SetCurrentPaginationPip::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function AthenaSeasonTab.AthenaSeasonTab_C.ClearPagePipLeft
// 0x0028 (0x0028 - 0x0000)
struct AthenaSeasonTab_C_ClearPagePipLeft final
{
public:
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue;         // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaSeasonPaginationPips_C*          K2Node_DynamicCast_AsAthena_Season_Pagination_Pips; // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaSeasonTab_C_ClearPagePipLeft) == 0x000008, "Wrong alignment on AthenaSeasonTab_C_ClearPagePipLeft");
static_assert(sizeof(AthenaSeasonTab_C_ClearPagePipLeft) == 0x000028, "Wrong size on AthenaSeasonTab_C_ClearPagePipLeft");
static_assert(offsetof(AthenaSeasonTab_C_ClearPagePipLeft, CallFunc_GetActiveWidgetIndex_ReturnValue) == 0x000000, "Member 'AthenaSeasonTab_C_ClearPagePipLeft::CallFunc_GetActiveWidgetIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_ClearPagePipLeft, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'AthenaSeasonTab_C_ClearPagePipLeft::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_ClearPagePipLeft, CallFunc_Greater_IntInt_ReturnValue) == 0x000008, "Member 'AthenaSeasonTab_C_ClearPagePipLeft::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_ClearPagePipLeft, CallFunc_Array_Get_Item) == 0x000010, "Member 'AthenaSeasonTab_C_ClearPagePipLeft::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_ClearPagePipLeft, K2Node_DynamicCast_AsAthena_Season_Pagination_Pips) == 0x000018, "Member 'AthenaSeasonTab_C_ClearPagePipLeft::K2Node_DynamicCast_AsAthena_Season_Pagination_Pips' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_ClearPagePipLeft, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'AthenaSeasonTab_C_ClearPagePipLeft::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function AthenaSeasonTab.AthenaSeasonTab_C.ClearPagePipRight
// 0x0020 (0x0020 - 0x0000)
struct AthenaSeasonTab_C_ClearPagePipRight final
{
public:
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue;         // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_Array_Get_Item;                           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaSeasonPaginationPips_C*          K2Node_DynamicCast_AsAthena_Season_Pagination_Pips; // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaSeasonTab_C_ClearPagePipRight) == 0x000008, "Wrong alignment on AthenaSeasonTab_C_ClearPagePipRight");
static_assert(sizeof(AthenaSeasonTab_C_ClearPagePipRight) == 0x000020, "Wrong size on AthenaSeasonTab_C_ClearPagePipRight");
static_assert(offsetof(AthenaSeasonTab_C_ClearPagePipRight, CallFunc_GetActiveWidgetIndex_ReturnValue) == 0x000000, "Member 'AthenaSeasonTab_C_ClearPagePipRight::CallFunc_GetActiveWidgetIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_ClearPagePipRight, CallFunc_Subtract_IntInt_ReturnValue) == 0x000004, "Member 'AthenaSeasonTab_C_ClearPagePipRight::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_ClearPagePipRight, CallFunc_Array_Get_Item) == 0x000008, "Member 'AthenaSeasonTab_C_ClearPagePipRight::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_ClearPagePipRight, K2Node_DynamicCast_AsAthena_Season_Pagination_Pips) == 0x000010, "Member 'AthenaSeasonTab_C_ClearPagePipRight::K2Node_DynamicCast_AsAthena_Season_Pagination_Pips' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_ClearPagePipRight, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'AthenaSeasonTab_C_ClearPagePipRight::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function AthenaSeasonTab.AthenaSeasonTab_C.SetupPaginationPips
// 0x0030 (0x0030 - 0x0000)
struct AthenaSeasonTab_C_SetupPaginationPips final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_BP_CreateEntry_ReturnValue;               // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UUserWidget*>                    CallFunc_GetAllEntries_ReturnValue;                // 0x0020(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
};
static_assert(alignof(AthenaSeasonTab_C_SetupPaginationPips) == 0x000008, "Wrong alignment on AthenaSeasonTab_C_SetupPaginationPips");
static_assert(sizeof(AthenaSeasonTab_C_SetupPaginationPips) == 0x000030, "Wrong size on AthenaSeasonTab_C_SetupPaginationPips");
static_assert(offsetof(AthenaSeasonTab_C_SetupPaginationPips, Temp_int_Variable) == 0x000000, "Member 'AthenaSeasonTab_C_SetupPaginationPips::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_SetupPaginationPips, CallFunc_GetChildrenCount_ReturnValue) == 0x000004, "Member 'AthenaSeasonTab_C_SetupPaginationPips::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_SetupPaginationPips, CallFunc_Subtract_IntInt_ReturnValue) == 0x000008, "Member 'AthenaSeasonTab_C_SetupPaginationPips::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_SetupPaginationPips, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'AthenaSeasonTab_C_SetupPaginationPips::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_SetupPaginationPips, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000010, "Member 'AthenaSeasonTab_C_SetupPaginationPips::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_SetupPaginationPips, CallFunc_BP_CreateEntry_ReturnValue) == 0x000018, "Member 'AthenaSeasonTab_C_SetupPaginationPips::CallFunc_BP_CreateEntry_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_SetupPaginationPips, CallFunc_GetAllEntries_ReturnValue) == 0x000020, "Member 'AthenaSeasonTab_C_SetupPaginationPips::CallFunc_GetAllEntries_ReturnValue' has a wrong offset!");

// Function AthenaSeasonTab.AthenaSeasonTab_C.StreamedVideoOnUrlFailure
// 0x0050 (0x0050 - 0x0000)
struct AthenaSeasonTab_C_StreamedVideoOnUrlFailure final
{
public:
	class FString                                 URL;                                               // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LoadVideo_ReturnValue;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  K2Node_DynamicCast_AsFort_Player_Controller;       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const class FString& RetrievedUrl)> K2Node_CreateDelegate_OutputDelegate;              // 0x002C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(const class FString& RetrievedUrl)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x003C(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(AthenaSeasonTab_C_StreamedVideoOnUrlFailure) == 0x000008, "Wrong alignment on AthenaSeasonTab_C_StreamedVideoOnUrlFailure");
static_assert(sizeof(AthenaSeasonTab_C_StreamedVideoOnUrlFailure) == 0x000050, "Wrong size on AthenaSeasonTab_C_StreamedVideoOnUrlFailure");
static_assert(offsetof(AthenaSeasonTab_C_StreamedVideoOnUrlFailure, URL) == 0x000000, "Member 'AthenaSeasonTab_C_StreamedVideoOnUrlFailure::URL' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_StreamedVideoOnUrlFailure, CallFunc_GetPlayerController_ReturnValue) == 0x000010, "Member 'AthenaSeasonTab_C_StreamedVideoOnUrlFailure::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_StreamedVideoOnUrlFailure, CallFunc_LoadVideo_ReturnValue) == 0x000018, "Member 'AthenaSeasonTab_C_StreamedVideoOnUrlFailure::CallFunc_LoadVideo_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_StreamedVideoOnUrlFailure, K2Node_DynamicCast_AsFort_Player_Controller) == 0x000020, "Member 'AthenaSeasonTab_C_StreamedVideoOnUrlFailure::K2Node_DynamicCast_AsFort_Player_Controller' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_StreamedVideoOnUrlFailure, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'AthenaSeasonTab_C_StreamedVideoOnUrlFailure::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_StreamedVideoOnUrlFailure, K2Node_CreateDelegate_OutputDelegate) == 0x00002C, "Member 'AthenaSeasonTab_C_StreamedVideoOnUrlFailure::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_StreamedVideoOnUrlFailure, K2Node_CreateDelegate_OutputDelegate_1) == 0x00003C, "Member 'AthenaSeasonTab_C_StreamedVideoOnUrlFailure::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");

// Function AthenaSeasonTab.AthenaSeasonTab_C.StreamedVideoOnUrlSuccess
// 0x0070 (0x0070 - 0x0000)
struct AthenaSeasonTab_C_StreamedVideoOnUrlSuccess final
{
public:
	class FString                                 URL;                                               // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& RetrievedUrl)> K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(const class FString& RetrievedUrl)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_LoadVideo_ReturnValue;                    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0034(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(const class FString& OpenedUrl)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0044(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_GetTimeLimitForReplayCinematic_ReturnValue; // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0058(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0068(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaSeasonTab_C_StreamedVideoOnUrlSuccess) == 0x000008, "Wrong alignment on AthenaSeasonTab_C_StreamedVideoOnUrlSuccess");
static_assert(sizeof(AthenaSeasonTab_C_StreamedVideoOnUrlSuccess) == 0x000070, "Wrong size on AthenaSeasonTab_C_StreamedVideoOnUrlSuccess");
static_assert(offsetof(AthenaSeasonTab_C_StreamedVideoOnUrlSuccess, URL) == 0x000000, "Member 'AthenaSeasonTab_C_StreamedVideoOnUrlSuccess::URL' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_StreamedVideoOnUrlSuccess, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'AthenaSeasonTab_C_StreamedVideoOnUrlSuccess::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_StreamedVideoOnUrlSuccess, K2Node_CreateDelegate_OutputDelegate_1) == 0x000020, "Member 'AthenaSeasonTab_C_StreamedVideoOnUrlSuccess::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_StreamedVideoOnUrlSuccess, CallFunc_LoadVideo_ReturnValue) == 0x000030, "Member 'AthenaSeasonTab_C_StreamedVideoOnUrlSuccess::CallFunc_LoadVideo_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_StreamedVideoOnUrlSuccess, K2Node_CreateDelegate_OutputDelegate_2) == 0x000034, "Member 'AthenaSeasonTab_C_StreamedVideoOnUrlSuccess::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_StreamedVideoOnUrlSuccess, K2Node_CreateDelegate_OutputDelegate_3) == 0x000044, "Member 'AthenaSeasonTab_C_StreamedVideoOnUrlSuccess::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_StreamedVideoOnUrlSuccess, CallFunc_GetTimeLimitForReplayCinematic_ReturnValue) == 0x000054, "Member 'AthenaSeasonTab_C_StreamedVideoOnUrlSuccess::CallFunc_GetTimeLimitForReplayCinematic_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_StreamedVideoOnUrlSuccess, K2Node_CreateDelegate_OutputDelegate_4) == 0x000058, "Member 'AthenaSeasonTab_C_StreamedVideoOnUrlSuccess::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_StreamedVideoOnUrlSuccess, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000068, "Member 'AthenaSeasonTab_C_StreamedVideoOnUrlSuccess::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");

// Function AthenaSeasonTab.AthenaSeasonTab_C.SetLeftPaginationVisibility
// 0x000C (0x000C - 0x0000)
struct AthenaSeasonTab_C_SetLeftPaginationVisibility final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue;         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaSeasonTab_C_SetLeftPaginationVisibility) == 0x000004, "Wrong alignment on AthenaSeasonTab_C_SetLeftPaginationVisibility");
static_assert(sizeof(AthenaSeasonTab_C_SetLeftPaginationVisibility) == 0x00000C, "Wrong size on AthenaSeasonTab_C_SetLeftPaginationVisibility");
static_assert(offsetof(AthenaSeasonTab_C_SetLeftPaginationVisibility, Temp_bool_Variable) == 0x000000, "Member 'AthenaSeasonTab_C_SetLeftPaginationVisibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_SetLeftPaginationVisibility, Temp_byte_Variable) == 0x000001, "Member 'AthenaSeasonTab_C_SetLeftPaginationVisibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_SetLeftPaginationVisibility, Temp_byte_Variable_1) == 0x000002, "Member 'AthenaSeasonTab_C_SetLeftPaginationVisibility::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_SetLeftPaginationVisibility, CallFunc_GetActiveWidgetIndex_ReturnValue) == 0x000004, "Member 'AthenaSeasonTab_C_SetLeftPaginationVisibility::CallFunc_GetActiveWidgetIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_SetLeftPaginationVisibility, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000008, "Member 'AthenaSeasonTab_C_SetLeftPaginationVisibility::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_SetLeftPaginationVisibility, K2Node_Select_Default) == 0x000009, "Member 'AthenaSeasonTab_C_SetLeftPaginationVisibility::K2Node_Select_Default' has a wrong offset!");

// Function AthenaSeasonTab.AthenaSeasonTab_C.StreamedVideoPlayingTimedOut
// 0x0040 (0x0040 - 0x0000)
struct AthenaSeasonTab_C_StreamedVideoPlayingTimedOut final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AFortPlayerController*>          CallFunc_GetLocalFortPlayerControllers_ReturnValue; // 0x0020(0x0010)(ZeroConstructor, ReferenceParm)
	class AFortPlayerController*                  CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaSeasonTab_C_StreamedVideoPlayingTimedOut) == 0x000008, "Wrong alignment on AthenaSeasonTab_C_StreamedVideoPlayingTimedOut");
static_assert(sizeof(AthenaSeasonTab_C_StreamedVideoPlayingTimedOut) == 0x000040, "Wrong size on AthenaSeasonTab_C_StreamedVideoPlayingTimedOut");
static_assert(offsetof(AthenaSeasonTab_C_StreamedVideoPlayingTimedOut, Temp_int_Array_Index_Variable) == 0x000000, "Member 'AthenaSeasonTab_C_StreamedVideoPlayingTimedOut::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_StreamedVideoPlayingTimedOut, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'AthenaSeasonTab_C_StreamedVideoPlayingTimedOut::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_StreamedVideoPlayingTimedOut, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'AthenaSeasonTab_C_StreamedVideoPlayingTimedOut::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_StreamedVideoPlayingTimedOut, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'AthenaSeasonTab_C_StreamedVideoPlayingTimedOut::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_StreamedVideoPlayingTimedOut, CallFunc_GetLocalFortPlayerControllers_ReturnValue) == 0x000020, "Member 'AthenaSeasonTab_C_StreamedVideoPlayingTimedOut::CallFunc_GetLocalFortPlayerControllers_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_StreamedVideoPlayingTimedOut, CallFunc_Array_Get_Item) == 0x000030, "Member 'AthenaSeasonTab_C_StreamedVideoPlayingTimedOut::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_StreamedVideoPlayingTimedOut, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'AthenaSeasonTab_C_StreamedVideoPlayingTimedOut::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_StreamedVideoPlayingTimedOut, CallFunc_Less_IntInt_ReturnValue) == 0x00003C, "Member 'AthenaSeasonTab_C_StreamedVideoPlayingTimedOut::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function AthenaSeasonTab.AthenaSeasonTab_C.StreamedVideoOnSkipButtonClicked
// 0x0058 (0x0058 - 0x0000)
struct AthenaSeasonTab_C_StreamedVideoOnSkipButtonClicked final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& OpenedUrl)> K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x001C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AFortPlayerController*>          CallFunc_GetLocalFortPlayerControllers_ReturnValue; // 0x0030(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaSeasonTab_C_StreamedVideoOnSkipButtonClicked) == 0x000008, "Wrong alignment on AthenaSeasonTab_C_StreamedVideoOnSkipButtonClicked");
static_assert(sizeof(AthenaSeasonTab_C_StreamedVideoOnSkipButtonClicked) == 0x000058, "Wrong size on AthenaSeasonTab_C_StreamedVideoOnSkipButtonClicked");
static_assert(offsetof(AthenaSeasonTab_C_StreamedVideoOnSkipButtonClicked, Temp_int_Array_Index_Variable) == 0x000000, "Member 'AthenaSeasonTab_C_StreamedVideoOnSkipButtonClicked::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_StreamedVideoOnSkipButtonClicked, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'AthenaSeasonTab_C_StreamedVideoOnSkipButtonClicked::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_StreamedVideoOnSkipButtonClicked, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'AthenaSeasonTab_C_StreamedVideoOnSkipButtonClicked::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_StreamedVideoOnSkipButtonClicked, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'AthenaSeasonTab_C_StreamedVideoOnSkipButtonClicked::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_StreamedVideoOnSkipButtonClicked, K2Node_CreateDelegate_OutputDelegate_1) == 0x00001C, "Member 'AthenaSeasonTab_C_StreamedVideoOnSkipButtonClicked::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_StreamedVideoOnSkipButtonClicked, CallFunc_GetLocalFortPlayerControllers_ReturnValue) == 0x000030, "Member 'AthenaSeasonTab_C_StreamedVideoOnSkipButtonClicked::CallFunc_GetLocalFortPlayerControllers_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_StreamedVideoOnSkipButtonClicked, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'AthenaSeasonTab_C_StreamedVideoOnSkipButtonClicked::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_StreamedVideoOnSkipButtonClicked, CallFunc_Array_Get_Item) == 0x000048, "Member 'AthenaSeasonTab_C_StreamedVideoOnSkipButtonClicked::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_StreamedVideoOnSkipButtonClicked, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'AthenaSeasonTab_C_StreamedVideoOnSkipButtonClicked::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function AthenaSeasonTab.AthenaSeasonTab_C.StreamedVideoOnMediaPlayerEndReached
// 0x0048 (0x0048 - 0x0000)
struct AthenaSeasonTab_C_StreamedVideoOnMediaPlayerEndReached final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AFortPlayerController*>          CallFunc_GetLocalFortPlayerControllers_ReturnValue; // 0x0020(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaSeasonTab_C_StreamedVideoOnMediaPlayerEndReached) == 0x000008, "Wrong alignment on AthenaSeasonTab_C_StreamedVideoOnMediaPlayerEndReached");
static_assert(sizeof(AthenaSeasonTab_C_StreamedVideoOnMediaPlayerEndReached) == 0x000048, "Wrong size on AthenaSeasonTab_C_StreamedVideoOnMediaPlayerEndReached");
static_assert(offsetof(AthenaSeasonTab_C_StreamedVideoOnMediaPlayerEndReached, Temp_int_Array_Index_Variable) == 0x000000, "Member 'AthenaSeasonTab_C_StreamedVideoOnMediaPlayerEndReached::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_StreamedVideoOnMediaPlayerEndReached, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'AthenaSeasonTab_C_StreamedVideoOnMediaPlayerEndReached::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_StreamedVideoOnMediaPlayerEndReached, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'AthenaSeasonTab_C_StreamedVideoOnMediaPlayerEndReached::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_StreamedVideoOnMediaPlayerEndReached, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'AthenaSeasonTab_C_StreamedVideoOnMediaPlayerEndReached::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_StreamedVideoOnMediaPlayerEndReached, CallFunc_GetLocalFortPlayerControllers_ReturnValue) == 0x000020, "Member 'AthenaSeasonTab_C_StreamedVideoOnMediaPlayerEndReached::CallFunc_GetLocalFortPlayerControllers_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_StreamedVideoOnMediaPlayerEndReached, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'AthenaSeasonTab_C_StreamedVideoOnMediaPlayerEndReached::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_StreamedVideoOnMediaPlayerEndReached, CallFunc_Array_Get_Item) == 0x000038, "Member 'AthenaSeasonTab_C_StreamedVideoOnMediaPlayerEndReached::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_StreamedVideoOnMediaPlayerEndReached, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'AthenaSeasonTab_C_StreamedVideoOnMediaPlayerEndReached::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function AthenaSeasonTab.AthenaSeasonTab_C.StreamedVideoOpeningTimedOut
// 0x0050 (0x0050 - 0x0000)
struct AthenaSeasonTab_C_StreamedVideoOpeningTimedOut final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& OpenedUrl)> K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x001C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AFortPlayerController*>          CallFunc_GetLocalFortPlayerControllers_ReturnValue; // 0x0030(0x0010)(ZeroConstructor, ReferenceParm)
	class AFortPlayerController*                  CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LoadVideo_ReturnValue;                    // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaSeasonTab_C_StreamedVideoOpeningTimedOut) == 0x000008, "Wrong alignment on AthenaSeasonTab_C_StreamedVideoOpeningTimedOut");
static_assert(sizeof(AthenaSeasonTab_C_StreamedVideoOpeningTimedOut) == 0x000050, "Wrong size on AthenaSeasonTab_C_StreamedVideoOpeningTimedOut");
static_assert(offsetof(AthenaSeasonTab_C_StreamedVideoOpeningTimedOut, Temp_int_Array_Index_Variable) == 0x000000, "Member 'AthenaSeasonTab_C_StreamedVideoOpeningTimedOut::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_StreamedVideoOpeningTimedOut, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'AthenaSeasonTab_C_StreamedVideoOpeningTimedOut::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_StreamedVideoOpeningTimedOut, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'AthenaSeasonTab_C_StreamedVideoOpeningTimedOut::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_StreamedVideoOpeningTimedOut, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'AthenaSeasonTab_C_StreamedVideoOpeningTimedOut::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_StreamedVideoOpeningTimedOut, K2Node_CreateDelegate_OutputDelegate_1) == 0x00001C, "Member 'AthenaSeasonTab_C_StreamedVideoOpeningTimedOut::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_StreamedVideoOpeningTimedOut, CallFunc_GetLocalFortPlayerControllers_ReturnValue) == 0x000030, "Member 'AthenaSeasonTab_C_StreamedVideoOpeningTimedOut::CallFunc_GetLocalFortPlayerControllers_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_StreamedVideoOpeningTimedOut, CallFunc_Array_Get_Item) == 0x000040, "Member 'AthenaSeasonTab_C_StreamedVideoOpeningTimedOut::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_StreamedVideoOpeningTimedOut, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'AthenaSeasonTab_C_StreamedVideoOpeningTimedOut::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_StreamedVideoOpeningTimedOut, CallFunc_Less_IntInt_ReturnValue) == 0x00004C, "Member 'AthenaSeasonTab_C_StreamedVideoOpeningTimedOut::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_StreamedVideoOpeningTimedOut, CallFunc_LoadVideo_ReturnValue) == 0x00004D, "Member 'AthenaSeasonTab_C_StreamedVideoOpeningTimedOut::CallFunc_LoadVideo_ReturnValue' has a wrong offset!");

// Function AthenaSeasonTab.AthenaSeasonTab_C.StreamedVideoOnMediaOpened
// 0x0078 (0x0078 - 0x0000)
struct AthenaSeasonTab_C_StreamedVideoOnMediaOpened final
{
public:
	class FString                                 OpenedUrl;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTimeLimitForReplayCinematic_ReturnValue; // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& OpenedUrl)> K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0034(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              CallFunc_GetDuration_ReturnValue;                  // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTimeLimitForReplayCinematic_ReturnValue_1; // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTotalSeconds_ReturnValue;              // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMin_ReturnValue;                         // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0060(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0068(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(AthenaSeasonTab_C_StreamedVideoOnMediaOpened) == 0x000008, "Wrong alignment on AthenaSeasonTab_C_StreamedVideoOnMediaOpened");
static_assert(sizeof(AthenaSeasonTab_C_StreamedVideoOnMediaOpened) == 0x000078, "Wrong size on AthenaSeasonTab_C_StreamedVideoOnMediaOpened");
static_assert(offsetof(AthenaSeasonTab_C_StreamedVideoOnMediaOpened, OpenedUrl) == 0x000000, "Member 'AthenaSeasonTab_C_StreamedVideoOnMediaOpened::OpenedUrl' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_StreamedVideoOnMediaOpened, CallFunc_GetTimeLimitForReplayCinematic_ReturnValue) == 0x000010, "Member 'AthenaSeasonTab_C_StreamedVideoOnMediaOpened::CallFunc_GetTimeLimitForReplayCinematic_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_StreamedVideoOnMediaOpened, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'AthenaSeasonTab_C_StreamedVideoOnMediaOpened::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_StreamedVideoOnMediaOpened, K2Node_CreateDelegate_OutputDelegate_1) == 0x000024, "Member 'AthenaSeasonTab_C_StreamedVideoOnMediaOpened::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_StreamedVideoOnMediaOpened, K2Node_CreateDelegate_OutputDelegate_2) == 0x000034, "Member 'AthenaSeasonTab_C_StreamedVideoOnMediaOpened::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_StreamedVideoOnMediaOpened, CallFunc_GetDuration_ReturnValue) == 0x000048, "Member 'AthenaSeasonTab_C_StreamedVideoOnMediaOpened::CallFunc_GetDuration_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_StreamedVideoOnMediaOpened, CallFunc_GetTimeLimitForReplayCinematic_ReturnValue_1) == 0x000050, "Member 'AthenaSeasonTab_C_StreamedVideoOnMediaOpened::CallFunc_GetTimeLimitForReplayCinematic_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_StreamedVideoOnMediaOpened, CallFunc_GetTotalSeconds_ReturnValue) == 0x000054, "Member 'AthenaSeasonTab_C_StreamedVideoOnMediaOpened::CallFunc_GetTotalSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_StreamedVideoOnMediaOpened, CallFunc_Add_FloatFloat_ReturnValue) == 0x000058, "Member 'AthenaSeasonTab_C_StreamedVideoOnMediaOpened::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_StreamedVideoOnMediaOpened, CallFunc_FMin_ReturnValue) == 0x00005C, "Member 'AthenaSeasonTab_C_StreamedVideoOnMediaOpened::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_StreamedVideoOnMediaOpened, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000060, "Member 'AthenaSeasonTab_C_StreamedVideoOnMediaOpened::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_StreamedVideoOnMediaOpened, K2Node_CreateDelegate_OutputDelegate_3) == 0x000068, "Member 'AthenaSeasonTab_C_StreamedVideoOnMediaOpened::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");

// Function AthenaSeasonTab.AthenaSeasonTab_C.GetWidgetForFramingViewedItem
// 0x0008 (0x0008 - 0x0000)
struct AthenaSeasonTab_C_GetWidgetForFramingViewedItem final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaSeasonTab_C_GetWidgetForFramingViewedItem) == 0x000008, "Wrong alignment on AthenaSeasonTab_C_GetWidgetForFramingViewedItem");
static_assert(sizeof(AthenaSeasonTab_C_GetWidgetForFramingViewedItem) == 0x000008, "Wrong size on AthenaSeasonTab_C_GetWidgetForFramingViewedItem");
static_assert(offsetof(AthenaSeasonTab_C_GetWidgetForFramingViewedItem, ReturnValue) == 0x000000, "Member 'AthenaSeasonTab_C_GetWidgetForFramingViewedItem::ReturnValue' has a wrong offset!");

// Function AthenaSeasonTab.AthenaSeasonTab_C.PlaySeasonCinematic
// 0x0040 (0x0040 - 0x0000)
struct AthenaSeasonTab_C_PlaySeasonCinematic final
{
public:
	TDelegate<void(const class FString& RetrievedUrl)> K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(const class FString& RetrievedUrl)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UseElectraForReplayCinematic_ReturnValue; // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UActivatableMovieWidget_C*              CallFunc_Create_ReturnValue;                       // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LoadVideo_ReturnValue;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaSeasonTab_C_PlaySeasonCinematic) == 0x000008, "Wrong alignment on AthenaSeasonTab_C_PlaySeasonCinematic");
static_assert(sizeof(AthenaSeasonTab_C_PlaySeasonCinematic) == 0x000040, "Wrong size on AthenaSeasonTab_C_PlaySeasonCinematic");
static_assert(offsetof(AthenaSeasonTab_C_PlaySeasonCinematic, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'AthenaSeasonTab_C_PlaySeasonCinematic::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_PlaySeasonCinematic, K2Node_CreateDelegate_OutputDelegate_1) == 0x000010, "Member 'AthenaSeasonTab_C_PlaySeasonCinematic::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_PlaySeasonCinematic, CallFunc_GetPlayerController_ReturnValue) == 0x000020, "Member 'AthenaSeasonTab_C_PlaySeasonCinematic::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_PlaySeasonCinematic, CallFunc_UseElectraForReplayCinematic_ReturnValue) == 0x000028, "Member 'AthenaSeasonTab_C_PlaySeasonCinematic::CallFunc_UseElectraForReplayCinematic_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_PlaySeasonCinematic, CallFunc_Create_ReturnValue) == 0x000030, "Member 'AthenaSeasonTab_C_PlaySeasonCinematic::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_PlaySeasonCinematic, CallFunc_LoadVideo_ReturnValue) == 0x000038, "Member 'AthenaSeasonTab_C_PlaySeasonCinematic::CallFunc_LoadVideo_ReturnValue' has a wrong offset!");

// Function AthenaSeasonTab.AthenaSeasonTab_C.Handle_ReplayCinematic
// 0x0001 (0x0001 - 0x0000)
struct AthenaSeasonTab_C_Handle_ReplayCinematic final
{
public:
	bool                                          PassThrough;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaSeasonTab_C_Handle_ReplayCinematic) == 0x000001, "Wrong alignment on AthenaSeasonTab_C_Handle_ReplayCinematic");
static_assert(sizeof(AthenaSeasonTab_C_Handle_ReplayCinematic) == 0x000001, "Wrong size on AthenaSeasonTab_C_Handle_ReplayCinematic");
static_assert(offsetof(AthenaSeasonTab_C_Handle_ReplayCinematic, PassThrough) == 0x000000, "Member 'AthenaSeasonTab_C_Handle_ReplayCinematic::PassThrough' has a wrong offset!");

// Function AthenaSeasonTab.AthenaSeasonTab_C.UpdateLevelPageWidgetSwitcherTranslation
// 0x0014 (0x0014 - 0x0000)
struct AthenaSeasonTab_C_UpdateLevelPageWidgetSwitcherTranslation final
{
public:
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
