#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaSeasonBPTrackerSimpleWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaSeasonBPTrackerSimpleWidget.AthenaSeasonBPTrackerSimpleWidget_C
// 0x0080 (0x02E8 - 0x0268)
class UAthenaSeasonBPTrackerSimpleWidget_C final : public UFortAccountWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0268(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Border_Backing;                                    // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        CompleteSwitcher;                                  // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonNumericTextBlock*                CurrentText;                                       // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       DividerText;                                       // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               IconMaxed;                                         // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               IconNotMaxed;                                      // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortLazyImage*                         ItemIcon;                                          // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortLazyImage*                         ItemIconMax;                                       // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         MaxHB;                                             // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       MaxTextBlock;                                      // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         ProgressHB;                                        // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                TextColorBorder;                                   // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TotalText;                                         // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         LastBookXP;                                        // 0x02D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseBacking;                                        // 0x02DC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Large;                                             // 0x02DD(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2DE[0x2];                                      // 0x02DE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         FontSize;                                          // 0x02E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FontSizeOveride;                                   // 0x02E4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void SetStylePremium();
	void SetStyleFree();
	void OnInitialized();
	void OnAccountInfoChanged(const struct FFortPublicAccountInfo& Result);
	void PreConstruct(bool IsDesignTime);
	void Construct();
	void ExecuteUbergraph_AthenaSeasonBPTrackerSimpleWidget(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaSeasonBPTrackerSimpleWidget_C">();
	}
	static class UAthenaSeasonBPTrackerSimpleWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaSeasonBPTrackerSimpleWidget_C>();
	}
};
static_assert(alignof(UAthenaSeasonBPTrackerSimpleWidget_C) == 0x000008, "Wrong alignment on UAthenaSeasonBPTrackerSimpleWidget_C");
static_assert(sizeof(UAthenaSeasonBPTrackerSimpleWidget_C) == 0x0002E8, "Wrong size on UAthenaSeasonBPTrackerSimpleWidget_C");
static_assert(offsetof(UAthenaSeasonBPTrackerSimpleWidget_C, UberGraphFrame) == 0x000268, "Member 'UAthenaSeasonBPTrackerSimpleWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonBPTrackerSimpleWidget_C, Border_Backing) == 0x000270, "Member 'UAthenaSeasonBPTrackerSimpleWidget_C::Border_Backing' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonBPTrackerSimpleWidget_C, CompleteSwitcher) == 0x000278, "Member 'UAthenaSeasonBPTrackerSimpleWidget_C::CompleteSwitcher' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonBPTrackerSimpleWidget_C, CurrentText) == 0x000280, "Member 'UAthenaSeasonBPTrackerSimpleWidget_C::CurrentText' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonBPTrackerSimpleWidget_C, DividerText) == 0x000288, "Member 'UAthenaSeasonBPTrackerSimpleWidget_C::DividerText' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonBPTrackerSimpleWidget_C, IconMaxed) == 0x000290, "Member 'UAthenaSeasonBPTrackerSimpleWidget_C::IconMaxed' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonBPTrackerSimpleWidget_C, IconNotMaxed) == 0x000298, "Member 'UAthenaSeasonBPTrackerSimpleWidget_C::IconNotMaxed' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonBPTrackerSimpleWidget_C, ItemIcon) == 0x0002A0, "Member 'UAthenaSeasonBPTrackerSimpleWidget_C::ItemIcon' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonBPTrackerSimpleWidget_C, ItemIconMax) == 0x0002A8, "Member 'UAthenaSeasonBPTrackerSimpleWidget_C::ItemIconMax' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonBPTrackerSimpleWidget_C, MaxHB) == 0x0002B0, "Member 'UAthenaSeasonBPTrackerSimpleWidget_C::MaxHB' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonBPTrackerSimpleWidget_C, MaxTextBlock) == 0x0002B8, "Member 'UAthenaSeasonBPTrackerSimpleWidget_C::MaxTextBlock' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonBPTrackerSimpleWidget_C, ProgressHB) == 0x0002C0, "Member 'UAthenaSeasonBPTrackerSimpleWidget_C::ProgressHB' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonBPTrackerSimpleWidget_C, TextColorBorder) == 0x0002C8, "Member 'UAthenaSeasonBPTrackerSimpleWidget_C::TextColorBorder' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonBPTrackerSimpleWidget_C, TotalText) == 0x0002D0, "Member 'UAthenaSeasonBPTrackerSimpleWidget_C::TotalText' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonBPTrackerSimpleWidget_C, LastBookXP) == 0x0002D8, "Member 'UAthenaSeasonBPTrackerSimpleWidget_C::LastBookXP' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonBPTrackerSimpleWidget_C, UseBacking) == 0x0002DC, "Member 'UAthenaSeasonBPTrackerSimpleWidget_C::UseBacking' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonBPTrackerSimpleWidget_C, Large) == 0x0002DD, "Member 'UAthenaSeasonBPTrackerSimpleWidget_C::Large' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonBPTrackerSimpleWidget_C, FontSize) == 0x0002E0, "Member 'UAthenaSeasonBPTrackerSimpleWidget_C::FontSize' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonBPTrackerSimpleWidget_C, FontSizeOveride) == 0x0002E4, "Member 'UAthenaSeasonBPTrackerSimpleWidget_C::FontSizeOveride' has a wrong offset!");

}

