#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Athena_BadgerBangs_LockOnWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Athena_BadgerBangs_LockOnWidget.Athena_BadgerBangs_LockOnWidget_C
// 0x0038 (0x0260 - 0x0228)
class UAthena_BadgerBangs_LockOnWidget_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0228(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Flash;                                             // 0x0230(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Scale;                                             // 0x0238(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_83;                                          // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class AActor*                                 Target;                                            // 0x0248(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             LockinOnSound;                                     // 0x0250(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             LockinOffSound;                                    // 0x0258(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Athena_BadgerBangs_LockOnWidget(int32 EntryPoint);
	void Construct();
	void Destruct();
	void MoveUI();
	void WidgetAnimationEvt_Scale_K2Node_WidgetAnimationEvent_0();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Athena_BadgerBangs_LockOnWidget_C">();
	}
	static class UAthena_BadgerBangs_LockOnWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthena_BadgerBangs_LockOnWidget_C>();
	}
};
static_assert(alignof(UAthena_BadgerBangs_LockOnWidget_C) == 0x000008, "Wrong alignment on UAthena_BadgerBangs_LockOnWidget_C");
static_assert(sizeof(UAthena_BadgerBangs_LockOnWidget_C) == 0x000260, "Wrong size on UAthena_BadgerBangs_LockOnWidget_C");
static_assert(offsetof(UAthena_BadgerBangs_LockOnWidget_C, UberGraphFrame) == 0x000228, "Member 'UAthena_BadgerBangs_LockOnWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthena_BadgerBangs_LockOnWidget_C, Flash) == 0x000230, "Member 'UAthena_BadgerBangs_LockOnWidget_C::Flash' has a wrong offset!");
static_assert(offsetof(UAthena_BadgerBangs_LockOnWidget_C, Scale) == 0x000238, "Member 'UAthena_BadgerBangs_LockOnWidget_C::Scale' has a wrong offset!");
static_assert(offsetof(UAthena_BadgerBangs_LockOnWidget_C, Image_83) == 0x000240, "Member 'UAthena_BadgerBangs_LockOnWidget_C::Image_83' has a wrong offset!");
static_assert(offsetof(UAthena_BadgerBangs_LockOnWidget_C, Target) == 0x000248, "Member 'UAthena_BadgerBangs_LockOnWidget_C::Target' has a wrong offset!");
static_assert(offsetof(UAthena_BadgerBangs_LockOnWidget_C, LockinOnSound) == 0x000250, "Member 'UAthena_BadgerBangs_LockOnWidget_C::LockinOnSound' has a wrong offset!");
static_assert(offsetof(UAthena_BadgerBangs_LockOnWidget_C, LockinOffSound) == 0x000258, "Member 'UAthena_BadgerBangs_LockOnWidget_C::LockinOffSound' has a wrong offset!");

}

