#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaSpectateMatchModal

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaSpectateMatchModal.AthenaSpectateMatchModal_C
// 0x0060 (0x03F0 - 0x0390)
class UAthenaSpectateMatchModal_C final : public UAthenaSpectateMatchModalBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0390(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UIconTextButton_C*                      CloseButton;                                       // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDynamicEntryBox*                       FriendListEntryBox;                                // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  FriendSwitcher;                                    // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableText*                          GameSessionSearchText;                             // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           GameSessionVB;                                     // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      JoinButton;                                        // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      JoinFriendSessionButton;                           // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      JoinGameSessionButton;                             // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       NoFriendsPlayingText;                              // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         FriendListCooldown;                                // 0x03E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E4[0x4];                                      // 0x03E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           FriendListCooldownTimer;                           // 0x03E8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__GameSessionSearchText_K2Node_ComponentBoundEvent_5_OnEditableTextChangedEvent__DelegateSignature(const class FText& Text);
	void BndEvt__CloseButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__GameSessionSearchText_K2Node_ComponentBoundEvent_7_OnEditableTextCommittedEvent__DelegateSignature(const class FText& Text, ETextCommit CommitMethod);
	void BndEvt__SearchButton_K2Node_ComponentBoundEvent_8_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void Construct();
	void CreateFriendList(const TArray<class FString>& FriendsNames);
	void OnFriendNameClicked(class UCommonButton* ButtonClicked);
	void PreConstruct(bool IsDesignTime);
	void BndEvt__JoinFriend_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__JoinGame_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void RefreshFriendList();
	void Destruct();
	void OnActivated();
	void ExecuteUbergraph_AthenaSpectateMatchModal(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaSpectateMatchModal_C">();
	}
	static class UAthenaSpectateMatchModal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaSpectateMatchModal_C>();
	}
};
static_assert(alignof(UAthenaSpectateMatchModal_C) == 0x000008, "Wrong alignment on UAthenaSpectateMatchModal_C");
static_assert(sizeof(UAthenaSpectateMatchModal_C) == 0x0003F0, "Wrong size on UAthenaSpectateMatchModal_C");
static_assert(offsetof(UAthenaSpectateMatchModal_C, UberGraphFrame) == 0x000390, "Member 'UAthenaSpectateMatchModal_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaSpectateMatchModal_C, CloseButton) == 0x000398, "Member 'UAthenaSpectateMatchModal_C::CloseButton' has a wrong offset!");
static_assert(offsetof(UAthenaSpectateMatchModal_C, FriendListEntryBox) == 0x0003A0, "Member 'UAthenaSpectateMatchModal_C::FriendListEntryBox' has a wrong offset!");
static_assert(offsetof(UAthenaSpectateMatchModal_C, FriendSwitcher) == 0x0003A8, "Member 'UAthenaSpectateMatchModal_C::FriendSwitcher' has a wrong offset!");
static_assert(offsetof(UAthenaSpectateMatchModal_C, GameSessionSearchText) == 0x0003B0, "Member 'UAthenaSpectateMatchModal_C::GameSessionSearchText' has a wrong offset!");
static_assert(offsetof(UAthenaSpectateMatchModal_C, GameSessionVB) == 0x0003B8, "Member 'UAthenaSpectateMatchModal_C::GameSessionVB' has a wrong offset!");
static_assert(offsetof(UAthenaSpectateMatchModal_C, JoinButton) == 0x0003C0, "Member 'UAthenaSpectateMatchModal_C::JoinButton' has a wrong offset!");
static_assert(offsetof(UAthenaSpectateMatchModal_C, JoinFriendSessionButton) == 0x0003C8, "Member 'UAthenaSpectateMatchModal_C::JoinFriendSessionButton' has a wrong offset!");
static_assert(offsetof(UAthenaSpectateMatchModal_C, JoinGameSessionButton) == 0x0003D0, "Member 'UAthenaSpectateMatchModal_C::JoinGameSessionButton' has a wrong offset!");
static_assert(offsetof(UAthenaSpectateMatchModal_C, NoFriendsPlayingText) == 0x0003D8, "Member 'UAthenaSpectateMatchModal_C::NoFriendsPlayingText' has a wrong offset!");
static_assert(offsetof(UAthenaSpectateMatchModal_C, FriendListCooldown) == 0x0003E0, "Member 'UAthenaSpectateMatchModal_C::FriendListCooldown' has a wrong offset!");
static_assert(offsetof(UAthenaSpectateMatchModal_C, FriendListCooldownTimer) == 0x0003E8, "Member 'UAthenaSpectateMatchModal_C::FriendListCooldownTimer' has a wrong offset!");

}

