#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaDirectAcquisitionOfferPurchasedOverlay

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "GameSubCatalog_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaDirectAcquisitionOfferPurchasedOverlay.AthenaDirectAcquisitionOfferPurchasedOverlay_C
// 0x00F0 (0x05E8 - 0x04F8)
class UAthenaDirectAcquisitionOfferPurchasedOverlay_C final : public UFortStoreFrontOfferDetailsWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Purchased___Bundle_Item____FAST;                   // 0x0500(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Successfully_Purchased___Bundle_Item_;             // 0x0508(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Bundle_Blur__out_;                                 // 0x0510(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Bundle_Blur__loop_;                                // 0x0518(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Purchased___Bundle_Item_;                          // 0x0520(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Purchased_;                                        // 0x0528(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                BorderItemNAme;                                    // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HBoxMiniCards1;                                    // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HBoxMiniCards2;                                    // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HBoxMiniCards3;                                    // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HBoxMiniCards4;                                    // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HBoxSuccessfullyPurchased;                         // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageRarityFlare;                                  // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortMultiSizeItemCard*                 ItemCard;                                          // 0x0568(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               OverlayMainItem;                                   // 0x0570(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RarityGlow;                                        // 0x0578(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBoxMiniBundleItems;                            // 0x0580(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextName;                                          // 0x0588(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         QuantityPurchased;                                 // 0x0590(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         Bundle_Item_Index;                                 // 0x0594(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FPurchasedItemInfo>             Purchased_Bundle_Items;                            // 0x0598(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn)
	int32                                         BundleMiniGrid___Column;                           // 0x05A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BundleMiniGrid___Row;                              // 0x05AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortReceivedItemLootInfo              Fort_Received_Loot_Info_Struct;                    // 0x05B0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UBundleItemMiniCardWidget_C*>    Bundle_Mini_Item_Cards;                            // 0x05D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)

public:
	void Mini_Bundle_Item_Location(int32 Bundle_Item_Index_0, class UHorizontalBox** HBox_Row);
	void Bundle_Item_Anim_Speed(float* Speed);
	void Get_Bundle_Info_from_Item_Def(class UFortAccountItemDefinition* Item_Definition, struct FBundledItemInfo* Bundled_Item_Info, bool* bFoundItem);
	void PopScreen();
	void HandleBack(bool* PassThrough);
	void UpdateFromOffer(class UFortAccountItemDefinition* Item_Definition);
	void OnOfferSet();
	void OnActivated();
	void Construct();
	void WidgetAnimationEvt_Purchased__K2Node_WidgetAnimationEvent_0();
	void Remove_Widget_and_Return_to_Last_Menu();
	void Show_Next_Item();
	void BundleBlurOut();
	void WidgetAnimationEvt_Purchased___Bundle_Item__K2Node_WidgetAnimationEvent_2();
	void WidgetAnimationEvt_Purchased___Bundle_Item____FAST_K2Node_WidgetAnimationEvent_1();
	void Init_Bundle_Layout();
	void Populate_Bundle_Mini_Cards();
	void Show_Bundle_Mini_Item_Card();
	void ExecuteUbergraph_AthenaDirectAcquisitionOfferPurchasedOverlay(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaDirectAcquisitionOfferPurchasedOverlay_C">();
	}
	static class UAthenaDirectAcquisitionOfferPurchasedOverlay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaDirectAcquisitionOfferPurchasedOverlay_C>();
	}
};
static_assert(alignof(UAthenaDirectAcquisitionOfferPurchasedOverlay_C) == 0x000008, "Wrong alignment on UAthenaDirectAcquisitionOfferPurchasedOverlay_C");
static_assert(sizeof(UAthenaDirectAcquisitionOfferPurchasedOverlay_C) == 0x0005E8, "Wrong size on UAthenaDirectAcquisitionOfferPurchasedOverlay_C");
static_assert(offsetof(UAthenaDirectAcquisitionOfferPurchasedOverlay_C, UberGraphFrame) == 0x0004F8, "Member 'UAthenaDirectAcquisitionOfferPurchasedOverlay_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferPurchasedOverlay_C, Purchased___Bundle_Item____FAST) == 0x000500, "Member 'UAthenaDirectAcquisitionOfferPurchasedOverlay_C::Purchased___Bundle_Item____FAST' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferPurchasedOverlay_C, Successfully_Purchased___Bundle_Item_) == 0x000508, "Member 'UAthenaDirectAcquisitionOfferPurchasedOverlay_C::Successfully_Purchased___Bundle_Item_' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferPurchasedOverlay_C, Bundle_Blur__out_) == 0x000510, "Member 'UAthenaDirectAcquisitionOfferPurchasedOverlay_C::Bundle_Blur__out_' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferPurchasedOverlay_C, Bundle_Blur__loop_) == 0x000518, "Member 'UAthenaDirectAcquisitionOfferPurchasedOverlay_C::Bundle_Blur__loop_' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferPurchasedOverlay_C, Purchased___Bundle_Item_) == 0x000520, "Member 'UAthenaDirectAcquisitionOfferPurchasedOverlay_C::Purchased___Bundle_Item_' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferPurchasedOverlay_C, Purchased_) == 0x000528, "Member 'UAthenaDirectAcquisitionOfferPurchasedOverlay_C::Purchased_' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferPurchasedOverlay_C, BorderItemNAme) == 0x000530, "Member 'UAthenaDirectAcquisitionOfferPurchasedOverlay_C::BorderItemNAme' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferPurchasedOverlay_C, HBoxMiniCards1) == 0x000538, "Member 'UAthenaDirectAcquisitionOfferPurchasedOverlay_C::HBoxMiniCards1' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferPurchasedOverlay_C, HBoxMiniCards2) == 0x000540, "Member 'UAthenaDirectAcquisitionOfferPurchasedOverlay_C::HBoxMiniCards2' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferPurchasedOverlay_C, HBoxMiniCards3) == 0x000548, "Member 'UAthenaDirectAcquisitionOfferPurchasedOverlay_C::HBoxMiniCards3' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferPurchasedOverlay_C, HBoxMiniCards4) == 0x000550, "Member 'UAthenaDirectAcquisitionOfferPurchasedOverlay_C::HBoxMiniCards4' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferPurchasedOverlay_C, HBoxSuccessfullyPurchased) == 0x000558, "Member 'UAthenaDirectAcquisitionOfferPurchasedOverlay_C::HBoxSuccessfullyPurchased' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferPurchasedOverlay_C, ImageRarityFlare) == 0x000560, "Member 'UAthenaDirectAcquisitionOfferPurchasedOverlay_C::ImageRarityFlare' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferPurchasedOverlay_C, ItemCard) == 0x000568, "Member 'UAthenaDirectAcquisitionOfferPurchasedOverlay_C::ItemCard' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferPurchasedOverlay_C, OverlayMainItem) == 0x000570, "Member 'UAthenaDirectAcquisitionOfferPurchasedOverlay_C::OverlayMainItem' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferPurchasedOverlay_C, RarityGlow) == 0x000578, "Member 'UAthenaDirectAcquisitionOfferPurchasedOverlay_C::RarityGlow' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferPurchasedOverlay_C, SizeBoxMiniBundleItems) == 0x000580, "Member 'UAthenaDirectAcquisitionOfferPurchasedOverlay_C::SizeBoxMiniBundleItems' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferPurchasedOverlay_C, TextName) == 0x000588, "Member 'UAthenaDirectAcquisitionOfferPurchasedOverlay_C::TextName' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferPurchasedOverlay_C, QuantityPurchased) == 0x000590, "Member 'UAthenaDirectAcquisitionOfferPurchasedOverlay_C::QuantityPurchased' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferPurchasedOverlay_C, Bundle_Item_Index) == 0x000594, "Member 'UAthenaDirectAcquisitionOfferPurchasedOverlay_C::Bundle_Item_Index' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferPurchasedOverlay_C, Purchased_Bundle_Items) == 0x000598, "Member 'UAthenaDirectAcquisitionOfferPurchasedOverlay_C::Purchased_Bundle_Items' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferPurchasedOverlay_C, BundleMiniGrid___Column) == 0x0005A8, "Member 'UAthenaDirectAcquisitionOfferPurchasedOverlay_C::BundleMiniGrid___Column' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferPurchasedOverlay_C, BundleMiniGrid___Row) == 0x0005AC, "Member 'UAthenaDirectAcquisitionOfferPurchasedOverlay_C::BundleMiniGrid___Row' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferPurchasedOverlay_C, Fort_Received_Loot_Info_Struct) == 0x0005B0, "Member 'UAthenaDirectAcquisitionOfferPurchasedOverlay_C::Fort_Received_Loot_Info_Struct' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferPurchasedOverlay_C, Bundle_Mini_Item_Cards) == 0x0005D8, "Member 'UAthenaDirectAcquisitionOfferPurchasedOverlay_C::Bundle_Mini_Item_Cards' has a wrong offset!");

}

