#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaNews

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaNews.AthenaNews_C
// 0x0058 (0x02D8 - 0x0280)
class UAthenaNews_C final : public UFortAthenaNewsWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       AirRoyaleIntro;                                    // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UAthenaNewsTile_C*                      AthenaNewsTile;                                    // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaNewsTile_C*                      AthenaNewsTile_1;                                  // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaNewsTile_C*                      AthenaNewsTile_2;                                  // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaNewsTile_Spotlight_C*            AthenaNewsTile_Spotlight;                          // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SpecialEventImage;                                 // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_MoTD_Layout;                        // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(EAthenaNewsStyle NewStyle)> UpdateStyle;                                       // 0x02C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void SingleItemConfiguration();
	void ResetViewConfiguration();
	void BeginIntroSequence();
	void HandleNewsStyle(EAthenaNewsStyle NewsStyle);
	void ExecuteUbergraph_AthenaNews(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaNews_C">();
	}
	static class UAthenaNews_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaNews_C>();
	}
};
static_assert(alignof(UAthenaNews_C) == 0x000008, "Wrong alignment on UAthenaNews_C");
static_assert(sizeof(UAthenaNews_C) == 0x0002D8, "Wrong size on UAthenaNews_C");
static_assert(offsetof(UAthenaNews_C, UberGraphFrame) == 0x000280, "Member 'UAthenaNews_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaNews_C, AirRoyaleIntro) == 0x000288, "Member 'UAthenaNews_C::AirRoyaleIntro' has a wrong offset!");
static_assert(offsetof(UAthenaNews_C, Intro) == 0x000290, "Member 'UAthenaNews_C::Intro' has a wrong offset!");
static_assert(offsetof(UAthenaNews_C, AthenaNewsTile) == 0x000298, "Member 'UAthenaNews_C::AthenaNewsTile' has a wrong offset!");
static_assert(offsetof(UAthenaNews_C, AthenaNewsTile_1) == 0x0002A0, "Member 'UAthenaNews_C::AthenaNewsTile_1' has a wrong offset!");
static_assert(offsetof(UAthenaNews_C, AthenaNewsTile_2) == 0x0002A8, "Member 'UAthenaNews_C::AthenaNewsTile_2' has a wrong offset!");
static_assert(offsetof(UAthenaNews_C, AthenaNewsTile_Spotlight) == 0x0002B0, "Member 'UAthenaNews_C::AthenaNewsTile_Spotlight' has a wrong offset!");
static_assert(offsetof(UAthenaNews_C, SpecialEventImage) == 0x0002B8, "Member 'UAthenaNews_C::SpecialEventImage' has a wrong offset!");
static_assert(offsetof(UAthenaNews_C, WidgetSwitcher_MoTD_Layout) == 0x0002C0, "Member 'UAthenaNews_C::WidgetSwitcher_MoTD_Layout' has a wrong offset!");
static_assert(offsetof(UAthenaNews_C, UpdateStyle) == 0x0002C8, "Member 'UAthenaNews_C::UpdateStyle' has a wrong offset!");

}

