#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaGiftboxUnownedMessage

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaGiftboxUnownedMessage.AthenaGiftboxUnownedMessage_C
// 0x0030 (0x02C0 - 0x0290)
class UAthenaGiftboxUnownedMessage_C final : public UAthenaCosmeticUnlockingInfo
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       DataUpdate;                                        // 0x0298(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x02A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_ProgressInfo;                              // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_StaticText;                                // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        Switcher_LockedInfo;                               // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void RequestUpdateAnim();
	void RequestOutroAnim();
	void RequestIntroAnim();
	void OutroFinished();
	void ExecuteUbergraph_AthenaGiftboxUnownedMessage(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaGiftboxUnownedMessage_C">();
	}
	static class UAthenaGiftboxUnownedMessage_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaGiftboxUnownedMessage_C>();
	}
};
static_assert(alignof(UAthenaGiftboxUnownedMessage_C) == 0x000008, "Wrong alignment on UAthenaGiftboxUnownedMessage_C");
static_assert(sizeof(UAthenaGiftboxUnownedMessage_C) == 0x0002C0, "Wrong size on UAthenaGiftboxUnownedMessage_C");
static_assert(offsetof(UAthenaGiftboxUnownedMessage_C, UberGraphFrame) == 0x000290, "Member 'UAthenaGiftboxUnownedMessage_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaGiftboxUnownedMessage_C, DataUpdate) == 0x000298, "Member 'UAthenaGiftboxUnownedMessage_C::DataUpdate' has a wrong offset!");
static_assert(offsetof(UAthenaGiftboxUnownedMessage_C, Intro) == 0x0002A0, "Member 'UAthenaGiftboxUnownedMessage_C::Intro' has a wrong offset!");
static_assert(offsetof(UAthenaGiftboxUnownedMessage_C, SizeBox_ProgressInfo) == 0x0002A8, "Member 'UAthenaGiftboxUnownedMessage_C::SizeBox_ProgressInfo' has a wrong offset!");
static_assert(offsetof(UAthenaGiftboxUnownedMessage_C, SizeBox_StaticText) == 0x0002B0, "Member 'UAthenaGiftboxUnownedMessage_C::SizeBox_StaticText' has a wrong offset!");
static_assert(offsetof(UAthenaGiftboxUnownedMessage_C, Switcher_LockedInfo) == 0x0002B8, "Member 'UAthenaGiftboxUnownedMessage_C::Switcher_LockedInfo' has a wrong offset!");

}

