#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaSeasonPassLabels

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaSeasonPassLabels.AthenaSeasonPassLabels_C
// 0x0020 (0x0248 - 0x0228)
class UAthenaSeasonPassLabels_C final : public UUserWidget
{
public:
	class UWidgetAnimation*                       ShowLabels;                                        // 0x0228(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0230(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_219;                                         // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_66;                                        // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void HideTierLabels();
	void ShowTierLabels();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaSeasonPassLabels_C">();
	}
	static class UAthenaSeasonPassLabels_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaSeasonPassLabels_C>();
	}
};
static_assert(alignof(UAthenaSeasonPassLabels_C) == 0x000008, "Wrong alignment on UAthenaSeasonPassLabels_C");
static_assert(sizeof(UAthenaSeasonPassLabels_C) == 0x000248, "Wrong size on UAthenaSeasonPassLabels_C");
static_assert(offsetof(UAthenaSeasonPassLabels_C, ShowLabels) == 0x000228, "Member 'UAthenaSeasonPassLabels_C::ShowLabels' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonPassLabels_C, Image) == 0x000230, "Member 'UAthenaSeasonPassLabels_C::Image' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonPassLabels_C, Image_219) == 0x000238, "Member 'UAthenaSeasonPassLabels_C::Image_219' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonPassLabels_C, SizeBox_66) == 0x000240, "Member 'UAthenaSeasonPassLabels_C::SizeBox_66' has a wrong offset!");

}

