#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaDirectAquisitionStyleScreen

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function AthenaDirectAquisitionStyleScreen.AthenaDirectAquisitionStyleScreen_C.GetOfferGrantedItemDef
// 0x0020 (0x0020 - 0x0000)
struct AthenaDirectAquisitionStyleScreen_C_GetOfferGrantedItemDef final
{
public:
	class UFortAccountItemDefinition*             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortStoreFrontOfferInfo*               CallFunc_GetOfferInfo_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item;                           // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAccountItemDefinition*             CallFunc_GetGrantedItemDefinition_ReturnValue;     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaDirectAquisitionStyleScreen_C_GetOfferGrantedItemDef) == 0x000008, "Wrong alignment on AthenaDirectAquisitionStyleScreen_C_GetOfferGrantedItemDef");
static_assert(sizeof(AthenaDirectAquisitionStyleScreen_C_GetOfferGrantedItemDef) == 0x000020, "Wrong size on AthenaDirectAquisitionStyleScreen_C_GetOfferGrantedItemDef");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_GetOfferGrantedItemDef, ReturnValue) == 0x000000, "Member 'AthenaDirectAquisitionStyleScreen_C_GetOfferGrantedItemDef::ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_GetOfferGrantedItemDef, CallFunc_GetOfferInfo_ReturnValue) == 0x000008, "Member 'AthenaDirectAquisitionStyleScreen_C_GetOfferGrantedItemDef::CallFunc_GetOfferInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_GetOfferGrantedItemDef, CallFunc_Array_Get_Item) == 0x000010, "Member 'AthenaDirectAquisitionStyleScreen_C_GetOfferGrantedItemDef::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_GetOfferGrantedItemDef, CallFunc_GetGrantedItemDefinition_ReturnValue) == 0x000018, "Member 'AthenaDirectAquisitionStyleScreen_C_GetOfferGrantedItemDef::CallFunc_GetGrantedItemDefinition_ReturnValue' has a wrong offset!");

// Function AthenaDirectAquisitionStyleScreen.AthenaDirectAquisitionStyleScreen_C.RebuildStylesFromOffer
// 0x0030 (0x0030 - 0x0000)
struct AthenaDirectAquisitionStyleScreen_C_RebuildStylesFromOffer final
{
public:
	class UAthenaCosmeticItemDefinition*          CosmeticDef;                                       // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAccountItemDefinition*             CallFunc_GetOfferGrantedItemDef_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FMcpVariantChannelInfo>         CallFunc_GetDefaultVariantChannels_OutDefaultVariantData; // 0x0010(0x0010)(ZeroConstructor, ReferenceParm)
	class UAthenaCosmeticItemDefinition*          K2Node_DynamicCast_AsAthena_Cosmetic_Item_Definition; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaDirectAquisitionStyleScreen_C_RebuildStylesFromOffer) == 0x000008, "Wrong alignment on AthenaDirectAquisitionStyleScreen_C_RebuildStylesFromOffer");
static_assert(sizeof(AthenaDirectAquisitionStyleScreen_C_RebuildStylesFromOffer) == 0x000030, "Wrong size on AthenaDirectAquisitionStyleScreen_C_RebuildStylesFromOffer");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_RebuildStylesFromOffer, CosmeticDef) == 0x000000, "Member 'AthenaDirectAquisitionStyleScreen_C_RebuildStylesFromOffer::CosmeticDef' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_RebuildStylesFromOffer, CallFunc_GetOfferGrantedItemDef_ReturnValue) == 0x000008, "Member 'AthenaDirectAquisitionStyleScreen_C_RebuildStylesFromOffer::CallFunc_GetOfferGrantedItemDef_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_RebuildStylesFromOffer, CallFunc_GetDefaultVariantChannels_OutDefaultVariantData) == 0x000010, "Member 'AthenaDirectAquisitionStyleScreen_C_RebuildStylesFromOffer::CallFunc_GetDefaultVariantChannels_OutDefaultVariantData' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_RebuildStylesFromOffer, K2Node_DynamicCast_AsAthena_Cosmetic_Item_Definition) == 0x000020, "Member 'AthenaDirectAquisitionStyleScreen_C_RebuildStylesFromOffer::K2Node_DynamicCast_AsAthena_Cosmetic_Item_Definition' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_RebuildStylesFromOffer, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'AthenaDirectAquisitionStyleScreen_C_RebuildStylesFromOffer::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_RebuildStylesFromOffer, CallFunc_HasTag_ReturnValue) == 0x000029, "Member 'AthenaDirectAquisitionStyleScreen_C_RebuildStylesFromOffer::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_RebuildStylesFromOffer, CallFunc_TextIsEmpty_ReturnValue) == 0x00002A, "Member 'AthenaDirectAquisitionStyleScreen_C_RebuildStylesFromOffer::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");

// Function AthenaDirectAquisitionStyleScreen.AthenaDirectAquisitionStyleScreen_C.SwitchToNextItemInOffer
// 0x0014 (0x0014 - 0x0000)
struct AthenaDirectAquisitionStyleScreen_C_SwitchToNextItemInOffer final
{
public:
	int32                                         Direction;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaDirectAquisitionStyleScreen_C_SwitchToNextItemInOffer) == 0x000004, "Wrong alignment on AthenaDirectAquisitionStyleScreen_C_SwitchToNextItemInOffer");
static_assert(sizeof(AthenaDirectAquisitionStyleScreen_C_SwitchToNextItemInOffer) == 0x000014, "Wrong size on AthenaDirectAquisitionStyleScreen_C_SwitchToNextItemInOffer");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_SwitchToNextItemInOffer, Direction) == 0x000000, "Member 'AthenaDirectAquisitionStyleScreen_C_SwitchToNextItemInOffer::Direction' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_SwitchToNextItemInOffer, CallFunc_Array_Length_ReturnValue) == 0x000004, "Member 'AthenaDirectAquisitionStyleScreen_C_SwitchToNextItemInOffer::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_SwitchToNextItemInOffer, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'AthenaDirectAquisitionStyleScreen_C_SwitchToNextItemInOffer::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_SwitchToNextItemInOffer, CallFunc_Add_IntInt_ReturnValue_1) == 0x00000C, "Member 'AthenaDirectAquisitionStyleScreen_C_SwitchToNextItemInOffer::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_SwitchToNextItemInOffer, CallFunc_Percent_IntInt_ReturnValue) == 0x000010, "Member 'AthenaDirectAquisitionStyleScreen_C_SwitchToNextItemInOffer::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");

// Function AthenaDirectAquisitionStyleScreen.AthenaDirectAquisitionStyleScreen_C.ScanOfferForVariants
// 0x0050 (0x0050 - 0x0000)
struct AthenaDirectAquisitionStyleScreen_C_ScanOfferForVariants final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortStoreFrontOfferInfo*               CallFunc_GetOfferInfo_ReturnValue;                 // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAccountItemDefinition*             CallFunc_GetGrantedItemDefinition_ReturnValue;     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumGrantedItems_ReturnValue;           // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaCosmeticItemDefinition*          K2Node_DynamicCast_AsAthena_Cosmetic_Item_Definition; // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasModifiableVariants_ReturnValue;        // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaDirectAquisitionStyleScreen_C_ScanOfferForVariants) == 0x000008, "Wrong alignment on AthenaDirectAquisitionStyleScreen_C_ScanOfferForVariants");
static_assert(sizeof(AthenaDirectAquisitionStyleScreen_C_ScanOfferForVariants) == 0x000050, "Wrong size on AthenaDirectAquisitionStyleScreen_C_ScanOfferForVariants");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_ScanOfferForVariants, Temp_int_Variable) == 0x000000, "Member 'AthenaDirectAquisitionStyleScreen_C_ScanOfferForVariants::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_ScanOfferForVariants, CallFunc_Array_LastIndex_ReturnValue) == 0x000004, "Member 'AthenaDirectAquisitionStyleScreen_C_ScanOfferForVariants::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_ScanOfferForVariants, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'AthenaDirectAquisitionStyleScreen_C_ScanOfferForVariants::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_ScanOfferForVariants, Temp_byte_Variable) == 0x00000C, "Member 'AthenaDirectAquisitionStyleScreen_C_ScanOfferForVariants::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_ScanOfferForVariants, Temp_byte_Variable_1) == 0x00000D, "Member 'AthenaDirectAquisitionStyleScreen_C_ScanOfferForVariants::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_ScanOfferForVariants, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'AthenaDirectAquisitionStyleScreen_C_ScanOfferForVariants::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_ScanOfferForVariants, Temp_bool_Variable) == 0x000014, "Member 'AthenaDirectAquisitionStyleScreen_C_ScanOfferForVariants::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_ScanOfferForVariants, CallFunc_Greater_IntInt_ReturnValue) == 0x000015, "Member 'AthenaDirectAquisitionStyleScreen_C_ScanOfferForVariants::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_ScanOfferForVariants, CallFunc_Array_Add_ReturnValue) == 0x000018, "Member 'AthenaDirectAquisitionStyleScreen_C_ScanOfferForVariants::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_ScanOfferForVariants, K2Node_Select_Default) == 0x00001C, "Member 'AthenaDirectAquisitionStyleScreen_C_ScanOfferForVariants::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_ScanOfferForVariants, CallFunc_GetOfferInfo_ReturnValue) == 0x000020, "Member 'AthenaDirectAquisitionStyleScreen_C_ScanOfferForVariants::CallFunc_GetOfferInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_ScanOfferForVariants, CallFunc_GetGrantedItemDefinition_ReturnValue) == 0x000028, "Member 'AthenaDirectAquisitionStyleScreen_C_ScanOfferForVariants::CallFunc_GetGrantedItemDefinition_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_ScanOfferForVariants, CallFunc_GetNumGrantedItems_ReturnValue) == 0x000030, "Member 'AthenaDirectAquisitionStyleScreen_C_ScanOfferForVariants::CallFunc_GetNumGrantedItems_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_ScanOfferForVariants, K2Node_DynamicCast_AsAthena_Cosmetic_Item_Definition) == 0x000038, "Member 'AthenaDirectAquisitionStyleScreen_C_ScanOfferForVariants::K2Node_DynamicCast_AsAthena_Cosmetic_Item_Definition' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_ScanOfferForVariants, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'AthenaDirectAquisitionStyleScreen_C_ScanOfferForVariants::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_ScanOfferForVariants, CallFunc_Subtract_IntInt_ReturnValue) == 0x000044, "Member 'AthenaDirectAquisitionStyleScreen_C_ScanOfferForVariants::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_ScanOfferForVariants, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000048, "Member 'AthenaDirectAquisitionStyleScreen_C_ScanOfferForVariants::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_ScanOfferForVariants, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000049, "Member 'AthenaDirectAquisitionStyleScreen_C_ScanOfferForVariants::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_ScanOfferForVariants, CallFunc_HasModifiableVariants_ReturnValue) == 0x00004A, "Member 'AthenaDirectAquisitionStyleScreen_C_ScanOfferForVariants::CallFunc_HasModifiableVariants_ReturnValue' has a wrong offset!");

// Function AthenaDirectAquisitionStyleScreen.AthenaDirectAquisitionStyleScreen_C.UpdateFromVariant
// 0x0050 (0x0050 - 0x0000)
struct AthenaDirectAquisitionStyleScreen_C_UpdateFromVariant final
{
public:
	struct FGameplayTag                           VariantChannelTag;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           VariantTag;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	bool                                          IsOwned;                                           // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAccountItemDefinition*             GrantedItemDef;                                    // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAccountItemDefinition*             CallFunc_GetOfferGrantedItemDef_ReturnValue;       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaCosmeticItemDefinition*          K2Node_DynamicCast_AsAthena_Cosmetic_Item_Definition; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaCosmeticItemDefinition*          K2Node_DynamicCast_AsAthena_Cosmetic_Item_Definition_1; // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaDirectAquisitionStyleScreen_C_UpdateFromVariant) == 0x000008, "Wrong alignment on AthenaDirectAquisitionStyleScreen_C_UpdateFromVariant");
static_assert(sizeof(AthenaDirectAquisitionStyleScreen_C_UpdateFromVariant) == 0x000050, "Wrong size on AthenaDirectAquisitionStyleScreen_C_UpdateFromVariant");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_UpdateFromVariant, VariantChannelTag) == 0x000000, "Member 'AthenaDirectAquisitionStyleScreen_C_UpdateFromVariant::VariantChannelTag' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_UpdateFromVariant, VariantTag) == 0x000008, "Member 'AthenaDirectAquisitionStyleScreen_C_UpdateFromVariant::VariantTag' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_UpdateFromVariant, IsOwned) == 0x000010, "Member 'AthenaDirectAquisitionStyleScreen_C_UpdateFromVariant::IsOwned' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_UpdateFromVariant, GrantedItemDef) == 0x000018, "Member 'AthenaDirectAquisitionStyleScreen_C_UpdateFromVariant::GrantedItemDef' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_UpdateFromVariant, CallFunc_GetOfferGrantedItemDef_ReturnValue) == 0x000020, "Member 'AthenaDirectAquisitionStyleScreen_C_UpdateFromVariant::CallFunc_GetOfferGrantedItemDef_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_UpdateFromVariant, K2Node_DynamicCast_AsAthena_Cosmetic_Item_Definition) == 0x000028, "Member 'AthenaDirectAquisitionStyleScreen_C_UpdateFromVariant::K2Node_DynamicCast_AsAthena_Cosmetic_Item_Definition' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_UpdateFromVariant, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'AthenaDirectAquisitionStyleScreen_C_UpdateFromVariant::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_UpdateFromVariant, K2Node_DynamicCast_AsAthena_Cosmetic_Item_Definition_1) == 0x000038, "Member 'AthenaDirectAquisitionStyleScreen_C_UpdateFromVariant::K2Node_DynamicCast_AsAthena_Cosmetic_Item_Definition_1' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_UpdateFromVariant, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'AthenaDirectAquisitionStyleScreen_C_UpdateFromVariant::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_UpdateFromVariant, CallFunc_GetContext_ReturnValue) == 0x000048, "Member 'AthenaDirectAquisitionStyleScreen_C_UpdateFromVariant::CallFunc_GetContext_ReturnValue' has a wrong offset!");

// Function AthenaDirectAquisitionStyleScreen.AthenaDirectAquisitionStyleScreen_C.GetWidgetForFramingViewedItem
// 0x0008 (0x0008 - 0x0000)
struct AthenaDirectAquisitionStyleScreen_C_GetWidgetForFramingViewedItem final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaDirectAquisitionStyleScreen_C_GetWidgetForFramingViewedItem) == 0x000008, "Wrong alignment on AthenaDirectAquisitionStyleScreen_C_GetWidgetForFramingViewedItem");
static_assert(sizeof(AthenaDirectAquisitionStyleScreen_C_GetWidgetForFramingViewedItem) == 0x000008, "Wrong size on AthenaDirectAquisitionStyleScreen_C_GetWidgetForFramingViewedItem");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_GetWidgetForFramingViewedItem, ReturnValue) == 0x000000, "Member 'AthenaDirectAquisitionStyleScreen_C_GetWidgetForFramingViewedItem::ReturnValue' has a wrong offset!");

// Function AthenaDirectAquisitionStyleScreen.AthenaDirectAquisitionStyleScreen_C.HandleBack
// 0x0001 (0x0001 - 0x0000)
struct AthenaDirectAquisitionStyleScreen_C_HandleBack final
{
public:
	bool                                          bPassThrough;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaDirectAquisitionStyleScreen_C_HandleBack) == 0x000001, "Wrong alignment on AthenaDirectAquisitionStyleScreen_C_HandleBack");
static_assert(sizeof(AthenaDirectAquisitionStyleScreen_C_HandleBack) == 0x000001, "Wrong size on AthenaDirectAquisitionStyleScreen_C_HandleBack");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_HandleBack, bPassThrough) == 0x000000, "Member 'AthenaDirectAquisitionStyleScreen_C_HandleBack::bPassThrough' has a wrong offset!");

// Function AthenaDirectAquisitionStyleScreen.AthenaDirectAquisitionStyleScreen_C.BndEvt__Button_Previous_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AthenaDirectAquisitionStyleScreen_C_BndEvt__Button_Previous_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaDirectAquisitionStyleScreen_C_BndEvt__Button_Previous_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on AthenaDirectAquisitionStyleScreen_C_BndEvt__Button_Previous_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(AthenaDirectAquisitionStyleScreen_C_BndEvt__Button_Previous_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on AthenaDirectAquisitionStyleScreen_C_BndEvt__Button_Previous_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_BndEvt__Button_Previous_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'AthenaDirectAquisitionStyleScreen_C_BndEvt__Button_Previous_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function AthenaDirectAquisitionStyleScreen.AthenaDirectAquisitionStyleScreen_C.BndEvt__Button_Next_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AthenaDirectAquisitionStyleScreen_C_BndEvt__Button_Next_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaDirectAquisitionStyleScreen_C_BndEvt__Button_Next_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on AthenaDirectAquisitionStyleScreen_C_BndEvt__Button_Next_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(AthenaDirectAquisitionStyleScreen_C_BndEvt__Button_Next_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on AthenaDirectAquisitionStyleScreen_C_BndEvt__Button_Next_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_BndEvt__Button_Next_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'AthenaDirectAquisitionStyleScreen_C_BndEvt__Button_Next_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function AthenaDirectAquisitionStyleScreen.AthenaDirectAquisitionStyleScreen_C.BndEvt__MobileCloseButton_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AthenaDirectAquisitionStyleScreen_C_BndEvt__MobileCloseButton_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaDirectAquisitionStyleScreen_C_BndEvt__MobileCloseButton_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on AthenaDirectAquisitionStyleScreen_C_BndEvt__MobileCloseButton_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(AthenaDirectAquisitionStyleScreen_C_BndEvt__MobileCloseButton_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on AthenaDirectAquisitionStyleScreen_C_BndEvt__MobileCloseButton_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_BndEvt__MobileCloseButton_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'AthenaDirectAquisitionStyleScreen_C_BndEvt__MobileCloseButton_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function AthenaDirectAquisitionStyleScreen.AthenaDirectAquisitionStyleScreen_C.OnVariantChanged
// 0x0014 (0x0014 - 0x0000)
struct AthenaDirectAquisitionStyleScreen_C_OnVariantChanged final
{
public:
	struct FGameplayTag                           VariantChannel;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           VariantTag;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	bool                                          IsOwned;                                           // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaDirectAquisitionStyleScreen_C_OnVariantChanged) == 0x000004, "Wrong alignment on AthenaDirectAquisitionStyleScreen_C_OnVariantChanged");
static_assert(sizeof(AthenaDirectAquisitionStyleScreen_C_OnVariantChanged) == 0x000014, "Wrong size on AthenaDirectAquisitionStyleScreen_C_OnVariantChanged");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_OnVariantChanged, VariantChannel) == 0x000000, "Member 'AthenaDirectAquisitionStyleScreen_C_OnVariantChanged::VariantChannel' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_OnVariantChanged, VariantTag) == 0x000008, "Member 'AthenaDirectAquisitionStyleScreen_C_OnVariantChanged::VariantTag' has a wrong offset!");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_OnVariantChanged, IsOwned) == 0x000010, "Member 'AthenaDirectAquisitionStyleScreen_C_OnVariantChanged::IsOwned' has a wrong offset!");

// Function AthenaDirectAquisitionStyleScreen.AthenaDirectAquisitionStyleScreen_C.ExecuteUbergraph_AthenaDirectAquisitionStyleScreen
// 0x0060 (0x0060 - 0x0000)
struct AthenaDirectAquisitionStyleScreen_C_ExecuteUbergraph_AthenaDirectAquisitionStyleScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    K2Node_MakeStruct_DataTableRowHandle;              // 0x0008(0x0010)(NoDestructor)
	TDelegate<void(bool* bPassThrough)>           K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button_2;               // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button_1;               // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HandleBack_bPassThrough;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x2];                                       // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_Event_VariantChannel;                       // 0x004C(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_Event_VariantTag;                           // 0x0054(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsOwned;                              // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaDirectAquisitionStyleScreen_C_ExecuteUbergraph_AthenaDirectAquisitionStyleScreen) == 0x000008, "Wrong alignment on AthenaDirectAquisitionStyleScreen_C_ExecuteUbergraph_AthenaDirectAquisitionStyleScreen");
static_assert(sizeof(AthenaDirectAquisitionStyleScreen_C_ExecuteUbergraph_AthenaDirectAquisitionStyleScreen) == 0x000060, "Wrong size on AthenaDirectAquisitionStyleScreen_C_ExecuteUbergraph_AthenaDirectAquisitionStyleScreen");
static_assert(offsetof(AthenaDirectAquisitionStyleScreen_C_ExecuteUbergraph_AthenaDirectAquisitionStyleScreen, EntryPoint) == 0x000000, "Member 'AthenaDirectAquisitionStyleScreen_C_ExecuteUbergraph_AthenaDirectAquisitionStyleScreen::EntryPoint' has a wrong offset!");
