#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Assault_InfantryRifle_Athena

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "B_Assault_Generic_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Assault_InfantryRifle_Athena.B_Assault_InfantryRifle_Athena_C
// 0x0018 (0x0EC0 - 0x0EA8)
class AB_Assault_InfantryRifle_Athena_C final : public AB_Assault_Generic_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_B_Assault_InfantryRifle_Athena_C;   // 0x0EA8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               ClipEject;                                         // 0x0EB0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Is_Equiping;                                       // 0x0EB8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_B_Assault_InfantryRifle_Athena(int32 EntryPoint);
	void ReceiveBeginPlay();
	void OnPlayReloadFX(EFortReloadFXState ReloadStage);
	void OnPlayWeaponFireFX(bool bPersistentFire, bool bSecondaryFire);
	void K2_OnUnEquip();
	void OnWeaponAttached();
	void EjectClip();
	void Collide(class FName EventName, float EmitterTime, int32 ParticleTime, const struct FVector& Location, const struct FVector& Velocity, const struct FVector& Direction, const struct FVector& Normal, class FName BoneName, class UPhysicalMaterial* PhysMat);
	void ResetClipEject();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Assault_InfantryRifle_Athena_C">();
	}
	static class AB_Assault_InfantryRifle_Athena_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Assault_InfantryRifle_Athena_C>();
	}
};
static_assert(alignof(AB_Assault_InfantryRifle_Athena_C) == 0x000008, "Wrong alignment on AB_Assault_InfantryRifle_Athena_C");
static_assert(sizeof(AB_Assault_InfantryRifle_Athena_C) == 0x000EC0, "Wrong size on AB_Assault_InfantryRifle_Athena_C");
static_assert(offsetof(AB_Assault_InfantryRifle_Athena_C, UberGraphFrame_B_Assault_InfantryRifle_Athena_C) == 0x000EA8, "Member 'AB_Assault_InfantryRifle_Athena_C::UberGraphFrame_B_Assault_InfantryRifle_Athena_C' has a wrong offset!");
static_assert(offsetof(AB_Assault_InfantryRifle_Athena_C, ClipEject) == 0x000EB0, "Member 'AB_Assault_InfantryRifle_Athena_C::ClipEject' has a wrong offset!");
static_assert(offsetof(AB_Assault_InfantryRifle_Athena_C, Is_Equiping) == 0x000EB8, "Member 'AB_Assault_InfantryRifle_Athena_C::Is_Equiping' has a wrong offset!");

}

