#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Athena_JollyRascal_Spawner

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function B_Athena_JollyRascal_Spawner.B_Athena_JollyRascal_Spawner_C.ExecuteUbergraph_B_Athena_JollyRascal_Spawner
// 0x01E0 (0x01E0 - 0x0000)
struct B_Athena_JollyRascal_Spawner_C_ExecuteUbergraph_B_Athena_JollyRascal_Spawner final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeExtraSpawnerTransform_ReturnValue;    // 0x0010(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue_1;                   // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue;    // 0x0078(0x00B8)(ContainsInstancedReference)
	class UClass*                                 CallFunc_Array_Get_Item;                           // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsBGA_Athena_Jolly_Rascal_Extra_Drop_Resource; // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue;          // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0158(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetInstigator_ReturnValue_1;              // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0170(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_17C[0x4];                                      // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0180(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x01B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C4[0x4];                                      // 0x01C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABGA_Athena_JollyRascal_MainDrop_C*     CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Athena_JollyRascal_Spawner_C_ExecuteUbergraph_B_Athena_JollyRascal_Spawner) == 0x000010, "Wrong alignment on B_Athena_JollyRascal_Spawner_C_ExecuteUbergraph_B_Athena_JollyRascal_Spawner");
static_assert(sizeof(B_Athena_JollyRascal_Spawner_C_ExecuteUbergraph_B_Athena_JollyRascal_Spawner) == 0x0001E0, "Wrong size on B_Athena_JollyRascal_Spawner_C_ExecuteUbergraph_B_Athena_JollyRascal_Spawner");
static_assert(offsetof(B_Athena_JollyRascal_Spawner_C_ExecuteUbergraph_B_Athena_JollyRascal_Spawner, EntryPoint) == 0x000000, "Member 'B_Athena_JollyRascal_Spawner_C_ExecuteUbergraph_B_Athena_JollyRascal_Spawner::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_Athena_JollyRascal_Spawner_C_ExecuteUbergraph_B_Athena_JollyRascal_Spawner, CallFunc_IsServer_ReturnValue) == 0x000004, "Member 'B_Athena_JollyRascal_Spawner_C_ExecuteUbergraph_B_Athena_JollyRascal_Spawner::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_JollyRascal_Spawner_C_ExecuteUbergraph_B_Athena_JollyRascal_Spawner, CallFunc_GetInstigator_ReturnValue) == 0x000008, "Member 'B_Athena_JollyRascal_Spawner_C_ExecuteUbergraph_B_Athena_JollyRascal_Spawner::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_JollyRascal_Spawner_C_ExecuteUbergraph_B_Athena_JollyRascal_Spawner, CallFunc_MakeExtraSpawnerTransform_ReturnValue) == 0x000010, "Member 'B_Athena_JollyRascal_Spawner_C_ExecuteUbergraph_B_Athena_JollyRascal_Spawner::CallFunc_MakeExtraSpawnerTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_JollyRascal_Spawner_C_ExecuteUbergraph_B_Athena_JollyRascal_Spawner, CallFunc_IsServer_ReturnValue_1) == 0x000040, "Member 'B_Athena_JollyRascal_Spawner_C_ExecuteUbergraph_B_Athena_JollyRascal_Spawner::CallFunc_IsServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Athena_JollyRascal_Spawner_C_ExecuteUbergraph_B_Athena_JollyRascal_Spawner, CallFunc_RandomFloatInRange_ReturnValue) == 0x000044, "Member 'B_Athena_JollyRascal_Spawner_C_ExecuteUbergraph_B_Athena_JollyRascal_Spawner::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_JollyRascal_Spawner_C_ExecuteUbergraph_B_Athena_JollyRascal_Spawner, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'B_Athena_JollyRascal_Spawner_C_ExecuteUbergraph_B_Athena_JollyRascal_Spawner::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_JollyRascal_Spawner_C_ExecuteUbergraph_B_Athena_JollyRascal_Spawner, CallFunc_Add_IntInt_ReturnValue) == 0x00004C, "Member 'B_Athena_JollyRascal_Spawner_C_ExecuteUbergraph_B_Athena_JollyRascal_Spawner::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_JollyRascal_Spawner_C_ExecuteUbergraph_B_Athena_JollyRascal_Spawner, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000050, "Member 'B_Athena_JollyRascal_Spawner_C_ExecuteUbergraph_B_Athena_JollyRascal_Spawner::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_JollyRascal_Spawner_C_ExecuteUbergraph_B_Athena_JollyRascal_Spawner, CallFunc_BreakTransform_Location) == 0x000054, "Member 'B_Athena_JollyRascal_Spawner_C_ExecuteUbergraph_B_Athena_JollyRascal_Spawner::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(B_Athena_JollyRascal_Spawner_C_ExecuteUbergraph_B_Athena_JollyRascal_Spawner, CallFunc_BreakTransform_Rotation) == 0x000060, "Member 'B_Athena_JollyRascal_Spawner_C_ExecuteUbergraph_B_Athena_JollyRascal_Spawner::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(B_Athena_JollyRascal_Spawner_C_ExecuteUbergraph_B_Athena_JollyRascal_Spawner, CallFunc_BreakTransform_Scale) == 0x00006C, "Member 'B_Athena_JollyRascal_Spawner_C_ExecuteUbergraph_B_Athena_JollyRascal_Spawner::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(B_Athena_JollyRascal_Spawner_C_ExecuteUbergraph_B_Athena_JollyRascal_Spawner, CallFunc_MakeGameplayCueParameters_ReturnValue) == 0x000078, "Member 'B_Athena_JollyRascal_Spawner_C_ExecuteUbergraph_B_Athena_JollyRascal_Spawner::CallFunc_MakeGameplayCueParameters_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_JollyRascal_Spawner_C_ExecuteUbergraph_B_Athena_JollyRascal_Spawner, CallFunc_Array_Get_Item) == 0x000130, "Member 'B_Athena_JollyRascal_Spawner_C_ExecuteUbergraph_B_Athena_JollyRascal_Spawner::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(B_Athena_JollyRascal_Spawner_C_ExecuteUbergraph_B_Athena_JollyRascal_Spawner, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000138, "Member 'B_Athena_JollyRascal_Spawner_C_ExecuteUbergraph_B_Athena_JollyRascal_Spawner::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_JollyRascal_Spawner_C_ExecuteUbergraph_B_Athena_JollyRascal_Spawner, K2Node_ClassDynamicCast_AsBGA_Athena_Jolly_Rascal_Extra_Drop_Resource) == 0x000140, "Member 'B_Athena_JollyRascal_Spawner_C_ExecuteUbergraph_B_Athena_JollyRascal_Spawner::K2Node_ClassDynamicCast_AsBGA_Athena_Jolly_Rascal_Extra_Drop_Resource' has a wrong offset!");
static_assert(offsetof(B_Athena_JollyRascal_Spawner_C_ExecuteUbergraph_B_Athena_JollyRascal_Spawner, K2Node_ClassDynamicCast_bSuccess) == 0x000148, "Member 'B_Athena_JollyRascal_Spawner_C_ExecuteUbergraph_B_Athena_JollyRascal_Spawner::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_Athena_JollyRascal_Spawner_C_ExecuteUbergraph_B_Athena_JollyRascal_Spawner, CallFunc_FinishSpawningActor_ReturnValue) == 0x000150, "Member 'B_Athena_JollyRascal_Spawner_C_ExecuteUbergraph_B_Athena_JollyRascal_Spawner::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_JollyRascal_Spawner_C_ExecuteUbergraph_B_Athena_JollyRascal_Spawner, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000158, "Member 'B_Athena_JollyRascal_Spawner_C_ExecuteUbergraph_B_Athena_JollyRascal_Spawner::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_JollyRascal_Spawner_C_ExecuteUbergraph_B_Athena_JollyRascal_Spawner, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000164, "Member 'B_Athena_JollyRascal_Spawner_C_ExecuteUbergraph_B_Athena_JollyRascal_Spawner::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Athena_JollyRascal_Spawner_C_ExecuteUbergraph_B_Athena_JollyRascal_Spawner, CallFunc_GetInstigator_ReturnValue_1) == 0x000168, "Member 'B_Athena_JollyRascal_Spawner_C_ExecuteUbergraph_B_Athena_JollyRascal_Spawner::CallFunc_GetInstigator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Athena_JollyRascal_Spawner_C_ExecuteUbergraph_B_Athena_JollyRascal_Spawner, CallFunc_MakeRotator_ReturnValue) == 0x000170, "Member 'B_Athena_JollyRascal_Spawner_C_ExecuteUbergraph_B_Athena_JollyRascal_Spawner::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_JollyRascal_Spawner_C_ExecuteUbergraph_B_Athena_JollyRascal_Spawner, CallFunc_MakeTransform_ReturnValue) == 0x000180, "Member 'B_Athena_JollyRascal_Spawner_C_ExecuteUbergraph_B_Athena_JollyRascal_Spawner::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_JollyRascal_Spawner_C_ExecuteUbergraph_B_Athena_JollyRascal_Spawner, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x0001B0, "Member 'B_Athena_JollyRascal_Spawner_C_ExecuteUbergraph_B_Athena_JollyRascal_Spawner::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Athena_JollyRascal_Spawner_C_ExecuteUbergraph_B_Athena_JollyRascal_Spawner, CallFunc_VLerp_ReturnValue) == 0x0001B8, "Member 'B_Athena_JollyRascal_Spawner_C_ExecuteUbergraph_B_Athena_JollyRascal_Spawner::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_JollyRascal_Spawner_C_ExecuteUbergraph_B_Athena_JollyRascal_Spawner, CallFunc_FinishSpawningActor_ReturnValue_1) == 0x0001C8, "Member 'B_Athena_JollyRascal_Spawner_C_ExecuteUbergraph_B_Athena_JollyRascal_Spawner::CallFunc_FinishSpawningActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Athena_JollyRascal_Spawner_C_ExecuteUbergraph_B_Athena_JollyRascal_Spawner, Temp_int_Variable) == 0x0001D0, "Member 'B_Athena_JollyRascal_Spawner_C_ExecuteUbergraph_B_Athena_JollyRascal_Spawner::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(B_Athena_JollyRascal_Spawner_C_ExecuteUbergraph_B_Athena_JollyRascal_Spawner, CallFunc_RandomIntegerInRange_ReturnValue) == 0x0001D4, "Member 'B_Athena_JollyRascal_Spawner_C_ExecuteUbergraph_B_Athena_JollyRascal_Spawner::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_JollyRascal_Spawner_C_ExecuteUbergraph_B_Athena_JollyRascal_Spawner, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0001D8, "Member 'B_Athena_JollyRascal_Spawner_C_ExecuteUbergraph_B_Athena_JollyRascal_Spawner::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");

// Function B_Athena_JollyRascal_Spawner.B_Athena_JollyRascal_Spawner_C.SelectThingsToDrop
// 0x0060 (0x0060 - 0x0000)
struct B_Athena_JollyRascal_Spawner_C_SelectThingsToDrop final
{
public:
	class UClass*                                 ResourceBox;                                       // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Ammobox;                                           // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 DroneBox;                                          // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueAtLevel_ReturnValue_1;            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue;         // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F[0x1];                                       // 0x002F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	const class UClass*                           K2Node_Select_Default;                             // 0x0030(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_2;            // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_3;            // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue_1;       // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Athena_JollyRascal_Spawner_C_SelectThingsToDrop) == 0x000008, "Wrong alignment on B_Athena_JollyRascal_Spawner_C_SelectThingsToDrop");
static_assert(sizeof(B_Athena_JollyRascal_Spawner_C_SelectThingsToDrop) == 0x000060, "Wrong size on B_Athena_JollyRascal_Spawner_C_SelectThingsToDrop");
static_assert(offsetof(B_Athena_JollyRascal_Spawner_C_SelectThingsToDrop, ResourceBox) == 0x000000, "Member 'B_Athena_JollyRascal_Spawner_C_SelectThingsToDrop::ResourceBox' has a wrong offset!");
static_assert(offsetof(B_Athena_JollyRascal_Spawner_C_SelectThingsToDrop, Ammobox) == 0x000008, "Member 'B_Athena_JollyRascal_Spawner_C_SelectThingsToDrop::Ammobox' has a wrong offset!");
static_assert(offsetof(B_Athena_JollyRascal_Spawner_C_SelectThingsToDrop, DroneBox) == 0x000010, "Member 'B_Athena_JollyRascal_Spawner_C_SelectThingsToDrop::DroneBox' has a wrong offset!");
static_assert(offsetof(B_Athena_JollyRascal_Spawner_C_SelectThingsToDrop, Temp_int_Variable) == 0x000018, "Member 'B_Athena_JollyRascal_Spawner_C_SelectThingsToDrop::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(B_Athena_JollyRascal_Spawner_C_SelectThingsToDrop, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'B_Athena_JollyRascal_Spawner_C_SelectThingsToDrop::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_JollyRascal_Spawner_C_SelectThingsToDrop, CallFunc_GetValueAtLevel_ReturnValue) == 0x000020, "Member 'B_Athena_JollyRascal_Spawner_C_SelectThingsToDrop::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_JollyRascal_Spawner_C_SelectThingsToDrop, CallFunc_NearlyEqual_FloatFloat_ReturnValue) == 0x000024, "Member 'B_Athena_JollyRascal_Spawner_C_SelectThingsToDrop::CallFunc_NearlyEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_JollyRascal_Spawner_C_SelectThingsToDrop, CallFunc_Not_PreBool_ReturnValue) == 0x000025, "Member 'B_Athena_JollyRascal_Spawner_C_SelectThingsToDrop::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_JollyRascal_Spawner_C_SelectThingsToDrop, CallFunc_GetValueAtLevel_ReturnValue_1) == 0x000028, "Member 'B_Athena_JollyRascal_Spawner_C_SelectThingsToDrop::CallFunc_GetValueAtLevel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Athena_JollyRascal_Spawner_C_SelectThingsToDrop, CallFunc_RandomBoolWithWeight_ReturnValue) == 0x00002C, "Member 'B_Athena_JollyRascal_Spawner_C_SelectThingsToDrop::CallFunc_RandomBoolWithWeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_JollyRascal_Spawner_C_SelectThingsToDrop, Temp_bool_Variable) == 0x00002D, "Member 'B_Athena_JollyRascal_Spawner_C_SelectThingsToDrop::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(B_Athena_JollyRascal_Spawner_C_SelectThingsToDrop, CallFunc_BooleanAND_ReturnValue) == 0x00002E, "Member 'B_Athena_JollyRascal_Spawner_C_SelectThingsToDrop::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_JollyRascal_Spawner_C_SelectThingsToDrop, K2Node_Select_Default) == 0x000030, "Member 'B_Athena_JollyRascal_Spawner_C_SelectThingsToDrop::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(B_Athena_JollyRascal_Spawner_C_SelectThingsToDrop, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'B_Athena_JollyRascal_Spawner_C_SelectThingsToDrop::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_JollyRascal_Spawner_C_SelectThingsToDrop, CallFunc_Array_Add_ReturnValue) == 0x00003C, "Member 'B_Athena_JollyRascal_Spawner_C_SelectThingsToDrop::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_JollyRascal_Spawner_C_SelectThingsToDrop, CallFunc_Subtract_IntInt_ReturnValue) == 0x000040, "Member 'B_Athena_JollyRascal_Spawner_C_SelectThingsToDrop::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_JollyRascal_Spawner_C_SelectThingsToDrop, CallFunc_RandomIntegerInRange_ReturnValue) == 0x000044, "Member 'B_Athena_JollyRascal_Spawner_C_SelectThingsToDrop::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_JollyRascal_Spawner_C_SelectThingsToDrop, CallFunc_GetValueAtLevel_ReturnValue_2) == 0x000048, "Member 'B_Athena_JollyRascal_Spawner_C_SelectThingsToDrop::CallFunc_GetValueAtLevel_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_Athena_JollyRascal_Spawner_C_SelectThingsToDrop, CallFunc_FTrunc_ReturnValue) == 0x00004C, "Member 'B_Athena_JollyRascal_Spawner_C_SelectThingsToDrop::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_JollyRascal_Spawner_C_SelectThingsToDrop, CallFunc_GetValueAtLevel_ReturnValue_3) == 0x000050, "Member 'B_Athena_JollyRascal_Spawner_C_SelectThingsToDrop::CallFunc_GetValueAtLevel_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(B_Athena_JollyRascal_Spawner_C_SelectThingsToDrop, CallFunc_FTrunc_ReturnValue_1) == 0x000054, "Member 'B_Athena_JollyRascal_Spawner_C_SelectThingsToDrop::CallFunc_FTrunc_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Athena_JollyRascal_Spawner_C_SelectThingsToDrop, CallFunc_RandomIntegerInRange_ReturnValue_1) == 0x000058, "Member 'B_Athena_JollyRascal_Spawner_C_SelectThingsToDrop::CallFunc_RandomIntegerInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Athena_JollyRascal_Spawner_C_SelectThingsToDrop, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00005C, "Member 'B_Athena_JollyRascal_Spawner_C_SelectThingsToDrop::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function B_Athena_JollyRascal_Spawner.B_Athena_JollyRascal_Spawner_C.MakeExtraSpawnerTransform
// 0x00E0 (0x00E0 - 0x0000)
struct B_Athena_JollyRascal_Spawner_C_MakeExtraSpawnerTransform final
{
public:
	struct FTransform                             ReturnValue;                                       // 0x0000(0x0030)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor)
	float                                         ExtraDropSpawnRadius;                              // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_RotatorToVector_ReturnValue;         // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x0084(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0098(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0xC];                                       // 0x00A4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00B0(0x0030)(IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Athena_JollyRascal_Spawner_C_MakeExtraSpawnerTransform) == 0x000010, "Wrong alignment on B_Athena_JollyRascal_Spawner_C_MakeExtraSpawnerTransform");
static_assert(sizeof(B_Athena_JollyRascal_Spawner_C_MakeExtraSpawnerTransform) == 0x0000E0, "Wrong size on B_Athena_JollyRascal_Spawner_C_MakeExtraSpawnerTransform");
static_assert(offsetof(B_Athena_JollyRascal_Spawner_C_MakeExtraSpawnerTransform, ReturnValue) == 0x000000, "Member 'B_Athena_JollyRascal_Spawner_C_MakeExtraSpawnerTransform::ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_JollyRascal_Spawner_C_MakeExtraSpawnerTransform, ExtraDropSpawnRadius) == 0x000030, "Member 'B_Athena_JollyRascal_Spawner_C_MakeExtraSpawnerTransform::ExtraDropSpawnRadius' has a wrong offset!");
static_assert(offsetof(B_Athena_JollyRascal_Spawner_C_MakeExtraSpawnerTransform, CallFunc_RandomFloatInRange_ReturnValue) == 0x000034, "Member 'B_Athena_JollyRascal_Spawner_C_MakeExtraSpawnerTransform::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_JollyRascal_Spawner_C_MakeExtraSpawnerTransform, CallFunc_MakeRotator_ReturnValue) == 0x000038, "Member 'B_Athena_JollyRascal_Spawner_C_MakeExtraSpawnerTransform::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_JollyRascal_Spawner_C_MakeExtraSpawnerTransform, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000044, "Member 'B_Athena_JollyRascal_Spawner_C_MakeExtraSpawnerTransform::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_JollyRascal_Spawner_C_MakeExtraSpawnerTransform, CallFunc_Conv_RotatorToVector_ReturnValue) == 0x000050, "Member 'B_Athena_JollyRascal_Spawner_C_MakeExtraSpawnerTransform::CallFunc_Conv_RotatorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_JollyRascal_Spawner_C_MakeExtraSpawnerTransform, CallFunc_BreakVector_X) == 0x00005C, "Member 'B_Athena_JollyRascal_Spawner_C_MakeExtraSpawnerTransform::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(B_Athena_JollyRascal_Spawner_C_MakeExtraSpawnerTransform, CallFunc_BreakVector_Y) == 0x000060, "Member 'B_Athena_JollyRascal_Spawner_C_MakeExtraSpawnerTransform::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(B_Athena_JollyRascal_Spawner_C_MakeExtraSpawnerTransform, CallFunc_BreakVector_Z) == 0x000064, "Member 'B_Athena_JollyRascal_Spawner_C_MakeExtraSpawnerTransform::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(B_Athena_JollyRascal_Spawner_C_MakeExtraSpawnerTransform, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000068, "Member 'B_Athena_JollyRascal_Spawner_C_MakeExtraSpawnerTransform::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_JollyRascal_Spawner_C_MakeExtraSpawnerTransform, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000074, "Member 'B_Athena_JollyRascal_Spawner_C_MakeExtraSpawnerTransform::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Athena_JollyRascal_Spawner_C_MakeExtraSpawnerTransform, CallFunc_BreakVector_X_1) == 0x000078, "Member 'B_Athena_JollyRascal_Spawner_C_MakeExtraSpawnerTransform::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(B_Athena_JollyRascal_Spawner_C_MakeExtraSpawnerTransform, CallFunc_BreakVector_Y_1) == 0x00007C, "Member 'B_Athena_JollyRascal_Spawner_C_MakeExtraSpawnerTransform::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(B_Athena_JollyRascal_Spawner_C_MakeExtraSpawnerTransform, CallFunc_BreakVector_Z_1) == 0x000080, "Member 'B_Athena_JollyRascal_Spawner_C_MakeExtraSpawnerTransform::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(B_Athena_JollyRascal_Spawner_C_MakeExtraSpawnerTransform, CallFunc_MakeRotator_ReturnValue_1) == 0x000084, "Member 'B_Athena_JollyRascal_Spawner_C_MakeExtraSpawnerTransform::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Athena_JollyRascal_Spawner_C_MakeExtraSpawnerTransform, CallFunc_Add_FloatFloat_ReturnValue) == 0x000090, "Member 'B_Athena_JollyRascal_Spawner_C_MakeExtraSpawnerTransform::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_JollyRascal_Spawner_C_MakeExtraSpawnerTransform, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000094, "Member 'B_Athena_JollyRascal_Spawner_C_MakeExtraSpawnerTransform::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Athena_JollyRascal_Spawner_C_MakeExtraSpawnerTransform, CallFunc_MakeVector_ReturnValue) == 0x000098, "Member 'B_Athena_JollyRascal_Spawner_C_MakeExtraSpawnerTransform::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_JollyRascal_Spawner_C_MakeExtraSpawnerTransform, CallFunc_MakeTransform_ReturnValue) == 0x0000B0, "Member 'B_Athena_JollyRascal_Spawner_C_MakeExtraSpawnerTransform::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");

// Function B_Athena_JollyRascal_Spawner.B_Athena_JollyRascal_Spawner_C.SpawnResourceBox
// 0x0070 (0x0070 - 0x0000)
struct B_Athena_JollyRascal_Spawner_C_SpawnResourceBox final
{
public:
	struct FTransform                             Transform;                                         // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	class APawn*                                  Instigator_0;                                      // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortResourceType                             ResourceType;                                      // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABGA_Athena_JollyRascal_ExtraDrop_Resource_C* CallFunc_FinishSpawningActor_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_1;            // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_1;       // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Athena_JollyRascal_Spawner_C_SpawnResourceBox) == 0x000010, "Wrong alignment on B_Athena_JollyRascal_Spawner_C_SpawnResourceBox");
static_assert(sizeof(B_Athena_JollyRascal_Spawner_C_SpawnResourceBox) == 0x000070, "Wrong size on B_Athena_JollyRascal_Spawner_C_SpawnResourceBox");
static_assert(offsetof(B_Athena_JollyRascal_Spawner_C_SpawnResourceBox, Transform) == 0x000000, "Member 'B_Athena_JollyRascal_Spawner_C_SpawnResourceBox::Transform' has a wrong offset!");
static_assert(offsetof(B_Athena_JollyRascal_Spawner_C_SpawnResourceBox, Instigator_0) == 0x000030, "Member 'B_Athena_JollyRascal_Spawner_C_SpawnResourceBox::Instigator_0' has a wrong offset!");
static_assert(offsetof(B_Athena_JollyRascal_Spawner_C_SpawnResourceBox, ResourceType) == 0x000038, "Member 'B_Athena_JollyRascal_Spawner_C_SpawnResourceBox::ResourceType' has a wrong offset!");
