#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_BadgerGrape_Athena

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function B_BadgerGrape_Athena.B_BadgerGrape_Athena_C.ExecuteUbergraph_B_BadgerGrape_Athena
// 0x0058 (0x0058 - 0x0000)
struct B_BadgerGrape_Athena_C_ExecuteUbergraph_B_BadgerGrape_Athena final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           K2Node_MakeArray_Array;                            // 0x0018(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	TArray<struct FPrimaryAssetId>                K2Node_MakeArray_Array_1;                          // 0x0028(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	TArray<class FName>                           K2Node_MakeArray_Array_2;                          // 0x0038(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	class UAsyncActionChangePrimaryAssetBundles*  CallFunc_AsyncChangeBundleStateForPrimaryAssetList_ReturnValue; // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_BadgerGrape_Athena_C_ExecuteUbergraph_B_BadgerGrape_Athena) == 0x000008, "Wrong alignment on B_BadgerGrape_Athena_C_ExecuteUbergraph_B_BadgerGrape_Athena");
static_assert(sizeof(B_BadgerGrape_Athena_C_ExecuteUbergraph_B_BadgerGrape_Athena) == 0x000058, "Wrong size on B_BadgerGrape_Athena_C_ExecuteUbergraph_B_BadgerGrape_Athena");
static_assert(offsetof(B_BadgerGrape_Athena_C_ExecuteUbergraph_B_BadgerGrape_Athena, EntryPoint) == 0x000000, "Member 'B_BadgerGrape_Athena_C_ExecuteUbergraph_B_BadgerGrape_Athena::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_BadgerGrape_Athena_C_ExecuteUbergraph_B_BadgerGrape_Athena, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'B_BadgerGrape_Athena_C_ExecuteUbergraph_B_BadgerGrape_Athena::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(B_BadgerGrape_Athena_C_ExecuteUbergraph_B_BadgerGrape_Athena, K2Node_MakeArray_Array) == 0x000018, "Member 'B_BadgerGrape_Athena_C_ExecuteUbergraph_B_BadgerGrape_Athena::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(B_BadgerGrape_Athena_C_ExecuteUbergraph_B_BadgerGrape_Athena, K2Node_MakeArray_Array_1) == 0x000028, "Member 'B_BadgerGrape_Athena_C_ExecuteUbergraph_B_BadgerGrape_Athena::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(B_BadgerGrape_Athena_C_ExecuteUbergraph_B_BadgerGrape_Athena, K2Node_MakeArray_Array_2) == 0x000038, "Member 'B_BadgerGrape_Athena_C_ExecuteUbergraph_B_BadgerGrape_Athena::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(B_BadgerGrape_Athena_C_ExecuteUbergraph_B_BadgerGrape_Athena, CallFunc_AsyncChangeBundleStateForPrimaryAssetList_ReturnValue) == 0x000048, "Member 'B_BadgerGrape_Athena_C_ExecuteUbergraph_B_BadgerGrape_Athena::CallFunc_AsyncChangeBundleStateForPrimaryAssetList_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BadgerGrape_Athena_C_ExecuteUbergraph_B_BadgerGrape_Athena, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'B_BadgerGrape_Athena_C_ExecuteUbergraph_B_BadgerGrape_Athena::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

