#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_BGA_Athena_SilverBlazer_V2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_BGA_Athena_SilverBlazer_V2.B_BGA_Athena_SilverBlazer_V2_C
// 0x0190 (0x08F8 - 0x0768)
class AB_BGA_Athena_SilverBlazer_V2_C final : public ABuildingGameplayActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0768(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USphereEdgeAudioComponent_C*            SphereEdgeAudioComponent;                          // 0x0770(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       CollisionSphere;                                   // 0x0778(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               P_ShieldBubble_SilverBlazer_Deploy;                // 0x0780(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Root;                                              // 0x0788(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SafeZone;                                          // 0x0790(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_Warning_WarningEmissive_0F672540439858CBFFDC68AC167DD1A5; // 0x0798(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_Warning__Direction_0F672540439858CBFFDC68AC167DD1A5; // 0x079C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79D[0x3];                                      // 0x079D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_Warning;                                  // 0x07A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TimeLine_Death_Opacity_DABF44C9495658D1ACA2669E712E5AB3; // 0x07A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TimeLine_Death_ShrinkWPO_DABF44C9495658D1ACA2669E712E5AB3; // 0x07AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TimeLine_Death_FadeOut_DABF44C9495658D1ACA2669E712E5AB3; // 0x07B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            TimeLine_Death__Direction_DABF44C9495658D1ACA2669E712E5AB3; // 0x07B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7B5[0x3];                                      // 0x07B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     TimeLine_Death;                                    // 0x07B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ScaleSafeZone_DeployDoneEmis_EFFA995D4F7A89E42AA0A3963AD1FFE2; // 0x07C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ScaleSafeZone_DeployScanIn_EFFA995D4F7A89E42AA0A3963AD1FFE2; // 0x07C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ScaleSafeZone_ScaleSafeZone_EFFA995D4F7A89E42AA0A3963AD1FFE2; // 0x07C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ScaleSafeZone__Direction_EFFA995D4F7A89E42AA0A3963AD1FFE2; // 0x07CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7CD[0x3];                                      // 0x07CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     ScaleSafeZone;                                     // 0x07D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         LifespanTime;                                      // 0x07D8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class USoundBase*                             SoundDeactivate;                                   // 0x07F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        FX_Death;                                          // 0x0800(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        FX_Activate;                                       // 0x0808(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         MaxScale;                                          // 0x0810(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class USoundBase*                             SoundHitSafeZone;                                  // 0x0830(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        FX_HitSafeZone;                                    // 0x0838(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BeginSafeZone;                                     // 0x0840(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_841[0x7];                                      // 0x0841(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             SoundActivate;                                     // 0x0848(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FinishedScaling;                                   // 0x0850(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_851[0x7];                                      // 0x0851(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         InitialVelocitySlow;                               // 0x0858(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         ScaleDuration;                                     // 0x0878(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UParticleSystemComponent*               FX_SafezoneDeploy;                                 // 0x0898(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AEmitterCameraLensEffectBase*           CameraLensFX_RunIn;                                // 0x08A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AEmitterCameraLensEffectBase*           CameraLensFX_RunOut;                               // 0x08A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitWaveLocation;                                   // 0x08B0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8BC[0x4];                                      // 0x08BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               FX_SafezoneImpact;                                 // 0x08C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Damage;                                            // 0x08C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsEnding;                                          // 0x08CC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8CD[0x3];                                      // 0x08CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               FX_OnPlayer;                                       // 0x08D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                PlayerGoesInLoc;                                   // 0x08D8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                PlayerGoesOutLoc;                                  // 0x08E4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               FX_OutOfSafezone;                                  // 0x08F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2(int32 EntryPoint);
	void RunOut(class AActor* Actor);
	void RunIn(class AActor* Actor);
	void BndEvt__Sphere_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void BndEvt__Sphere_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void PlayWarningEffectBeforeShieldGoAway();
	void HitByShotgun(const struct FVector& ImpactLoc);
	void HitByRocket(const struct FVector& ImpactLoc);
	void OnDamagePlayEffects(float Damage_0, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AFortPawn* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void EventScaleSafeZone();
	void ReceiveHit(class UPrimitiveComponent* MyComp, class AActor* Other, class UPrimitiveComponent* OtherComp, bool bSelfMoved, const struct FVector& HitLocation, const struct FVector& HitNormal, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void End();
	void DeathCosmetics();
	void ReceiveBeginPlay();
	void Timeline_Warning__Audio_Pulse__EventFunc();
	void Timeline_Warning__UpdateFunc();
	void Timeline_Warning__FinishedFunc();
	void TimeLine_Death__TriggerDeathFX__EventFunc();
	void TimeLine_Death__UpdateFunc();
	void TimeLine_Death__FinishedFunc();
	void ScaleSafeZone__UpdateFunc();
	void ScaleSafeZone__FinishedFunc();
	void GetResistenceInformation(struct FVector* BasePos, float* Radius, float* ResistanceLength);
	void Set_FX_Pos(const struct FVector& Pos);
	void Set_RippleFX_Param(const struct FVector& HitWave_Loc, const float HitWave_SizeMultiplierOuterRing, const float HitWave_SizeMultiplierInnerRing, const float HitWave_DurationNew, float HitGridBrightness);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_BGA_Athena_SilverBlazer_V2_C">();
	}
	static class AB_BGA_Athena_SilverBlazer_V2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_BGA_Athena_SilverBlazer_V2_C>();
	}
};
static_assert(alignof(AB_BGA_Athena_SilverBlazer_V2_C) == 0x000008, "Wrong alignment on AB_BGA_Athena_SilverBlazer_V2_C");
static_assert(sizeof(AB_BGA_Athena_SilverBlazer_V2_C) == 0x0008F8, "Wrong size on AB_BGA_Athena_SilverBlazer_V2_C");
static_assert(offsetof(AB_BGA_Athena_SilverBlazer_V2_C, UberGraphFrame) == 0x000768, "Member 'AB_BGA_Athena_SilverBlazer_V2_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AB_BGA_Athena_SilverBlazer_V2_C, SphereEdgeAudioComponent) == 0x000770, "Member 'AB_BGA_Athena_SilverBlazer_V2_C::SphereEdgeAudioComponent' has a wrong offset!");
static_assert(offsetof(AB_BGA_Athena_SilverBlazer_V2_C, CollisionSphere) == 0x000778, "Member 'AB_BGA_Athena_SilverBlazer_V2_C::CollisionSphere' has a wrong offset!");
static_assert(offsetof(AB_BGA_Athena_SilverBlazer_V2_C, P_ShieldBubble_SilverBlazer_Deploy) == 0x000780, "Member 'AB_BGA_Athena_SilverBlazer_V2_C::P_ShieldBubble_SilverBlazer_Deploy' has a wrong offset!");
static_assert(offsetof(AB_BGA_Athena_SilverBlazer_V2_C, Root) == 0x000788, "Member 'AB_BGA_Athena_SilverBlazer_V2_C::Root' has a wrong offset!");
static_assert(offsetof(AB_BGA_Athena_SilverBlazer_V2_C, SafeZone) == 0x000790, "Member 'AB_BGA_Athena_SilverBlazer_V2_C::SafeZone' has a wrong offset!");
static_assert(offsetof(AB_BGA_Athena_SilverBlazer_V2_C, Timeline_Warning_WarningEmissive_0F672540439858CBFFDC68AC167DD1A5) == 0x000798, "Member 'AB_BGA_Athena_SilverBlazer_V2_C::Timeline_Warning_WarningEmissive_0F672540439858CBFFDC68AC167DD1A5' has a wrong offset!");
static_assert(offsetof(AB_BGA_Athena_SilverBlazer_V2_C, Timeline_Warning__Direction_0F672540439858CBFFDC68AC167DD1A5) == 0x00079C, "Member 'AB_BGA_Athena_SilverBlazer_V2_C::Timeline_Warning__Direction_0F672540439858CBFFDC68AC167DD1A5' has a wrong offset!");
static_assert(offsetof(AB_BGA_Athena_SilverBlazer_V2_C, Timeline_Warning) == 0x0007A0, "Member 'AB_BGA_Athena_SilverBlazer_V2_C::Timeline_Warning' has a wrong offset!");
static_assert(offsetof(AB_BGA_Athena_SilverBlazer_V2_C, TimeLine_Death_Opacity_DABF44C9495658D1ACA2669E712E5AB3) == 0x0007A8, "Member 'AB_BGA_Athena_SilverBlazer_V2_C::TimeLine_Death_Opacity_DABF44C9495658D1ACA2669E712E5AB3' has a wrong offset!");
static_assert(offsetof(AB_BGA_Athena_SilverBlazer_V2_C, TimeLine_Death_ShrinkWPO_DABF44C9495658D1ACA2669E712E5AB3) == 0x0007AC, "Member 'AB_BGA_Athena_SilverBlazer_V2_C::TimeLine_Death_ShrinkWPO_DABF44C9495658D1ACA2669E712E5AB3' has a wrong offset!");
static_assert(offsetof(AB_BGA_Athena_SilverBlazer_V2_C, TimeLine_Death_FadeOut_DABF44C9495658D1ACA2669E712E5AB3) == 0x0007B0, "Member 'AB_BGA_Athena_SilverBlazer_V2_C::TimeLine_Death_FadeOut_DABF44C9495658D1ACA2669E712E5AB3' has a wrong offset!");
static_assert(offsetof(AB_BGA_Athena_SilverBlazer_V2_C, TimeLine_Death__Direction_DABF44C9495658D1ACA2669E712E5AB3) == 0x0007B4, "Member 'AB_BGA_Athena_SilverBlazer_V2_C::TimeLine_Death__Direction_DABF44C9495658D1ACA2669E712E5AB3' has a wrong offset!");
static_assert(offsetof(AB_BGA_Athena_SilverBlazer_V2_C, TimeLine_Death) == 0x0007B8, "Member 'AB_BGA_Athena_SilverBlazer_V2_C::TimeLine_Death' has a wrong offset!");
static_assert(offsetof(AB_BGA_Athena_SilverBlazer_V2_C, ScaleSafeZone_DeployDoneEmis_EFFA995D4F7A89E42AA0A3963AD1FFE2) == 0x0007C0, "Member 'AB_BGA_Athena_SilverBlazer_V2_C::ScaleSafeZone_DeployDoneEmis_EFFA995D4F7A89E42AA0A3963AD1FFE2' has a wrong offset!");
static_assert(offsetof(AB_BGA_Athena_SilverBlazer_V2_C, ScaleSafeZone_DeployScanIn_EFFA995D4F7A89E42AA0A3963AD1FFE2) == 0x0007C4, "Member 'AB_BGA_Athena_SilverBlazer_V2_C::ScaleSafeZone_DeployScanIn_EFFA995D4F7A89E42AA0A3963AD1FFE2' has a wrong offset!");
static_assert(offsetof(AB_BGA_Athena_SilverBlazer_V2_C, ScaleSafeZone_ScaleSafeZone_EFFA995D4F7A89E42AA0A3963AD1FFE2) == 0x0007C8, "Member 'AB_BGA_Athena_SilverBlazer_V2_C::ScaleSafeZone_ScaleSafeZone_EFFA995D4F7A89E42AA0A3963AD1FFE2' has a wrong offset!");
static_assert(offsetof(AB_BGA_Athena_SilverBlazer_V2_C, ScaleSafeZone__Direction_EFFA995D4F7A89E42AA0A3963AD1FFE2) == 0x0007CC, "Member 'AB_BGA_Athena_SilverBlazer_V2_C::ScaleSafeZone__Direction_EFFA995D4F7A89E42AA0A3963AD1FFE2' has a wrong offset!");
static_assert(offsetof(AB_BGA_Athena_SilverBlazer_V2_C, ScaleSafeZone) == 0x0007D0, "Member 'AB_BGA_Athena_SilverBlazer_V2_C::ScaleSafeZone' has a wrong offset!");
static_assert(offsetof(AB_BGA_Athena_SilverBlazer_V2_C, LifespanTime) == 0x0007D8, "Member 'AB_BGA_Athena_SilverBlazer_V2_C::LifespanTime' has a wrong offset!");
static_assert(offsetof(AB_BGA_Athena_SilverBlazer_V2_C, SoundDeactivate) == 0x0007F8, "Member 'AB_BGA_Athena_SilverBlazer_V2_C::SoundDeactivate' has a wrong offset!");
static_assert(offsetof(AB_BGA_Athena_SilverBlazer_V2_C, FX_Death) == 0x000800, "Member 'AB_BGA_Athena_SilverBlazer_V2_C::FX_Death' has a wrong offset!");
static_assert(offsetof(AB_BGA_Athena_SilverBlazer_V2_C, FX_Activate) == 0x000808, "Member 'AB_BGA_Athena_SilverBlazer_V2_C::FX_Activate' has a wrong offset!");
static_assert(offsetof(AB_BGA_Athena_SilverBlazer_V2_C, MaxScale) == 0x000810, "Member 'AB_BGA_Athena_SilverBlazer_V2_C::MaxScale' has a wrong offset!");
static_assert(offsetof(AB_BGA_Athena_SilverBlazer_V2_C, SoundHitSafeZone) == 0x000830, "Member 'AB_BGA_Athena_SilverBlazer_V2_C::SoundHitSafeZone' has a wrong offset!");
static_assert(offsetof(AB_BGA_Athena_SilverBlazer_V2_C, FX_HitSafeZone) == 0x000838, "Member 'AB_BGA_Athena_SilverBlazer_V2_C::FX_HitSafeZone' has a wrong offset!");
static_assert(offsetof(AB_BGA_Athena_SilverBlazer_V2_C, BeginSafeZone) == 0x000840, "Member 'AB_BGA_Athena_SilverBlazer_V2_C::BeginSafeZone' has a wrong offset!");
static_assert(offsetof(AB_BGA_Athena_SilverBlazer_V2_C, SoundActivate) == 0x000848, "Member 'AB_BGA_Athena_SilverBlazer_V2_C::SoundActivate' has a wrong offset!");
static_assert(offsetof(AB_BGA_Athena_SilverBlazer_V2_C, FinishedScaling) == 0x000850, "Member 'AB_BGA_Athena_SilverBlazer_V2_C::FinishedScaling' has a wrong offset!");
static_assert(offsetof(AB_BGA_Athena_SilverBlazer_V2_C, InitialVelocitySlow) == 0x000858, "Member 'AB_BGA_Athena_SilverBlazer_V2_C::InitialVelocitySlow' has a wrong offset!");
static_assert(offsetof(AB_BGA_Athena_SilverBlazer_V2_C, ScaleDuration) == 0x000878, "Member 'AB_BGA_Athena_SilverBlazer_V2_C::ScaleDuration' has a wrong offset!");
static_assert(offsetof(AB_BGA_Athena_SilverBlazer_V2_C, FX_SafezoneDeploy) == 0x000898, "Member 'AB_BGA_Athena_SilverBlazer_V2_C::FX_SafezoneDeploy' has a wrong offset!");
static_assert(offsetof(AB_BGA_Athena_SilverBlazer_V2_C, CameraLensFX_RunIn) == 0x0008A0, "Member 'AB_BGA_Athena_SilverBlazer_V2_C::CameraLensFX_RunIn' has a wrong offset!");
static_assert(offsetof(AB_BGA_Athena_SilverBlazer_V2_C, CameraLensFX_RunOut) == 0x0008A8, "Member 'AB_BGA_Athena_SilverBlazer_V2_C::CameraLensFX_RunOut' has a wrong offset!");
static_assert(offsetof(AB_BGA_Athena_SilverBlazer_V2_C, HitWaveLocation) == 0x0008B0, "Member 'AB_BGA_Athena_SilverBlazer_V2_C::HitWaveLocation' has a wrong offset!");
static_assert(offsetof(AB_BGA_Athena_SilverBlazer_V2_C, FX_SafezoneImpact) == 0x0008C0, "Member 'AB_BGA_Athena_SilverBlazer_V2_C::FX_SafezoneImpact' has a wrong offset!");
static_assert(offsetof(AB_BGA_Athena_SilverBlazer_V2_C, Damage) == 0x0008C8, "Member 'AB_BGA_Athena_SilverBlazer_V2_C::Damage' has a wrong offset!");
static_assert(offsetof(AB_BGA_Athena_SilverBlazer_V2_C, IsEnding) == 0x0008CC, "Member 'AB_BGA_Athena_SilverBlazer_V2_C::IsEnding' has a wrong offset!");
static_assert(offsetof(AB_BGA_Athena_SilverBlazer_V2_C, FX_OnPlayer) == 0x0008D0, "Member 'AB_BGA_Athena_SilverBlazer_V2_C::FX_OnPlayer' has a wrong offset!");
static_assert(offsetof(AB_BGA_Athena_SilverBlazer_V2_C, PlayerGoesInLoc) == 0x0008D8, "Member 'AB_BGA_Athena_SilverBlazer_V2_C::PlayerGoesInLoc' has a wrong offset!");
static_assert(offsetof(AB_BGA_Athena_SilverBlazer_V2_C, PlayerGoesOutLoc) == 0x0008E4, "Member 'AB_BGA_Athena_SilverBlazer_V2_C::PlayerGoesOutLoc' has a wrong offset!");
static_assert(offsetof(AB_BGA_Athena_SilverBlazer_V2_C, FX_OutOfSafezone) == 0x0008F0, "Member 'AB_BGA_Athena_SilverBlazer_V2_C::FX_OutOfSafezone' has a wrong offset!");

}

