#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_FerretWeapon

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "B_Ranged_Dual_Generic_FerretVehicle_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_FerretWeapon.B_FerretWeapon_C
// 0x0018 (0x0F00 - 0x0EE8)
class AB_FerretWeapon_C final : public AB_Ranged_Dual_Generic_FerretVehicle_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_B_FerretWeapon_C;                   // 0x0EE8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AFortAthenaFerretVehicle*               Biplane;                                           // 0x0EF0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           SnowmanCue;                                        // 0x0EF8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_B_FerretWeapon(int32 EntryPoint);
	void OnStartOverheated();
	void HandFired(EDualWeaponHand Hand, bool bPersistantFire);
	void FerretSnowmanCheck();
	void K2_OnUnEquip();
	void OnWeaponAttached();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_FerretWeapon_C">();
	}
	static class AB_FerretWeapon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_FerretWeapon_C>();
	}
};
static_assert(alignof(AB_FerretWeapon_C) == 0x000008, "Wrong alignment on AB_FerretWeapon_C");
static_assert(sizeof(AB_FerretWeapon_C) == 0x000F00, "Wrong size on AB_FerretWeapon_C");
static_assert(offsetof(AB_FerretWeapon_C, UberGraphFrame_B_FerretWeapon_C) == 0x000EE8, "Member 'AB_FerretWeapon_C::UberGraphFrame_B_FerretWeapon_C' has a wrong offset!");
static_assert(offsetof(AB_FerretWeapon_C, Biplane) == 0x000EF0, "Member 'AB_FerretWeapon_C::Biplane' has a wrong offset!");
static_assert(offsetof(AB_FerretWeapon_C, SnowmanCue) == 0x000EF8, "Member 'AB_FerretWeapon_C::SnowmanCue' has a wrong offset!");

}

