#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_FerretWeapon

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function B_FerretWeapon.B_FerretWeapon_C.ExecuteUbergraph_B_FerretWeapon
// 0x0108 (0x0108 - 0x0000)
struct B_FerretWeapon_C_ExecuteUbergraph_B_FerretWeapon final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IFortVehicleInterface> K2Node_DynamicCast_AsFort_Vehicle_Interface;       // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput;    // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_RemoveActiveEffectsWithGrantedTags_ReturnValue; // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetAttachedActors_OutActors;              // 0x0050(0x0010)(ZeroConstructor, ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABuildingGameplayActorBalloon*          K2Node_DynamicCast_AsBuilding_Gameplay_Actor_Balloon; // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AB_FerretWeapon_C*                      K2Node_DynamicCast_AsB_Ferret_Weapon;              // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8B[0x5];                                       // 0x008B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AB_SneakySnowman_Athena_C*              K2Node_DynamicCast_AsB_Sneaky_Snowman_Athena;      // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00A4(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x00B8(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetHostVehicleCached_ReturnValue;         // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortAthenaFerretVehicle*               K2Node_DynamicCast_AsFort_Athena_Ferret_Vehicle;   // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EDualWeaponHand                               K2Node_Event_Hand;                                 // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bPersistantFire;                      // 0x00D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00D3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IFortVehicleInterface> K2Node_DynamicCast_AsFort_Vehicle_Interface_1;     // 0x00D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurrentOverheatValue_ReturnValue;      // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetOverheatingMaxValue_ReturnValue;       // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortVehicleSeatWeaponComponent*        CallFunc_GetWeaponComponentCached_ReturnValue;     // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortVehicleSeatWeaponComponent*        CallFunc_GetWeaponComponentCached_ReturnValue_1;   // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_FerretWeapon_C_ExecuteUbergraph_B_FerretWeapon) == 0x000008, "Wrong alignment on B_FerretWeapon_C_ExecuteUbergraph_B_FerretWeapon");
static_assert(sizeof(B_FerretWeapon_C_ExecuteUbergraph_B_FerretWeapon) == 0x000108, "Wrong size on B_FerretWeapon_C_ExecuteUbergraph_B_FerretWeapon");
static_assert(offsetof(B_FerretWeapon_C_ExecuteUbergraph_B_FerretWeapon, EntryPoint) == 0x000000, "Member 'B_FerretWeapon_C_ExecuteUbergraph_B_FerretWeapon::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_FerretWeapon_C_ExecuteUbergraph_B_FerretWeapon, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'B_FerretWeapon_C_ExecuteUbergraph_B_FerretWeapon::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(B_FerretWeapon_C_ExecuteUbergraph_B_FerretWeapon, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'B_FerretWeapon_C_ExecuteUbergraph_B_FerretWeapon::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_FerretWeapon_C_ExecuteUbergraph_B_FerretWeapon, CallFunc_IsValid_ReturnValue) == 0x00000C, "Member 'B_FerretWeapon_C_ExecuteUbergraph_B_FerretWeapon::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_FerretWeapon_C_ExecuteUbergraph_B_FerretWeapon, K2Node_DynamicCast_AsFort_Vehicle_Interface) == 0x000010, "Member 'B_FerretWeapon_C_ExecuteUbergraph_B_FerretWeapon::K2Node_DynamicCast_AsFort_Vehicle_Interface' has a wrong offset!");
static_assert(offsetof(B_FerretWeapon_C_ExecuteUbergraph_B_FerretWeapon, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'B_FerretWeapon_C_ExecuteUbergraph_B_FerretWeapon::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_FerretWeapon_C_ExecuteUbergraph_B_FerretWeapon, Temp_int_Array_Index_Variable) == 0x000024, "Member 'B_FerretWeapon_C_ExecuteUbergraph_B_FerretWeapon::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(B_FerretWeapon_C_ExecuteUbergraph_B_FerretWeapon, CallFunc_IsDedicatedServer_ReturnValue) == 0x000028, "Member 'B_FerretWeapon_C_ExecuteUbergraph_B_FerretWeapon::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_FerretWeapon_C_ExecuteUbergraph_B_FerretWeapon, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x000029, "Member 'B_FerretWeapon_C_ExecuteUbergraph_B_FerretWeapon::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_FerretWeapon_C_ExecuteUbergraph_B_FerretWeapon, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000030, "Member 'B_FerretWeapon_C_ExecuteUbergraph_B_FerretWeapon::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_FerretWeapon_C_ExecuteUbergraph_B_FerretWeapon, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x000038, "Member 'B_FerretWeapon_C_ExecuteUbergraph_B_FerretWeapon::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(B_FerretWeapon_C_ExecuteUbergraph_B_FerretWeapon, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000048, "Member 'B_FerretWeapon_C_ExecuteUbergraph_B_FerretWeapon::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_FerretWeapon_C_ExecuteUbergraph_B_FerretWeapon, CallFunc_RemoveActiveEffectsWithGrantedTags_ReturnValue) == 0x00004C, "Member 'B_FerretWeapon_C_ExecuteUbergraph_B_FerretWeapon::CallFunc_RemoveActiveEffectsWithGrantedTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_FerretWeapon_C_ExecuteUbergraph_B_FerretWeapon, CallFunc_GetAttachedActors_OutActors) == 0x000050, "Member 'B_FerretWeapon_C_ExecuteUbergraph_B_FerretWeapon::CallFunc_GetAttachedActors_OutActors' has a wrong offset!");
static_assert(offsetof(B_FerretWeapon_C_ExecuteUbergraph_B_FerretWeapon, CallFunc_Array_Get_Item) == 0x000060, "Member 'B_FerretWeapon_C_ExecuteUbergraph_B_FerretWeapon::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(B_FerretWeapon_C_ExecuteUbergraph_B_FerretWeapon, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000068, "Member 'B_FerretWeapon_C_ExecuteUbergraph_B_FerretWeapon::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_FerretWeapon_C_ExecuteUbergraph_B_FerretWeapon, K2Node_DynamicCast_AsBuilding_Gameplay_Actor_Balloon) == 0x000070, "Member 'B_FerretWeapon_C_ExecuteUbergraph_B_FerretWeapon::K2Node_DynamicCast_AsBuilding_Gameplay_Actor_Balloon' has a wrong offset!");
static_assert(offsetof(B_FerretWeapon_C_ExecuteUbergraph_B_FerretWeapon, K2Node_DynamicCast_bSuccess_1) == 0x000078, "Member 'B_FerretWeapon_C_ExecuteUbergraph_B_FerretWeapon::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(B_FerretWeapon_C_ExecuteUbergraph_B_FerretWeapon, K2Node_DynamicCast_AsB_Ferret_Weapon) == 0x000080, "Member 'B_FerretWeapon_C_ExecuteUbergraph_B_FerretWeapon::K2Node_DynamicCast_AsB_Ferret_Weapon' has a wrong offset!");
static_assert(offsetof(B_FerretWeapon_C_ExecuteUbergraph_B_FerretWeapon, K2Node_DynamicCast_bSuccess_2) == 0x000088, "Member 'B_FerretWeapon_C_ExecuteUbergraph_B_FerretWeapon::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(B_FerretWeapon_C_ExecuteUbergraph_B_FerretWeapon, CallFunc_BooleanOR_ReturnValue) == 0x000089, "Member 'B_FerretWeapon_C_ExecuteUbergraph_B_FerretWeapon::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_FerretWeapon_C_ExecuteUbergraph_B_FerretWeapon, CallFunc_IsValid_ReturnValue_1) == 0x00008A, "Member 'B_FerretWeapon_C_ExecuteUbergraph_B_FerretWeapon::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_FerretWeapon_C_ExecuteUbergraph_B_FerretWeapon, K2Node_DynamicCast_AsB_Sneaky_Snowman_Athena) == 0x000090, "Member 'B_FerretWeapon_C_ExecuteUbergraph_B_FerretWeapon::K2Node_DynamicCast_AsB_Sneaky_Snowman_Athena' has a wrong offset!");
static_assert(offsetof(B_FerretWeapon_C_ExecuteUbergraph_B_FerretWeapon, K2Node_DynamicCast_bSuccess_3) == 0x000098, "Member 'B_FerretWeapon_C_ExecuteUbergraph_B_FerretWeapon::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(B_FerretWeapon_C_ExecuteUbergraph_B_FerretWeapon, CallFunc_Array_Length_ReturnValue) == 0x00009C, "Member 'B_FerretWeapon_C_ExecuteUbergraph_B_FerretWeapon::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_FerretWeapon_C_ExecuteUbergraph_B_FerretWeapon, CallFunc_Less_IntInt_ReturnValue) == 0x0000A0, "Member 'B_FerretWeapon_C_ExecuteUbergraph_B_FerretWeapon::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_FerretWeapon_C_ExecuteUbergraph_B_FerretWeapon, K2Node_CreateDelegate_OutputDelegate) == 0x0000A4, "Member 'B_FerretWeapon_C_ExecuteUbergraph_B_FerretWeapon::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(B_FerretWeapon_C_ExecuteUbergraph_B_FerretWeapon, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0000B8, "Member 'B_FerretWeapon_C_ExecuteUbergraph_B_FerretWeapon::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_FerretWeapon_C_ExecuteUbergraph_B_FerretWeapon, CallFunc_GetHostVehicleCached_ReturnValue) == 0x0000C0, "Member 'B_FerretWeapon_C_ExecuteUbergraph_B_FerretWeapon::CallFunc_GetHostVehicleCached_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_FerretWeapon_C_ExecuteUbergraph_B_FerretWeapon, K2Node_DynamicCast_AsFort_Athena_Ferret_Vehicle) == 0x0000C8, "Member 'B_FerretWeapon_C_ExecuteUbergraph_B_FerretWeapon::K2Node_DynamicCast_AsFort_Athena_Ferret_Vehicle' has a wrong offset!");
static_assert(offsetof(B_FerretWeapon_C_ExecuteUbergraph_B_FerretWeapon, K2Node_DynamicCast_bSuccess_4) == 0x0000D0, "Member 'B_FerretWeapon_C_ExecuteUbergraph_B_FerretWeapon::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(B_FerretWeapon_C_ExecuteUbergraph_B_FerretWeapon, K2Node_Event_Hand) == 0x0000D1, "Member 'B_FerretWeapon_C_ExecuteUbergraph_B_FerretWeapon::K2Node_Event_Hand' has a wrong offset!");
static_assert(offsetof(B_FerretWeapon_C_ExecuteUbergraph_B_FerretWeapon, K2Node_Event_bPersistantFire) == 0x0000D2, "Member 'B_FerretWeapon_C_ExecuteUbergraph_B_FerretWeapon::K2Node_Event_bPersistantFire' has a wrong offset!");
static_assert(offsetof(B_FerretWeapon_C_ExecuteUbergraph_B_FerretWeapon, CallFunc_IsValid_ReturnValue_2) == 0x0000D3, "Member 'B_FerretWeapon_C_ExecuteUbergraph_B_FerretWeapon::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_FerretWeapon_C_ExecuteUbergraph_B_FerretWeapon, K2Node_DynamicCast_AsFort_Vehicle_Interface_1) == 0x0000D8, "Member 'B_FerretWeapon_C_ExecuteUbergraph_B_FerretWeapon::K2Node_DynamicCast_AsFort_Vehicle_Interface_1' has a wrong offset!");
static_assert(offsetof(B_FerretWeapon_C_ExecuteUbergraph_B_FerretWeapon, K2Node_DynamicCast_bSuccess_5) == 0x0000E8, "Member 'B_FerretWeapon_C_ExecuteUbergraph_B_FerretWeapon::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(B_FerretWeapon_C_ExecuteUbergraph_B_FerretWeapon, CallFunc_GetCurrentOverheatValue_ReturnValue) == 0x0000EC, "Member 'B_FerretWeapon_C_ExecuteUbergraph_B_FerretWeapon::CallFunc_GetCurrentOverheatValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_FerretWeapon_C_ExecuteUbergraph_B_FerretWeapon, CallFunc_GetOverheatingMaxValue_ReturnValue) == 0x0000F0, "Member 'B_FerretWeapon_C_ExecuteUbergraph_B_FerretWeapon::CallFunc_GetOverheatingMaxValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_FerretWeapon_C_ExecuteUbergraph_B_FerretWeapon, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0000F4, "Member 'B_FerretWeapon_C_ExecuteUbergraph_B_FerretWeapon::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_FerretWeapon_C_ExecuteUbergraph_B_FerretWeapon, CallFunc_GetWeaponComponentCached_ReturnValue) == 0x0000F8, "Member 'B_FerretWeapon_C_ExecuteUbergraph_B_FerretWeapon::CallFunc_GetWeaponComponentCached_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_FerretWeapon_C_ExecuteUbergraph_B_FerretWeapon, CallFunc_GetWeaponComponentCached_ReturnValue_1) == 0x000100, "Member 'B_FerretWeapon_C_ExecuteUbergraph_B_FerretWeapon::CallFunc_GetWeaponComponentCached_ReturnValue_1' has a wrong offset!");

// Function B_FerretWeapon.B_FerretWeapon_C.HandFired
// 0x0002 (0x0002 - 0x0000)
struct B_FerretWeapon_C_HandFired final
{
public:
	EDualWeaponHand                               Hand;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bPersistantFire;                                   // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_FerretWeapon_C_HandFired) == 0x000001, "Wrong alignment on B_FerretWeapon_C_HandFired");
static_assert(sizeof(B_FerretWeapon_C_HandFired) == 0x000002, "Wrong size on B_FerretWeapon_C_HandFired");
static_assert(offsetof(B_FerretWeapon_C_HandFired, Hand) == 0x000000, "Member 'B_FerretWeapon_C_HandFired::Hand' has a wrong offset!");
static_assert(offsetof(B_FerretWeapon_C_HandFired, bPersistantFire) == 0x000001, "Member 'B_FerretWeapon_C_HandFired::bPersistantFire' has a wrong offset!");

}

