#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Melee_Torch

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function B_Melee_Torch.B_Melee_Torch_C.ExecuteUbergraph_B_Melee_Torch
// 0x00A0 (0x00A0 - 0x0000)
struct B_Melee_Torch_C_ExecuteUbergraph_B_Melee_Torch final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0034(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0048(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue;                    // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue_1;       // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0078(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue_1;            // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue;                          // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue_1;                  // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bVisible;                             // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Melee_Torch_C_ExecuteUbergraph_B_Melee_Torch) == 0x000008, "Wrong alignment on B_Melee_Torch_C_ExecuteUbergraph_B_Melee_Torch");
static_assert(sizeof(B_Melee_Torch_C_ExecuteUbergraph_B_Melee_Torch) == 0x0000A0, "Wrong size on B_Melee_Torch_C_ExecuteUbergraph_B_Melee_Torch");
static_assert(offsetof(B_Melee_Torch_C_ExecuteUbergraph_B_Melee_Torch, EntryPoint) == 0x000000, "Member 'B_Melee_Torch_C_ExecuteUbergraph_B_Melee_Torch::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_Melee_Torch_C_ExecuteUbergraph_B_Melee_Torch, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000004, "Member 'B_Melee_Torch_C_ExecuteUbergraph_B_Melee_Torch::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Melee_Torch_C_ExecuteUbergraph_B_Melee_Torch, CallFunc_GetPlayerPawn_ReturnValue) == 0x000010, "Member 'B_Melee_Torch_C_ExecuteUbergraph_B_Melee_Torch::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Melee_Torch_C_ExecuteUbergraph_B_Melee_Torch, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000018, "Member 'B_Melee_Torch_C_ExecuteUbergraph_B_Melee_Torch::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(B_Melee_Torch_C_ExecuteUbergraph_B_Melee_Torch, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'B_Melee_Torch_C_ExecuteUbergraph_B_Melee_Torch::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_Melee_Torch_C_ExecuteUbergraph_B_Melee_Torch, CallFunc_GetVelocity_ReturnValue) == 0x000024, "Member 'B_Melee_Torch_C_ExecuteUbergraph_B_Melee_Torch::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Melee_Torch_C_ExecuteUbergraph_B_Melee_Torch, CallFunc_VSize_ReturnValue) == 0x000030, "Member 'B_Melee_Torch_C_ExecuteUbergraph_B_Melee_Torch::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Melee_Torch_C_ExecuteUbergraph_B_Melee_Torch, K2Node_CreateDelegate_OutputDelegate) == 0x000034, "Member 'B_Melee_Torch_C_ExecuteUbergraph_B_Melee_Torch::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(B_Melee_Torch_C_ExecuteUbergraph_B_Melee_Torch, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000048, "Member 'B_Melee_Torch_C_ExecuteUbergraph_B_Melee_Torch::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Melee_Torch_C_ExecuteUbergraph_B_Melee_Torch, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000050, "Member 'B_Melee_Torch_C_ExecuteUbergraph_B_Melee_Torch::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Melee_Torch_C_ExecuteUbergraph_B_Melee_Torch, CallFunc_FInterpTo_ReturnValue) == 0x000054, "Member 'B_Melee_Torch_C_ExecuteUbergraph_B_Melee_Torch::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Melee_Torch_C_ExecuteUbergraph_B_Melee_Torch, CallFunc_MapRangeClamped_ReturnValue) == 0x000058, "Member 'B_Melee_Torch_C_ExecuteUbergraph_B_Melee_Torch::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Melee_Torch_C_ExecuteUbergraph_B_Melee_Torch, CallFunc_GetActorForwardVector_ReturnValue) == 0x00005C, "Member 'B_Melee_Torch_C_ExecuteUbergraph_B_Melee_Torch::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Melee_Torch_C_ExecuteUbergraph_B_Melee_Torch, CallFunc_BreakVector_X) == 0x000068, "Member 'B_Melee_Torch_C_ExecuteUbergraph_B_Melee_Torch::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(B_Melee_Torch_C_ExecuteUbergraph_B_Melee_Torch, CallFunc_BreakVector_Y) == 0x00006C, "Member 'B_Melee_Torch_C_ExecuteUbergraph_B_Melee_Torch::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(B_Melee_Torch_C_ExecuteUbergraph_B_Melee_Torch, CallFunc_BreakVector_Z) == 0x000070, "Member 'B_Melee_Torch_C_ExecuteUbergraph_B_Melee_Torch::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(B_Melee_Torch_C_ExecuteUbergraph_B_Melee_Torch, CallFunc_GetWorldDeltaSeconds_ReturnValue_1) == 0x000074, "Member 'B_Melee_Torch_C_ExecuteUbergraph_B_Melee_Torch::CallFunc_GetWorldDeltaSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Melee_Torch_C_ExecuteUbergraph_B_Melee_Torch, CallFunc_MakeVector_ReturnValue) == 0x000078, "Member 'B_Melee_Torch_C_ExecuteUbergraph_B_Melee_Torch::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Melee_Torch_C_ExecuteUbergraph_B_Melee_Torch, CallFunc_Dot_VectorVector_ReturnValue) == 0x000084, "Member 'B_Melee_Torch_C_ExecuteUbergraph_B_Melee_Torch::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Melee_Torch_C_ExecuteUbergraph_B_Melee_Torch, CallFunc_MapRangeClamped_ReturnValue_1) == 0x000088, "Member 'B_Melee_Torch_C_ExecuteUbergraph_B_Melee_Torch::CallFunc_MapRangeClamped_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Melee_Torch_C_ExecuteUbergraph_B_Melee_Torch, CallFunc_Abs_ReturnValue) == 0x00008C, "Member 'B_Melee_Torch_C_ExecuteUbergraph_B_Melee_Torch::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Melee_Torch_C_ExecuteUbergraph_B_Melee_Torch, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000090, "Member 'B_Melee_Torch_C_ExecuteUbergraph_B_Melee_Torch::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Melee_Torch_C_ExecuteUbergraph_B_Melee_Torch, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000094, "Member 'B_Melee_Torch_C_ExecuteUbergraph_B_Melee_Torch::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Melee_Torch_C_ExecuteUbergraph_B_Melee_Torch, CallFunc_FInterpTo_ReturnValue_1) == 0x000098, "Member 'B_Melee_Torch_C_ExecuteUbergraph_B_Melee_Torch::CallFunc_FInterpTo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Melee_Torch_C_ExecuteUbergraph_B_Melee_Torch, K2Node_Event_bVisible) == 0x00009C, "Member 'B_Melee_Torch_C_ExecuteUbergraph_B_Melee_Torch::K2Node_Event_bVisible' has a wrong offset!");
static_assert(offsetof(B_Melee_Torch_C_ExecuteUbergraph_B_Melee_Torch, CallFunc_IsValid_ReturnValue) == 0x00009D, "Member 'B_Melee_Torch_C_ExecuteUbergraph_B_Melee_Torch::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function B_Melee_Torch.B_Melee_Torch_C.OnWeaponVisibilityChanged
// 0x0001 (0x0001 - 0x0000)
struct B_Melee_Torch_C_OnWeaponVisibilityChanged final
{
public:
	bool                                          bVisible;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Melee_Torch_C_OnWeaponVisibilityChanged) == 0x000001, "Wrong alignment on B_Melee_Torch_C_OnWeaponVisibilityChanged");
static_assert(sizeof(B_Melee_Torch_C_OnWeaponVisibilityChanged) == 0x000001, "Wrong size on B_Melee_Torch_C_OnWeaponVisibilityChanged");
static_assert(offsetof(B_Melee_Torch_C_OnWeaponVisibilityChanged, bVisible) == 0x000000, "Member 'B_Melee_Torch_C_OnWeaponVisibilityChanged::bVisible' has a wrong offset!");

}

