#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_MountedCannonAthena

#include "Basic.hpp"


namespace SDK::Params
{

// Function B_MountedCannonAthena.B_MountedCannonAthena_C.ExecuteUbergraph_B_MountedCannonAthena
// 0x0098 (0x0098 - 0x0000)
struct B_MountedCannonAthena_C_ExecuteUbergraph_B_MountedCannonAthena final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bPersistentFire;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bSecondaryFire;                       // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetInstigator_ReturnValue_1;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn_1;           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetVehicleActor_ReturnValue;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetVehicleActor_ReturnValue_1;            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortAthenaSKPushCannon*                K2Node_DynamicCast_AsFort_Athena_SKPush_Cannon;    // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortAthenaSKPushCannon*                K2Node_DynamicCast_AsFort_Athena_SKPush_Cannon_1;  // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue_1;         // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue_1;       // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue_2;       // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue_3;       // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_MountedCannonAthena_C_ExecuteUbergraph_B_MountedCannonAthena) == 0x000008, "Wrong alignment on B_MountedCannonAthena_C_ExecuteUbergraph_B_MountedCannonAthena");
static_assert(sizeof(B_MountedCannonAthena_C_ExecuteUbergraph_B_MountedCannonAthena) == 0x000098, "Wrong size on B_MountedCannonAthena_C_ExecuteUbergraph_B_MountedCannonAthena");
static_assert(offsetof(B_MountedCannonAthena_C_ExecuteUbergraph_B_MountedCannonAthena, EntryPoint) == 0x000000, "Member 'B_MountedCannonAthena_C_ExecuteUbergraph_B_MountedCannonAthena::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_MountedCannonAthena_C_ExecuteUbergraph_B_MountedCannonAthena, K2Node_Event_bPersistentFire) == 0x000004, "Member 'B_MountedCannonAthena_C_ExecuteUbergraph_B_MountedCannonAthena::K2Node_Event_bPersistentFire' has a wrong offset!");
static_assert(offsetof(B_MountedCannonAthena_C_ExecuteUbergraph_B_MountedCannonAthena, K2Node_Event_bSecondaryFire) == 0x000005, "Member 'B_MountedCannonAthena_C_ExecuteUbergraph_B_MountedCannonAthena::K2Node_Event_bSecondaryFire' has a wrong offset!");
static_assert(offsetof(B_MountedCannonAthena_C_ExecuteUbergraph_B_MountedCannonAthena, CallFunc_IsValid_ReturnValue) == 0x000006, "Member 'B_MountedCannonAthena_C_ExecuteUbergraph_B_MountedCannonAthena::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_MountedCannonAthena_C_ExecuteUbergraph_B_MountedCannonAthena, CallFunc_GetInstigator_ReturnValue) == 0x000008, "Member 'B_MountedCannonAthena_C_ExecuteUbergraph_B_MountedCannonAthena::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_MountedCannonAthena_C_ExecuteUbergraph_B_MountedCannonAthena, CallFunc_GetInstigator_ReturnValue_1) == 0x000010, "Member 'B_MountedCannonAthena_C_ExecuteUbergraph_B_MountedCannonAthena::CallFunc_GetInstigator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_MountedCannonAthena_C_ExecuteUbergraph_B_MountedCannonAthena, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000018, "Member 'B_MountedCannonAthena_C_ExecuteUbergraph_B_MountedCannonAthena::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(B_MountedCannonAthena_C_ExecuteUbergraph_B_MountedCannonAthena, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'B_MountedCannonAthena_C_ExecuteUbergraph_B_MountedCannonAthena::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_MountedCannonAthena_C_ExecuteUbergraph_B_MountedCannonAthena, K2Node_DynamicCast_AsFort_Player_Pawn_1) == 0x000028, "Member 'B_MountedCannonAthena_C_ExecuteUbergraph_B_MountedCannonAthena::K2Node_DynamicCast_AsFort_Player_Pawn_1' has a wrong offset!");
static_assert(offsetof(B_MountedCannonAthena_C_ExecuteUbergraph_B_MountedCannonAthena, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'B_MountedCannonAthena_C_ExecuteUbergraph_B_MountedCannonAthena::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(B_MountedCannonAthena_C_ExecuteUbergraph_B_MountedCannonAthena, CallFunc_GetVehicleActor_ReturnValue) == 0x000038, "Member 'B_MountedCannonAthena_C_ExecuteUbergraph_B_MountedCannonAthena::CallFunc_GetVehicleActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_MountedCannonAthena_C_ExecuteUbergraph_B_MountedCannonAthena, CallFunc_GetVehicleActor_ReturnValue_1) == 0x000040, "Member 'B_MountedCannonAthena_C_ExecuteUbergraph_B_MountedCannonAthena::CallFunc_GetVehicleActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_MountedCannonAthena_C_ExecuteUbergraph_B_MountedCannonAthena, K2Node_DynamicCast_AsFort_Athena_SKPush_Cannon) == 0x000048, "Member 'B_MountedCannonAthena_C_ExecuteUbergraph_B_MountedCannonAthena::K2Node_DynamicCast_AsFort_Athena_SKPush_Cannon' has a wrong offset!");
static_assert(offsetof(B_MountedCannonAthena_C_ExecuteUbergraph_B_MountedCannonAthena, K2Node_DynamicCast_bSuccess_2) == 0x000050, "Member 'B_MountedCannonAthena_C_ExecuteUbergraph_B_MountedCannonAthena::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(B_MountedCannonAthena_C_ExecuteUbergraph_B_MountedCannonAthena, K2Node_DynamicCast_AsFort_Athena_SKPush_Cannon_1) == 0x000058, "Member 'B_MountedCannonAthena_C_ExecuteUbergraph_B_MountedCannonAthena::K2Node_DynamicCast_AsFort_Athena_SKPush_Cannon_1' has a wrong offset!");
static_assert(offsetof(B_MountedCannonAthena_C_ExecuteUbergraph_B_MountedCannonAthena, K2Node_DynamicCast_bSuccess_3) == 0x000060, "Member 'B_MountedCannonAthena_C_ExecuteUbergraph_B_MountedCannonAthena::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(B_MountedCannonAthena_C_ExecuteUbergraph_B_MountedCannonAthena, CallFunc_SpawnSoundAttached_ReturnValue) == 0x000068, "Member 'B_MountedCannonAthena_C_ExecuteUbergraph_B_MountedCannonAthena::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_MountedCannonAthena_C_ExecuteUbergraph_B_MountedCannonAthena, CallFunc_SpawnSoundAttached_ReturnValue_1) == 0x000070, "Member 'B_MountedCannonAthena_C_ExecuteUbergraph_B_MountedCannonAthena::CallFunc_SpawnSoundAttached_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_MountedCannonAthena_C_ExecuteUbergraph_B_MountedCannonAthena, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x000078, "Member 'B_MountedCannonAthena_C_ExecuteUbergraph_B_MountedCannonAthena::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_MountedCannonAthena_C_ExecuteUbergraph_B_MountedCannonAthena, CallFunc_SpawnEmitterAttached_ReturnValue_1) == 0x000080, "Member 'B_MountedCannonAthena_C_ExecuteUbergraph_B_MountedCannonAthena::CallFunc_SpawnEmitterAttached_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_MountedCannonAthena_C_ExecuteUbergraph_B_MountedCannonAthena, CallFunc_SpawnEmitterAttached_ReturnValue_2) == 0x000088, "Member 'B_MountedCannonAthena_C_ExecuteUbergraph_B_MountedCannonAthena::CallFunc_SpawnEmitterAttached_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_MountedCannonAthena_C_ExecuteUbergraph_B_MountedCannonAthena, CallFunc_SpawnEmitterAttached_ReturnValue_3) == 0x000090, "Member 'B_MountedCannonAthena_C_ExecuteUbergraph_B_MountedCannonAthena::CallFunc_SpawnEmitterAttached_ReturnValue_3' has a wrong offset!");

// Function B_MountedCannonAthena.B_MountedCannonAthena_C.OnPlayWeaponFireFX
// 0x0002 (0x0002 - 0x0000)
struct B_MountedCannonAthena_C_OnPlayWeaponFireFX final
{
public:
	bool                                          bPersistentFire;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bSecondaryFire;                                    // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_MountedCannonAthena_C_OnPlayWeaponFireFX) == 0x000001, "Wrong alignment on B_MountedCannonAthena_C_OnPlayWeaponFireFX");
static_assert(sizeof(B_MountedCannonAthena_C_OnPlayWeaponFireFX) == 0x000002, "Wrong size on B_MountedCannonAthena_C_OnPlayWeaponFireFX");
static_assert(offsetof(B_MountedCannonAthena_C_OnPlayWeaponFireFX, bPersistentFire) == 0x000000, "Member 'B_MountedCannonAthena_C_OnPlayWeaponFireFX::bPersistentFire' has a wrong offset!");
static_assert(offsetof(B_MountedCannonAthena_C_OnPlayWeaponFireFX, bSecondaryFire) == 0x000001, "Member 'B_MountedCannonAthena_C_OnPlayWeaponFireFX::bSecondaryFire' has a wrong offset!");

}

