#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Pistol_Flashlight

#include "Basic.hpp"


namespace SDK::Params
{

// Function B_Pistol_Flashlight.B_Pistol_Flashlight_C.ExecuteUbergraph_B_Pistol_Flashlight
// 0x0020 (0x0020 - 0x0000)
struct B_Pistol_Flashlight_C_ExecuteUbergraph_B_Pistol_Flashlight final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Pistol_Flashlight_C_ExecuteUbergraph_B_Pistol_Flashlight) == 0x000008, "Wrong alignment on B_Pistol_Flashlight_C_ExecuteUbergraph_B_Pistol_Flashlight");
static_assert(sizeof(B_Pistol_Flashlight_C_ExecuteUbergraph_B_Pistol_Flashlight) == 0x000020, "Wrong size on B_Pistol_Flashlight_C_ExecuteUbergraph_B_Pistol_Flashlight");
static_assert(offsetof(B_Pistol_Flashlight_C_ExecuteUbergraph_B_Pistol_Flashlight, EntryPoint) == 0x000000, "Member 'B_Pistol_Flashlight_C_ExecuteUbergraph_B_Pistol_Flashlight::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_Pistol_Flashlight_C_ExecuteUbergraph_B_Pistol_Flashlight, CallFunc_GetInstigator_ReturnValue) == 0x000008, "Member 'B_Pistol_Flashlight_C_ExecuteUbergraph_B_Pistol_Flashlight::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pistol_Flashlight_C_ExecuteUbergraph_B_Pistol_Flashlight, CallFunc_IsLocallyControlled_ReturnValue) == 0x000010, "Member 'B_Pistol_Flashlight_C_ExecuteUbergraph_B_Pistol_Flashlight::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pistol_Flashlight_C_ExecuteUbergraph_B_Pistol_Flashlight, CallFunc_SpawnSoundAttached_ReturnValue) == 0x000018, "Member 'B_Pistol_Flashlight_C_ExecuteUbergraph_B_Pistol_Flashlight::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");

}

