#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Prj_Athena_JollyRascal

#include "Basic.hpp"

#include "B_Prj_ThrownConsumable_classes.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Prj_Athena_JollyRascal.B_Prj_Athena_JollyRascal_C
// 0x0028 (0x0830 - 0x0808)
class AB_Prj_Athena_JollyRascal_C final : public AB_Prj_ThrownConsumable_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_B_Prj_Athena_JollyRascal_C;         // 0x0808(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FVector                                TraceOffset;                                       // 0x0810(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LifeAfterHide;                                     // 0x081C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpawnOffset;                                       // 0x0820(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TraceOverlapRadius;                                // 0x082C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_B_Prj_Athena_JollyRascal(int32 EntryPoint);
	void FXandSounds(const struct FVector& Location);
	void HideAndKill();
	void ReceiveHit(class UPrimitiveComponent* MyComp, class AActor* Other, class UPrimitiveComponent* OtherComp, bool bSelfMoved, const struct FVector& HitLocation, const struct FVector& HitNormal, const struct FVector& NormalImpulse, const struct FHitResult& Hit);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Prj_Athena_JollyRascal_C">();
	}
	static class AB_Prj_Athena_JollyRascal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Prj_Athena_JollyRascal_C>();
	}
};
static_assert(alignof(AB_Prj_Athena_JollyRascal_C) == 0x000008, "Wrong alignment on AB_Prj_Athena_JollyRascal_C");
static_assert(sizeof(AB_Prj_Athena_JollyRascal_C) == 0x000830, "Wrong size on AB_Prj_Athena_JollyRascal_C");
static_assert(offsetof(AB_Prj_Athena_JollyRascal_C, UberGraphFrame_B_Prj_Athena_JollyRascal_C) == 0x000808, "Member 'AB_Prj_Athena_JollyRascal_C::UberGraphFrame_B_Prj_Athena_JollyRascal_C' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_JollyRascal_C, TraceOffset) == 0x000810, "Member 'AB_Prj_Athena_JollyRascal_C::TraceOffset' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_JollyRascal_C, LifeAfterHide) == 0x00081C, "Member 'AB_Prj_Athena_JollyRascal_C::LifeAfterHide' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_JollyRascal_C, SpawnOffset) == 0x000820, "Member 'AB_Prj_Athena_JollyRascal_C::SpawnOffset' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_JollyRascal_C, TraceOverlapRadius) == 0x00082C, "Member 'AB_Prj_Athena_JollyRascal_C::TraceOverlapRadius' has a wrong offset!");

}

