#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Prj_Ranged_Rocket_Athena

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Prj_Ranged_Rocket_Athena.B_Prj_Ranged_Rocket_Athena_C
// 0x0140 (0x08B8 - 0x0778)
class AB_Prj_Ranged_Rocket_Athena_C final : public AFortProjectileBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0778(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_SurfaceTypeSoundComponent_C*        BP_SurfaceTypeSoundComponent;                      // 0x0780(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Rocket_AudioComponent;                             // 0x0788(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Mesh;                                              // 0x0790(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CollisionMesh;                                     // 0x0798(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPostProcessComponent*                  PP_Explode;                                        // 0x07A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         PPFader_PPFade_6840155342A20C80B8C71EB25DE77BD9;   // 0x07A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            PPFader__Direction_6840155342A20C80B8C71EB25DE77BD9; // 0x07AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7AD[0x3];                                      // 0x07AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     PPFader;                                           // 0x07B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Ribbon_Trail_PSC;                                  // 0x07B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Water_Explosion_PSC;                               // 0x07C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        Ribbon_Trail_PS;                                   // 0x07C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        Water_Explosion_PS;                                // 0x07D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        Explosion_Generic_PS;                              // 0x07D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Explosion_Generic_PSC;                             // 0x07E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Rocket_Projectile_Explosion_Sound;                 // 0x07E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                StopLocation;                                      // 0x07F0(0x000C)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7FC[0x4];                                      // 0x07FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      ObjectsToTraceAgainst;                             // 0x0800(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class UParticleSystem*                        Explosion_Flesh_Damage_PS;                         // 0x0810(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               StopRotZ;                                          // 0x0818(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         TrailLifetime;                                     // 0x0824(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Explosion_Flesh_Damage_PSC;                        // 0x0828(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Rocket_Projectile_Explosion_Water_Sound;           // 0x0830(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Rocket_Projectile_InAir_Sound;                     // 0x0838(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               RocketTrailPS;                                     // 0x0840(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Tick_Delta;                                        // 0x0848(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RocketSpinRate;                                    // 0x084C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Explosion_Impact_Offset;                           // 0x0850(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               RocketSpin;                                        // 0x0854(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FVector                                RocketScale;                                       // 0x0860(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TimerMaxReached_;                                  // 0x086C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_86D[0x3];                                      // 0x086D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Ground_Decal;                                      // 0x0870(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Ground_Decal_MID;                                  // 0x0878(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Decal_Size_Max;                                    // 0x0880(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Decal_Size_Min;                                    // 0x0884(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                DecalLocation;                                     // 0x0888(0x000C)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_894[0x4];                                      // 0x0894(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        Rocket_Trail_Template;                             // 0x0898(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPhysicalSurface                              SurfaceType;                                       // 0x08A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A1[0x7];                                      // 0x08A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               Explosion_PS;                                      // 0x08A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           FeedbackCue;                                       // 0x08B0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_B_Prj_Ranged_Rocket_Athena(int32 EntryPoint);
	void OnTouched(class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FHitResult& HitResult, bool bIsOverlap);
	void ReceiveDestroyed();
	void ReceiveTick(float DeltaSeconds);
	void OnExploded(const TArray<class AActor*>& HitActors, const TArray<struct FHitResult>& HitResults);
	void FuseTimerMax();
	void OnBounce(const struct FHitResult& Hit);
	void OnStop(const struct FHitResult& Hit);
	void PPFader__FinishedFunc();
	void PPFader__UpdateFunc();
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Prj_Ranged_Rocket_Athena_C">();
	}
	static class AB_Prj_Ranged_Rocket_Athena_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Prj_Ranged_Rocket_Athena_C>();
	}
};
static_assert(alignof(AB_Prj_Ranged_Rocket_Athena_C) == 0x000008, "Wrong alignment on AB_Prj_Ranged_Rocket_Athena_C");
static_assert(sizeof(AB_Prj_Ranged_Rocket_Athena_C) == 0x0008B8, "Wrong size on AB_Prj_Ranged_Rocket_Athena_C");
static_assert(offsetof(AB_Prj_Ranged_Rocket_Athena_C, UberGraphFrame) == 0x000778, "Member 'AB_Prj_Ranged_Rocket_Athena_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Rocket_Athena_C, BP_SurfaceTypeSoundComponent) == 0x000780, "Member 'AB_Prj_Ranged_Rocket_Athena_C::BP_SurfaceTypeSoundComponent' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Rocket_Athena_C, Rocket_AudioComponent) == 0x000788, "Member 'AB_Prj_Ranged_Rocket_Athena_C::Rocket_AudioComponent' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Rocket_Athena_C, Mesh) == 0x000790, "Member 'AB_Prj_Ranged_Rocket_Athena_C::Mesh' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Rocket_Athena_C, CollisionMesh) == 0x000798, "Member 'AB_Prj_Ranged_Rocket_Athena_C::CollisionMesh' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Rocket_Athena_C, PP_Explode) == 0x0007A0, "Member 'AB_Prj_Ranged_Rocket_Athena_C::PP_Explode' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Rocket_Athena_C, PPFader_PPFade_6840155342A20C80B8C71EB25DE77BD9) == 0x0007A8, "Member 'AB_Prj_Ranged_Rocket_Athena_C::PPFader_PPFade_6840155342A20C80B8C71EB25DE77BD9' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Rocket_Athena_C, PPFader__Direction_6840155342A20C80B8C71EB25DE77BD9) == 0x0007AC, "Member 'AB_Prj_Ranged_Rocket_Athena_C::PPFader__Direction_6840155342A20C80B8C71EB25DE77BD9' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Rocket_Athena_C, PPFader) == 0x0007B0, "Member 'AB_Prj_Ranged_Rocket_Athena_C::PPFader' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Rocket_Athena_C, Ribbon_Trail_PSC) == 0x0007B8, "Member 'AB_Prj_Ranged_Rocket_Athena_C::Ribbon_Trail_PSC' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Rocket_Athena_C, Water_Explosion_PSC) == 0x0007C0, "Member 'AB_Prj_Ranged_Rocket_Athena_C::Water_Explosion_PSC' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Rocket_Athena_C, Ribbon_Trail_PS) == 0x0007C8, "Member 'AB_Prj_Ranged_Rocket_Athena_C::Ribbon_Trail_PS' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Rocket_Athena_C, Water_Explosion_PS) == 0x0007D0, "Member 'AB_Prj_Ranged_Rocket_Athena_C::Water_Explosion_PS' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Rocket_Athena_C, Explosion_Generic_PS) == 0x0007D8, "Member 'AB_Prj_Ranged_Rocket_Athena_C::Explosion_Generic_PS' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Rocket_Athena_C, Explosion_Generic_PSC) == 0x0007E0, "Member 'AB_Prj_Ranged_Rocket_Athena_C::Explosion_Generic_PSC' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Rocket_Athena_C, Rocket_Projectile_Explosion_Sound) == 0x0007E8, "Member 'AB_Prj_Ranged_Rocket_Athena_C::Rocket_Projectile_Explosion_Sound' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Rocket_Athena_C, StopLocation) == 0x0007F0, "Member 'AB_Prj_Ranged_Rocket_Athena_C::StopLocation' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Rocket_Athena_C, ObjectsToTraceAgainst) == 0x000800, "Member 'AB_Prj_Ranged_Rocket_Athena_C::ObjectsToTraceAgainst' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Rocket_Athena_C, Explosion_Flesh_Damage_PS) == 0x000810, "Member 'AB_Prj_Ranged_Rocket_Athena_C::Explosion_Flesh_Damage_PS' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Rocket_Athena_C, StopRotZ) == 0x000818, "Member 'AB_Prj_Ranged_Rocket_Athena_C::StopRotZ' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Rocket_Athena_C, TrailLifetime) == 0x000824, "Member 'AB_Prj_Ranged_Rocket_Athena_C::TrailLifetime' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Rocket_Athena_C, Explosion_Flesh_Damage_PSC) == 0x000828, "Member 'AB_Prj_Ranged_Rocket_Athena_C::Explosion_Flesh_Damage_PSC' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Rocket_Athena_C, Rocket_Projectile_Explosion_Water_Sound) == 0x000830, "Member 'AB_Prj_Ranged_Rocket_Athena_C::Rocket_Projectile_Explosion_Water_Sound' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Rocket_Athena_C, Rocket_Projectile_InAir_Sound) == 0x000838, "Member 'AB_Prj_Ranged_Rocket_Athena_C::Rocket_Projectile_InAir_Sound' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Rocket_Athena_C, RocketTrailPS) == 0x000840, "Member 'AB_Prj_Ranged_Rocket_Athena_C::RocketTrailPS' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Rocket_Athena_C, Tick_Delta) == 0x000848, "Member 'AB_Prj_Ranged_Rocket_Athena_C::Tick_Delta' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Rocket_Athena_C, RocketSpinRate) == 0x00084C, "Member 'AB_Prj_Ranged_Rocket_Athena_C::RocketSpinRate' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Rocket_Athena_C, Explosion_Impact_Offset) == 0x000850, "Member 'AB_Prj_Ranged_Rocket_Athena_C::Explosion_Impact_Offset' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Rocket_Athena_C, RocketSpin) == 0x000854, "Member 'AB_Prj_Ranged_Rocket_Athena_C::RocketSpin' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Rocket_Athena_C, RocketScale) == 0x000860, "Member 'AB_Prj_Ranged_Rocket_Athena_C::RocketScale' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Rocket_Athena_C, TimerMaxReached_) == 0x00086C, "Member 'AB_Prj_Ranged_Rocket_Athena_C::TimerMaxReached_' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Rocket_Athena_C, Ground_Decal) == 0x000870, "Member 'AB_Prj_Ranged_Rocket_Athena_C::Ground_Decal' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Rocket_Athena_C, Ground_Decal_MID) == 0x000878, "Member 'AB_Prj_Ranged_Rocket_Athena_C::Ground_Decal_MID' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Rocket_Athena_C, Decal_Size_Max) == 0x000880, "Member 'AB_Prj_Ranged_Rocket_Athena_C::Decal_Size_Max' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Rocket_Athena_C, Decal_Size_Min) == 0x000884, "Member 'AB_Prj_Ranged_Rocket_Athena_C::Decal_Size_Min' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Rocket_Athena_C, DecalLocation) == 0x000888, "Member 'AB_Prj_Ranged_Rocket_Athena_C::DecalLocation' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Rocket_Athena_C, Rocket_Trail_Template) == 0x000898, "Member 'AB_Prj_Ranged_Rocket_Athena_C::Rocket_Trail_Template' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Rocket_Athena_C, SurfaceType) == 0x0008A0, "Member 'AB_Prj_Ranged_Rocket_Athena_C::SurfaceType' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Rocket_Athena_C, Explosion_PS) == 0x0008A8, "Member 'AB_Prj_Ranged_Rocket_Athena_C::Explosion_PS' has a wrong offset!");
static_assert(offsetof(AB_Prj_Ranged_Rocket_Athena_C, FeedbackCue) == 0x0008B0, "Member 'AB_Prj_Ranged_Rocket_Athena_C::FeedbackCue' has a wrong offset!");

}

