#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Prj_Bullet_SuppressedAutoSniper

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function B_Prj_Bullet_SuppressedAutoSniper.B_Prj_Bullet_SuppressedAutoSniper_C.ExecuteUbergraph_B_Prj_Bullet_SuppressedAutoSniper
// 0x0178 (0x0178 - 0x0000)
struct B_Prj_Bullet_SuppressedAutoSniper_C_ExecuteUbergraph_B_Prj_Bullet_SuppressedAutoSniper final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMobilePlatform_ReturnValue;             // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             K2Node_Event_Hit;                                  // 0x0008(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9E[0x2];                                       // 0x009E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x00A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x00B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x00C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x00CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0100(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x010C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn;                    // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x3];                                      // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0124(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x0130(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             K2Node_Select_Default;                             // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        CallFunc_SpawnDecalAtLocation_ReturnValue;         // 0x0148(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_161[0x3];                                      // 0x0161(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetMuzzleLocation_ReturnValue;            // 0x0168(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Prj_Bullet_SuppressedAutoSniper_C_ExecuteUbergraph_B_Prj_Bullet_SuppressedAutoSniper) == 0x000008, "Wrong alignment on B_Prj_Bullet_SuppressedAutoSniper_C_ExecuteUbergraph_B_Prj_Bullet_SuppressedAutoSniper");
static_assert(sizeof(B_Prj_Bullet_SuppressedAutoSniper_C_ExecuteUbergraph_B_Prj_Bullet_SuppressedAutoSniper) == 0x000178, "Wrong size on B_Prj_Bullet_SuppressedAutoSniper_C_ExecuteUbergraph_B_Prj_Bullet_SuppressedAutoSniper");
static_assert(offsetof(B_Prj_Bullet_SuppressedAutoSniper_C_ExecuteUbergraph_B_Prj_Bullet_SuppressedAutoSniper, EntryPoint) == 0x000000, "Member 'B_Prj_Bullet_SuppressedAutoSniper_C_ExecuteUbergraph_B_Prj_Bullet_SuppressedAutoSniper::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_Prj_Bullet_SuppressedAutoSniper_C_ExecuteUbergraph_B_Prj_Bullet_SuppressedAutoSniper, Temp_bool_Variable) == 0x000004, "Member 'B_Prj_Bullet_SuppressedAutoSniper_C_ExecuteUbergraph_B_Prj_Bullet_SuppressedAutoSniper::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(B_Prj_Bullet_SuppressedAutoSniper_C_ExecuteUbergraph_B_Prj_Bullet_SuppressedAutoSniper, CallFunc_IsDedicatedServer_ReturnValue) == 0x000005, "Member 'B_Prj_Bullet_SuppressedAutoSniper_C_ExecuteUbergraph_B_Prj_Bullet_SuppressedAutoSniper::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Bullet_SuppressedAutoSniper_C_ExecuteUbergraph_B_Prj_Bullet_SuppressedAutoSniper, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x000006, "Member 'B_Prj_Bullet_SuppressedAutoSniper_C_ExecuteUbergraph_B_Prj_Bullet_SuppressedAutoSniper::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Bullet_SuppressedAutoSniper_C_ExecuteUbergraph_B_Prj_Bullet_SuppressedAutoSniper, CallFunc_IsMobilePlatform_ReturnValue) == 0x000007, "Member 'B_Prj_Bullet_SuppressedAutoSniper_C_ExecuteUbergraph_B_Prj_Bullet_SuppressedAutoSniper::CallFunc_IsMobilePlatform_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Bullet_SuppressedAutoSniper_C_ExecuteUbergraph_B_Prj_Bullet_SuppressedAutoSniper, K2Node_Event_Hit) == 0x000008, "Member 'B_Prj_Bullet_SuppressedAutoSniper_C_ExecuteUbergraph_B_Prj_Bullet_SuppressedAutoSniper::K2Node_Event_Hit' has a wrong offset!");
static_assert(offsetof(B_Prj_Bullet_SuppressedAutoSniper_C_ExecuteUbergraph_B_Prj_Bullet_SuppressedAutoSniper, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000090, "Member 'B_Prj_Bullet_SuppressedAutoSniper_C_ExecuteUbergraph_B_Prj_Bullet_SuppressedAutoSniper::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Bullet_SuppressedAutoSniper_C_ExecuteUbergraph_B_Prj_Bullet_SuppressedAutoSniper, CallFunc_BreakHitResult_bBlockingHit) == 0x00009C, "Member 'B_Prj_Bullet_SuppressedAutoSniper_C_ExecuteUbergraph_B_Prj_Bullet_SuppressedAutoSniper::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(B_Prj_Bullet_SuppressedAutoSniper_C_ExecuteUbergraph_B_Prj_Bullet_SuppressedAutoSniper, CallFunc_BreakHitResult_bInitialOverlap) == 0x00009D, "Member 'B_Prj_Bullet_SuppressedAutoSniper_C_ExecuteUbergraph_B_Prj_Bullet_SuppressedAutoSniper::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(B_Prj_Bullet_SuppressedAutoSniper_C_ExecuteUbergraph_B_Prj_Bullet_SuppressedAutoSniper, CallFunc_BreakHitResult_Time) == 0x0000A0, "Member 'B_Prj_Bullet_SuppressedAutoSniper_C_ExecuteUbergraph_B_Prj_Bullet_SuppressedAutoSniper::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(B_Prj_Bullet_SuppressedAutoSniper_C_ExecuteUbergraph_B_Prj_Bullet_SuppressedAutoSniper, CallFunc_BreakHitResult_Distance) == 0x0000A4, "Member 'B_Prj_Bullet_SuppressedAutoSniper_C_ExecuteUbergraph_B_Prj_Bullet_SuppressedAutoSniper::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(B_Prj_Bullet_SuppressedAutoSniper_C_ExecuteUbergraph_B_Prj_Bullet_SuppressedAutoSniper, CallFunc_BreakHitResult_Location) == 0x0000A8, "Member 'B_Prj_Bullet_SuppressedAutoSniper_C_ExecuteUbergraph_B_Prj_Bullet_SuppressedAutoSniper::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(B_Prj_Bullet_SuppressedAutoSniper_C_ExecuteUbergraph_B_Prj_Bullet_SuppressedAutoSniper, CallFunc_BreakHitResult_ImpactPoint) == 0x0000B4, "Member 'B_Prj_Bullet_SuppressedAutoSniper_C_ExecuteUbergraph_B_Prj_Bullet_SuppressedAutoSniper::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(B_Prj_Bullet_SuppressedAutoSniper_C_ExecuteUbergraph_B_Prj_Bullet_SuppressedAutoSniper, CallFunc_BreakHitResult_Normal) == 0x0000C0, "Member 'B_Prj_Bullet_SuppressedAutoSniper_C_ExecuteUbergraph_B_Prj_Bullet_SuppressedAutoSniper::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(B_Prj_Bullet_SuppressedAutoSniper_C_ExecuteUbergraph_B_Prj_Bullet_SuppressedAutoSniper, CallFunc_BreakHitResult_ImpactNormal) == 0x0000CC, "Member 'B_Prj_Bullet_SuppressedAutoSniper_C_ExecuteUbergraph_B_Prj_Bullet_SuppressedAutoSniper::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(B_Prj_Bullet_SuppressedAutoSniper_C_ExecuteUbergraph_B_Prj_Bullet_SuppressedAutoSniper, CallFunc_BreakHitResult_PhysMat) == 0x0000D8, "Member 'B_Prj_Bullet_SuppressedAutoSniper_C_ExecuteUbergraph_B_Prj_Bullet_SuppressedAutoSniper::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(B_Prj_Bullet_SuppressedAutoSniper_C_ExecuteUbergraph_B_Prj_Bullet_SuppressedAutoSniper, CallFunc_BreakHitResult_HitActor) == 0x0000E0, "Member 'B_Prj_Bullet_SuppressedAutoSniper_C_ExecuteUbergraph_B_Prj_Bullet_SuppressedAutoSniper::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(B_Prj_Bullet_SuppressedAutoSniper_C_ExecuteUbergraph_B_Prj_Bullet_SuppressedAutoSniper, CallFunc_BreakHitResult_HitComponent) == 0x0000E8, "Member 'B_Prj_Bullet_SuppressedAutoSniper_C_ExecuteUbergraph_B_Prj_Bullet_SuppressedAutoSniper::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(B_Prj_Bullet_SuppressedAutoSniper_C_ExecuteUbergraph_B_Prj_Bullet_SuppressedAutoSniper, CallFunc_BreakHitResult_HitBoneName) == 0x0000F0, "Member 'B_Prj_Bullet_SuppressedAutoSniper_C_ExecuteUbergraph_B_Prj_Bullet_SuppressedAutoSniper::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(B_Prj_Bullet_SuppressedAutoSniper_C_ExecuteUbergraph_B_Prj_Bullet_SuppressedAutoSniper, CallFunc_BreakHitResult_HitItem) == 0x0000F8, "Member 'B_Prj_Bullet_SuppressedAutoSniper_C_ExecuteUbergraph_B_Prj_Bullet_SuppressedAutoSniper::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(B_Prj_Bullet_SuppressedAutoSniper_C_ExecuteUbergraph_B_Prj_Bullet_SuppressedAutoSniper, CallFunc_BreakHitResult_FaceIndex) == 0x0000FC, "Member 'B_Prj_Bullet_SuppressedAutoSniper_C_ExecuteUbergraph_B_Prj_Bullet_SuppressedAutoSniper::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(B_Prj_Bullet_SuppressedAutoSniper_C_ExecuteUbergraph_B_Prj_Bullet_SuppressedAutoSniper, CallFunc_BreakHitResult_TraceStart) == 0x000100, "Member 'B_Prj_Bullet_SuppressedAutoSniper_C_ExecuteUbergraph_B_Prj_Bullet_SuppressedAutoSniper::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(B_Prj_Bullet_SuppressedAutoSniper_C_ExecuteUbergraph_B_Prj_Bullet_SuppressedAutoSniper, CallFunc_BreakHitResult_TraceEnd) == 0x00010C, "Member 'B_Prj_Bullet_SuppressedAutoSniper_C_ExecuteUbergraph_B_Prj_Bullet_SuppressedAutoSniper::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(B_Prj_Bullet_SuppressedAutoSniper_C_ExecuteUbergraph_B_Prj_Bullet_SuppressedAutoSniper, K2Node_DynamicCast_AsFort_Pawn) == 0x000118, "Member 'B_Prj_Bullet_SuppressedAutoSniper_C_ExecuteUbergraph_B_Prj_Bullet_SuppressedAutoSniper::K2Node_DynamicCast_AsFort_Pawn' has a wrong offset!");
static_assert(offsetof(B_Prj_Bullet_SuppressedAutoSniper_C_ExecuteUbergraph_B_Prj_Bullet_SuppressedAutoSniper, K2Node_DynamicCast_bSuccess) == 0x000120, "Member 'B_Prj_Bullet_SuppressedAutoSniper_C_ExecuteUbergraph_B_Prj_Bullet_SuppressedAutoSniper::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_Prj_Bullet_SuppressedAutoSniper_C_ExecuteUbergraph_B_Prj_Bullet_SuppressedAutoSniper, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000124, "Member 'B_Prj_Bullet_SuppressedAutoSniper_C_ExecuteUbergraph_B_Prj_Bullet_SuppressedAutoSniper::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Bullet_SuppressedAutoSniper_C_ExecuteUbergraph_B_Prj_Bullet_SuppressedAutoSniper, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x000130, "Member 'B_Prj_Bullet_SuppressedAutoSniper_C_ExecuteUbergraph_B_Prj_Bullet_SuppressedAutoSniper::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Bullet_SuppressedAutoSniper_C_ExecuteUbergraph_B_Prj_Bullet_SuppressedAutoSniper, K2Node_Select_Default) == 0x000140, "Member 'B_Prj_Bullet_SuppressedAutoSniper_C_ExecuteUbergraph_B_Prj_Bullet_SuppressedAutoSniper::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(B_Prj_Bullet_SuppressedAutoSniper_C_ExecuteUbergraph_B_Prj_Bullet_SuppressedAutoSniper, CallFunc_SpawnDecalAtLocation_ReturnValue) == 0x000148, "Member 'B_Prj_Bullet_SuppressedAutoSniper_C_ExecuteUbergraph_B_Prj_Bullet_SuppressedAutoSniper::CallFunc_SpawnDecalAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Bullet_SuppressedAutoSniper_C_ExecuteUbergraph_B_Prj_Bullet_SuppressedAutoSniper, CallFunc_BooleanOR_ReturnValue) == 0x000150, "Member 'B_Prj_Bullet_SuppressedAutoSniper_C_ExecuteUbergraph_B_Prj_Bullet_SuppressedAutoSniper::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Bullet_SuppressedAutoSniper_C_ExecuteUbergraph_B_Prj_Bullet_SuppressedAutoSniper, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000158, "Member 'B_Prj_Bullet_SuppressedAutoSniper_C_ExecuteUbergraph_B_Prj_Bullet_SuppressedAutoSniper::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(B_Prj_Bullet_SuppressedAutoSniper_C_ExecuteUbergraph_B_Prj_Bullet_SuppressedAutoSniper, K2Node_DynamicCast_bSuccess_1) == 0x000160, "Member 'B_Prj_Bullet_SuppressedAutoSniper_C_ExecuteUbergraph_B_Prj_Bullet_SuppressedAutoSniper::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Bullet_SuppressedAutoSniper_C_ExecuteUbergraph_B_Prj_Bullet_SuppressedAutoSniper, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x000164, "Member 'B_Prj_Bullet_SuppressedAutoSniper_C_ExecuteUbergraph_B_Prj_Bullet_SuppressedAutoSniper::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Bullet_SuppressedAutoSniper_C_ExecuteUbergraph_B_Prj_Bullet_SuppressedAutoSniper, CallFunc_GetMuzzleLocation_ReturnValue) == 0x000168, "Member 'B_Prj_Bullet_SuppressedAutoSniper_C_ExecuteUbergraph_B_Prj_Bullet_SuppressedAutoSniper::CallFunc_GetMuzzleLocation_ReturnValue' has a wrong offset!");

// Function B_Prj_Bullet_SuppressedAutoSniper.B_Prj_Bullet_SuppressedAutoSniper_C.OnStop
// 0x0088 (0x0088 - 0x0000)
struct B_Prj_Bullet_SuppressedAutoSniper_C_OnStop final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(B_Prj_Bullet_SuppressedAutoSniper_C_OnStop) == 0x000004, "Wrong alignment on B_Prj_Bullet_SuppressedAutoSniper_C_OnStop");
static_assert(sizeof(B_Prj_Bullet_SuppressedAutoSniper_C_OnStop) == 0x000088, "Wrong size on B_Prj_Bullet_SuppressedAutoSniper_C_OnStop");
static_assert(offsetof(B_Prj_Bullet_SuppressedAutoSniper_C_OnStop, Hit) == 0x000000, "Member 'B_Prj_Bullet_SuppressedAutoSniper_C_OnStop::Hit' has a wrong offset!");

// Function B_Prj_Bullet_SuppressedAutoSniper.B_Prj_Bullet_SuppressedAutoSniper_C.UserConstructionScript
// 0x0004 (0x0004 - 0x0000)
struct B_Prj_Bullet_SuppressedAutoSniper_C_UserConstructionScript final
{
public:
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Prj_Bullet_SuppressedAutoSniper_C_UserConstructionScript) == 0x000004, "Wrong alignment on B_Prj_Bullet_SuppressedAutoSniper_C_UserConstructionScript");
static_assert(sizeof(B_Prj_Bullet_SuppressedAutoSniper_C_UserConstructionScript) == 0x000004, "Wrong size on B_Prj_Bullet_SuppressedAutoSniper_C_UserConstructionScript");
static_assert(offsetof(B_Prj_Bullet_SuppressedAutoSniper_C_UserConstructionScript, CallFunc_GetValueAtLevel_ReturnValue) == 0x000000, "Member 'B_Prj_Bullet_SuppressedAutoSniper_C_UserConstructionScript::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");

}

