#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Prj_Athena_SuperBridgeGrenade

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function B_Prj_Athena_SuperBridgeGrenade.B_Prj_Athena_SuperBridgeGrenade_C.ExecuteUbergraph_B_Prj_Athena_SuperBridgeGrenade
// 0x0004 (0x0004 - 0x0000)
struct B_Prj_Athena_SuperBridgeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SuperBridgeGrenade final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Prj_Athena_SuperBridgeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SuperBridgeGrenade) == 0x000004, "Wrong alignment on B_Prj_Athena_SuperBridgeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SuperBridgeGrenade");
static_assert(sizeof(B_Prj_Athena_SuperBridgeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SuperBridgeGrenade) == 0x000004, "Wrong size on B_Prj_Athena_SuperBridgeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SuperBridgeGrenade");
static_assert(offsetof(B_Prj_Athena_SuperBridgeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SuperBridgeGrenade, EntryPoint) == 0x000000, "Member 'B_Prj_Athena_SuperBridgeGrenade_C_ExecuteUbergraph_B_Prj_Athena_SuperBridgeGrenade::EntryPoint' has a wrong offset!");

// Function B_Prj_Athena_SuperBridgeGrenade.B_Prj_Athena_SuperBridgeGrenade_C.UserConstructionScript
// 0x0001 (0x0001 - 0x0000)
struct B_Prj_Athena_SuperBridgeGrenade_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Prj_Athena_SuperBridgeGrenade_C_UserConstructionScript) == 0x000001, "Wrong alignment on B_Prj_Athena_SuperBridgeGrenade_C_UserConstructionScript");
static_assert(sizeof(B_Prj_Athena_SuperBridgeGrenade_C_UserConstructionScript) == 0x000001, "Wrong size on B_Prj_Athena_SuperBridgeGrenade_C_UserConstructionScript");
static_assert(offsetof(B_Prj_Athena_SuperBridgeGrenade_C_UserConstructionScript, CallFunc_IsDedicatedServer_ReturnValue) == 0x000000, "Member 'B_Prj_Athena_SuperBridgeGrenade_C_UserConstructionScript::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");

// Function B_Prj_Athena_SuperBridgeGrenade.B_Prj_Athena_SuperBridgeGrenade_C.SetBaseDestination
// 0x0150 (0x0150 - 0x0000)
struct B_Prj_Athena_SuperBridgeGrenade_C_SetBaseDestination final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A[0x2];                                       // 0x008A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0094(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x00A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x00AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x00B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x00F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x00FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0108(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0114(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12D[0x3];                                      // 0x012D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GridSnap_Float_ReturnValue;               // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GridSnap_Float_ReturnValue_1;             // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GridSnap_Float_ReturnValue_2;             // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0144(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Prj_Athena_SuperBridgeGrenade_C_SetBaseDestination) == 0x000008, "Wrong alignment on B_Prj_Athena_SuperBridgeGrenade_C_SetBaseDestination");
static_assert(sizeof(B_Prj_Athena_SuperBridgeGrenade_C_SetBaseDestination) == 0x000150, "Wrong size on B_Prj_Athena_SuperBridgeGrenade_C_SetBaseDestination");
static_assert(offsetof(B_Prj_Athena_SuperBridgeGrenade_C_SetBaseDestination, Hit) == 0x000000, "Member 'B_Prj_Athena_SuperBridgeGrenade_C_SetBaseDestination::Hit' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SuperBridgeGrenade_C_SetBaseDestination, CallFunc_BreakHitResult_bBlockingHit) == 0x000088, "Member 'B_Prj_Athena_SuperBridgeGrenade_C_SetBaseDestination::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SuperBridgeGrenade_C_SetBaseDestination, CallFunc_BreakHitResult_bInitialOverlap) == 0x000089, "Member 'B_Prj_Athena_SuperBridgeGrenade_C_SetBaseDestination::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SuperBridgeGrenade_C_SetBaseDestination, CallFunc_BreakHitResult_Time) == 0x00008C, "Member 'B_Prj_Athena_SuperBridgeGrenade_C_SetBaseDestination::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SuperBridgeGrenade_C_SetBaseDestination, CallFunc_BreakHitResult_Distance) == 0x000090, "Member 'B_Prj_Athena_SuperBridgeGrenade_C_SetBaseDestination::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SuperBridgeGrenade_C_SetBaseDestination, CallFunc_BreakHitResult_Location) == 0x000094, "Member 'B_Prj_Athena_SuperBridgeGrenade_C_SetBaseDestination::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SuperBridgeGrenade_C_SetBaseDestination, CallFunc_BreakHitResult_ImpactPoint) == 0x0000A0, "Member 'B_Prj_Athena_SuperBridgeGrenade_C_SetBaseDestination::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SuperBridgeGrenade_C_SetBaseDestination, CallFunc_BreakHitResult_Normal) == 0x0000AC, "Member 'B_Prj_Athena_SuperBridgeGrenade_C_SetBaseDestination::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SuperBridgeGrenade_C_SetBaseDestination, CallFunc_BreakHitResult_ImpactNormal) == 0x0000B8, "Member 'B_Prj_Athena_SuperBridgeGrenade_C_SetBaseDestination::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SuperBridgeGrenade_C_SetBaseDestination, CallFunc_BreakHitResult_PhysMat) == 0x0000C8, "Member 'B_Prj_Athena_SuperBridgeGrenade_C_SetBaseDestination::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SuperBridgeGrenade_C_SetBaseDestination, CallFunc_BreakHitResult_HitActor) == 0x0000D0, "Member 'B_Prj_Athena_SuperBridgeGrenade_C_SetBaseDestination::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SuperBridgeGrenade_C_SetBaseDestination, CallFunc_BreakHitResult_HitComponent) == 0x0000D8, "Member 'B_Prj_Athena_SuperBridgeGrenade_C_SetBaseDestination::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SuperBridgeGrenade_C_SetBaseDestination, CallFunc_BreakHitResult_HitBoneName) == 0x0000E0, "Member 'B_Prj_Athena_SuperBridgeGrenade_C_SetBaseDestination::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SuperBridgeGrenade_C_SetBaseDestination, CallFunc_BreakHitResult_HitItem) == 0x0000E8, "Member 'B_Prj_Athena_SuperBridgeGrenade_C_SetBaseDestination::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SuperBridgeGrenade_C_SetBaseDestination, CallFunc_BreakHitResult_FaceIndex) == 0x0000EC, "Member 'B_Prj_Athena_SuperBridgeGrenade_C_SetBaseDestination::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SuperBridgeGrenade_C_SetBaseDestination, CallFunc_BreakHitResult_TraceStart) == 0x0000F0, "Member 'B_Prj_Athena_SuperBridgeGrenade_C_SetBaseDestination::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SuperBridgeGrenade_C_SetBaseDestination, CallFunc_BreakHitResult_TraceEnd) == 0x0000FC, "Member 'B_Prj_Athena_SuperBridgeGrenade_C_SetBaseDestination::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SuperBridgeGrenade_C_SetBaseDestination, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000108, "Member 'B_Prj_Athena_SuperBridgeGrenade_C_SetBaseDestination::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SuperBridgeGrenade_C_SetBaseDestination, CallFunc_Add_VectorVector_ReturnValue) == 0x000114, "Member 'B_Prj_Athena_SuperBridgeGrenade_C_SetBaseDestination::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SuperBridgeGrenade_C_SetBaseDestination, CallFunc_BreakVector_X) == 0x000120, "Member 'B_Prj_Athena_SuperBridgeGrenade_C_SetBaseDestination::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SuperBridgeGrenade_C_SetBaseDestination, CallFunc_BreakVector_Y) == 0x000124, "Member 'B_Prj_Athena_SuperBridgeGrenade_C_SetBaseDestination::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SuperBridgeGrenade_C_SetBaseDestination, CallFunc_BreakVector_Z) == 0x000128, "Member 'B_Prj_Athena_SuperBridgeGrenade_C_SetBaseDestination::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SuperBridgeGrenade_C_SetBaseDestination, CallFunc_HasAuthority_ReturnValue) == 0x00012C, "Member 'B_Prj_Athena_SuperBridgeGrenade_C_SetBaseDestination::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SuperBridgeGrenade_C_SetBaseDestination, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000130, "Member 'B_Prj_Athena_SuperBridgeGrenade_C_SetBaseDestination::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SuperBridgeGrenade_C_SetBaseDestination, CallFunc_GridSnap_Float_ReturnValue) == 0x000134, "Member 'B_Prj_Athena_SuperBridgeGrenade_C_SetBaseDestination::CallFunc_GridSnap_Float_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SuperBridgeGrenade_C_SetBaseDestination, CallFunc_GridSnap_Float_ReturnValue_1) == 0x000138, "Member 'B_Prj_Athena_SuperBridgeGrenade_C_SetBaseDestination::CallFunc_GridSnap_Float_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SuperBridgeGrenade_C_SetBaseDestination, CallFunc_GridSnap_Float_ReturnValue_2) == 0x00013C, "Member 'B_Prj_Athena_SuperBridgeGrenade_C_SetBaseDestination::CallFunc_GridSnap_Float_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SuperBridgeGrenade_C_SetBaseDestination, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x000140, "Member 'B_Prj_Athena_SuperBridgeGrenade_C_SetBaseDestination::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SuperBridgeGrenade_C_SetBaseDestination, CallFunc_MakeVector_ReturnValue) == 0x000144, "Member 'B_Prj_Athena_SuperBridgeGrenade_C_SetBaseDestination::CallFunc_MakeVector_ReturnValue' has a wrong offset!");

// Function B_Prj_Athena_SuperBridgeGrenade.B_Prj_Athena_SuperBridgeGrenade_C.CreateBaseSection
// 0x0170 (0x0170 - 0x0000)
struct B_Prj_Athena_SuperBridgeGrenade_C_CreateBaseSection final
{
public:
	struct FVector                                ReferenceLocation;                                 // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UClass*>                         BGAClassArray;                                     // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	TArray<struct FVector>                        BGALocationArray;                                  // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	TArray<struct FRotator>                       BGARotationArray;                                  // 0x0030(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue; // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanPlaceClassInstances_ReturnValue;       // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A[0x2];                                       // 0x005A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBuildingStructuralSupportSystem*       CallFunc_GetBuildingStructuralSupportSystem_BuildingStructuralSupportSystem; // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Map_Find_Value;                           // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Map_Find_Value_1;                         // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_GetActorTeam_ReturnValue;                 // 0x008D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8E[0x2];                                       // 0x008E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_Array_Get_Item;                           // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RotateAngleAxis_ReturnValue;              // 0x00AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x00C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x00D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00E0(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue;          // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABuildingSMActor*                       K2Node_DynamicCast_AsBuilding_SMActor;             // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABuildingTrap*                          K2Node_DynamicCast_AsBuilding_Trap;                // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_141[0x3];                                      // 0x0141(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0144(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x0150(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_3;           // 0x015C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsWorldLocValid_ReturnValue;              // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsWorldLocValid_ReturnValue_1;            // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x016A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Prj_Athena_SuperBridgeGrenade_C_CreateBaseSection) == 0x000010, "Wrong alignment on B_Prj_Athena_SuperBridgeGrenade_C_CreateBaseSection");
static_assert(sizeof(B_Prj_Athena_SuperBridgeGrenade_C_CreateBaseSection) == 0x000170, "Wrong size on B_Prj_Athena_SuperBridgeGrenade_C_CreateBaseSection");
static_assert(offsetof(B_Prj_Athena_SuperBridgeGrenade_C_CreateBaseSection, ReferenceLocation) == 0x000000, "Member 'B_Prj_Athena_SuperBridgeGrenade_C_CreateBaseSection::ReferenceLocation' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SuperBridgeGrenade_C_CreateBaseSection, BGAClassArray) == 0x000010, "Member 'B_Prj_Athena_SuperBridgeGrenade_C_CreateBaseSection::BGAClassArray' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SuperBridgeGrenade_C_CreateBaseSection, BGALocationArray) == 0x000020, "Member 'B_Prj_Athena_SuperBridgeGrenade_C_CreateBaseSection::BGALocationArray' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SuperBridgeGrenade_C_CreateBaseSection, BGARotationArray) == 0x000030, "Member 'B_Prj_Athena_SuperBridgeGrenade_C_CreateBaseSection::BGARotationArray' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SuperBridgeGrenade_C_CreateBaseSection, CallFunc_GetOwner_ReturnValue) == 0x000040, "Member 'B_Prj_Athena_SuperBridgeGrenade_C_CreateBaseSection::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SuperBridgeGrenade_C_CreateBaseSection, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'B_Prj_Athena_SuperBridgeGrenade_C_CreateBaseSection::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SuperBridgeGrenade_C_CreateBaseSection, CallFunc_GetFortPlayerControllerFromActor_ReturnValue) == 0x000050, "Member 'B_Prj_Athena_SuperBridgeGrenade_C_CreateBaseSection::CallFunc_GetFortPlayerControllerFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SuperBridgeGrenade_C_CreateBaseSection, CallFunc_Greater_IntInt_ReturnValue) == 0x000058, "Member 'B_Prj_Athena_SuperBridgeGrenade_C_CreateBaseSection::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SuperBridgeGrenade_C_CreateBaseSection, CallFunc_CanPlaceClassInstances_ReturnValue) == 0x000059, "Member 'B_Prj_Athena_SuperBridgeGrenade_C_CreateBaseSection::CallFunc_CanPlaceClassInstances_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SuperBridgeGrenade_C_CreateBaseSection, CallFunc_Array_Length_ReturnValue_1) == 0x00005C, "Member 'B_Prj_Athena_SuperBridgeGrenade_C_CreateBaseSection::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SuperBridgeGrenade_C_CreateBaseSection, CallFunc_GetBuildingStructuralSupportSystem_BuildingStructuralSupportSystem) == 0x000060, "Member 'B_Prj_Athena_SuperBridgeGrenade_C_CreateBaseSection::CallFunc_GetBuildingStructuralSupportSystem_BuildingStructuralSupportSystem' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SuperBridgeGrenade_C_CreateBaseSection, CallFunc_Subtract_IntInt_ReturnValue) == 0x000068, "Member 'B_Prj_Athena_SuperBridgeGrenade_C_CreateBaseSection::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SuperBridgeGrenade_C_CreateBaseSection, CallFunc_Map_Find_Value) == 0x00006C, "Member 'B_Prj_Athena_SuperBridgeGrenade_C_CreateBaseSection::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SuperBridgeGrenade_C_CreateBaseSection, CallFunc_Map_Find_ReturnValue) == 0x000078, "Member 'B_Prj_Athena_SuperBridgeGrenade_C_CreateBaseSection::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SuperBridgeGrenade_C_CreateBaseSection, CallFunc_GetOwner_ReturnValue_1) == 0x000080, "Member 'B_Prj_Athena_SuperBridgeGrenade_C_CreateBaseSection::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SuperBridgeGrenade_C_CreateBaseSection, CallFunc_Map_Find_Value_1) == 0x000088, "Member 'B_Prj_Athena_SuperBridgeGrenade_C_CreateBaseSection::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SuperBridgeGrenade_C_CreateBaseSection, CallFunc_Map_Find_ReturnValue_1) == 0x00008C, "Member 'B_Prj_Athena_SuperBridgeGrenade_C_CreateBaseSection::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SuperBridgeGrenade_C_CreateBaseSection, CallFunc_GetActorTeam_ReturnValue) == 0x00008D, "Member 'B_Prj_Athena_SuperBridgeGrenade_C_CreateBaseSection::CallFunc_GetActorTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SuperBridgeGrenade_C_CreateBaseSection, Temp_int_Variable) == 0x000090, "Member 'B_Prj_Athena_SuperBridgeGrenade_C_CreateBaseSection::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SuperBridgeGrenade_C_CreateBaseSection, CallFunc_Add_IntInt_ReturnValue) == 0x000094, "Member 'B_Prj_Athena_SuperBridgeGrenade_C_CreateBaseSection::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SuperBridgeGrenade_C_CreateBaseSection, CallFunc_Array_Get_Item) == 0x000098, "Member 'B_Prj_Athena_SuperBridgeGrenade_C_CreateBaseSection::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SuperBridgeGrenade_C_CreateBaseSection, CallFunc_BreakRotator_Roll) == 0x0000A0, "Member 'B_Prj_Athena_SuperBridgeGrenade_C_CreateBaseSection::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SuperBridgeGrenade_C_CreateBaseSection, CallFunc_BreakRotator_Pitch) == 0x0000A4, "Member 'B_Prj_Athena_SuperBridgeGrenade_C_CreateBaseSection::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SuperBridgeGrenade_C_CreateBaseSection, CallFunc_BreakRotator_Yaw) == 0x0000A8, "Member 'B_Prj_Athena_SuperBridgeGrenade_C_CreateBaseSection::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SuperBridgeGrenade_C_CreateBaseSection, CallFunc_RotateAngleAxis_ReturnValue) == 0x0000AC, "Member 'B_Prj_Athena_SuperBridgeGrenade_C_CreateBaseSection::CallFunc_RotateAngleAxis_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SuperBridgeGrenade_C_CreateBaseSection, CallFunc_Add_FloatFloat_ReturnValue) == 0x0000B8, "Member 'B_Prj_Athena_SuperBridgeGrenade_C_CreateBaseSection::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SuperBridgeGrenade_C_CreateBaseSection, CallFunc_Add_VectorVector_ReturnValue) == 0x0000BC, "Member 'B_Prj_Athena_SuperBridgeGrenade_C_CreateBaseSection::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SuperBridgeGrenade_C_CreateBaseSection, CallFunc_MakeRotator_ReturnValue) == 0x0000C8, "Member 'B_Prj_Athena_SuperBridgeGrenade_C_CreateBaseSection::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SuperBridgeGrenade_C_CreateBaseSection, CallFunc_Add_VectorVector_ReturnValue_1) == 0x0000D4, "Member 'B_Prj_Athena_SuperBridgeGrenade_C_CreateBaseSection::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SuperBridgeGrenade_C_CreateBaseSection, CallFunc_MakeTransform_ReturnValue) == 0x0000E0, "Member 'B_Prj_Athena_SuperBridgeGrenade_C_CreateBaseSection::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SuperBridgeGrenade_C_CreateBaseSection, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000110, "Member 'B_Prj_Athena_SuperBridgeGrenade_C_CreateBaseSection::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SuperBridgeGrenade_C_CreateBaseSection, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000118, "Member 'B_Prj_Athena_SuperBridgeGrenade_C_CreateBaseSection::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SuperBridgeGrenade_C_CreateBaseSection, CallFunc_FinishSpawningActor_ReturnValue) == 0x000120, "Member 'B_Prj_Athena_SuperBridgeGrenade_C_CreateBaseSection::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SuperBridgeGrenade_C_CreateBaseSection, K2Node_DynamicCast_AsBuilding_SMActor) == 0x000128, "Member 'B_Prj_Athena_SuperBridgeGrenade_C_CreateBaseSection::K2Node_DynamicCast_AsBuilding_SMActor' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SuperBridgeGrenade_C_CreateBaseSection, K2Node_DynamicCast_bSuccess) == 0x000130, "Member 'B_Prj_Athena_SuperBridgeGrenade_C_CreateBaseSection::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SuperBridgeGrenade_C_CreateBaseSection, K2Node_DynamicCast_AsBuilding_Trap) == 0x000138, "Member 'B_Prj_Athena_SuperBridgeGrenade_C_CreateBaseSection::K2Node_DynamicCast_AsBuilding_Trap' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SuperBridgeGrenade_C_CreateBaseSection, K2Node_DynamicCast_bSuccess_1) == 0x000140, "Member 'B_Prj_Athena_SuperBridgeGrenade_C_CreateBaseSection::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SuperBridgeGrenade_C_CreateBaseSection, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000144, "Member 'B_Prj_Athena_SuperBridgeGrenade_C_CreateBaseSection::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SuperBridgeGrenade_C_CreateBaseSection, CallFunc_Add_VectorVector_ReturnValue_2) == 0x000150, "Member 'B_Prj_Athena_SuperBridgeGrenade_C_CreateBaseSection::CallFunc_Add_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SuperBridgeGrenade_C_CreateBaseSection, CallFunc_Add_VectorVector_ReturnValue_3) == 0x00015C, "Member 'B_Prj_Athena_SuperBridgeGrenade_C_CreateBaseSection::CallFunc_Add_VectorVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SuperBridgeGrenade_C_CreateBaseSection, CallFunc_IsWorldLocValid_ReturnValue) == 0x000168, "Member 'B_Prj_Athena_SuperBridgeGrenade_C_CreateBaseSection::CallFunc_IsWorldLocValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SuperBridgeGrenade_C_CreateBaseSection, CallFunc_IsWorldLocValid_ReturnValue_1) == 0x000169, "Member 'B_Prj_Athena_SuperBridgeGrenade_C_CreateBaseSection::CallFunc_IsWorldLocValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SuperBridgeGrenade_C_CreateBaseSection, CallFunc_BooleanAND_ReturnValue) == 0x00016A, "Member 'B_Prj_Athena_SuperBridgeGrenade_C_CreateBaseSection::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function B_Prj_Athena_SuperBridgeGrenade.B_Prj_Athena_SuperBridgeGrenade_C.ClearAndBuild
// 0x0090 (0x0090 - 0x0000)
struct B_Prj_Athena_SuperBridgeGrenade_C_ClearAndBuild final
{
public:
	TArray<struct FVector>                        ClearedGridCells;                                  // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	TArray<class UClass*>                         BGAClassArray;                                     // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	TArray<struct FVector>                        BGALocationArray;                                  // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	TArray<struct FRotator>                       BGARotationArray;                                  // 0x0030(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	bool                                          DestroyFloorsQuickly;                              // 0x0040(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBuildingStructuralSupportSystem*       CallFunc_GetBuildingStructuralSupportSystem_BuildingStructuralSupportSystem; // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Array_Get_Item;                           // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Map_Find_Value;                           // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_RotateAngleAxis_ReturnValue;              // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Prj_Athena_SuperBridgeGrenade_C_ClearAndBuild) == 0x000008, "Wrong alignment on B_Prj_Athena_SuperBridgeGrenade_C_ClearAndBuild");
static_assert(sizeof(B_Prj_Athena_SuperBridgeGrenade_C_ClearAndBuild) == 0x000090, "Wrong size on B_Prj_Athena_SuperBridgeGrenade_C_ClearAndBuild");
static_assert(offsetof(B_Prj_Athena_SuperBridgeGrenade_C_ClearAndBuild, ClearedGridCells) == 0x000000, "Member 'B_Prj_Athena_SuperBridgeGrenade_C_ClearAndBuild::ClearedGridCells' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SuperBridgeGrenade_C_ClearAndBuild, BGAClassArray) == 0x000010, "Member 'B_Prj_Athena_SuperBridgeGrenade_C_ClearAndBuild::BGAClassArray' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SuperBridgeGrenade_C_ClearAndBuild, BGALocationArray) == 0x000020, "Member 'B_Prj_Athena_SuperBridgeGrenade_C_ClearAndBuild::BGALocationArray' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SuperBridgeGrenade_C_ClearAndBuild, BGARotationArray) == 0x000030, "Member 'B_Prj_Athena_SuperBridgeGrenade_C_ClearAndBuild::BGARotationArray' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SuperBridgeGrenade_C_ClearAndBuild, DestroyFloorsQuickly) == 0x000040, "Member 'B_Prj_Athena_SuperBridgeGrenade_C_ClearAndBuild::DestroyFloorsQuickly' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SuperBridgeGrenade_C_ClearAndBuild, Temp_int_Loop_Counter_Variable) == 0x000044, "Member 'B_Prj_Athena_SuperBridgeGrenade_C_ClearAndBuild::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SuperBridgeGrenade_C_ClearAndBuild, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'B_Prj_Athena_SuperBridgeGrenade_C_ClearAndBuild::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SuperBridgeGrenade_C_ClearAndBuild, CallFunc_Add_IntInt_ReturnValue) == 0x00004C, "Member 'B_Prj_Athena_SuperBridgeGrenade_C_ClearAndBuild::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SuperBridgeGrenade_C_ClearAndBuild, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'B_Prj_Athena_SuperBridgeGrenade_C_ClearAndBuild::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SuperBridgeGrenade_C_ClearAndBuild, Temp_int_Array_Index_Variable) == 0x000054, "Member 'B_Prj_Athena_SuperBridgeGrenade_C_ClearAndBuild::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SuperBridgeGrenade_C_ClearAndBuild, CallFunc_GetBuildingStructuralSupportSystem_BuildingStructuralSupportSystem) == 0x000058, "Member 'B_Prj_Athena_SuperBridgeGrenade_C_ClearAndBuild::CallFunc_GetBuildingStructuralSupportSystem_BuildingStructuralSupportSystem' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SuperBridgeGrenade_C_ClearAndBuild, CallFunc_Array_Get_Item) == 0x000060, "Member 'B_Prj_Athena_SuperBridgeGrenade_C_ClearAndBuild::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SuperBridgeGrenade_C_ClearAndBuild, CallFunc_Map_Find_Value) == 0x00006C, "Member 'B_Prj_Athena_SuperBridgeGrenade_C_ClearAndBuild::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SuperBridgeGrenade_C_ClearAndBuild, CallFunc_Map_Find_ReturnValue) == 0x000070, "Member 'B_Prj_Athena_SuperBridgeGrenade_C_ClearAndBuild::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SuperBridgeGrenade_C_ClearAndBuild, CallFunc_RotateAngleAxis_ReturnValue) == 0x000074, "Member 'B_Prj_Athena_SuperBridgeGrenade_C_ClearAndBuild::CallFunc_RotateAngleAxis_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SuperBridgeGrenade_C_ClearAndBuild, CallFunc_Add_VectorVector_ReturnValue) == 0x000080, "Member 'B_Prj_Athena_SuperBridgeGrenade_C_ClearAndBuild::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");

// Function B_Prj_Athena_SuperBridgeGrenade.B_Prj_Athena_SuperBridgeGrenade_C.SpawnTires
// 0x0290 (0x0290 - 0x0000)
struct B_Prj_Athena_SuperBridgeGrenade_C_SpawnTires final
{
public:
	struct FVector                                ReferenceLocation;                                 // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TireHitLocation;                                   // 0x000C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          b_TireHitTerrain;                                  // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBuildingStructuralSupportSystem*       CallFunc_GetBuildingStructuralSupportSystem_BuildingStructuralSupportSystem; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanPlaceClassInstances_ReturnValue;       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Map_Find_Value;                           // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Map_Find_Value_1;                         // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_Array_Get_Item;                           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RotateAngleAxis_ReturnValue;              // 0x007C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x008C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0098(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x00A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x00B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_SphereTraceSingle_OutHit;                 // 0x00C0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_SphereTraceSingle_ReturnValue;            // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x014A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14B[0x1];                                      // 0x014B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0154(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0160(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x016C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0178(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0198(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x01B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x01BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CC[0x4];                                      // 0x01CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x01D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x01E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x01F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x01FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1FD[0x3];                                      // 0x01FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Select_Default;                             // 0x0200(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20C[0x4];                                      // 0x020C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0210(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue;          // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABuildingActor*                         K2Node_DynamicCast_AsBuilding_Actor;               // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_259[0x3];                                      // 0x0259(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x025C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_3;           // 0x0268(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_4;           // 0x0274(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsWorldLocValid_ReturnValue;              // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsWorldLocValid_ReturnValue_1;            // 0x0281(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0282(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Prj_Athena_SuperBridgeGrenade_C_SpawnTires) == 0x000010, "Wrong alignment on B_Prj_Athena_SuperBridgeGrenade_C_SpawnTires");
static_assert(sizeof(B_Prj_Athena_SuperBridgeGrenade_C_SpawnTires) == 0x000290, "Wrong size on B_Prj_Athena_SuperBridgeGrenade_C_SpawnTires");
static_assert(offsetof(B_Prj_Athena_SuperBridgeGrenade_C_SpawnTires, ReferenceLocation) == 0x000000, "Member 'B_Prj_Athena_SuperBridgeGrenade_C_SpawnTires::ReferenceLocation' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SuperBridgeGrenade_C_SpawnTires, TireHitLocation) == 0x00000C, "Member 'B_Prj_Athena_SuperBridgeGrenade_C_SpawnTires::TireHitLocation' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SuperBridgeGrenade_C_SpawnTires, b_TireHitTerrain) == 0x000018, "Member 'B_Prj_Athena_SuperBridgeGrenade_C_SpawnTires::b_TireHitTerrain' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SuperBridgeGrenade_C_SpawnTires, CallFunc_GetBuildingStructuralSupportSystem_BuildingStructuralSupportSystem) == 0x000020, "Member 'B_Prj_Athena_SuperBridgeGrenade_C_SpawnTires::CallFunc_GetBuildingStructuralSupportSystem_BuildingStructuralSupportSystem' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SuperBridgeGrenade_C_SpawnTires, CallFunc_GetOwner_ReturnValue) == 0x000028, "Member 'B_Prj_Athena_SuperBridgeGrenade_C_SpawnTires::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SuperBridgeGrenade_C_SpawnTires, CallFunc_GetFortPlayerControllerFromActor_ReturnValue) == 0x000030, "Member 'B_Prj_Athena_SuperBridgeGrenade_C_SpawnTires::CallFunc_GetFortPlayerControllerFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SuperBridgeGrenade_C_SpawnTires, CallFunc_CanPlaceClassInstances_ReturnValue) == 0x000038, "Member 'B_Prj_Athena_SuperBridgeGrenade_C_SpawnTires::CallFunc_CanPlaceClassInstances_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SuperBridgeGrenade_C_SpawnTires, CallFunc_Array_Length_ReturnValue) == 0x00003C, "Member 'B_Prj_Athena_SuperBridgeGrenade_C_SpawnTires::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SuperBridgeGrenade_C_SpawnTires, CallFunc_Greater_IntInt_ReturnValue) == 0x000040, "Member 'B_Prj_Athena_SuperBridgeGrenade_C_SpawnTires::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SuperBridgeGrenade_C_SpawnTires, CallFunc_Array_Length_ReturnValue_1) == 0x000044, "Member 'B_Prj_Athena_SuperBridgeGrenade_C_SpawnTires::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SuperBridgeGrenade_C_SpawnTires, CallFunc_Subtract_IntInt_ReturnValue) == 0x000048, "Member 'B_Prj_Athena_SuperBridgeGrenade_C_SpawnTires::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SuperBridgeGrenade_C_SpawnTires, CallFunc_Map_Find_Value) == 0x00004C, "Member 'B_Prj_Athena_SuperBridgeGrenade_C_SpawnTires::CallFunc_Map_Find_Value' has a wrong offset!");
