#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Prj_OctopusTowhook_Athena

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ToyAngleSelectorInfo_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function B_Prj_OctopusTowhook_Athena.B_Prj_OctopusTowhook_Athena_C.ExecuteUbergraph_B_Prj_OctopusTowhook_Athena
// 0x02B8 (0x02B8 - 0x0000)
struct B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IFortVehicleInterface> CallFunc_GetVehicleUInterface_ReturnValue;         // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInVehicle_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetVehicleActorPtr_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetInstigatorController_ReturnValue;      // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52[0x2];                                       // 0x0052(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_Event_MyComp;                               // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Other;                                // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_OtherComp;                            // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bSelfMoved;                           // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_HitLocation;                          // 0x008C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_HitNormal;                            // 0x0098(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_NormalImpulse;                        // 0x00A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_Hit;                                  // 0x00B0(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AActor*                                 CallFunc_HandleHits_Target;                        // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_142[0x2];                                      // 0x0142(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x014C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0158(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0164(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0170(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17C[0x4];                                      // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0190(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x01A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x01B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x01C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C2[0x6];                                      // 0x01C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IFortVehicleInterface> CallFunc_GetVehicleUInterface_ReturnValue_1;       // 0x01C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetOwnerLocation_ReturnValue;             // 0x01D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E4[0x4];                                      // 0x01E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetVehicleActorPtr_ReturnValue_1;         // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVehicleVelocity_ReturnValue;           // 0x01F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FC[0x4];                                      // 0x01FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortAthenaJackalVehicle*               K2Node_DynamicCast_AsFort_Athena_Jackal_Vehicle;   // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_2;                              // 0x0209(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_3;                              // 0x020A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_4;                              // 0x020B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x020C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_20D[0x3];                                      // 0x020D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SuggestProjectileVelocity_CustomArc_OutLaunchVelocity; // 0x0214(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SuggestProjectileVelocity_CustomArc_ReturnValue; // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_221[0x3];                                      // 0x0221(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0224(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0230(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x023C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue_1;                      // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0244(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_245[0x3];                                      // 0x0245(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default_1;                           // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SuggestProjectileVelocity_CustomArc_OutLaunchVelocity_1; // 0x024C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SuggestProjectileVelocity_CustomArc_ReturnValue_1; // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_259[0x3];                                      // 0x0259(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x025C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_2;                           // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SuggestProjectileVelocity_CustomArc_OutLaunchVelocity_2; // 0x026C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SuggestProjectileVelocity_CustomArc_ReturnValue_2; // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_279[0x3];                                      // 0x0279(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Select_Default_3;                           // 0x027C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_4;                           // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28C[0x4];                                      // 0x028C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0298(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A4[0x4];                                      // 0x02A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena) == 0x000008, "Wrong alignment on B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena");
static_assert(sizeof(B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena) == 0x0002B8, "Wrong size on B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena, EntryPoint) == 0x000000, "Member 'B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena, CallFunc_GetVehicleUInterface_ReturnValue) == 0x000008, "Member 'B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena::CallFunc_GetVehicleUInterface_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena, CallFunc_IsInVehicle_ReturnValue) == 0x000018, "Member 'B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena::CallFunc_IsInVehicle_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena, CallFunc_GetVehicleActorPtr_ReturnValue) == 0x000020, "Member 'B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena::CallFunc_GetVehicleActorPtr_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena, Temp_bool_Variable) == 0x000028, "Member 'B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00002C, "Member 'B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000038, "Member 'B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena, CallFunc_IsDedicatedServer_ReturnValue) == 0x000044, "Member 'B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena, CallFunc_GetInstigatorController_ReturnValue) == 0x000048, "Member 'B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena::CallFunc_GetInstigatorController_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena, CallFunc_BooleanAND_ReturnValue) == 0x000051, "Member 'B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x000054, "Member 'B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000060, "Member 'B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000068, "Member 'B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena, K2Node_Event_MyComp) == 0x000070, "Member 'B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena::K2Node_Event_MyComp' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena, K2Node_Event_Other) == 0x000078, "Member 'B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena::K2Node_Event_Other' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena, K2Node_Event_OtherComp) == 0x000080, "Member 'B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena::K2Node_Event_OtherComp' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena, K2Node_Event_bSelfMoved) == 0x000088, "Member 'B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena::K2Node_Event_bSelfMoved' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena, K2Node_Event_HitLocation) == 0x00008C, "Member 'B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena::K2Node_Event_HitLocation' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena, K2Node_Event_HitNormal) == 0x000098, "Member 'B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena::K2Node_Event_HitNormal' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena, K2Node_Event_NormalImpulse) == 0x0000A4, "Member 'B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena::K2Node_Event_NormalImpulse' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena, K2Node_Event_Hit) == 0x0000B0, "Member 'B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena::K2Node_Event_Hit' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena, CallFunc_HandleHits_Target) == 0x000138, "Member 'B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena::CallFunc_HandleHits_Target' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena, CallFunc_BreakHitResult_bBlockingHit) == 0x000140, "Member 'B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena, CallFunc_BreakHitResult_bInitialOverlap) == 0x000141, "Member 'B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena, CallFunc_BreakHitResult_Time) == 0x000144, "Member 'B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena, CallFunc_BreakHitResult_Distance) == 0x000148, "Member 'B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena, CallFunc_BreakHitResult_Location) == 0x00014C, "Member 'B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena, CallFunc_BreakHitResult_ImpactPoint) == 0x000158, "Member 'B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena, CallFunc_BreakHitResult_Normal) == 0x000164, "Member 'B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena, CallFunc_BreakHitResult_ImpactNormal) == 0x000170, "Member 'B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena, CallFunc_BreakHitResult_PhysMat) == 0x000180, "Member 'B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena, CallFunc_BreakHitResult_HitActor) == 0x000188, "Member 'B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena, CallFunc_BreakHitResult_HitComponent) == 0x000190, "Member 'B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena, CallFunc_BreakHitResult_HitBoneName) == 0x000198, "Member 'B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena, CallFunc_BreakHitResult_HitItem) == 0x0001A0, "Member 'B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena, CallFunc_BreakHitResult_FaceIndex) == 0x0001A4, "Member 'B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena, CallFunc_BreakHitResult_TraceStart) == 0x0001A8, "Member 'B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena, CallFunc_BreakHitResult_TraceEnd) == 0x0001B4, "Member 'B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x0001C0, "Member 'B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena, Temp_bool_Variable_1) == 0x0001C1, "Member 'B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena, CallFunc_GetVehicleUInterface_ReturnValue_1) == 0x0001C8, "Member 'B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena::CallFunc_GetVehicleUInterface_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena, CallFunc_GetOwnerLocation_ReturnValue) == 0x0001D8, "Member 'B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena::CallFunc_GetOwnerLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena, CallFunc_GetVehicleActorPtr_ReturnValue_1) == 0x0001E8, "Member 'B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena::CallFunc_GetVehicleActorPtr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena, CallFunc_GetVehicleVelocity_ReturnValue) == 0x0001F0, "Member 'B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena::CallFunc_GetVehicleVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena, K2Node_DynamicCast_AsFort_Athena_Jackal_Vehicle) == 0x000200, "Member 'B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena::K2Node_DynamicCast_AsFort_Athena_Jackal_Vehicle' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena, K2Node_DynamicCast_bSuccess) == 0x000208, "Member 'B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena, Temp_bool_Variable_2) == 0x000209, "Member 'B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena, Temp_bool_Variable_3) == 0x00020A, "Member 'B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena, Temp_bool_Variable_4) == 0x00020B, "Member 'B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena, CallFunc_IsValid_ReturnValue_1) == 0x00020C, "Member 'B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena, K2Node_Select_Default) == 0x000210, "Member 'B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena, CallFunc_SuggestProjectileVelocity_CustomArc_OutLaunchVelocity) == 0x000214, "Member 'B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena::CallFunc_SuggestProjectileVelocity_CustomArc_OutLaunchVelocity' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena, CallFunc_SuggestProjectileVelocity_CustomArc_ReturnValue) == 0x000220, "Member 'B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena::CallFunc_SuggestProjectileVelocity_CustomArc_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena, CallFunc_Add_VectorVector_ReturnValue) == 0x000224, "Member 'B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000230, "Member 'B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena, CallFunc_VSize_ReturnValue) == 0x00023C, "Member 'B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena, CallFunc_VSize_ReturnValue_1) == 0x000240, "Member 'B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena::CallFunc_VSize_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000244, "Member 'B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena, K2Node_Select_Default_1) == 0x000248, "Member 'B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena, CallFunc_SuggestProjectileVelocity_CustomArc_OutLaunchVelocity_1) == 0x00024C, "Member 'B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena::CallFunc_SuggestProjectileVelocity_CustomArc_OutLaunchVelocity_1' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena, CallFunc_SuggestProjectileVelocity_CustomArc_ReturnValue_1) == 0x000258, "Member 'B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena::CallFunc_SuggestProjectileVelocity_CustomArc_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena, CallFunc_Add_VectorVector_ReturnValue_2) == 0x00025C, "Member 'B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena::CallFunc_Add_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena, K2Node_Select_Default_2) == 0x000268, "Member 'B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena, CallFunc_SuggestProjectileVelocity_CustomArc_OutLaunchVelocity_2) == 0x00026C, "Member 'B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena::CallFunc_SuggestProjectileVelocity_CustomArc_OutLaunchVelocity_2' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena, CallFunc_SuggestProjectileVelocity_CustomArc_ReturnValue_2) == 0x000278, "Member 'B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena::CallFunc_SuggestProjectileVelocity_CustomArc_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena, K2Node_Select_Default_3) == 0x00027C, "Member 'B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena, K2Node_Select_Default_4) == 0x000288, "Member 'B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena, CallFunc_GetInstigator_ReturnValue) == 0x000290, "Member 'B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000298, "Member 'B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x0002A8, "Member 'B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena, K2Node_DynamicCast_bSuccess_1) == 0x0002B0, "Member 'B_Prj_OctopusTowhook_Athena_C_ExecuteUbergraph_B_Prj_OctopusTowhook_Athena::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function B_Prj_OctopusTowhook_Athena.B_Prj_OctopusTowhook_Athena_C.ReceiveHit
// 0x00C8 (0x00C8 - 0x0000)
struct B_Prj_OctopusTowhook_Athena_C_ReceiveHit final
{
public:
	class UPrimitiveComponent*                    MyComp;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Other;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSelfMoved;                                        // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                HitLocation_0;                                     // 0x001C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitNormal;                                         // 0x0028(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NormalImpulse;                                     // 0x0034(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0040(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(B_Prj_OctopusTowhook_Athena_C_ReceiveHit) == 0x000008, "Wrong alignment on B_Prj_OctopusTowhook_Athena_C_ReceiveHit");
static_assert(sizeof(B_Prj_OctopusTowhook_Athena_C_ReceiveHit) == 0x0000C8, "Wrong size on B_Prj_OctopusTowhook_Athena_C_ReceiveHit");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_ReceiveHit, MyComp) == 0x000000, "Member 'B_Prj_OctopusTowhook_Athena_C_ReceiveHit::MyComp' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_ReceiveHit, Other) == 0x000008, "Member 'B_Prj_OctopusTowhook_Athena_C_ReceiveHit::Other' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_ReceiveHit, OtherComp) == 0x000010, "Member 'B_Prj_OctopusTowhook_Athena_C_ReceiveHit::OtherComp' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_ReceiveHit, bSelfMoved) == 0x000018, "Member 'B_Prj_OctopusTowhook_Athena_C_ReceiveHit::bSelfMoved' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_ReceiveHit, HitLocation_0) == 0x00001C, "Member 'B_Prj_OctopusTowhook_Athena_C_ReceiveHit::HitLocation_0' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_ReceiveHit, HitNormal) == 0x000028, "Member 'B_Prj_OctopusTowhook_Athena_C_ReceiveHit::HitNormal' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_ReceiveHit, NormalImpulse) == 0x000034, "Member 'B_Prj_OctopusTowhook_Athena_C_ReceiveHit::NormalImpulse' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_ReceiveHit, Hit) == 0x000040, "Member 'B_Prj_OctopusTowhook_Athena_C_ReceiveHit::Hit' has a wrong offset!");

// Function B_Prj_OctopusTowhook_Athena.B_Prj_OctopusTowhook_Athena_C.PlayStickSounds
// 0x0030 (0x0030 - 0x0000)
struct B_Prj_OctopusTowhook_Athena_C_PlayStickSounds final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 HitActor;                                          // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_1;        // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_2;        // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Prj_OctopusTowhook_Athena_C_PlayStickSounds) == 0x000008, "Wrong alignment on B_Prj_OctopusTowhook_Athena_C_PlayStickSounds");
static_assert(sizeof(B_Prj_OctopusTowhook_Athena_C_PlayStickSounds) == 0x000030, "Wrong size on B_Prj_OctopusTowhook_Athena_C_PlayStickSounds");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_PlayStickSounds, Location) == 0x000000, "Member 'B_Prj_OctopusTowhook_Athena_C_PlayStickSounds::Location' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_PlayStickSounds, HitActor) == 0x000010, "Member 'B_Prj_OctopusTowhook_Athena_C_PlayStickSounds::HitActor' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_PlayStickSounds, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'B_Prj_OctopusTowhook_Athena_C_PlayStickSounds::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_PlayStickSounds, CallFunc_IsLocallyControlled_ReturnValue) == 0x000019, "Member 'B_Prj_OctopusTowhook_Athena_C_PlayStickSounds::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_PlayStickSounds, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000020, "Member 'B_Prj_OctopusTowhook_Athena_C_PlayStickSounds::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_PlayStickSounds, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'B_Prj_OctopusTowhook_Athena_C_PlayStickSounds::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_PlayStickSounds, CallFunc_IsLocallyControlled_ReturnValue_1) == 0x000029, "Member 'B_Prj_OctopusTowhook_Athena_C_PlayStickSounds::CallFunc_IsLocallyControlled_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_PlayStickSounds, CallFunc_IsLocallyControlled_ReturnValue_2) == 0x00002A, "Member 'B_Prj_OctopusTowhook_Athena_C_PlayStickSounds::CallFunc_IsLocallyControlled_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_PlayStickSounds, CallFunc_IsValid_ReturnValue_1) == 0x00002B, "Member 'B_Prj_OctopusTowhook_Athena_C_PlayStickSounds::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function B_Prj_OctopusTowhook_Athena.B_Prj_OctopusTowhook_Athena_C.HandleHits
// 0x01E8 (0x01E8 - 0x0000)
struct B_Prj_OctopusTowhook_Athena_C_HandleHits final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AActor*                                 Target_0;                                          // 0x0088(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_92[0x2];                                       // 0x0092(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x009C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x00A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x00B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x00C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x00F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0104(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_ScoreBallerGlass_C*                 K2Node_DynamicCast_AsBP_Score_Baller_Glass;        // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x3];                                      // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x011C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x0128(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetActorLocationAndRotation_SweepHitResult; // 0x0134(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocationAndRotation_ReturnValue; // 0x01BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1BD[0x3];                                      // 0x01BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x01C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CC[0x4];                                      // 0x01CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue;         // 0x01D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue; // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Prj_OctopusTowhook_Athena_C_HandleHits) == 0x000008, "Wrong alignment on B_Prj_OctopusTowhook_Athena_C_HandleHits");
static_assert(sizeof(B_Prj_OctopusTowhook_Athena_C_HandleHits) == 0x0001E8, "Wrong size on B_Prj_OctopusTowhook_Athena_C_HandleHits");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_HandleHits, Hit) == 0x000000, "Member 'B_Prj_OctopusTowhook_Athena_C_HandleHits::Hit' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_HandleHits, Target_0) == 0x000088, "Member 'B_Prj_OctopusTowhook_Athena_C_HandleHits::Target_0' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_HandleHits, CallFunc_BreakHitResult_bBlockingHit) == 0x000090, "Member 'B_Prj_OctopusTowhook_Athena_C_HandleHits::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_HandleHits, CallFunc_BreakHitResult_bInitialOverlap) == 0x000091, "Member 'B_Prj_OctopusTowhook_Athena_C_HandleHits::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_HandleHits, CallFunc_BreakHitResult_Time) == 0x000094, "Member 'B_Prj_OctopusTowhook_Athena_C_HandleHits::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_HandleHits, CallFunc_BreakHitResult_Distance) == 0x000098, "Member 'B_Prj_OctopusTowhook_Athena_C_HandleHits::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_HandleHits, CallFunc_BreakHitResult_Location) == 0x00009C, "Member 'B_Prj_OctopusTowhook_Athena_C_HandleHits::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_HandleHits, CallFunc_BreakHitResult_ImpactPoint) == 0x0000A8, "Member 'B_Prj_OctopusTowhook_Athena_C_HandleHits::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_HandleHits, CallFunc_BreakHitResult_Normal) == 0x0000B4, "Member 'B_Prj_OctopusTowhook_Athena_C_HandleHits::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_HandleHits, CallFunc_BreakHitResult_ImpactNormal) == 0x0000C0, "Member 'B_Prj_OctopusTowhook_Athena_C_HandleHits::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_HandleHits, CallFunc_BreakHitResult_PhysMat) == 0x0000D0, "Member 'B_Prj_OctopusTowhook_Athena_C_HandleHits::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_HandleHits, CallFunc_BreakHitResult_HitActor) == 0x0000D8, "Member 'B_Prj_OctopusTowhook_Athena_C_HandleHits::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_HandleHits, CallFunc_BreakHitResult_HitComponent) == 0x0000E0, "Member 'B_Prj_OctopusTowhook_Athena_C_HandleHits::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_HandleHits, CallFunc_BreakHitResult_HitBoneName) == 0x0000E8, "Member 'B_Prj_OctopusTowhook_Athena_C_HandleHits::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_HandleHits, CallFunc_BreakHitResult_HitItem) == 0x0000F0, "Member 'B_Prj_OctopusTowhook_Athena_C_HandleHits::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_HandleHits, CallFunc_BreakHitResult_FaceIndex) == 0x0000F4, "Member 'B_Prj_OctopusTowhook_Athena_C_HandleHits::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_HandleHits, CallFunc_BreakHitResult_TraceStart) == 0x0000F8, "Member 'B_Prj_OctopusTowhook_Athena_C_HandleHits::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_HandleHits, CallFunc_BreakHitResult_TraceEnd) == 0x000104, "Member 'B_Prj_OctopusTowhook_Athena_C_HandleHits::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_HandleHits, K2Node_DynamicCast_AsBP_Score_Baller_Glass) == 0x000110, "Member 'B_Prj_OctopusTowhook_Athena_C_HandleHits::K2Node_DynamicCast_AsBP_Score_Baller_Glass' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_HandleHits, K2Node_DynamicCast_bSuccess) == 0x000118, "Member 'B_Prj_OctopusTowhook_Athena_C_HandleHits::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_HandleHits, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x00011C, "Member 'B_Prj_OctopusTowhook_Athena_C_HandleHits::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_HandleHits, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x000128, "Member 'B_Prj_OctopusTowhook_Athena_C_HandleHits::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_HandleHits, CallFunc_K2_SetActorLocationAndRotation_SweepHitResult) == 0x000134, "Member 'B_Prj_OctopusTowhook_Athena_C_HandleHits::CallFunc_K2_SetActorLocationAndRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_HandleHits, CallFunc_K2_SetActorLocationAndRotation_ReturnValue) == 0x0001BC, "Member 'B_Prj_OctopusTowhook_Athena_C_HandleHits::CallFunc_K2_SetActorLocationAndRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_HandleHits, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0001C0, "Member 'B_Prj_OctopusTowhook_Athena_C_HandleHits::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_HandleHits, CallFunc_SpawnSoundAtLocation_ReturnValue) == 0x0001D0, "Member 'B_Prj_OctopusTowhook_Athena_C_HandleHits::CallFunc_SpawnSoundAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_HandleHits, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x0001D8, "Member 'B_Prj_OctopusTowhook_Athena_C_HandleHits::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_OctopusTowhook_Athena_C_HandleHits, CallFunc_GetFortPlayerControllerFromActor_ReturnValue) == 0x0001E0, "Member 'B_Prj_OctopusTowhook_Athena_C_HandleHits::CallFunc_GetFortPlayerControllerFromActor_ReturnValue' has a wrong offset!");

// Function B_Prj_OctopusTowhook_Athena.B_Prj_OctopusTowhook_Athena_C.IncapacitateTarget
// 0x0030 (0x0030 - 0x0000)
struct B_Prj_OctopusTowhook_Athena_C_IncapacitateTarget final
{
public:
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
