#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Prj_Athena_BadgerBangs

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function B_Prj_Athena_BadgerBangs.B_Prj_Athena_BadgerBangs_C.ExecuteUbergraph_B_Prj_Athena_BadgerBangs
// 0x0B50 (0x0B50 - 0x0000)
struct B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeSinceCreation_ReturnValue;     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetInstigator_ReturnValue_1;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetInstigator_ReturnValue_2;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetInstigator_ReturnValue_3;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UActorComponent*                        K2Node_ComponentBoundEvent_Component;              // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bReset;                 // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ADA_BadgerBangs_C*                      K2Node_DynamicCast_AsDA_Badger_Bangs;              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_HitActor;                       // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             K2Node_CustomEvent_Sound;                          // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Location;                       // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_CustomEvent_InputPin;                       // 0x007C(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             K2Node_CustomEvent_HitResult;                      // 0x0104(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x018C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x018D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_18E[0x2];                                      // 0x018E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0198(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x01A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x01B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x01BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x01F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x01FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_1;            // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_1;         // 0x0209(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_20A[0x2];                                      // 0x020A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_1;                    // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_1;                // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location_1;                // 0x0214(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_1;             // 0x0220(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_1;                  // 0x022C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_1;            // 0x0238(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_244[0x4];                                      // 0x0244(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_1;                 // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_1;                // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_1;            // 0x0258(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_1;             // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_1;                 // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_1;               // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart_1;              // 0x0270(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_1;                // 0x027C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_289[0x3];                                      // 0x0289(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x028C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_29C[0x4];                                      // 0x029C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x02A0(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x02A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_2;            // 0x02B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_2;         // 0x02B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B6[0x2];                                      // 0x02B6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_2;                    // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_2;                // 0x02BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location_2;                // 0x02C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_2;             // 0x02CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_2;                  // 0x02D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_2;            // 0x02E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_2;                 // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_2;                // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_2;            // 0x0300(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_2;             // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_2;                 // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_2;               // 0x0314(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart_2;              // 0x0318(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_2;                // 0x0324(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0334(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_RLerp_ReturnValue;                        // 0x0340(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RandomBool_ReturnValue;                   // 0x034C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34D[0x3];                                      // 0x034D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0350(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult_1;  // 0x03D8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0460(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0461(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_462[0x6];                                      // 0x0462(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0468(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x0470(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0478(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x047C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0480(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0484(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0488(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x0494(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x04A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x04AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x04B8(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_4C8[0x8];                                      // 0x04C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x04D0(0x0030)(IsPlainOldData, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0500(0x0008)(NoDestructor, HasGetValueTypeHash)
	class ABuildingGameplayActor*                 CallFunc_SpawnBuildingGameplayActor_ReturnValue;   // 0x0508(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABGA_Athena_BadgerBangsStuck_C*         K2Node_DynamicCast_AsBGA_Athena_Badger_Bangs_Stuck; // 0x0510(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0518(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_519[0x7];                                      // 0x0519(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABGA_Athena_WithGravity_Parent_C*       K2Node_DynamicCast_AsBGA_Athena_with_Gravity_Parent; // 0x0520(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0528(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_529[0x3];                                      // 0x0529(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x052C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue_1;    // 0x0530(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         Temp_float_Variable_1;                             // 0x053C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x0540(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void(class AActor* DestroyedActor)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x054C(0x0010)(ZeroConstructor, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult_2;  // 0x055C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x05E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x05F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5FC[0x4];                                      // 0x05FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x0600(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_2;           // 0x0608(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_2;            // 0x0610(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x0618(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep_1;           // 0x061C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61D[0x3];                                      // 0x061D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult_1;          // 0x0620(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue;    // 0x06A8(0x00B8)(ContainsInstancedReference)
	class AWaterVolume_Athena*                    K2Node_DynamicCast_AsWater_Volume_Athena;          // 0x0760(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0768(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_769[0x7];                                      // 0x0769(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Temp_object_Variable;                              // 0x0770(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0778(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_2;        // 0x0788(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_HitComponent;           // 0x0790(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x0798(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x07A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_ComponentBoundEvent_NormalImpulse;          // 0x07A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_ComponentBoundEvent_Hit;                    // 0x07B4(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_3;            // 0x083C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_3;         // 0x083D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_83E[0x2];                                      // 0x083E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_3;                    // 0x0840(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_3;                // 0x0844(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location_3;                // 0x0848(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_3;             // 0x0854(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_3;                  // 0x0860(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_3;            // 0x086C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_3;                 // 0x0878(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_3;                // 0x0880(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_3;            // 0x0888(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_3;             // 0x0890(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_3;                 // 0x0898(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_3;               // 0x089C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart_3;              // 0x08A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_3;                // 0x08AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IFortVehicleInterface> K2Node_DynamicCast_AsFort_Vehicle_Interface;       // 0x08B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x08C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8C9[0x3];                                      // 0x08C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x08CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<class AFortPlayerPawn*>                CallFunc_GetAllPassengers_ReturnValue;             // 0x08D8(0x0010)(ZeroConstructor, ReferenceParm)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x08E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AllOnSameTeam_Result;                     // 0x08F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8F1[0x3];                                      // 0x08F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x08F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x08F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x08F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8FA[0x6];                                      // 0x08FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortAIPawn*                            K2Node_DynamicCast_AsFort_AIPawn;                  // 0x0900(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0908(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_909[0x7];                                      // 0x0909(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerPawn_Athena_C*                   K2Node_DynamicCast_AsPlayer_Pawn_Athena;           // 0x0910(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0918(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_919[0x7];                                      // 0x0919(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABGA_Athena_SuperDingo_C*               K2Node_DynamicCast_AsBGA_Athena_Super_Dingo;       // 0x0920(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x0928(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_OnSameTeam_ReturnValue;                   // 0x0929(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_92A[0x6];                                      // 0x092A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AAthenaSupplyDropBalloon_C*             K2Node_DynamicCast_AsAthena_Supply_Drop_Balloon;   // 0x0930(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x0938(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_939[0x7];                                      // 0x0939(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAthena_Player_Bush_C*                  K2Node_DynamicCast_AsAthena_Player_Bush;           // 0x0940(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_10;                    // 0x0948(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_949[0x7];                                      // 0x0949(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABGA_Athena_BadgerBangsStuck_C*         K2Node_DynamicCast_AsBGA_Athena_Badger_Bangs_Stuck_1; // 0x0950(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_11;                    // 0x0958(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_959[0x7];                                      // 0x0959(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0960(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0968(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0970(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0978(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x097C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_97D[0x3];                                      // 0x097D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0980(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class USoundBase*                             Temp_object_Variable_1;                            // 0x0A08(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckLineOfSightToActor_ReturnValue;      // 0x0A10(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A11[0x7];                                      // 0x0A11(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IFortVehicleInterface> K2Node_DynamicCast_AsFort_Vehicle_Interface_1;     // 0x0A18(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_12;                    // 0x0A28(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A29[0x7];                                      // 0x0A29(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortAIPawn*                            K2Node_DynamicCast_AsFort_AIPawn_1;                // 0x0A30(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_13;                    // 0x0A38(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A39[0x7];                                      // 0x0A39(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AFortPlayerPawn*>                CallFunc_GetAllPassengers_ReturnValue_1;           // 0x0A40(0x0010)(ZeroConstructor, ReferenceParm)
	class APlayerPawn_Athena_C*                   K2Node_DynamicCast_AsPlayer_Pawn_Athena_1;         // 0x0A50(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_14;                    // 0x0A58(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AllOnSameTeam_Result_1;                   // 0x0A59(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_OnSameTeam_ReturnValue_1;                 // 0x0A5A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0A5B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0A5C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABGA_Athena_SuperDingo_C*               K2Node_DynamicCast_AsBGA_Athena_Super_Dingo_1;     // 0x0A60(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_15;                    // 0x0A68(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0A69(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A6A[0x6];                                      // 0x0A6A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AAthenaSupplyDropBalloon_C*             K2Node_DynamicCast_AsAthena_Supply_Drop_Balloon_1; // 0x0A70(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_16;                    // 0x0A78(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A79[0x7];                                      // 0x0A79(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAthena_Player_Bush_C*                  K2Node_DynamicCast_AsAthena_Player_Bush_1;         // 0x0A80(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_17;                    // 0x0A88(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0A89(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A8A[0x2];                                      // 0x0A8A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_2;                // 0x0A8C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class USoundBase*                             K2Node_Select_Default;                             // 0x0A98(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult_3;  // 0x0AA0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0B28(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B29[0x3];                                      // 0x0B29(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetGameTimeSinceCreation_ReturnValue_1;   // 0x0B2C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x0B30(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B31[0x3];                                      // 0x0B31(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0B34(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DestroyedActor;                 // 0x0B38(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0B40(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0B41(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs) == 0x000010, "Wrong alignment on B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs");
static_assert(sizeof(B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs) == 0x000B50, "Wrong size on B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs");
static_assert(offsetof(B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs, EntryPoint) == 0x000000, "Member 'B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs, CallFunc_GetGameTimeSinceCreation_ReturnValue) == 0x000004, "Member 'B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs::CallFunc_GetGameTimeSinceCreation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000008, "Member 'B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs, Temp_bool_Has_Been_Initd_Variable) == 0x000009, "Member 'B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs, CallFunc_GetInstigator_ReturnValue) == 0x000010, "Member 'B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs, CallFunc_GetInstigator_ReturnValue_1) == 0x000018, "Member 'B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs::CallFunc_GetInstigator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs, CallFunc_GetInstigator_ReturnValue_2) == 0x000020, "Member 'B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs::CallFunc_GetInstigator_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs, CallFunc_GetInstigator_ReturnValue_3) == 0x000028, "Member 'B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs::CallFunc_GetInstigator_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000030, "Member 'B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs, CallFunc_Array_AddUnique_ReturnValue) == 0x00003C, "Member 'B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs, K2Node_ComponentBoundEvent_Component) == 0x000040, "Member 'B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs::K2Node_ComponentBoundEvent_Component' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs, K2Node_ComponentBoundEvent_bReset) == 0x000048, "Member 'B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs::K2Node_ComponentBoundEvent_bReset' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs, K2Node_DynamicCast_AsDA_Badger_Bangs) == 0x000050, "Member 'B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs::K2Node_DynamicCast_AsDA_Badger_Bangs' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs, K2Node_DynamicCast_bSuccess_1) == 0x000058, "Member 'B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs, K2Node_CustomEvent_HitActor) == 0x000060, "Member 'B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs::K2Node_CustomEvent_HitActor' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs, K2Node_CustomEvent_Sound) == 0x000068, "Member 'B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs::K2Node_CustomEvent_Sound' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs, K2Node_CustomEvent_Location) == 0x000070, "Member 'B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs::K2Node_CustomEvent_Location' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs, K2Node_CustomEvent_InputPin) == 0x00007C, "Member 'B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs::K2Node_CustomEvent_InputPin' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs, K2Node_CustomEvent_HitResult) == 0x000104, "Member 'B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs::K2Node_CustomEvent_HitResult' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs, CallFunc_BreakHitResult_bBlockingHit) == 0x00018C, "Member 'B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs, CallFunc_BreakHitResult_bInitialOverlap) == 0x00018D, "Member 'B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs, CallFunc_BreakHitResult_Time) == 0x000190, "Member 'B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs, CallFunc_BreakHitResult_Distance) == 0x000194, "Member 'B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs, CallFunc_BreakHitResult_Location) == 0x000198, "Member 'B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs, CallFunc_BreakHitResult_ImpactPoint) == 0x0001A4, "Member 'B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs, CallFunc_BreakHitResult_Normal) == 0x0001B0, "Member 'B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs, CallFunc_BreakHitResult_ImpactNormal) == 0x0001BC, "Member 'B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs, CallFunc_BreakHitResult_PhysMat) == 0x0001C8, "Member 'B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs, CallFunc_BreakHitResult_HitActor) == 0x0001D0, "Member 'B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs, CallFunc_BreakHitResult_HitComponent) == 0x0001D8, "Member 'B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs, CallFunc_BreakHitResult_HitBoneName) == 0x0001E0, "Member 'B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs, CallFunc_BreakHitResult_HitItem) == 0x0001E8, "Member 'B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs, CallFunc_BreakHitResult_FaceIndex) == 0x0001EC, "Member 'B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs, CallFunc_BreakHitResult_TraceStart) == 0x0001F0, "Member 'B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs, CallFunc_BreakHitResult_TraceEnd) == 0x0001FC, "Member 'B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs, CallFunc_BreakHitResult_bBlockingHit_1) == 0x000208, "Member 'B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs::CallFunc_BreakHitResult_bBlockingHit_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs, CallFunc_BreakHitResult_bInitialOverlap_1) == 0x000209, "Member 'B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs::CallFunc_BreakHitResult_bInitialOverlap_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs, CallFunc_BreakHitResult_Time_1) == 0x00020C, "Member 'B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs::CallFunc_BreakHitResult_Time_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs, CallFunc_BreakHitResult_Distance_1) == 0x000210, "Member 'B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs::CallFunc_BreakHitResult_Distance_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs, CallFunc_BreakHitResult_Location_1) == 0x000214, "Member 'B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs::CallFunc_BreakHitResult_Location_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs, CallFunc_BreakHitResult_ImpactPoint_1) == 0x000220, "Member 'B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs::CallFunc_BreakHitResult_ImpactPoint_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs, CallFunc_BreakHitResult_Normal_1) == 0x00022C, "Member 'B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs::CallFunc_BreakHitResult_Normal_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs, CallFunc_BreakHitResult_ImpactNormal_1) == 0x000238, "Member 'B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs::CallFunc_BreakHitResult_ImpactNormal_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs, CallFunc_BreakHitResult_PhysMat_1) == 0x000248, "Member 'B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs::CallFunc_BreakHitResult_PhysMat_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs, CallFunc_BreakHitResult_HitActor_1) == 0x000250, "Member 'B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs::CallFunc_BreakHitResult_HitActor_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs, CallFunc_BreakHitResult_HitComponent_1) == 0x000258, "Member 'B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs::CallFunc_BreakHitResult_HitComponent_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs, CallFunc_BreakHitResult_HitBoneName_1) == 0x000260, "Member 'B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs::CallFunc_BreakHitResult_HitBoneName_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs, CallFunc_BreakHitResult_HitItem_1) == 0x000268, "Member 'B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs::CallFunc_BreakHitResult_HitItem_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs, CallFunc_BreakHitResult_FaceIndex_1) == 0x00026C, "Member 'B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs::CallFunc_BreakHitResult_FaceIndex_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs, CallFunc_BreakHitResult_TraceStart_1) == 0x000270, "Member 'B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs::CallFunc_BreakHitResult_TraceStart_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs, CallFunc_BreakHitResult_TraceEnd_1) == 0x00027C, "Member 'B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs::CallFunc_BreakHitResult_TraceEnd_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs, Temp_bool_IsClosed_Variable) == 0x000288, "Member 'B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs, K2Node_CreateDelegate_OutputDelegate) == 0x00028C, "Member 'B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0002A0, "Member 'B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0002A8, "Member 'B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs, CallFunc_BreakHitResult_bBlockingHit_2) == 0x0002B4, "Member 'B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs::CallFunc_BreakHitResult_bBlockingHit_2' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs, CallFunc_BreakHitResult_bInitialOverlap_2) == 0x0002B5, "Member 'B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs::CallFunc_BreakHitResult_bInitialOverlap_2' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs, CallFunc_BreakHitResult_Time_2) == 0x0002B8, "Member 'B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs::CallFunc_BreakHitResult_Time_2' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs, CallFunc_BreakHitResult_Distance_2) == 0x0002BC, "Member 'B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs::CallFunc_BreakHitResult_Distance_2' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs, CallFunc_BreakHitResult_Location_2) == 0x0002C0, "Member 'B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs::CallFunc_BreakHitResult_Location_2' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs, CallFunc_BreakHitResult_ImpactPoint_2) == 0x0002CC, "Member 'B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs::CallFunc_BreakHitResult_ImpactPoint_2' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs, CallFunc_BreakHitResult_Normal_2) == 0x0002D8, "Member 'B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs::CallFunc_BreakHitResult_Normal_2' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs, CallFunc_BreakHitResult_ImpactNormal_2) == 0x0002E4, "Member 'B_Prj_Athena_BadgerBangs_C_ExecuteUbergraph_B_Prj_Athena_BadgerBangs::CallFunc_BreakHitResult_ImpactNormal_2' has a wrong offset!");
