#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Prj_Athena_SilverBlazer_V2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function B_Prj_Athena_SilverBlazer_V2.B_Prj_Athena_SilverBlazer_V2_C.ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2
// 0x03E0 (0x03E0 - 0x0000)
struct B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_CustomEvent_HitResult;                      // 0x0020(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UPrimitiveComponent*                    K2Node_CustomEvent_HitComp;                        // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Pos;                            // 0x00B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_Event_MyComp;                               // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Other;                                // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_OtherComp;                            // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bSelfMoved;                           // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_HitLocation;                          // 0x00DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_HitNormal;                            // 0x00E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_NormalImpulse;                        // 0x00F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_Hit;                                  // 0x0100(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0189(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_18A[0x2];                                      // 0x018A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0194(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x01A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x01AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x01B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C4[0x4];                                      // 0x01C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x01F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x01FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetClosestPointOnCollision_OutPointOnBody; // 0x0208(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetClosestPointOnCollision_ReturnValue;   // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABGA_Athena_WithGravity_Parent_C*       K2Node_DynamicCast_AsBGA_Athena_with_Gravity_Parent; // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0221(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_222[0x2];                                      // 0x0222(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0224(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_1;            // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_1;         // 0x0231(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_232[0x2];                                      // 0x0232(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_1;                    // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_1;                // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location_1;                // 0x023C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_1;             // 0x0248(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_1;                  // 0x0254(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_1;            // 0x0260(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26C[0x4];                                      // 0x026C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_1;                 // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_1;                // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_1;            // 0x0280(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_1;             // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_1;                 // 0x0290(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_1;               // 0x0294(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart_1;              // 0x0298(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_1;                // 0x02A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x02B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotFromZ_ReturnValue;                 // 0x02BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x02C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D4[0xC];                                      // 0x02D4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x02E0(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0310(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31C[0x4];                                      // 0x031C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x0328(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_334[0x4];                                      // 0x0334(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue;          // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_Hit_1;                                // 0x0340(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class ABGA_Athena_WithGravity_Parent_C*       K2Node_DynamicCast_AsBGA_Athena_with_Gravity_Parent_1; // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x03D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x03D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D2[0x2];                                      // 0x03D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x03D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2) == 0x000010, "Wrong alignment on B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2");
static_assert(sizeof(B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2) == 0x0003E0, "Wrong size on B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2");
static_assert(offsetof(B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2, EntryPoint) == 0x000000, "Member 'B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2, Temp_bool_Has_Been_Initd_Variable) == 0x000004, "Member 'B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000008, "Member 'B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000014, "Member 'B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2, K2Node_CustomEvent_HitResult) == 0x000020, "Member 'B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2::K2Node_CustomEvent_HitResult' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2, K2Node_CustomEvent_HitComp) == 0x0000A8, "Member 'B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2::K2Node_CustomEvent_HitComp' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2, K2Node_CustomEvent_Pos) == 0x0000B0, "Member 'B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2::K2Node_CustomEvent_Pos' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2, K2Node_Event_MyComp) == 0x0000C0, "Member 'B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2::K2Node_Event_MyComp' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2, K2Node_Event_Other) == 0x0000C8, "Member 'B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2::K2Node_Event_Other' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2, K2Node_Event_OtherComp) == 0x0000D0, "Member 'B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2::K2Node_Event_OtherComp' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2, K2Node_Event_bSelfMoved) == 0x0000D8, "Member 'B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2::K2Node_Event_bSelfMoved' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2, K2Node_Event_HitLocation) == 0x0000DC, "Member 'B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2::K2Node_Event_HitLocation' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2, K2Node_Event_HitNormal) == 0x0000E8, "Member 'B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2::K2Node_Event_HitNormal' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2, K2Node_Event_NormalImpulse) == 0x0000F4, "Member 'B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2::K2Node_Event_NormalImpulse' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2, K2Node_Event_Hit) == 0x000100, "Member 'B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2::K2Node_Event_Hit' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2, CallFunc_BreakHitResult_bBlockingHit) == 0x000188, "Member 'B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2, CallFunc_BreakHitResult_bInitialOverlap) == 0x000189, "Member 'B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2, CallFunc_BreakHitResult_Time) == 0x00018C, "Member 'B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2, CallFunc_BreakHitResult_Distance) == 0x000190, "Member 'B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2, CallFunc_BreakHitResult_Location) == 0x000194, "Member 'B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2, CallFunc_BreakHitResult_ImpactPoint) == 0x0001A0, "Member 'B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2, CallFunc_BreakHitResult_Normal) == 0x0001AC, "Member 'B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2, CallFunc_BreakHitResult_ImpactNormal) == 0x0001B8, "Member 'B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2, CallFunc_BreakHitResult_PhysMat) == 0x0001C8, "Member 'B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2, CallFunc_BreakHitResult_HitActor) == 0x0001D0, "Member 'B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2, CallFunc_BreakHitResult_HitComponent) == 0x0001D8, "Member 'B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2, CallFunc_BreakHitResult_HitBoneName) == 0x0001E0, "Member 'B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2, CallFunc_BreakHitResult_HitItem) == 0x0001E8, "Member 'B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2, CallFunc_BreakHitResult_FaceIndex) == 0x0001EC, "Member 'B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2, CallFunc_BreakHitResult_TraceStart) == 0x0001F0, "Member 'B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2, CallFunc_BreakHitResult_TraceEnd) == 0x0001FC, "Member 'B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2, CallFunc_GetClosestPointOnCollision_OutPointOnBody) == 0x000208, "Member 'B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2::CallFunc_GetClosestPointOnCollision_OutPointOnBody' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2, CallFunc_GetClosestPointOnCollision_ReturnValue) == 0x000214, "Member 'B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2::CallFunc_GetClosestPointOnCollision_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2, K2Node_DynamicCast_AsBGA_Athena_with_Gravity_Parent) == 0x000218, "Member 'B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2::K2Node_DynamicCast_AsBGA_Athena_with_Gravity_Parent' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2, K2Node_DynamicCast_bSuccess) == 0x000220, "Member 'B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000221, "Member 'B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000224, "Member 'B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2, CallFunc_BreakHitResult_bBlockingHit_1) == 0x000230, "Member 'B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2::CallFunc_BreakHitResult_bBlockingHit_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2, CallFunc_BreakHitResult_bInitialOverlap_1) == 0x000231, "Member 'B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2::CallFunc_BreakHitResult_bInitialOverlap_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2, CallFunc_BreakHitResult_Time_1) == 0x000234, "Member 'B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2::CallFunc_BreakHitResult_Time_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2, CallFunc_BreakHitResult_Distance_1) == 0x000238, "Member 'B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2::CallFunc_BreakHitResult_Distance_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2, CallFunc_BreakHitResult_Location_1) == 0x00023C, "Member 'B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2::CallFunc_BreakHitResult_Location_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2, CallFunc_BreakHitResult_ImpactPoint_1) == 0x000248, "Member 'B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2::CallFunc_BreakHitResult_ImpactPoint_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2, CallFunc_BreakHitResult_Normal_1) == 0x000254, "Member 'B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2::CallFunc_BreakHitResult_Normal_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2, CallFunc_BreakHitResult_ImpactNormal_1) == 0x000260, "Member 'B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2::CallFunc_BreakHitResult_ImpactNormal_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2, CallFunc_BreakHitResult_PhysMat_1) == 0x000270, "Member 'B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2::CallFunc_BreakHitResult_PhysMat_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2, CallFunc_BreakHitResult_HitActor_1) == 0x000278, "Member 'B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2::CallFunc_BreakHitResult_HitActor_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2, CallFunc_BreakHitResult_HitComponent_1) == 0x000280, "Member 'B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2::CallFunc_BreakHitResult_HitComponent_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2, CallFunc_BreakHitResult_HitBoneName_1) == 0x000288, "Member 'B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2::CallFunc_BreakHitResult_HitBoneName_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2, CallFunc_BreakHitResult_HitItem_1) == 0x000290, "Member 'B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2::CallFunc_BreakHitResult_HitItem_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2, CallFunc_BreakHitResult_FaceIndex_1) == 0x000294, "Member 'B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2::CallFunc_BreakHitResult_FaceIndex_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2, CallFunc_BreakHitResult_TraceStart_1) == 0x000298, "Member 'B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2::CallFunc_BreakHitResult_TraceStart_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2, CallFunc_BreakHitResult_TraceEnd_1) == 0x0002A4, "Member 'B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2::CallFunc_BreakHitResult_TraceEnd_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2, CallFunc_Normal_ReturnValue) == 0x0002B0, "Member 'B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2, CallFunc_MakeRotFromZ_ReturnValue) == 0x0002BC, "Member 'B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2::CallFunc_MakeRotFromZ_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0002C8, "Member 'B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2, CallFunc_MakeTransform_ReturnValue) == 0x0002E0, "Member 'B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2, CallFunc_Add_VectorVector_ReturnValue) == 0x000310, "Member 'B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000320, "Member 'B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2, CallFunc_SelectVector_ReturnValue) == 0x000328, "Member 'B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2::CallFunc_SelectVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2, CallFunc_FinishSpawningActor_ReturnValue) == 0x000338, "Member 'B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2, K2Node_Event_Hit_1) == 0x000340, "Member 'B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2::K2Node_Event_Hit_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2, K2Node_DynamicCast_AsBGA_Athena_with_Gravity_Parent_1) == 0x0003C8, "Member 'B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2::K2Node_DynamicCast_AsBGA_Athena_with_Gravity_Parent_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2, K2Node_DynamicCast_bSuccess_1) == 0x0003D0, "Member 'B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2, Temp_bool_IsClosed_Variable) == 0x0003D1, "Member 'B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x0003D4, "Member 'B_Prj_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_Prj_Athena_SilverBlazer_V2::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");

// Function B_Prj_Athena_SilverBlazer_V2.B_Prj_Athena_SilverBlazer_V2_C.SpawnBGA
// 0x00A0 (0x00A0 - 0x0000)
struct B_Prj_Athena_SilverBlazer_V2_C_SpawnBGA final
{
public:
	struct FHitResult                             HitResult;                                         // 0x0000(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UPrimitiveComponent*                    HitComp;                                           // 0x0088(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Pos;                                               // 0x0090(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Prj_Athena_SilverBlazer_V2_C_SpawnBGA) == 0x000008, "Wrong alignment on B_Prj_Athena_SilverBlazer_V2_C_SpawnBGA");
static_assert(sizeof(B_Prj_Athena_SilverBlazer_V2_C_SpawnBGA) == 0x0000A0, "Wrong size on B_Prj_Athena_SilverBlazer_V2_C_SpawnBGA");
static_assert(offsetof(B_Prj_Athena_SilverBlazer_V2_C_SpawnBGA, HitResult) == 0x000000, "Member 'B_Prj_Athena_SilverBlazer_V2_C_SpawnBGA::HitResult' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SilverBlazer_V2_C_SpawnBGA, HitComp) == 0x000088, "Member 'B_Prj_Athena_SilverBlazer_V2_C_SpawnBGA::HitComp' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SilverBlazer_V2_C_SpawnBGA, Pos) == 0x000090, "Member 'B_Prj_Athena_SilverBlazer_V2_C_SpawnBGA::Pos' has a wrong offset!");

// Function B_Prj_Athena_SilverBlazer_V2.B_Prj_Athena_SilverBlazer_V2_C.ReceiveHit
// 0x00C8 (0x00C8 - 0x0000)
struct B_Prj_Athena_SilverBlazer_V2_C_ReceiveHit final
{
public:
	class UPrimitiveComponent*                    MyComp;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Other;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSelfMoved;                                        // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                HitLocation;                                       // 0x001C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitNormal;                                         // 0x0028(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NormalImpulse;                                     // 0x0034(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0040(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(B_Prj_Athena_SilverBlazer_V2_C_ReceiveHit) == 0x000008, "Wrong alignment on B_Prj_Athena_SilverBlazer_V2_C_ReceiveHit");
static_assert(sizeof(B_Prj_Athena_SilverBlazer_V2_C_ReceiveHit) == 0x0000C8, "Wrong size on B_Prj_Athena_SilverBlazer_V2_C_ReceiveHit");
static_assert(offsetof(B_Prj_Athena_SilverBlazer_V2_C_ReceiveHit, MyComp) == 0x000000, "Member 'B_Prj_Athena_SilverBlazer_V2_C_ReceiveHit::MyComp' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SilverBlazer_V2_C_ReceiveHit, Other) == 0x000008, "Member 'B_Prj_Athena_SilverBlazer_V2_C_ReceiveHit::Other' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SilverBlazer_V2_C_ReceiveHit, OtherComp) == 0x000010, "Member 'B_Prj_Athena_SilverBlazer_V2_C_ReceiveHit::OtherComp' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SilverBlazer_V2_C_ReceiveHit, bSelfMoved) == 0x000018, "Member 'B_Prj_Athena_SilverBlazer_V2_C_ReceiveHit::bSelfMoved' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SilverBlazer_V2_C_ReceiveHit, HitLocation) == 0x00001C, "Member 'B_Prj_Athena_SilverBlazer_V2_C_ReceiveHit::HitLocation' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SilverBlazer_V2_C_ReceiveHit, HitNormal) == 0x000028, "Member 'B_Prj_Athena_SilverBlazer_V2_C_ReceiveHit::HitNormal' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SilverBlazer_V2_C_ReceiveHit, NormalImpulse) == 0x000034, "Member 'B_Prj_Athena_SilverBlazer_V2_C_ReceiveHit::NormalImpulse' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SilverBlazer_V2_C_ReceiveHit, Hit) == 0x000040, "Member 'B_Prj_Athena_SilverBlazer_V2_C_ReceiveHit::Hit' has a wrong offset!");

// Function B_Prj_Athena_SilverBlazer_V2.B_Prj_Athena_SilverBlazer_V2_C.OnStop
// 0x0088 (0x0088 - 0x0000)
struct B_Prj_Athena_SilverBlazer_V2_C_OnStop final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(B_Prj_Athena_SilverBlazer_V2_C_OnStop) == 0x000004, "Wrong alignment on B_Prj_Athena_SilverBlazer_V2_C_OnStop");
static_assert(sizeof(B_Prj_Athena_SilverBlazer_V2_C_OnStop) == 0x000088, "Wrong size on B_Prj_Athena_SilverBlazer_V2_C_OnStop");
static_assert(offsetof(B_Prj_Athena_SilverBlazer_V2_C_OnStop, Hit) == 0x000000, "Member 'B_Prj_Athena_SilverBlazer_V2_C_OnStop::Hit' has a wrong offset!");

// Function B_Prj_Athena_SilverBlazer_V2.B_Prj_Athena_SilverBlazer_V2_C.WillBounceOffTarget
// 0x0130 (0x0130 - 0x0000)
struct B_Prj_Athena_SilverBlazer_V2_C_WillBounceOffTarget final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x0088(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8B[0x1];                                       // 0x008B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0094(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x00A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x00AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x00B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x00F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x00FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ComponentHasTag_ReturnValue;              // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AB_BGA_Athena_SilverBlazer_V2_C*        K2Node_DynamicCast_AsB_BGA_Athena_Silver_Blazer_V2; // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABuildingGameplayActor*                 K2Node_DynamicCast_AsBuilding_Gameplay_Actor;      // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Prj_Athena_SilverBlazer_V2_C_WillBounceOffTarget) == 0x000008, "Wrong alignment on B_Prj_Athena_SilverBlazer_V2_C_WillBounceOffTarget");
static_assert(sizeof(B_Prj_Athena_SilverBlazer_V2_C_WillBounceOffTarget) == 0x000130, "Wrong size on B_Prj_Athena_SilverBlazer_V2_C_WillBounceOffTarget");
static_assert(offsetof(B_Prj_Athena_SilverBlazer_V2_C_WillBounceOffTarget, Hit) == 0x000000, "Member 'B_Prj_Athena_SilverBlazer_V2_C_WillBounceOffTarget::Hit' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_SilverBlazer_V2_C_WillBounceOffTarget, ReturnValue) == 0x000088, "Member 'B_Prj_Athena_SilverBlazer_V2_C_WillBounceOffTarget::ReturnValue' has a wrong offset!");
