#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Prj_Athena_TrapGrenade_ZippyTrout

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Prj_Athena_TrapGrenade_ZippyTrout.B_Prj_Athena_TrapGrenade_ZippyTrout_C
// 0x00C8 (0x0858 - 0x0790)
class AB_Prj_Athena_TrapGrenade_ZippyTrout_C final : public AFortTrapGrenadeProjectile
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0790(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Sphere;                                            // 0x0798(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URotatingMovementComponent*             RotatingMovement;                                  // 0x07A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LastBounceLocation;                                // 0x07A8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MinBounceDistance;                                 // 0x07B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LastBounceTime;                                    // 0x07B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MinTimeBetweenBounces;                             // 0x07BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 HitActor;                                          // 0x07C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             GrenadeHitResult;                                  // 0x07C8(0x0088)(Edit, BlueprintVisible, Net, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, ContainsInstancedReference)
	bool                                          TrapPlaced;                                        // 0x0850(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_B_Prj_Athena_TrapGrenade_ZippyTrout(int32 EntryPoint);
	void GrenadeHitClient();
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void HandleBounce(const struct FVector& Hit_Location);
	void ReceiveHit(class UPrimitiveComponent* MyComp, class AActor* Other, class UPrimitiveComponent* OtherComp, bool bSelfMoved, const struct FVector& HitLocation, const struct FVector& HitNormal, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void SetHitAndTick(const struct FHitResult& Hit);
	void OnRep_GrenadeHitResult();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Prj_Athena_TrapGrenade_ZippyTrout_C">();
	}
	static class AB_Prj_Athena_TrapGrenade_ZippyTrout_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Prj_Athena_TrapGrenade_ZippyTrout_C>();
	}
};
static_assert(alignof(AB_Prj_Athena_TrapGrenade_ZippyTrout_C) == 0x000008, "Wrong alignment on AB_Prj_Athena_TrapGrenade_ZippyTrout_C");
static_assert(sizeof(AB_Prj_Athena_TrapGrenade_ZippyTrout_C) == 0x000858, "Wrong size on AB_Prj_Athena_TrapGrenade_ZippyTrout_C");
static_assert(offsetof(AB_Prj_Athena_TrapGrenade_ZippyTrout_C, UberGraphFrame) == 0x000790, "Member 'AB_Prj_Athena_TrapGrenade_ZippyTrout_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_TrapGrenade_ZippyTrout_C, Sphere) == 0x000798, "Member 'AB_Prj_Athena_TrapGrenade_ZippyTrout_C::Sphere' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_TrapGrenade_ZippyTrout_C, RotatingMovement) == 0x0007A0, "Member 'AB_Prj_Athena_TrapGrenade_ZippyTrout_C::RotatingMovement' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_TrapGrenade_ZippyTrout_C, LastBounceLocation) == 0x0007A8, "Member 'AB_Prj_Athena_TrapGrenade_ZippyTrout_C::LastBounceLocation' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_TrapGrenade_ZippyTrout_C, MinBounceDistance) == 0x0007B4, "Member 'AB_Prj_Athena_TrapGrenade_ZippyTrout_C::MinBounceDistance' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_TrapGrenade_ZippyTrout_C, LastBounceTime) == 0x0007B8, "Member 'AB_Prj_Athena_TrapGrenade_ZippyTrout_C::LastBounceTime' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_TrapGrenade_ZippyTrout_C, MinTimeBetweenBounces) == 0x0007BC, "Member 'AB_Prj_Athena_TrapGrenade_ZippyTrout_C::MinTimeBetweenBounces' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_TrapGrenade_ZippyTrout_C, HitActor) == 0x0007C0, "Member 'AB_Prj_Athena_TrapGrenade_ZippyTrout_C::HitActor' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_TrapGrenade_ZippyTrout_C, GrenadeHitResult) == 0x0007C8, "Member 'AB_Prj_Athena_TrapGrenade_ZippyTrout_C::GrenadeHitResult' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_TrapGrenade_ZippyTrout_C, TrapPlaced) == 0x000850, "Member 'AB_Prj_Athena_TrapGrenade_ZippyTrout_C::TrapPlaced' has a wrong offset!");

}

