#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Prj_Athena_DanceGrenade

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "B_Prj_Athena_Grenade_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Prj_Athena_DanceGrenade.B_Prj_Athena_DanceGrenade_C
// 0x0068 (0x0878 - 0x0810)
class AB_Prj_Athena_DanceGrenade_C final : public AB_Prj_Athena_Grenade_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_B_Prj_Athena_DanceGrenade_C;        // 0x0810(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AFortPlayerController*                  ControllerWhoThrew;                                // 0x0818(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestItemDefinition*               QuestItem;                                         // 0x0820(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ObjBackendName;                                    // 0x0828(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDataTableRowHandle                    ObjStat;                                           // 0x0830(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	class USoundBase*                             QuestSuccessSound;                                 // 0x0840(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        QuestSuccessEmitter;                               // 0x0848(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              Target;                                            // 0x0850(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestItemDefinition*               QuestItem_2;                                       // 0x0858(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ObjBackendName_2;                                  // 0x0860(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDataTableRowHandle                    ObjStat_2;                                         // 0x0868(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void ExecuteUbergraph_B_Prj_Athena_DanceGrenade(int32 EntryPoint);
	void OnBeginPlayQuestCheck();
	void ReceiveBeginPlay();
	void Play_Quest_Success_FX();
	void BndEvt__CapsuleComponent_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void FuseEnded();
	void OnBounce(const struct FHitResult& Hit);
	void OnExploded(const TArray<class AActor*>& HitActors, const TArray<struct FHitResult>& HitResults);
	void QuestUpdate();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Prj_Athena_DanceGrenade_C">();
	}
	static class AB_Prj_Athena_DanceGrenade_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Prj_Athena_DanceGrenade_C>();
	}
};
static_assert(alignof(AB_Prj_Athena_DanceGrenade_C) == 0x000008, "Wrong alignment on AB_Prj_Athena_DanceGrenade_C");
static_assert(sizeof(AB_Prj_Athena_DanceGrenade_C) == 0x000878, "Wrong size on AB_Prj_Athena_DanceGrenade_C");
static_assert(offsetof(AB_Prj_Athena_DanceGrenade_C, UberGraphFrame_B_Prj_Athena_DanceGrenade_C) == 0x000810, "Member 'AB_Prj_Athena_DanceGrenade_C::UberGraphFrame_B_Prj_Athena_DanceGrenade_C' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_DanceGrenade_C, ControllerWhoThrew) == 0x000818, "Member 'AB_Prj_Athena_DanceGrenade_C::ControllerWhoThrew' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_DanceGrenade_C, QuestItem) == 0x000820, "Member 'AB_Prj_Athena_DanceGrenade_C::QuestItem' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_DanceGrenade_C, ObjBackendName) == 0x000828, "Member 'AB_Prj_Athena_DanceGrenade_C::ObjBackendName' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_DanceGrenade_C, ObjStat) == 0x000830, "Member 'AB_Prj_Athena_DanceGrenade_C::ObjStat' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_DanceGrenade_C, QuestSuccessSound) == 0x000840, "Member 'AB_Prj_Athena_DanceGrenade_C::QuestSuccessSound' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_DanceGrenade_C, QuestSuccessEmitter) == 0x000848, "Member 'AB_Prj_Athena_DanceGrenade_C::QuestSuccessEmitter' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_DanceGrenade_C, Target) == 0x000850, "Member 'AB_Prj_Athena_DanceGrenade_C::Target' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_DanceGrenade_C, QuestItem_2) == 0x000858, "Member 'AB_Prj_Athena_DanceGrenade_C::QuestItem_2' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_DanceGrenade_C, ObjBackendName_2) == 0x000860, "Member 'AB_Prj_Athena_DanceGrenade_C::ObjBackendName_2' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_DanceGrenade_C, ObjStat_2) == 0x000868, "Member 'AB_Prj_Athena_DanceGrenade_C::ObjStat_2' has a wrong offset!");

}

