#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Prj_Athena_GasGrenade

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Prj_Athena_GasGrenade.B_Prj_Athena_GasGrenade_C
// 0x0208 (0x0980 - 0x0778)
class AB_Prj_Athena_GasGrenade_C final : public AFortProjectileBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0778(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPostProcessComponent*                  PostProcessComponent;                              // 0x0780(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       PostProcessParentShape;                            // 0x0788(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SmokeVolumeMesh;                                   // 0x0790(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               P_GasGrenade_InnerSmoke;                           // 0x0798(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        AudioReleaseSmoke;                                 // 0x07A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      OverlapCapsule;                                    // 0x07A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URotatingMovementComponent*             RotatingMovement;                                  // 0x07B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               SmokeTrail_Particle;                               // 0x07B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Mesh;                                              // 0x07C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        GrenadeFuse_AudioComponent;                        // 0x07C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Effect_Distance;                                   // 0x07D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         FadeSmokeTL_Float_2626207A4A43AC642A80FF89AC59D028; // 0x07D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            FadeSmokeTL__Direction_2626207A4A43AC642A80FF89AC59D028; // 0x07DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7DD[0x3];                                      // 0x07DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     FadeSmokeTL;                                       // 0x07E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Cue_CloseSound;                                    // 0x07E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DoT_TickRate;                                      // 0x07F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GasDuration;                                       // 0x07F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GasGrenadeLifespan;                                // 0x07F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GasDelayBeforeFadeIn;                              // 0x07FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GasFadeOutTime;                                    // 0x0800(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GasFadeInTime;                                     // 0x0804(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               SmokeVolumeMeshMID;                                // 0x0808(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GasGrenadeRadius;                                  // 0x0810(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_814[0x4];                                      // 0x0814(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        Audio_ReleaseSmoke;                                // 0x0818(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CurrentTargetArray;                                // 0x0820(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<class AActor*>                         PreviousTargetArray;                               // 0x0830(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance)
	struct FGameplayEffectQuery                   NewVar_0;                                          // 0x0840(0x0138)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	float                                         SyncedDelay;                                       // 0x0978(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_B_Prj_Athena_GasGrenade(int32 EntryPoint);
	void Update_PostProcess_Scale();
	void Update_Tick_Rate();
	void Update_Gas_Duration();
	void SyncedTimer();
	void FadeOut();
	void FadeIn();
	void DamageTick();
	void Stop_Rotation();
	void OnStop(const struct FHitResult& Hit);
	void FadeSmokeTL__UpdateFunc();
	void FadeSmokeTL__FinishedFunc();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Prj_Athena_GasGrenade_C">();
	}
	static class AB_Prj_Athena_GasGrenade_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Prj_Athena_GasGrenade_C>();
	}
};
static_assert(alignof(AB_Prj_Athena_GasGrenade_C) == 0x000008, "Wrong alignment on AB_Prj_Athena_GasGrenade_C");
static_assert(sizeof(AB_Prj_Athena_GasGrenade_C) == 0x000980, "Wrong size on AB_Prj_Athena_GasGrenade_C");
static_assert(offsetof(AB_Prj_Athena_GasGrenade_C, UberGraphFrame) == 0x000778, "Member 'AB_Prj_Athena_GasGrenade_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_GasGrenade_C, PostProcessComponent) == 0x000780, "Member 'AB_Prj_Athena_GasGrenade_C::PostProcessComponent' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_GasGrenade_C, PostProcessParentShape) == 0x000788, "Member 'AB_Prj_Athena_GasGrenade_C::PostProcessParentShape' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_GasGrenade_C, SmokeVolumeMesh) == 0x000790, "Member 'AB_Prj_Athena_GasGrenade_C::SmokeVolumeMesh' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_GasGrenade_C, P_GasGrenade_InnerSmoke) == 0x000798, "Member 'AB_Prj_Athena_GasGrenade_C::P_GasGrenade_InnerSmoke' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_GasGrenade_C, AudioReleaseSmoke) == 0x0007A0, "Member 'AB_Prj_Athena_GasGrenade_C::AudioReleaseSmoke' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_GasGrenade_C, OverlapCapsule) == 0x0007A8, "Member 'AB_Prj_Athena_GasGrenade_C::OverlapCapsule' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_GasGrenade_C, RotatingMovement) == 0x0007B0, "Member 'AB_Prj_Athena_GasGrenade_C::RotatingMovement' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_GasGrenade_C, SmokeTrail_Particle) == 0x0007B8, "Member 'AB_Prj_Athena_GasGrenade_C::SmokeTrail_Particle' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_GasGrenade_C, Mesh) == 0x0007C0, "Member 'AB_Prj_Athena_GasGrenade_C::Mesh' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_GasGrenade_C, GrenadeFuse_AudioComponent) == 0x0007C8, "Member 'AB_Prj_Athena_GasGrenade_C::GrenadeFuse_AudioComponent' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_GasGrenade_C, Effect_Distance) == 0x0007D0, "Member 'AB_Prj_Athena_GasGrenade_C::Effect_Distance' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_GasGrenade_C, FadeSmokeTL_Float_2626207A4A43AC642A80FF89AC59D028) == 0x0007D8, "Member 'AB_Prj_Athena_GasGrenade_C::FadeSmokeTL_Float_2626207A4A43AC642A80FF89AC59D028' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_GasGrenade_C, FadeSmokeTL__Direction_2626207A4A43AC642A80FF89AC59D028) == 0x0007DC, "Member 'AB_Prj_Athena_GasGrenade_C::FadeSmokeTL__Direction_2626207A4A43AC642A80FF89AC59D028' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_GasGrenade_C, FadeSmokeTL) == 0x0007E0, "Member 'AB_Prj_Athena_GasGrenade_C::FadeSmokeTL' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_GasGrenade_C, Cue_CloseSound) == 0x0007E8, "Member 'AB_Prj_Athena_GasGrenade_C::Cue_CloseSound' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_GasGrenade_C, DoT_TickRate) == 0x0007F0, "Member 'AB_Prj_Athena_GasGrenade_C::DoT_TickRate' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_GasGrenade_C, GasDuration) == 0x0007F4, "Member 'AB_Prj_Athena_GasGrenade_C::GasDuration' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_GasGrenade_C, GasGrenadeLifespan) == 0x0007F8, "Member 'AB_Prj_Athena_GasGrenade_C::GasGrenadeLifespan' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_GasGrenade_C, GasDelayBeforeFadeIn) == 0x0007FC, "Member 'AB_Prj_Athena_GasGrenade_C::GasDelayBeforeFadeIn' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_GasGrenade_C, GasFadeOutTime) == 0x000800, "Member 'AB_Prj_Athena_GasGrenade_C::GasFadeOutTime' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_GasGrenade_C, GasFadeInTime) == 0x000804, "Member 'AB_Prj_Athena_GasGrenade_C::GasFadeInTime' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_GasGrenade_C, SmokeVolumeMeshMID) == 0x000808, "Member 'AB_Prj_Athena_GasGrenade_C::SmokeVolumeMeshMID' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_GasGrenade_C, GasGrenadeRadius) == 0x000810, "Member 'AB_Prj_Athena_GasGrenade_C::GasGrenadeRadius' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_GasGrenade_C, Audio_ReleaseSmoke) == 0x000818, "Member 'AB_Prj_Athena_GasGrenade_C::Audio_ReleaseSmoke' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_GasGrenade_C, CurrentTargetArray) == 0x000820, "Member 'AB_Prj_Athena_GasGrenade_C::CurrentTargetArray' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_GasGrenade_C, PreviousTargetArray) == 0x000830, "Member 'AB_Prj_Athena_GasGrenade_C::PreviousTargetArray' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_GasGrenade_C, NewVar_0) == 0x000840, "Member 'AB_Prj_Athena_GasGrenade_C::NewVar_0' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_GasGrenade_C, SyncedDelay) == 0x000978, "Member 'AB_Prj_Athena_GasGrenade_C::SyncedDelay' has a wrong offset!");

}

