#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Prj_Athena_JollyRascal

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function B_Prj_Athena_JollyRascal.B_Prj_Athena_JollyRascal_C.ExecuteUbergraph_B_Prj_Athena_JollyRascal
// 0x02C0 (0x02C0 - 0x0000)
struct B_Prj_Athena_JollyRascal_C_ExecuteUbergraph_B_Prj_Athena_JollyRascal final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0008(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	class UPrimitiveComponent*                    K2Node_Event_MyComp;                               // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Other;                                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_OtherComp;                            // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bSelfMoved;                           // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_HitLocation;                          // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_HitNormal;                            // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_NormalImpulse;                        // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_Hit;                                  // 0x0058(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          Temp_bool_Variable;                                // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x00E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0100(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x010C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0118(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_SphereTraceSingle_OutHit;                 // 0x0124(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_SphereTraceSingle_ReturnValue;            // 0x01AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1AD[0x3];                                      // 0x01AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x01B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x01BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1BB[0x1];                                      // 0x01BB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x01C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x01D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x01DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x01E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F4[0x4];                                      // 0x01F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0208(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0220(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x022C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Select_Default;                             // 0x0238(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0244(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0250(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AB_Athena_JollyRascal_Spawner_C*        CallFunc_FinishSpawningActor_ReturnValue;          // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_291[0x3];                                      // 0x0291(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_CustomEvent_Location;                       // 0x0294(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x02A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x02AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x02B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Prj_Athena_JollyRascal_C_ExecuteUbergraph_B_Prj_Athena_JollyRascal) == 0x000010, "Wrong alignment on B_Prj_Athena_JollyRascal_C_ExecuteUbergraph_B_Prj_Athena_JollyRascal");
static_assert(sizeof(B_Prj_Athena_JollyRascal_C_ExecuteUbergraph_B_Prj_Athena_JollyRascal) == 0x0002C0, "Wrong size on B_Prj_Athena_JollyRascal_C_ExecuteUbergraph_B_Prj_Athena_JollyRascal");
static_assert(offsetof(B_Prj_Athena_JollyRascal_C_ExecuteUbergraph_B_Prj_Athena_JollyRascal, EntryPoint) == 0x000000, "Member 'B_Prj_Athena_JollyRascal_C_ExecuteUbergraph_B_Prj_Athena_JollyRascal::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_JollyRascal_C_ExecuteUbergraph_B_Prj_Athena_JollyRascal, Temp_object_Variable) == 0x000008, "Member 'B_Prj_Athena_JollyRascal_C_ExecuteUbergraph_B_Prj_Athena_JollyRascal::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_JollyRascal_C_ExecuteUbergraph_B_Prj_Athena_JollyRascal, K2Node_Event_MyComp) == 0x000018, "Member 'B_Prj_Athena_JollyRascal_C_ExecuteUbergraph_B_Prj_Athena_JollyRascal::K2Node_Event_MyComp' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_JollyRascal_C_ExecuteUbergraph_B_Prj_Athena_JollyRascal, K2Node_Event_Other) == 0x000020, "Member 'B_Prj_Athena_JollyRascal_C_ExecuteUbergraph_B_Prj_Athena_JollyRascal::K2Node_Event_Other' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_JollyRascal_C_ExecuteUbergraph_B_Prj_Athena_JollyRascal, K2Node_Event_OtherComp) == 0x000028, "Member 'B_Prj_Athena_JollyRascal_C_ExecuteUbergraph_B_Prj_Athena_JollyRascal::K2Node_Event_OtherComp' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_JollyRascal_C_ExecuteUbergraph_B_Prj_Athena_JollyRascal, K2Node_Event_bSelfMoved) == 0x000030, "Member 'B_Prj_Athena_JollyRascal_C_ExecuteUbergraph_B_Prj_Athena_JollyRascal::K2Node_Event_bSelfMoved' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_JollyRascal_C_ExecuteUbergraph_B_Prj_Athena_JollyRascal, K2Node_Event_HitLocation) == 0x000034, "Member 'B_Prj_Athena_JollyRascal_C_ExecuteUbergraph_B_Prj_Athena_JollyRascal::K2Node_Event_HitLocation' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_JollyRascal_C_ExecuteUbergraph_B_Prj_Athena_JollyRascal, K2Node_Event_HitNormal) == 0x000040, "Member 'B_Prj_Athena_JollyRascal_C_ExecuteUbergraph_B_Prj_Athena_JollyRascal::K2Node_Event_HitNormal' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_JollyRascal_C_ExecuteUbergraph_B_Prj_Athena_JollyRascal, K2Node_Event_NormalImpulse) == 0x00004C, "Member 'B_Prj_Athena_JollyRascal_C_ExecuteUbergraph_B_Prj_Athena_JollyRascal::K2Node_Event_NormalImpulse' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_JollyRascal_C_ExecuteUbergraph_B_Prj_Athena_JollyRascal, K2Node_Event_Hit) == 0x000058, "Member 'B_Prj_Athena_JollyRascal_C_ExecuteUbergraph_B_Prj_Athena_JollyRascal::K2Node_Event_Hit' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_JollyRascal_C_ExecuteUbergraph_B_Prj_Athena_JollyRascal, Temp_bool_Variable) == 0x0000E0, "Member 'B_Prj_Athena_JollyRascal_C_ExecuteUbergraph_B_Prj_Athena_JollyRascal::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_JollyRascal_C_ExecuteUbergraph_B_Prj_Athena_JollyRascal, CallFunc_RandomFloatInRange_ReturnValue) == 0x0000E4, "Member 'B_Prj_Athena_JollyRascal_C_ExecuteUbergraph_B_Prj_Athena_JollyRascal::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_JollyRascal_C_ExecuteUbergraph_B_Prj_Athena_JollyRascal, CallFunc_MakeRotator_ReturnValue) == 0x0000E8, "Member 'B_Prj_Athena_JollyRascal_C_ExecuteUbergraph_B_Prj_Athena_JollyRascal::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_JollyRascal_C_ExecuteUbergraph_B_Prj_Athena_JollyRascal, CallFunc_GetInstigator_ReturnValue) == 0x0000F8, "Member 'B_Prj_Athena_JollyRascal_C_ExecuteUbergraph_B_Prj_Athena_JollyRascal::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_JollyRascal_C_ExecuteUbergraph_B_Prj_Athena_JollyRascal, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000100, "Member 'B_Prj_Athena_JollyRascal_C_ExecuteUbergraph_B_Prj_Athena_JollyRascal::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_JollyRascal_C_ExecuteUbergraph_B_Prj_Athena_JollyRascal, CallFunc_Add_VectorVector_ReturnValue) == 0x00010C, "Member 'B_Prj_Athena_JollyRascal_C_ExecuteUbergraph_B_Prj_Athena_JollyRascal::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_JollyRascal_C_ExecuteUbergraph_B_Prj_Athena_JollyRascal, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000118, "Member 'B_Prj_Athena_JollyRascal_C_ExecuteUbergraph_B_Prj_Athena_JollyRascal::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_JollyRascal_C_ExecuteUbergraph_B_Prj_Athena_JollyRascal, CallFunc_SphereTraceSingle_OutHit) == 0x000124, "Member 'B_Prj_Athena_JollyRascal_C_ExecuteUbergraph_B_Prj_Athena_JollyRascal::CallFunc_SphereTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_JollyRascal_C_ExecuteUbergraph_B_Prj_Athena_JollyRascal, CallFunc_SphereTraceSingle_ReturnValue) == 0x0001AC, "Member 'B_Prj_Athena_JollyRascal_C_ExecuteUbergraph_B_Prj_Athena_JollyRascal::CallFunc_SphereTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_JollyRascal_C_ExecuteUbergraph_B_Prj_Athena_JollyRascal, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x0001B0, "Member 'B_Prj_Athena_JollyRascal_C_ExecuteUbergraph_B_Prj_Athena_JollyRascal::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_JollyRascal_C_ExecuteUbergraph_B_Prj_Athena_JollyRascal, CallFunc_IsValid_ReturnValue) == 0x0001B8, "Member 'B_Prj_Athena_JollyRascal_C_ExecuteUbergraph_B_Prj_Athena_JollyRascal::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_JollyRascal_C_ExecuteUbergraph_B_Prj_Athena_JollyRascal, CallFunc_BreakHitResult_bBlockingHit) == 0x0001B9, "Member 'B_Prj_Athena_JollyRascal_C_ExecuteUbergraph_B_Prj_Athena_JollyRascal::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_JollyRascal_C_ExecuteUbergraph_B_Prj_Athena_JollyRascal, CallFunc_BreakHitResult_bInitialOverlap) == 0x0001BA, "Member 'B_Prj_Athena_JollyRascal_C_ExecuteUbergraph_B_Prj_Athena_JollyRascal::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_JollyRascal_C_ExecuteUbergraph_B_Prj_Athena_JollyRascal, CallFunc_BreakHitResult_Time) == 0x0001BC, "Member 'B_Prj_Athena_JollyRascal_C_ExecuteUbergraph_B_Prj_Athena_JollyRascal::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_JollyRascal_C_ExecuteUbergraph_B_Prj_Athena_JollyRascal, CallFunc_BreakHitResult_Distance) == 0x0001C0, "Member 'B_Prj_Athena_JollyRascal_C_ExecuteUbergraph_B_Prj_Athena_JollyRascal::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_JollyRascal_C_ExecuteUbergraph_B_Prj_Athena_JollyRascal, CallFunc_BreakHitResult_Location) == 0x0001C4, "Member 'B_Prj_Athena_JollyRascal_C_ExecuteUbergraph_B_Prj_Athena_JollyRascal::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_JollyRascal_C_ExecuteUbergraph_B_Prj_Athena_JollyRascal, CallFunc_BreakHitResult_ImpactPoint) == 0x0001D0, "Member 'B_Prj_Athena_JollyRascal_C_ExecuteUbergraph_B_Prj_Athena_JollyRascal::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_JollyRascal_C_ExecuteUbergraph_B_Prj_Athena_JollyRascal, CallFunc_BreakHitResult_Normal) == 0x0001DC, "Member 'B_Prj_Athena_JollyRascal_C_ExecuteUbergraph_B_Prj_Athena_JollyRascal::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_JollyRascal_C_ExecuteUbergraph_B_Prj_Athena_JollyRascal, CallFunc_BreakHitResult_ImpactNormal) == 0x0001E8, "Member 'B_Prj_Athena_JollyRascal_C_ExecuteUbergraph_B_Prj_Athena_JollyRascal::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_JollyRascal_C_ExecuteUbergraph_B_Prj_Athena_JollyRascal, CallFunc_BreakHitResult_PhysMat) == 0x0001F8, "Member 'B_Prj_Athena_JollyRascal_C_ExecuteUbergraph_B_Prj_Athena_JollyRascal::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_JollyRascal_C_ExecuteUbergraph_B_Prj_Athena_JollyRascal, CallFunc_BreakHitResult_HitActor) == 0x000200, "Member 'B_Prj_Athena_JollyRascal_C_ExecuteUbergraph_B_Prj_Athena_JollyRascal::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_JollyRascal_C_ExecuteUbergraph_B_Prj_Athena_JollyRascal, CallFunc_BreakHitResult_HitComponent) == 0x000208, "Member 'B_Prj_Athena_JollyRascal_C_ExecuteUbergraph_B_Prj_Athena_JollyRascal::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_JollyRascal_C_ExecuteUbergraph_B_Prj_Athena_JollyRascal, CallFunc_BreakHitResult_HitBoneName) == 0x000210, "Member 'B_Prj_Athena_JollyRascal_C_ExecuteUbergraph_B_Prj_Athena_JollyRascal::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_JollyRascal_C_ExecuteUbergraph_B_Prj_Athena_JollyRascal, CallFunc_BreakHitResult_HitItem) == 0x000218, "Member 'B_Prj_Athena_JollyRascal_C_ExecuteUbergraph_B_Prj_Athena_JollyRascal::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_JollyRascal_C_ExecuteUbergraph_B_Prj_Athena_JollyRascal, CallFunc_BreakHitResult_FaceIndex) == 0x00021C, "Member 'B_Prj_Athena_JollyRascal_C_ExecuteUbergraph_B_Prj_Athena_JollyRascal::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_JollyRascal_C_ExecuteUbergraph_B_Prj_Athena_JollyRascal, CallFunc_BreakHitResult_TraceStart) == 0x000220, "Member 'B_Prj_Athena_JollyRascal_C_ExecuteUbergraph_B_Prj_Athena_JollyRascal::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_JollyRascal_C_ExecuteUbergraph_B_Prj_Athena_JollyRascal, CallFunc_BreakHitResult_TraceEnd) == 0x00022C, "Member 'B_Prj_Athena_JollyRascal_C_ExecuteUbergraph_B_Prj_Athena_JollyRascal::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_JollyRascal_C_ExecuteUbergraph_B_Prj_Athena_JollyRascal, K2Node_Select_Default) == 0x000238, "Member 'B_Prj_Athena_JollyRascal_C_ExecuteUbergraph_B_Prj_Athena_JollyRascal::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_JollyRascal_C_ExecuteUbergraph_B_Prj_Athena_JollyRascal, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000244, "Member 'B_Prj_Athena_JollyRascal_C_ExecuteUbergraph_B_Prj_Athena_JollyRascal::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_JollyRascal_C_ExecuteUbergraph_B_Prj_Athena_JollyRascal, CallFunc_MakeTransform_ReturnValue) == 0x000250, "Member 'B_Prj_Athena_JollyRascal_C_ExecuteUbergraph_B_Prj_Athena_JollyRascal::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_JollyRascal_C_ExecuteUbergraph_B_Prj_Athena_JollyRascal, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000280, "Member 'B_Prj_Athena_JollyRascal_C_ExecuteUbergraph_B_Prj_Athena_JollyRascal::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_JollyRascal_C_ExecuteUbergraph_B_Prj_Athena_JollyRascal, CallFunc_FinishSpawningActor_ReturnValue) == 0x000288, "Member 'B_Prj_Athena_JollyRascal_C_ExecuteUbergraph_B_Prj_Athena_JollyRascal::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_JollyRascal_C_ExecuteUbergraph_B_Prj_Athena_JollyRascal, CallFunc_IsServer_ReturnValue) == 0x000290, "Member 'B_Prj_Athena_JollyRascal_C_ExecuteUbergraph_B_Prj_Athena_JollyRascal::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_JollyRascal_C_ExecuteUbergraph_B_Prj_Athena_JollyRascal, K2Node_CustomEvent_Location) == 0x000294, "Member 'B_Prj_Athena_JollyRascal_C_ExecuteUbergraph_B_Prj_Athena_JollyRascal::K2Node_CustomEvent_Location' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_JollyRascal_C_ExecuteUbergraph_B_Prj_Athena_JollyRascal, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0002A0, "Member 'B_Prj_Athena_JollyRascal_C_ExecuteUbergraph_B_Prj_Athena_JollyRascal::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_JollyRascal_C_ExecuteUbergraph_B_Prj_Athena_JollyRascal, CallFunc_VSize_ReturnValue) == 0x0002AC, "Member 'B_Prj_Athena_JollyRascal_C_ExecuteUbergraph_B_Prj_Athena_JollyRascal::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_JollyRascal_C_ExecuteUbergraph_B_Prj_Athena_JollyRascal, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0002B0, "Member 'B_Prj_Athena_JollyRascal_C_ExecuteUbergraph_B_Prj_Athena_JollyRascal::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_JollyRascal_C_ExecuteUbergraph_B_Prj_Athena_JollyRascal, CallFunc_MakeVector_ReturnValue) == 0x0002B4, "Member 'B_Prj_Athena_JollyRascal_C_ExecuteUbergraph_B_Prj_Athena_JollyRascal::CallFunc_MakeVector_ReturnValue' has a wrong offset!");

// Function B_Prj_Athena_JollyRascal.B_Prj_Athena_JollyRascal_C.FXandSounds
// 0x000C (0x000C - 0x0000)
struct B_Prj_Athena_JollyRascal_C_FXandSounds final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Prj_Athena_JollyRascal_C_FXandSounds) == 0x000004, "Wrong alignment on B_Prj_Athena_JollyRascal_C_FXandSounds");
static_assert(sizeof(B_Prj_Athena_JollyRascal_C_FXandSounds) == 0x00000C, "Wrong size on B_Prj_Athena_JollyRascal_C_FXandSounds");
static_assert(offsetof(B_Prj_Athena_JollyRascal_C_FXandSounds, Location) == 0x000000, "Member 'B_Prj_Athena_JollyRascal_C_FXandSounds::Location' has a wrong offset!");

// Function B_Prj_Athena_JollyRascal.B_Prj_Athena_JollyRascal_C.ReceiveHit
// 0x00C8 (0x00C8 - 0x0000)
struct B_Prj_Athena_JollyRascal_C_ReceiveHit final
{
public:
	class UPrimitiveComponent*                    MyComp;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Other;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSelfMoved;                                        // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                HitLocation;                                       // 0x001C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitNormal;                                         // 0x0028(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NormalImpulse;                                     // 0x0034(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0040(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(B_Prj_Athena_JollyRascal_C_ReceiveHit) == 0x000008, "Wrong alignment on B_Prj_Athena_JollyRascal_C_ReceiveHit");
static_assert(sizeof(B_Prj_Athena_JollyRascal_C_ReceiveHit) == 0x0000C8, "Wrong size on B_Prj_Athena_JollyRascal_C_ReceiveHit");
static_assert(offsetof(B_Prj_Athena_JollyRascal_C_ReceiveHit, MyComp) == 0x000000, "Member 'B_Prj_Athena_JollyRascal_C_ReceiveHit::MyComp' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_JollyRascal_C_ReceiveHit, Other) == 0x000008, "Member 'B_Prj_Athena_JollyRascal_C_ReceiveHit::Other' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_JollyRascal_C_ReceiveHit, OtherComp) == 0x000010, "Member 'B_Prj_Athena_JollyRascal_C_ReceiveHit::OtherComp' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_JollyRascal_C_ReceiveHit, bSelfMoved) == 0x000018, "Member 'B_Prj_Athena_JollyRascal_C_ReceiveHit::bSelfMoved' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_JollyRascal_C_ReceiveHit, HitLocation) == 0x00001C, "Member 'B_Prj_Athena_JollyRascal_C_ReceiveHit::HitLocation' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_JollyRascal_C_ReceiveHit, HitNormal) == 0x000028, "Member 'B_Prj_Athena_JollyRascal_C_ReceiveHit::HitNormal' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_JollyRascal_C_ReceiveHit, NormalImpulse) == 0x000034, "Member 'B_Prj_Athena_JollyRascal_C_ReceiveHit::NormalImpulse' has a wrong offset!");
static_assert(offsetof(B_Prj_Athena_JollyRascal_C_ReceiveHit, Hit) == 0x000040, "Member 'B_Prj_Athena_JollyRascal_C_ReceiveHit::Hit' has a wrong offset!");

}

