#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Ranged_Flashlight

#include "Basic.hpp"


namespace SDK::Params
{

// Function B_Ranged_Flashlight.B_Ranged_Flashlight_C.ExecuteUbergraph_B_Ranged_Flashlight
// 0x0004 (0x0004 - 0x0000)
struct B_Ranged_Flashlight_C_ExecuteUbergraph_B_Ranged_Flashlight final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Ranged_Flashlight_C_ExecuteUbergraph_B_Ranged_Flashlight) == 0x000004, "Wrong alignment on B_Ranged_Flashlight_C_ExecuteUbergraph_B_Ranged_Flashlight");
static_assert(sizeof(B_Ranged_Flashlight_C_ExecuteUbergraph_B_Ranged_Flashlight) == 0x000004, "Wrong size on B_Ranged_Flashlight_C_ExecuteUbergraph_B_Ranged_Flashlight");
static_assert(offsetof(B_Ranged_Flashlight_C_ExecuteUbergraph_B_Ranged_Flashlight, EntryPoint) == 0x000000, "Member 'B_Ranged_Flashlight_C_ExecuteUbergraph_B_Ranged_Flashlight::EntryPoint' has a wrong offset!");

// Function B_Ranged_Flashlight.B_Ranged_Flashlight_C.UserConstructionScript
// 0x0001 (0x0001 - 0x0000)
struct B_Ranged_Flashlight_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Ranged_Flashlight_C_UserConstructionScript) == 0x000001, "Wrong alignment on B_Ranged_Flashlight_C_UserConstructionScript");
static_assert(sizeof(B_Ranged_Flashlight_C_UserConstructionScript) == 0x000001, "Wrong size on B_Ranged_Flashlight_C_UserConstructionScript");
static_assert(offsetof(B_Ranged_Flashlight_C_UserConstructionScript, CallFunc_IsDedicatedServer_ReturnValue) == 0x000000, "Member 'B_Ranged_Flashlight_C_UserConstructionScript::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");

// Function B_Ranged_Flashlight.B_Ranged_Flashlight_C.InitLightShadowQuality
// 0x0038 (0x0038 - 0x0000)
struct B_Ranged_Flashlight_C_InitLightShadowQuality final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetShadowQuality_ReturnValue;             // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     K2Node_Select_Default_1;                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Ranged_Flashlight_C_InitLightShadowQuality) == 0x000008, "Wrong alignment on B_Ranged_Flashlight_C_InitLightShadowQuality");
static_assert(sizeof(B_Ranged_Flashlight_C_InitLightShadowQuality) == 0x000038, "Wrong size on B_Ranged_Flashlight_C_InitLightShadowQuality");
static_assert(offsetof(B_Ranged_Flashlight_C_InitLightShadowQuality, Temp_bool_Variable) == 0x000000, "Member 'B_Ranged_Flashlight_C_InitLightShadowQuality::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(B_Ranged_Flashlight_C_InitLightShadowQuality, Temp_object_Variable) == 0x000008, "Member 'B_Ranged_Flashlight_C_InitLightShadowQuality::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(B_Ranged_Flashlight_C_InitLightShadowQuality, CallFunc_IsDedicatedServer_ReturnValue) == 0x000010, "Member 'B_Ranged_Flashlight_C_InitLightShadowQuality::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Flashlight_C_InitLightShadowQuality, Temp_bool_Variable_1) == 0x000011, "Member 'B_Ranged_Flashlight_C_InitLightShadowQuality::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(B_Ranged_Flashlight_C_InitLightShadowQuality, CallFunc_GetGameUserSettings_ReturnValue) == 0x000018, "Member 'B_Ranged_Flashlight_C_InitLightShadowQuality::CallFunc_GetGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Flashlight_C_InitLightShadowQuality, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000020, "Member 'B_Ranged_Flashlight_C_InitLightShadowQuality::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Flashlight_C_InitLightShadowQuality, CallFunc_GetShadowQuality_ReturnValue) == 0x000024, "Member 'B_Ranged_Flashlight_C_InitLightShadowQuality::CallFunc_GetShadowQuality_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Flashlight_C_InitLightShadowQuality, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000028, "Member 'B_Ranged_Flashlight_C_InitLightShadowQuality::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Flashlight_C_InitLightShadowQuality, K2Node_Select_Default) == 0x00002C, "Member 'B_Ranged_Flashlight_C_InitLightShadowQuality::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(B_Ranged_Flashlight_C_InitLightShadowQuality, K2Node_Select_Default_1) == 0x000030, "Member 'B_Ranged_Flashlight_C_InitLightShadowQuality::K2Node_Select_Default_1' has a wrong offset!");

// Function B_Ranged_Flashlight.B_Ranged_Flashlight_C.InitComponents
// 0x0010 (0x0010 - 0x0000)
struct B_Ranged_Flashlight_C_InitComponents final
{
public:
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Ranged_Flashlight_C_InitComponents) == 0x000008, "Wrong alignment on B_Ranged_Flashlight_C_InitComponents");
static_assert(sizeof(B_Ranged_Flashlight_C_InitComponents) == 0x000010, "Wrong size on B_Ranged_Flashlight_C_InitComponents");
static_assert(offsetof(B_Ranged_Flashlight_C_InitComponents, CallFunc_IsDedicatedServer_ReturnValue) == 0x000000, "Member 'B_Ranged_Flashlight_C_InitComponents::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Flashlight_C_InitComponents, CallFunc_SpawnSoundAttached_ReturnValue) == 0x000008, "Member 'B_Ranged_Flashlight_C_InitComponents::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");

// Function B_Ranged_Flashlight.B_Ranged_Flashlight_C.SetMobileShadowsOff
// 0x0010 (0x0010 - 0x0000)
struct B_Ranged_Flashlight_C_SetMobileShadowsOff final
{
public:
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetShadowQuality_ReturnValue;             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Ranged_Flashlight_C_SetMobileShadowsOff) == 0x000008, "Wrong alignment on B_Ranged_Flashlight_C_SetMobileShadowsOff");
static_assert(sizeof(B_Ranged_Flashlight_C_SetMobileShadowsOff) == 0x000010, "Wrong size on B_Ranged_Flashlight_C_SetMobileShadowsOff");
static_assert(offsetof(B_Ranged_Flashlight_C_SetMobileShadowsOff, CallFunc_GetGameUserSettings_ReturnValue) == 0x000000, "Member 'B_Ranged_Flashlight_C_SetMobileShadowsOff::CallFunc_GetGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Flashlight_C_SetMobileShadowsOff, CallFunc_GetShadowQuality_ReturnValue) == 0x000008, "Member 'B_Ranged_Flashlight_C_SetMobileShadowsOff::CallFunc_GetShadowQuality_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Flashlight_C_SetMobileShadowsOff, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00000C, "Member 'B_Ranged_Flashlight_C_SetMobileShadowsOff::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Flashlight_C_SetMobileShadowsOff, CallFunc_Not_PreBool_ReturnValue) == 0x00000D, "Member 'B_Ranged_Flashlight_C_SetMobileShadowsOff::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

}

