#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Ranged_GenericMountedCannon

#include "Basic.hpp"

#include "En_ShellTypes_01_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Ranged_GenericMountedCannon.B_Ranged_GenericMountedCannon_C
// 0x0180 (0x0E58 - 0x0CD8)
class AB_Ranged_GenericMountedCannon_C : public AFortWeaponRangedMountedCannon
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0CD8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               Muzzle1P_Empty_;                                   // 0x0CE0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   IronSightsMesh1P;                                  // 0x0CE8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               MuzzleWindParticle_Empty_;                         // 0x0CF0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Reload_Empty_;                                     // 0x0CF8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPostProcessComponent*                  SecondDownScopePostProcess;                        // 0x0D00(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Shells_empty_;                                     // 0x0D08(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPostProcessComponent*                  DownScopePostProcess;                              // 0x0D10(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   ScopeMesh1P;                                       // 0x0D18(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Muzzle_Empty_;                                     // 0x0D20(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         AnimateScopePostProcess_DownSightPostProcessAmount_E57F8A624B0326DDF7A607AB2B92D195; // 0x0D28(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            AnimateScopePostProcess__Direction_E57F8A624B0326DDF7A607AB2B92D195; // 0x0D2C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D2D[0x3];                                      // 0x0D2D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     AnimateScopePostProcess;                           // 0x0D30(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        MuzzleParticleSystem;                              // 0x0D38(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        WeaponDurabilityDestroyEffect;                     // 0x0D40(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        WeaponDurabilityDestroyEffectIcon;                 // 0x0D48(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseDestroyEffect;                                  // 0x0D50(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Use_Reload_Particles;                              // 0x0D51(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D52[0x6];                                      // 0x0D52(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        Reload_ParticleSystem;                             // 0x0D58(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LastPlayFXTime;                                    // 0x0D60(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MinPlayFXTime;                                     // 0x0D64(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseShellsOnFire_;                                  // 0x0D68(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          UseShellsOnReload_;                                // 0x0D69(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          UseShellsOnPump_;                                  // 0x0D6A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D6B[0x5];                                      // 0x0D6B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        ShellsParticleSystemTemplate;                      // 0x0D70(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ReloadSocketName;                                  // 0x0D78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AFortAIPawn*>                    Array_Of_Active_Enemy_AI;                          // 0x0D80(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance)
	bool                                          Scope___Render_Enemies_To_Custom_Depth_Buffer;     // 0x0D90(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_D91[0x3];                                      // 0x0D91(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Shells_Socket_Name;                                // 0x0D94(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	En_ShellTypes_01                              ShellTypeSelect;                                   // 0x0D9C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9D[0x3];                                      // 0x0D9D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Shells_Spawn_Rate_Scale;                           // 0x0DA0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ShellsRotationRate;                                // 0x0DA4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Shells_Velocity;                                   // 0x0DB0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Shells_Gravity;                                    // 0x0DBC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Shells_Lifetime;                                   // 0x0DC8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Shells_Size;                                       // 0x0DCC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Shells_Time_Dilation;                              // 0x0DD8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Target_Scope_Vignette_Blur_Screen_Percentage;      // 0x0DDC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Scope_Camera_Offset_Amount;                        // 0x0DE0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          SmallShells;                                       // 0x0DE4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          MediumShells;                                      // 0x0DE5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          LargeShells;                                       // 0x0DE6(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ShotgunShells;                                     // 0x0DE7(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          EnergyShells;                                      // 0x0DE8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DE9[0x3];                                      // 0x0DE9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Inherit_Parent_Velocity;                           // 0x0DEC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Cylindrical_Radius;                                // 0x0DF0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Cylindrical_Height;                                // 0x0DF4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DebugShellsSocket_;                                // 0x0DF8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Use_2_Post_Processes_For_the_Scope;                // 0x0DF9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_DFA[0x6];                                      // 0x0DFA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Sound_ScopeZoomIn;                                 // 0x0E00(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Sound_ScopeZoomOut;                                // 0x0E08(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Alteration_Ambient_PS;                             // 0x0E10(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  ReticleHUDElementTags;                             // 0x0E18(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          Is_Wind_Enabled;                                   // 0x0E38(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E39[0x7];                                      // 0x0E39(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        MuzzleWindParticleSystem;                          // 0x0E40(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        MuzzleParticleSystem1P;                            // 0x0E48(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldHideReticleAfterDelay;                       // 0x0E50(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_B_Ranged_GenericMountedCannon(int32 EntryPoint);
	void ShowWeapon();
	void HideWeapon();
	void ShowGunMesh();
	void HideGunMesh();
	void ShowWeaponMesh();
	void HideWeaponMesh();
	void OnWeaponVisibilityChanged(bool bVisible);
	void ReceiveBeginPlay();
	void SetWeaponPierceThrough_ClientRep(bool Enable, int32 TargetLimit);
	void SetWeaponPierceThrough(bool Enable, int32 TargetLimit);
	void OnEquippedWeaponDestory();
	void ShellsON__onPump_();
	void OnInitCosmeticAlterations(const struct FFortCosmeticModification& CosmeticMod);
	void OnInitAlteration(class UFortAlterationItemDefinition* NewAlteration);
	void OnWeaponAttached();
	void Update_Enemy_Custom_Depths(bool Enable_Or_Disable, int32 StencilBufferValue);
	void InitializeScopeVariables();
	void K2_OnUnEquip();
	void OnSetTargeting(bool bNewIsTargeting);
	void OnPlayReloadFX(EFortReloadFXState ReloadStage);
	void OnStopWeaponFireFX();
	void OnPlayWeaponFireFX(bool bPersistentFire, bool bSecondaryFire);
	void OnLoaded_CD8718E64EA83A512EE3B892656574CE(class UObject* Loaded);
	void OnLoaded_16CAFB6E4E8091866C2642A669D4DCF7(class UObject* Loaded);
	void OnLoaded_941B4D03491F957EF97917BFF1EF6B00(class UObject* Loaded);
	void OnLoaded_575FCB5443E495736B8BE6BBC3D41E8C(class UObject* Loaded);
	void AnimateScopePostProcess__UpdateFunc();
	void AnimateScopePostProcess__FinishedFunc();
	void UserConstructionScript();
	void AddRandomScale();
	void SetWpnRarity();
	void Muzzle_Flash_FX(bool Persistent_Fire);
	void Muzzle_Play_Reload_FX(EFortReloadFXState Selection);
	void UpdateShellEmittersFX();
	void SetupShellFX();
	void DeactivateShellsFX();
	void ActivateShellsFX(bool Bool);
	void ActivateReloadSmokeFX();
	void DeactivateReloadSmokeFX();
	void DeactivateMuzzleFX();
	void ActivateOrDeactivateWindParticle(bool bNewActive);
	void HideIronSightsMesh();
	void HideReticle();
	void ShowReticle();
	void HandlePawnAndWeaponVisFor1PTargeting(bool IsTargeting);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Ranged_GenericMountedCannon_C">();
	}
	static class AB_Ranged_GenericMountedCannon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Ranged_GenericMountedCannon_C>();
	}
};
static_assert(alignof(AB_Ranged_GenericMountedCannon_C) == 0x000008, "Wrong alignment on AB_Ranged_GenericMountedCannon_C");
static_assert(sizeof(AB_Ranged_GenericMountedCannon_C) == 0x000E58, "Wrong size on AB_Ranged_GenericMountedCannon_C");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, UberGraphFrame) == 0x000CD8, "Member 'AB_Ranged_GenericMountedCannon_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, Muzzle1P_Empty_) == 0x000CE0, "Member 'AB_Ranged_GenericMountedCannon_C::Muzzle1P_Empty_' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, IronSightsMesh1P) == 0x000CE8, "Member 'AB_Ranged_GenericMountedCannon_C::IronSightsMesh1P' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, MuzzleWindParticle_Empty_) == 0x000CF0, "Member 'AB_Ranged_GenericMountedCannon_C::MuzzleWindParticle_Empty_' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, Reload_Empty_) == 0x000CF8, "Member 'AB_Ranged_GenericMountedCannon_C::Reload_Empty_' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, SecondDownScopePostProcess) == 0x000D00, "Member 'AB_Ranged_GenericMountedCannon_C::SecondDownScopePostProcess' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, Shells_empty_) == 0x000D08, "Member 'AB_Ranged_GenericMountedCannon_C::Shells_empty_' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, DownScopePostProcess) == 0x000D10, "Member 'AB_Ranged_GenericMountedCannon_C::DownScopePostProcess' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, ScopeMesh1P) == 0x000D18, "Member 'AB_Ranged_GenericMountedCannon_C::ScopeMesh1P' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, Muzzle_Empty_) == 0x000D20, "Member 'AB_Ranged_GenericMountedCannon_C::Muzzle_Empty_' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, AnimateScopePostProcess_DownSightPostProcessAmount_E57F8A624B0326DDF7A607AB2B92D195) == 0x000D28, "Member 'AB_Ranged_GenericMountedCannon_C::AnimateScopePostProcess_DownSightPostProcessAmount_E57F8A624B0326DDF7A607AB2B92D195' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, AnimateScopePostProcess__Direction_E57F8A624B0326DDF7A607AB2B92D195) == 0x000D2C, "Member 'AB_Ranged_GenericMountedCannon_C::AnimateScopePostProcess__Direction_E57F8A624B0326DDF7A607AB2B92D195' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, AnimateScopePostProcess) == 0x000D30, "Member 'AB_Ranged_GenericMountedCannon_C::AnimateScopePostProcess' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, MuzzleParticleSystem) == 0x000D38, "Member 'AB_Ranged_GenericMountedCannon_C::MuzzleParticleSystem' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, WeaponDurabilityDestroyEffect) == 0x000D40, "Member 'AB_Ranged_GenericMountedCannon_C::WeaponDurabilityDestroyEffect' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, WeaponDurabilityDestroyEffectIcon) == 0x000D48, "Member 'AB_Ranged_GenericMountedCannon_C::WeaponDurabilityDestroyEffectIcon' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, UseDestroyEffect) == 0x000D50, "Member 'AB_Ranged_GenericMountedCannon_C::UseDestroyEffect' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, Use_Reload_Particles) == 0x000D51, "Member 'AB_Ranged_GenericMountedCannon_C::Use_Reload_Particles' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, Reload_ParticleSystem) == 0x000D58, "Member 'AB_Ranged_GenericMountedCannon_C::Reload_ParticleSystem' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, LastPlayFXTime) == 0x000D60, "Member 'AB_Ranged_GenericMountedCannon_C::LastPlayFXTime' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, MinPlayFXTime) == 0x000D64, "Member 'AB_Ranged_GenericMountedCannon_C::MinPlayFXTime' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, UseShellsOnFire_) == 0x000D68, "Member 'AB_Ranged_GenericMountedCannon_C::UseShellsOnFire_' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, UseShellsOnReload_) == 0x000D69, "Member 'AB_Ranged_GenericMountedCannon_C::UseShellsOnReload_' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, UseShellsOnPump_) == 0x000D6A, "Member 'AB_Ranged_GenericMountedCannon_C::UseShellsOnPump_' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, ShellsParticleSystemTemplate) == 0x000D70, "Member 'AB_Ranged_GenericMountedCannon_C::ShellsParticleSystemTemplate' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, ReloadSocketName) == 0x000D78, "Member 'AB_Ranged_GenericMountedCannon_C::ReloadSocketName' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, Array_Of_Active_Enemy_AI) == 0x000D80, "Member 'AB_Ranged_GenericMountedCannon_C::Array_Of_Active_Enemy_AI' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, Scope___Render_Enemies_To_Custom_Depth_Buffer) == 0x000D90, "Member 'AB_Ranged_GenericMountedCannon_C::Scope___Render_Enemies_To_Custom_Depth_Buffer' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, Shells_Socket_Name) == 0x000D94, "Member 'AB_Ranged_GenericMountedCannon_C::Shells_Socket_Name' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, ShellTypeSelect) == 0x000D9C, "Member 'AB_Ranged_GenericMountedCannon_C::ShellTypeSelect' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, Shells_Spawn_Rate_Scale) == 0x000DA0, "Member 'AB_Ranged_GenericMountedCannon_C::Shells_Spawn_Rate_Scale' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, ShellsRotationRate) == 0x000DA4, "Member 'AB_Ranged_GenericMountedCannon_C::ShellsRotationRate' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, Shells_Velocity) == 0x000DB0, "Member 'AB_Ranged_GenericMountedCannon_C::Shells_Velocity' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, Shells_Gravity) == 0x000DBC, "Member 'AB_Ranged_GenericMountedCannon_C::Shells_Gravity' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, Shells_Lifetime) == 0x000DC8, "Member 'AB_Ranged_GenericMountedCannon_C::Shells_Lifetime' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, Shells_Size) == 0x000DCC, "Member 'AB_Ranged_GenericMountedCannon_C::Shells_Size' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, Shells_Time_Dilation) == 0x000DD8, "Member 'AB_Ranged_GenericMountedCannon_C::Shells_Time_Dilation' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, Target_Scope_Vignette_Blur_Screen_Percentage) == 0x000DDC, "Member 'AB_Ranged_GenericMountedCannon_C::Target_Scope_Vignette_Blur_Screen_Percentage' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, Scope_Camera_Offset_Amount) == 0x000DE0, "Member 'AB_Ranged_GenericMountedCannon_C::Scope_Camera_Offset_Amount' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, SmallShells) == 0x000DE4, "Member 'AB_Ranged_GenericMountedCannon_C::SmallShells' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, MediumShells) == 0x000DE5, "Member 'AB_Ranged_GenericMountedCannon_C::MediumShells' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, LargeShells) == 0x000DE6, "Member 'AB_Ranged_GenericMountedCannon_C::LargeShells' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, ShotgunShells) == 0x000DE7, "Member 'AB_Ranged_GenericMountedCannon_C::ShotgunShells' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, EnergyShells) == 0x000DE8, "Member 'AB_Ranged_GenericMountedCannon_C::EnergyShells' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, Inherit_Parent_Velocity) == 0x000DEC, "Member 'AB_Ranged_GenericMountedCannon_C::Inherit_Parent_Velocity' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, Cylindrical_Radius) == 0x000DF0, "Member 'AB_Ranged_GenericMountedCannon_C::Cylindrical_Radius' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, Cylindrical_Height) == 0x000DF4, "Member 'AB_Ranged_GenericMountedCannon_C::Cylindrical_Height' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, DebugShellsSocket_) == 0x000DF8, "Member 'AB_Ranged_GenericMountedCannon_C::DebugShellsSocket_' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, Use_2_Post_Processes_For_the_Scope) == 0x000DF9, "Member 'AB_Ranged_GenericMountedCannon_C::Use_2_Post_Processes_For_the_Scope' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, Sound_ScopeZoomIn) == 0x000E00, "Member 'AB_Ranged_GenericMountedCannon_C::Sound_ScopeZoomIn' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, Sound_ScopeZoomOut) == 0x000E08, "Member 'AB_Ranged_GenericMountedCannon_C::Sound_ScopeZoomOut' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, Alteration_Ambient_PS) == 0x000E10, "Member 'AB_Ranged_GenericMountedCannon_C::Alteration_Ambient_PS' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, ReticleHUDElementTags) == 0x000E18, "Member 'AB_Ranged_GenericMountedCannon_C::ReticleHUDElementTags' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, Is_Wind_Enabled) == 0x000E38, "Member 'AB_Ranged_GenericMountedCannon_C::Is_Wind_Enabled' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, MuzzleWindParticleSystem) == 0x000E40, "Member 'AB_Ranged_GenericMountedCannon_C::MuzzleWindParticleSystem' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, MuzzleParticleSystem1P) == 0x000E48, "Member 'AB_Ranged_GenericMountedCannon_C::MuzzleParticleSystem1P' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, ShouldHideReticleAfterDelay) == 0x000E50, "Member 'AB_Ranged_GenericMountedCannon_C::ShouldHideReticleAfterDelay' has a wrong offset!");

}

