#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_TNT_Athena

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function B_TNT_Athena.B_TNT_Athena_C.Spline Point Locations
// 0x00D0 (0x00D0 - 0x0000)
struct B_TNT_Athena_C_Spline_Point_Locations final
{
public:
	TArray<struct FVector>                        Array;                                             // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor)
	class USkeletalMeshComponentBudgeted*         CallFunc_GetWeaponMesh_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0xC];                                       // 0x0024(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0030(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_1;          // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_InverseTransformLocation_ReturnValue;     // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_InverseTransformLocation_ReturnValue_1;   // 0x0078(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_2;          // 0x0084(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_3;          // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_InverseTransformLocation_ReturnValue_2;   // 0x009C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_InverseTransformLocation_ReturnValue_3;   // 0x00A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector>                        K2Node_MakeArray_Array;                            // 0x00B8(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
};
static_assert(alignof(B_TNT_Athena_C_Spline_Point_Locations) == 0x000010, "Wrong alignment on B_TNT_Athena_C_Spline_Point_Locations");
static_assert(sizeof(B_TNT_Athena_C_Spline_Point_Locations) == 0x0000D0, "Wrong size on B_TNT_Athena_C_Spline_Point_Locations");
static_assert(offsetof(B_TNT_Athena_C_Spline_Point_Locations, Array) == 0x000000, "Member 'B_TNT_Athena_C_Spline_Point_Locations::Array' has a wrong offset!");
static_assert(offsetof(B_TNT_Athena_C_Spline_Point_Locations, CallFunc_GetWeaponMesh_ReturnValue) == 0x000010, "Member 'B_TNT_Athena_C_Spline_Point_Locations::CallFunc_GetWeaponMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TNT_Athena_C_Spline_Point_Locations, CallFunc_GetSocketLocation_ReturnValue) == 0x000018, "Member 'B_TNT_Athena_C_Spline_Point_Locations::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TNT_Athena_C_Spline_Point_Locations, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000030, "Member 'B_TNT_Athena_C_Spline_Point_Locations::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TNT_Athena_C_Spline_Point_Locations, CallFunc_GetSocketLocation_ReturnValue_1) == 0x000060, "Member 'B_TNT_Athena_C_Spline_Point_Locations::CallFunc_GetSocketLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_TNT_Athena_C_Spline_Point_Locations, CallFunc_InverseTransformLocation_ReturnValue) == 0x00006C, "Member 'B_TNT_Athena_C_Spline_Point_Locations::CallFunc_InverseTransformLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_TNT_Athena_C_Spline_Point_Locations, CallFunc_InverseTransformLocation_ReturnValue_1) == 0x000078, "Member 'B_TNT_Athena_C_Spline_Point_Locations::CallFunc_InverseTransformLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_TNT_Athena_C_Spline_Point_Locations, CallFunc_GetSocketLocation_ReturnValue_2) == 0x000084, "Member 'B_TNT_Athena_C_Spline_Point_Locations::CallFunc_GetSocketLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_TNT_Athena_C_Spline_Point_Locations, CallFunc_GetSocketLocation_ReturnValue_3) == 0x000090, "Member 'B_TNT_Athena_C_Spline_Point_Locations::CallFunc_GetSocketLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(B_TNT_Athena_C_Spline_Point_Locations, CallFunc_InverseTransformLocation_ReturnValue_2) == 0x00009C, "Member 'B_TNT_Athena_C_Spline_Point_Locations::CallFunc_InverseTransformLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_TNT_Athena_C_Spline_Point_Locations, CallFunc_InverseTransformLocation_ReturnValue_3) == 0x0000A8, "Member 'B_TNT_Athena_C_Spline_Point_Locations::CallFunc_InverseTransformLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(B_TNT_Athena_C_Spline_Point_Locations, K2Node_MakeArray_Array) == 0x0000B8, "Member 'B_TNT_Athena_C_Spline_Point_Locations::K2Node_MakeArray_Array' has a wrong offset!");

}

