#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BattlePassViewRewardsScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BattlePassViewRewardsScreen.BattlePassViewRewardsScreen_C
// 0x0058 (0x0510 - 0x04B8)
class UBattlePassViewRewardsScreen_C final : public UBattlePassViewAllRewardsScreen
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       PageIntro;                                         // 0x04C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SortIntro;                                         // 0x04C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UAthenaLockedStyleNotification_C*       AthenaLockedStyleNotification;                     // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CloseIcon;                                         // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UItemInfoHeaderWidget_C*                ItemInfoHeaderWidget;                              // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPanelButton_C*                         MobileCloseButton;                                 // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               OverlayCloseButton;                                // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               PreviewItemArea;                                   // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_108;                                      // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       SubHeader;                                         // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void HandleMobileClosed(bool* PassThrough);
	void CloseScreen(bool* bPassThrough);
	class UWidget* GetWidgetForFramingViewedItem();
	void OnItemViewed(const class UBattlePassViewRewardData* ItemDisplayed);
	void Construct();
	void BndEvt__Button_CycleSort_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void OnInitialized();
	void BndEvt__MobileCloseButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void ExecuteUbergraph_BattlePassViewRewardsScreen(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BattlePassViewRewardsScreen_C">();
	}
	static class UBattlePassViewRewardsScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBattlePassViewRewardsScreen_C>();
	}
};
static_assert(alignof(UBattlePassViewRewardsScreen_C) == 0x000008, "Wrong alignment on UBattlePassViewRewardsScreen_C");
static_assert(sizeof(UBattlePassViewRewardsScreen_C) == 0x000510, "Wrong size on UBattlePassViewRewardsScreen_C");
static_assert(offsetof(UBattlePassViewRewardsScreen_C, UberGraphFrame) == 0x0004B8, "Member 'UBattlePassViewRewardsScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBattlePassViewRewardsScreen_C, PageIntro) == 0x0004C0, "Member 'UBattlePassViewRewardsScreen_C::PageIntro' has a wrong offset!");
static_assert(offsetof(UBattlePassViewRewardsScreen_C, SortIntro) == 0x0004C8, "Member 'UBattlePassViewRewardsScreen_C::SortIntro' has a wrong offset!");
static_assert(offsetof(UBattlePassViewRewardsScreen_C, AthenaLockedStyleNotification) == 0x0004D0, "Member 'UBattlePassViewRewardsScreen_C::AthenaLockedStyleNotification' has a wrong offset!");
static_assert(offsetof(UBattlePassViewRewardsScreen_C, CloseIcon) == 0x0004D8, "Member 'UBattlePassViewRewardsScreen_C::CloseIcon' has a wrong offset!");
static_assert(offsetof(UBattlePassViewRewardsScreen_C, ItemInfoHeaderWidget) == 0x0004E0, "Member 'UBattlePassViewRewardsScreen_C::ItemInfoHeaderWidget' has a wrong offset!");
static_assert(offsetof(UBattlePassViewRewardsScreen_C, MobileCloseButton) == 0x0004E8, "Member 'UBattlePassViewRewardsScreen_C::MobileCloseButton' has a wrong offset!");
static_assert(offsetof(UBattlePassViewRewardsScreen_C, OverlayCloseButton) == 0x0004F0, "Member 'UBattlePassViewRewardsScreen_C::OverlayCloseButton' has a wrong offset!");
static_assert(offsetof(UBattlePassViewRewardsScreen_C, PreviewItemArea) == 0x0004F8, "Member 'UBattlePassViewRewardsScreen_C::PreviewItemArea' has a wrong offset!");
static_assert(offsetof(UBattlePassViewRewardsScreen_C, SafeZone_108) == 0x000500, "Member 'UBattlePassViewRewardsScreen_C::SafeZone_108' has a wrong offset!");
static_assert(offsetof(UBattlePassViewRewardsScreen_C, SubHeader) == 0x000508, "Member 'UBattlePassViewRewardsScreen_C::SubHeader' has a wrong offset!");

}

