#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BattleScreenPagePip

#include "Basic.hpp"


namespace SDK::Params
{

// Function BattleScreenPagePip.BattleScreenPagePip_C.OnSetPipActive
// 0x0001 (0x0001 - 0x0000)
struct BattleScreenPagePip_C_OnSetPipActive final
{
public:
	bool                                          bActive;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BattleScreenPagePip_C_OnSetPipActive) == 0x000001, "Wrong alignment on BattleScreenPagePip_C_OnSetPipActive");
static_assert(sizeof(BattleScreenPagePip_C_OnSetPipActive) == 0x000001, "Wrong size on BattleScreenPagePip_C_OnSetPipActive");
static_assert(offsetof(BattleScreenPagePip_C_OnSetPipActive, bActive) == 0x000000, "Member 'BattleScreenPagePip_C_OnSetPipActive::bActive' has a wrong offset!");

// Function BattleScreenPagePip.BattleScreenPagePip_C.ExecuteUbergraph_BattleScreenPagePip
// 0x0008 (0x0008 - 0x0000)
struct BattleScreenPagePip_C_ExecuteUbergraph_BattleScreenPagePip final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bActive;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BattleScreenPagePip_C_ExecuteUbergraph_BattleScreenPagePip) == 0x000004, "Wrong alignment on BattleScreenPagePip_C_ExecuteUbergraph_BattleScreenPagePip");
static_assert(sizeof(BattleScreenPagePip_C_ExecuteUbergraph_BattleScreenPagePip) == 0x000008, "Wrong size on BattleScreenPagePip_C_ExecuteUbergraph_BattleScreenPagePip");
static_assert(offsetof(BattleScreenPagePip_C_ExecuteUbergraph_BattleScreenPagePip, EntryPoint) == 0x000000, "Member 'BattleScreenPagePip_C_ExecuteUbergraph_BattleScreenPagePip::EntryPoint' has a wrong offset!");
static_assert(offsetof(BattleScreenPagePip_C_ExecuteUbergraph_BattleScreenPagePip, K2Node_Event_bActive) == 0x000004, "Member 'BattleScreenPagePip_C_ExecuteUbergraph_BattleScreenPagePip::K2Node_Event_bActive' has a wrong offset!");

}

