#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BattlePassOverviewVideo

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BattlePassOverviewVideo.BattlePassOverviewVideo_C
// 0x0060 (0x0418 - 0x03B8)
class UBattlePassOverviewVideo_C final : public UFortActivatableVideoPanel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       TitleIntro;                                        // 0x03C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BackingGlow;                                       // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BlackSlate;                                        // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BPLogo;                                            // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Cyan_LowerGlow_Left;                               // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Cyan_LowerGlow_Right;                              // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FortniteLogo;                                      // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageThrobberBackground;                           // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              MainSafeZone;                                      // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Shadow;                                            // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TopHighlight;                                      // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void OnDeactivated();
	void OnActivated();
	void MediaOpened();
	void PreConstruct(bool IsDesignTime);
	void ExecuteUbergraph_BattlePassOverviewVideo(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BattlePassOverviewVideo_C">();
	}
	static class UBattlePassOverviewVideo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBattlePassOverviewVideo_C>();
	}
};
static_assert(alignof(UBattlePassOverviewVideo_C) == 0x000008, "Wrong alignment on UBattlePassOverviewVideo_C");
static_assert(sizeof(UBattlePassOverviewVideo_C) == 0x000418, "Wrong size on UBattlePassOverviewVideo_C");
static_assert(offsetof(UBattlePassOverviewVideo_C, UberGraphFrame) == 0x0003B8, "Member 'UBattlePassOverviewVideo_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBattlePassOverviewVideo_C, TitleIntro) == 0x0003C0, "Member 'UBattlePassOverviewVideo_C::TitleIntro' has a wrong offset!");
static_assert(offsetof(UBattlePassOverviewVideo_C, BackingGlow) == 0x0003C8, "Member 'UBattlePassOverviewVideo_C::BackingGlow' has a wrong offset!");
static_assert(offsetof(UBattlePassOverviewVideo_C, BlackSlate) == 0x0003D0, "Member 'UBattlePassOverviewVideo_C::BlackSlate' has a wrong offset!");
static_assert(offsetof(UBattlePassOverviewVideo_C, BPLogo) == 0x0003D8, "Member 'UBattlePassOverviewVideo_C::BPLogo' has a wrong offset!");
static_assert(offsetof(UBattlePassOverviewVideo_C, Cyan_LowerGlow_Left) == 0x0003E0, "Member 'UBattlePassOverviewVideo_C::Cyan_LowerGlow_Left' has a wrong offset!");
static_assert(offsetof(UBattlePassOverviewVideo_C, Cyan_LowerGlow_Right) == 0x0003E8, "Member 'UBattlePassOverviewVideo_C::Cyan_LowerGlow_Right' has a wrong offset!");
static_assert(offsetof(UBattlePassOverviewVideo_C, FortniteLogo) == 0x0003F0, "Member 'UBattlePassOverviewVideo_C::FortniteLogo' has a wrong offset!");
static_assert(offsetof(UBattlePassOverviewVideo_C, ImageThrobberBackground) == 0x0003F8, "Member 'UBattlePassOverviewVideo_C::ImageThrobberBackground' has a wrong offset!");
static_assert(offsetof(UBattlePassOverviewVideo_C, MainSafeZone) == 0x000400, "Member 'UBattlePassOverviewVideo_C::MainSafeZone' has a wrong offset!");
static_assert(offsetof(UBattlePassOverviewVideo_C, Shadow) == 0x000408, "Member 'UBattlePassOverviewVideo_C::Shadow' has a wrong offset!");
static_assert(offsetof(UBattlePassOverviewVideo_C, TopHighlight) == 0x000410, "Member 'UBattlePassOverviewVideo_C::TopHighlight' has a wrong offset!");

}

