#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BattleScreenPagePip

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BattleScreenPagePip.BattleScreenPagePip_C
// 0x0018 (0x0248 - 0x0230)
class UBattleScreenPagePip_C final : public UBattlePassScreenPagePip
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_Active;                                      // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Normal;                                      // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void OnSetPipActive(bool bActive);
	void ExecuteUbergraph_BattleScreenPagePip(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BattleScreenPagePip_C">();
	}
	static class UBattleScreenPagePip_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBattleScreenPagePip_C>();
	}
};
static_assert(alignof(UBattleScreenPagePip_C) == 0x000008, "Wrong alignment on UBattleScreenPagePip_C");
static_assert(sizeof(UBattleScreenPagePip_C) == 0x000248, "Wrong size on UBattleScreenPagePip_C");
static_assert(offsetof(UBattleScreenPagePip_C, UberGraphFrame) == 0x000230, "Member 'UBattleScreenPagePip_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBattleScreenPagePip_C, Image_Active) == 0x000238, "Member 'UBattleScreenPagePip_C::Image_Active' has a wrong offset!");
static_assert(offsetof(UBattleScreenPagePip_C, Image_Normal) == 0x000240, "Member 'UBattleScreenPagePip_C::Image_Normal' has a wrong offset!");

}

