#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BattlePassScreenTierList

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BattlePassScreenTierList.BattlePassScreenTierList_C
// 0x0028 (0x02E8 - 0x02C0)
class UBattlePassScreenTierList_C final : public UBattlePassScreenTierList
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USizeBox*                               AdditionalStyles;                                  // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      Button_Purchase;                                   // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           SeasonDetailsContainer;                            // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bIsZoomed;                                         // 0x02E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void HandleOnSetZoomed(bool bZoom);
	void ExecuteUbergraph_BattlePassScreenTierList(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BattlePassScreenTierList_C">();
	}
	static class UBattlePassScreenTierList_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBattlePassScreenTierList_C>();
	}
};
static_assert(alignof(UBattlePassScreenTierList_C) == 0x000008, "Wrong alignment on UBattlePassScreenTierList_C");
static_assert(sizeof(UBattlePassScreenTierList_C) == 0x0002E8, "Wrong size on UBattlePassScreenTierList_C");
static_assert(offsetof(UBattlePassScreenTierList_C, UberGraphFrame) == 0x0002C0, "Member 'UBattlePassScreenTierList_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenTierList_C, AdditionalStyles) == 0x0002C8, "Member 'UBattlePassScreenTierList_C::AdditionalStyles' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenTierList_C, Button_Purchase) == 0x0002D0, "Member 'UBattlePassScreenTierList_C::Button_Purchase' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenTierList_C, SeasonDetailsContainer) == 0x0002D8, "Member 'UBattlePassScreenTierList_C::SeasonDetailsContainer' has a wrong offset!");
static_assert(offsetof(UBattlePassScreenTierList_C, bIsZoomed) == 0x0002E0, "Member 'UBattlePassScreenTierList_C::bIsZoomed' has a wrong offset!");

}

