#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BGA_Athena_JollyRascal_ExtraDrop_Resource

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BGA_Athena_JollyRascal_ExtraDrop_Resource.BGA_Athena_JollyRascal_ExtraDrop_Resource_C.ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Resource
// 0x0128 (0x0128 - 0x0000)
struct BGA_Athena_JollyRascal_ExtraDrop_Resource_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Resource final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPickup*                            CallFunc_K2_SpawnPickupInWorld_ReturnValue;        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_MyComp;                               // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Other;                                // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_OtherComp;                            // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bSelfMoved;                           // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_HitLocation;                          // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_HitNormal;                            // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_NormalImpulse;                        // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_Hit;                                  // 0x0078(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_RandomSpin_ReturnValue;                   // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomSpin_ReturnValue_1;                 // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomSpin_ReturnValue_2;                 // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Rotation_Rate_X__Roll_;         // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Rotation_Rate_Y__Pitch_;        // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Rotation_Rate_Z__Yaw_;          // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0118(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue_1;                   // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BGA_Athena_JollyRascal_ExtraDrop_Resource_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Resource) == 0x000008, "Wrong alignment on BGA_Athena_JollyRascal_ExtraDrop_Resource_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Resource");
static_assert(sizeof(BGA_Athena_JollyRascal_ExtraDrop_Resource_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Resource) == 0x000128, "Wrong size on BGA_Athena_JollyRascal_ExtraDrop_Resource_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Resource");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Resource_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Resource, EntryPoint) == 0x000000, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Resource_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Resource::EntryPoint' has a wrong offset!");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Resource_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Resource, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000004, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Resource_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Resource::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Resource_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Resource, CallFunc_GetActorForwardVector_ReturnValue) == 0x000010, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Resource_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Resource::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Resource_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Resource, CallFunc_IsServer_ReturnValue) == 0x00001C, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Resource_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Resource::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Resource_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Resource, CallFunc_Add_VectorVector_ReturnValue) == 0x000020, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Resource_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Resource::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Resource_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Resource, CallFunc_K2_SpawnPickupInWorld_ReturnValue) == 0x000030, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Resource_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Resource::CallFunc_K2_SpawnPickupInWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Resource_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Resource, K2Node_Event_MyComp) == 0x000038, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Resource_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Resource::K2Node_Event_MyComp' has a wrong offset!");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Resource_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Resource, K2Node_Event_Other) == 0x000040, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Resource_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Resource::K2Node_Event_Other' has a wrong offset!");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Resource_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Resource, K2Node_Event_OtherComp) == 0x000048, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Resource_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Resource::K2Node_Event_OtherComp' has a wrong offset!");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Resource_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Resource, K2Node_Event_bSelfMoved) == 0x000050, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Resource_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Resource::K2Node_Event_bSelfMoved' has a wrong offset!");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Resource_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Resource, K2Node_Event_HitLocation) == 0x000054, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Resource_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Resource::K2Node_Event_HitLocation' has a wrong offset!");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Resource_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Resource, K2Node_Event_HitNormal) == 0x000060, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Resource_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Resource::K2Node_Event_HitNormal' has a wrong offset!");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Resource_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Resource, K2Node_Event_NormalImpulse) == 0x00006C, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Resource_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Resource::K2Node_Event_NormalImpulse' has a wrong offset!");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Resource_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Resource, K2Node_Event_Hit) == 0x000078, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Resource_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Resource::K2Node_Event_Hit' has a wrong offset!");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Resource_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Resource, CallFunc_RandomSpin_ReturnValue) == 0x000100, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Resource_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Resource::CallFunc_RandomSpin_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Resource_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Resource, CallFunc_RandomSpin_ReturnValue_1) == 0x000104, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Resource_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Resource::CallFunc_RandomSpin_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Resource_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Resource, CallFunc_RandomSpin_ReturnValue_2) == 0x000108, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Resource_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Resource::CallFunc_RandomSpin_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Resource_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Resource, K2Node_CustomEvent_Rotation_Rate_X__Roll_) == 0x00010C, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Resource_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Resource::K2Node_CustomEvent_Rotation_Rate_X__Roll_' has a wrong offset!");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Resource_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Resource, K2Node_CustomEvent_Rotation_Rate_Y__Pitch_) == 0x000110, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Resource_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Resource::K2Node_CustomEvent_Rotation_Rate_Y__Pitch_' has a wrong offset!");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Resource_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Resource, K2Node_CustomEvent_Rotation_Rate_Z__Yaw_) == 0x000114, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Resource_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Resource::K2Node_CustomEvent_Rotation_Rate_Z__Yaw_' has a wrong offset!");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Resource_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Resource, CallFunc_MakeRotator_ReturnValue) == 0x000118, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Resource_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Resource::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Resource_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Resource, CallFunc_IsServer_ReturnValue_1) == 0x000124, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Resource_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Resource::CallFunc_IsServer_ReturnValue_1' has a wrong offset!");

// Function BGA_Athena_JollyRascal_ExtraDrop_Resource.BGA_Athena_JollyRascal_ExtraDrop_Resource_C.RepRotation
// 0x000C (0x000C - 0x0000)
struct BGA_Athena_JollyRascal_ExtraDrop_Resource_C_RepRotation final
{
public:
	float                                         Rotation_Rate_X__Roll_;                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Rotation_Rate_Y__Pitch_;                           // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Rotation_Rate_Z__Yaw_;                             // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_Athena_JollyRascal_ExtraDrop_Resource_C_RepRotation) == 0x000004, "Wrong alignment on BGA_Athena_JollyRascal_ExtraDrop_Resource_C_RepRotation");
static_assert(sizeof(BGA_Athena_JollyRascal_ExtraDrop_Resource_C_RepRotation) == 0x00000C, "Wrong size on BGA_Athena_JollyRascal_ExtraDrop_Resource_C_RepRotation");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Resource_C_RepRotation, Rotation_Rate_X__Roll_) == 0x000000, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Resource_C_RepRotation::Rotation_Rate_X__Roll_' has a wrong offset!");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Resource_C_RepRotation, Rotation_Rate_Y__Pitch_) == 0x000004, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Resource_C_RepRotation::Rotation_Rate_Y__Pitch_' has a wrong offset!");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Resource_C_RepRotation, Rotation_Rate_Z__Yaw_) == 0x000008, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Resource_C_RepRotation::Rotation_Rate_Z__Yaw_' has a wrong offset!");

// Function BGA_Athena_JollyRascal_ExtraDrop_Resource.BGA_Athena_JollyRascal_ExtraDrop_Resource_C.ReceiveHit
// 0x00C8 (0x00C8 - 0x0000)
struct BGA_Athena_JollyRascal_ExtraDrop_Resource_C_ReceiveHit final
{
public:
	class UPrimitiveComponent*                    MyComp;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Other;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSelfMoved;                                        // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                HitLocation;                                       // 0x001C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitNormal;                                         // 0x0028(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NormalImpulse;                                     // 0x0034(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0040(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BGA_Athena_JollyRascal_ExtraDrop_Resource_C_ReceiveHit) == 0x000008, "Wrong alignment on BGA_Athena_JollyRascal_ExtraDrop_Resource_C_ReceiveHit");
static_assert(sizeof(BGA_Athena_JollyRascal_ExtraDrop_Resource_C_ReceiveHit) == 0x0000C8, "Wrong size on BGA_Athena_JollyRascal_ExtraDrop_Resource_C_ReceiveHit");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Resource_C_ReceiveHit, MyComp) == 0x000000, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Resource_C_ReceiveHit::MyComp' has a wrong offset!");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Resource_C_ReceiveHit, Other) == 0x000008, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Resource_C_ReceiveHit::Other' has a wrong offset!");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Resource_C_ReceiveHit, OtherComp) == 0x000010, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Resource_C_ReceiveHit::OtherComp' has a wrong offset!");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Resource_C_ReceiveHit, bSelfMoved) == 0x000018, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Resource_C_ReceiveHit::bSelfMoved' has a wrong offset!");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Resource_C_ReceiveHit, HitLocation) == 0x00001C, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Resource_C_ReceiveHit::HitLocation' has a wrong offset!");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Resource_C_ReceiveHit, HitNormal) == 0x000028, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Resource_C_ReceiveHit::HitNormal' has a wrong offset!");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Resource_C_ReceiveHit, NormalImpulse) == 0x000034, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Resource_C_ReceiveHit::NormalImpulse' has a wrong offset!");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Resource_C_ReceiveHit, Hit) == 0x000040, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Resource_C_ReceiveHit::Hit' has a wrong offset!");

// Function BGA_Athena_JollyRascal_ExtraDrop_Resource.BGA_Athena_JollyRascal_ExtraDrop_Resource_C.SelectResourceType
// 0x001C (0x001C - 0x0000)
struct BGA_Athena_JollyRascal_ExtraDrop_Resource_C_SelectResourceType final
{
public:
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_1;            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_2;            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_2;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BGA_Athena_JollyRascal_ExtraDrop_Resource_C_SelectResourceType) == 0x000004, "Wrong alignment on BGA_Athena_JollyRascal_ExtraDrop_Resource_C_SelectResourceType");
static_assert(sizeof(BGA_Athena_JollyRascal_ExtraDrop_Resource_C_SelectResourceType) == 0x00001C, "Wrong size on BGA_Athena_JollyRascal_ExtraDrop_Resource_C_SelectResourceType");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Resource_C_SelectResourceType, CallFunc_GetValueAtLevel_ReturnValue) == 0x000000, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Resource_C_SelectResourceType::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Resource_C_SelectResourceType, CallFunc_GetValueAtLevel_ReturnValue_1) == 0x000004, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Resource_C_SelectResourceType::CallFunc_GetValueAtLevel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Resource_C_SelectResourceType, CallFunc_FTrunc_ReturnValue) == 0x000008, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Resource_C_SelectResourceType::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Resource_C_SelectResourceType, CallFunc_FTrunc_ReturnValue_1) == 0x00000C, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Resource_C_SelectResourceType::CallFunc_FTrunc_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Resource_C_SelectResourceType, CallFunc_GetValueAtLevel_ReturnValue_2) == 0x000010, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Resource_C_SelectResourceType::CallFunc_GetValueAtLevel_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Resource_C_SelectResourceType, CallFunc_FTrunc_ReturnValue_2) == 0x000014, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Resource_C_SelectResourceType::CallFunc_FTrunc_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Resource_C_SelectResourceType, K2Node_SwitchEnum_CmpSuccess) == 0x000018, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Resource_C_SelectResourceType::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function BGA_Athena_JollyRascal_ExtraDrop_Resource.BGA_Athena_JollyRascal_ExtraDrop_Resource_C.SelectMesh
// 0x0001 (0x0001 - 0x0000)
struct BGA_Athena_JollyRascal_ExtraDrop_Resource_C_SelectMesh final
{
public:
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BGA_Athena_JollyRascal_ExtraDrop_Resource_C_SelectMesh) == 0x000001, "Wrong alignment on BGA_Athena_JollyRascal_ExtraDrop_Resource_C_SelectMesh");
static_assert(sizeof(BGA_Athena_JollyRascal_ExtraDrop_Resource_C_SelectMesh) == 0x000001, "Wrong size on BGA_Athena_JollyRascal_ExtraDrop_Resource_C_SelectMesh");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Resource_C_SelectMesh, K2Node_SwitchEnum_CmpSuccess) == 0x000000, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Resource_C_SelectMesh::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function BGA_Athena_JollyRascal_ExtraDrop_Resource.BGA_Athena_JollyRascal_ExtraDrop_Resource_C.SetMesh
// 0x0150 (0x0150 - 0x0000)
struct BGA_Athena_JollyRascal_ExtraDrop_Resource_C_SetMesh final
{
public:
	TArray<class UStaticMesh*>                    Array;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	TMap<int32, struct FTransform>                TargetMap;                                         // 0x0010(0x0050)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0xC];                                       // 0x0064(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_Map_Find_Value;                           // 0x0070(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeTransform_SweepHitResult;   // 0x00AC(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_135[0x3];                                      // 0x0135(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            CallFunc_Array_Get_Item;                           // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BGA_Athena_JollyRascal_ExtraDrop_Resource_C_SetMesh) == 0x000010, "Wrong alignment on BGA_Athena_JollyRascal_ExtraDrop_Resource_C_SetMesh");
static_assert(sizeof(BGA_Athena_JollyRascal_ExtraDrop_Resource_C_SetMesh) == 0x000150, "Wrong size on BGA_Athena_JollyRascal_ExtraDrop_Resource_C_SetMesh");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Resource_C_SetMesh, Array) == 0x000000, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Resource_C_SetMesh::Array' has a wrong offset!");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Resource_C_SetMesh, TargetMap) == 0x000010, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Resource_C_SetMesh::TargetMap' has a wrong offset!");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Resource_C_SetMesh, CallFunc_Array_Length_ReturnValue) == 0x000060, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Resource_C_SetMesh::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Resource_C_SetMesh, CallFunc_Map_Find_Value) == 0x000070, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Resource_C_SetMesh::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Resource_C_SetMesh, CallFunc_Map_Find_ReturnValue) == 0x0000A0, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Resource_C_SetMesh::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Resource_C_SetMesh, CallFunc_Subtract_IntInt_ReturnValue) == 0x0000A4, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Resource_C_SetMesh::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Resource_C_SetMesh, Temp_bool_Variable) == 0x0000A8, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Resource_C_SetMesh::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Resource_C_SetMesh, CallFunc_K2_SetRelativeTransform_SweepHitResult) == 0x0000AC, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Resource_C_SetMesh::CallFunc_K2_SetRelativeTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Resource_C_SetMesh, CallFunc_Greater_IntInt_ReturnValue) == 0x000134, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Resource_C_SetMesh::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Resource_C_SetMesh, K2Node_Select_Default) == 0x000138, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Resource_C_SetMesh::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Resource_C_SetMesh, CallFunc_Array_Get_Item) == 0x000140, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Resource_C_SetMesh::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Resource_C_SetMesh, CallFunc_SetStaticMesh_ReturnValue) == 0x000148, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Resource_C_SetMesh::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");

// Function BGA_Athena_JollyRascal_ExtraDrop_Resource.BGA_Athena_JollyRascal_ExtraDrop_Resource_C.RandomSpin
// 0x0018 (0x0018 - 0x0000)
struct BGA_Athena_JollyRascal_ExtraDrop_Resource_C_RandomSpin final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue;         // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_Athena_JollyRascal_ExtraDrop_Resource_C_RandomSpin) == 0x000004, "Wrong alignment on BGA_Athena_JollyRascal_ExtraDrop_Resource_C_RandomSpin");
static_assert(sizeof(BGA_Athena_JollyRascal_ExtraDrop_Resource_C_RandomSpin) == 0x000018, "Wrong size on BGA_Athena_JollyRascal_ExtraDrop_Resource_C_RandomSpin");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Resource_C_RandomSpin, ReturnValue) == 0x000000, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Resource_C_RandomSpin::ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Resource_C_RandomSpin, Temp_bool_Variable) == 0x000004, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Resource_C_RandomSpin::Temp_bool_Variable' has a wrong offset!");
