#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BGA_Athena_JollyRascal_ExtraDrop_Ammo

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BGA_Athena_JollyRascal_ExtraDrop_Ammo.BGA_Athena_JollyRascal_ExtraDrop_Ammo_C
// 0x0108 (0x0870 - 0x0768)
class ABGA_Athena_JollyRascal_ExtraDrop_Ammo_C final : public ABuildingGameplayActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0768(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class URotatingMovementComponent*             RotatingMovement;                                  // 0x0770(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Trail;                                             // 0x0778(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Mesh;                                              // 0x0780(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       Collision;                                         // 0x0788(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFortProjectileMovementComponent*       FortProjectileMovement;                            // 0x0790(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Audio;                                             // 0x0798(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   ItemsToDrop;                                       // 0x07A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           GC_Destroy;                                        // 0x07A8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpawnPositionOffset;                               // 0x07B0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7BC[0x4];                                      // 0x07BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         Rows_AmmoScaler;                                   // 0x07C0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FHitResult                             NullHit;                                           // 0x07E0(0x0088)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          HiddenInGame;                                      // 0x0868(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)

public:
	void ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Ammo(int32 EntryPoint);
	void SetRotation(float Rotation_Rate_X__Roll_, float Rotation_Rate_Y__Pitch_, float Rotation_Rate_Z__Yaw_);
	void ReceiveBeginPlay();
	void ReceiveHit(class UPrimitiveComponent* MyComp, class AActor* Other, class UPrimitiveComponent* OtherComp, bool bSelfMoved, const struct FVector& HitLocation, const struct FVector& HitNormal, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void HideAndKill();
	void Spawn_Items();
	float RandomSpin();
	void OnRep_HiddenInGame();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BGA_Athena_JollyRascal_ExtraDrop_Ammo_C">();
	}
	static class ABGA_Athena_JollyRascal_ExtraDrop_Ammo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABGA_Athena_JollyRascal_ExtraDrop_Ammo_C>();
	}
};
static_assert(alignof(ABGA_Athena_JollyRascal_ExtraDrop_Ammo_C) == 0x000008, "Wrong alignment on ABGA_Athena_JollyRascal_ExtraDrop_Ammo_C");
static_assert(sizeof(ABGA_Athena_JollyRascal_ExtraDrop_Ammo_C) == 0x000870, "Wrong size on ABGA_Athena_JollyRascal_ExtraDrop_Ammo_C");
static_assert(offsetof(ABGA_Athena_JollyRascal_ExtraDrop_Ammo_C, UberGraphFrame) == 0x000768, "Member 'ABGA_Athena_JollyRascal_ExtraDrop_Ammo_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_JollyRascal_ExtraDrop_Ammo_C, RotatingMovement) == 0x000770, "Member 'ABGA_Athena_JollyRascal_ExtraDrop_Ammo_C::RotatingMovement' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_JollyRascal_ExtraDrop_Ammo_C, Trail) == 0x000778, "Member 'ABGA_Athena_JollyRascal_ExtraDrop_Ammo_C::Trail' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_JollyRascal_ExtraDrop_Ammo_C, Mesh) == 0x000780, "Member 'ABGA_Athena_JollyRascal_ExtraDrop_Ammo_C::Mesh' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_JollyRascal_ExtraDrop_Ammo_C, Collision) == 0x000788, "Member 'ABGA_Athena_JollyRascal_ExtraDrop_Ammo_C::Collision' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_JollyRascal_ExtraDrop_Ammo_C, FortProjectileMovement) == 0x000790, "Member 'ABGA_Athena_JollyRascal_ExtraDrop_Ammo_C::FortProjectileMovement' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_JollyRascal_ExtraDrop_Ammo_C, Audio) == 0x000798, "Member 'ABGA_Athena_JollyRascal_ExtraDrop_Ammo_C::Audio' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_JollyRascal_ExtraDrop_Ammo_C, ItemsToDrop) == 0x0007A0, "Member 'ABGA_Athena_JollyRascal_ExtraDrop_Ammo_C::ItemsToDrop' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_JollyRascal_ExtraDrop_Ammo_C, GC_Destroy) == 0x0007A8, "Member 'ABGA_Athena_JollyRascal_ExtraDrop_Ammo_C::GC_Destroy' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_JollyRascal_ExtraDrop_Ammo_C, SpawnPositionOffset) == 0x0007B0, "Member 'ABGA_Athena_JollyRascal_ExtraDrop_Ammo_C::SpawnPositionOffset' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_JollyRascal_ExtraDrop_Ammo_C, Rows_AmmoScaler) == 0x0007C0, "Member 'ABGA_Athena_JollyRascal_ExtraDrop_Ammo_C::Rows_AmmoScaler' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_JollyRascal_ExtraDrop_Ammo_C, NullHit) == 0x0007E0, "Member 'ABGA_Athena_JollyRascal_ExtraDrop_Ammo_C::NullHit' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_JollyRascal_ExtraDrop_Ammo_C, HiddenInGame) == 0x000868, "Member 'ABGA_Athena_JollyRascal_ExtraDrop_Ammo_C::HiddenInGame' has a wrong offset!");

}

