#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BGA_Athena_JollyRascal_ExtraDrop_Ammo

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BGA_Athena_JollyRascal_ExtraDrop_Ammo.BGA_Athena_JollyRascal_ExtraDrop_Ammo_C.ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Ammo
// 0x0280 (0x0280 - 0x0000)
struct BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Ammo final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFortItemEntry>                 CallFunc_PickLootDrops_OutLootToDrop;              // 0x0008(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_PickLootDrops_ReturnValue;                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortItemEntry                         CallFunc_Array_Get_Item;                           // 0x0028(0x0120)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x014C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortWorldItemDefinition*               K2Node_DynamicCast_AsFort_World_Item_Definition;   // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_162[0x2];                                      // 0x0162(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0164(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_174[0x4];                                      // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_Event_MyComp;                               // 0x0178(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Other;                                // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_OtherComp;                            // 0x0188(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bSelfMoved;                           // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_191[0x3];                                      // 0x0191(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_HitLocation;                          // 0x0194(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_HitNormal;                            // 0x01A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_NormalImpulse;                        // 0x01AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_Hit;                                  // 0x01B8(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPickup*                            CallFunc_K2_SpawnPickupInWorld_ReturnValue;        // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomSpin_ReturnValue;                   // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomSpin_ReturnValue_1;                 // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomSpin_ReturnValue_2;                 // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Rotation_Rate_X__Roll_;         // 0x025C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Rotation_Rate_Y__Pitch_;        // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Rotation_Rate_Z__Yaw_;          // 0x0264(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x026C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_279[0x3];                                      // 0x0279(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x027C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Ammo) == 0x000008, "Wrong alignment on BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Ammo");
static_assert(sizeof(BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Ammo) == 0x000280, "Wrong size on BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Ammo");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Ammo, EntryPoint) == 0x000000, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Ammo::EntryPoint' has a wrong offset!");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Ammo, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Ammo::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Ammo, CallFunc_PickLootDrops_OutLootToDrop) == 0x000008, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Ammo::CallFunc_PickLootDrops_OutLootToDrop' has a wrong offset!");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Ammo, CallFunc_PickLootDrops_ReturnValue) == 0x000018, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Ammo::CallFunc_PickLootDrops_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Ammo, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00001C, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Ammo::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Ammo, CallFunc_Array_Get_Item) == 0x000028, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Ammo::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Ammo, CallFunc_Array_Length_ReturnValue) == 0x000148, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Ammo::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Ammo, CallFunc_GetActorForwardVector_ReturnValue) == 0x00014C, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Ammo::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Ammo, K2Node_DynamicCast_AsFort_World_Item_Definition) == 0x000158, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Ammo::K2Node_DynamicCast_AsFort_World_Item_Definition' has a wrong offset!");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Ammo, K2Node_DynamicCast_bSuccess) == 0x000160, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Ammo::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Ammo, CallFunc_IsServer_ReturnValue) == 0x000161, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Ammo::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Ammo, CallFunc_Add_VectorVector_ReturnValue) == 0x000164, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Ammo::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Ammo, CallFunc_GetValueAtLevel_ReturnValue) == 0x000170, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Ammo::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Ammo, K2Node_Event_MyComp) == 0x000178, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Ammo::K2Node_Event_MyComp' has a wrong offset!");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Ammo, K2Node_Event_Other) == 0x000180, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Ammo::K2Node_Event_Other' has a wrong offset!");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Ammo, K2Node_Event_OtherComp) == 0x000188, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Ammo::K2Node_Event_OtherComp' has a wrong offset!");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Ammo, K2Node_Event_bSelfMoved) == 0x000190, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Ammo::K2Node_Event_bSelfMoved' has a wrong offset!");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Ammo, K2Node_Event_HitLocation) == 0x000194, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Ammo::K2Node_Event_HitLocation' has a wrong offset!");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Ammo, K2Node_Event_HitNormal) == 0x0001A0, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Ammo::K2Node_Event_HitNormal' has a wrong offset!");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Ammo, K2Node_Event_NormalImpulse) == 0x0001AC, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Ammo::K2Node_Event_NormalImpulse' has a wrong offset!");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Ammo, K2Node_Event_Hit) == 0x0001B8, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Ammo::K2Node_Event_Hit' has a wrong offset!");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Ammo, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000240, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Ammo::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Ammo, CallFunc_FTrunc_ReturnValue) == 0x000244, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Ammo::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Ammo, CallFunc_K2_SpawnPickupInWorld_ReturnValue) == 0x000248, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Ammo::CallFunc_K2_SpawnPickupInWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Ammo, CallFunc_RandomSpin_ReturnValue) == 0x000250, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Ammo::CallFunc_RandomSpin_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Ammo, CallFunc_RandomSpin_ReturnValue_1) == 0x000254, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Ammo::CallFunc_RandomSpin_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Ammo, CallFunc_RandomSpin_ReturnValue_2) == 0x000258, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Ammo::CallFunc_RandomSpin_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Ammo, K2Node_CustomEvent_Rotation_Rate_X__Roll_) == 0x00025C, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Ammo::K2Node_CustomEvent_Rotation_Rate_X__Roll_' has a wrong offset!");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Ammo, K2Node_CustomEvent_Rotation_Rate_Y__Pitch_) == 0x000260, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Ammo::K2Node_CustomEvent_Rotation_Rate_Y__Pitch_' has a wrong offset!");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Ammo, K2Node_CustomEvent_Rotation_Rate_Z__Yaw_) == 0x000264, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Ammo::K2Node_CustomEvent_Rotation_Rate_Z__Yaw_' has a wrong offset!");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Ammo, Temp_int_Loop_Counter_Variable) == 0x000268, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Ammo::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Ammo, CallFunc_MakeRotator_ReturnValue) == 0x00026C, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Ammo::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Ammo, CallFunc_Less_IntInt_ReturnValue) == 0x000278, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Ammo::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Ammo, CallFunc_Add_IntInt_ReturnValue) == 0x00027C, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Ammo::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function BGA_Athena_JollyRascal_ExtraDrop_Ammo.BGA_Athena_JollyRascal_ExtraDrop_Ammo_C.SetRotation
// 0x000C (0x000C - 0x0000)
struct BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_SetRotation final
{
public:
	float                                         Rotation_Rate_X__Roll_;                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Rotation_Rate_Y__Pitch_;                           // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Rotation_Rate_Z__Yaw_;                             // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_SetRotation) == 0x000004, "Wrong alignment on BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_SetRotation");
static_assert(sizeof(BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_SetRotation) == 0x00000C, "Wrong size on BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_SetRotation");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_SetRotation, Rotation_Rate_X__Roll_) == 0x000000, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_SetRotation::Rotation_Rate_X__Roll_' has a wrong offset!");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_SetRotation, Rotation_Rate_Y__Pitch_) == 0x000004, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_SetRotation::Rotation_Rate_Y__Pitch_' has a wrong offset!");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_SetRotation, Rotation_Rate_Z__Yaw_) == 0x000008, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_SetRotation::Rotation_Rate_Z__Yaw_' has a wrong offset!");

// Function BGA_Athena_JollyRascal_ExtraDrop_Ammo.BGA_Athena_JollyRascal_ExtraDrop_Ammo_C.ReceiveHit
// 0x00C8 (0x00C8 - 0x0000)
struct BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_ReceiveHit final
{
public:
	class UPrimitiveComponent*                    MyComp;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Other;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSelfMoved;                                        // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                HitLocation;                                       // 0x001C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitNormal;                                         // 0x0028(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NormalImpulse;                                     // 0x0034(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0040(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_ReceiveHit) == 0x000008, "Wrong alignment on BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_ReceiveHit");
static_assert(sizeof(BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_ReceiveHit) == 0x0000C8, "Wrong size on BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_ReceiveHit");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_ReceiveHit, MyComp) == 0x000000, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_ReceiveHit::MyComp' has a wrong offset!");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_ReceiveHit, Other) == 0x000008, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_ReceiveHit::Other' has a wrong offset!");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_ReceiveHit, OtherComp) == 0x000010, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_ReceiveHit::OtherComp' has a wrong offset!");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_ReceiveHit, bSelfMoved) == 0x000018, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_ReceiveHit::bSelfMoved' has a wrong offset!");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_ReceiveHit, HitLocation) == 0x00001C, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_ReceiveHit::HitLocation' has a wrong offset!");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_ReceiveHit, HitNormal) == 0x000028, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_ReceiveHit::HitNormal' has a wrong offset!");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_ReceiveHit, NormalImpulse) == 0x000034, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_ReceiveHit::NormalImpulse' has a wrong offset!");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_ReceiveHit, Hit) == 0x000040, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_ReceiveHit::Hit' has a wrong offset!");

// Function BGA_Athena_JollyRascal_ExtraDrop_Ammo.BGA_Athena_JollyRascal_ExtraDrop_Ammo_C.RandomSpin
// 0x0020 (0x0020 - 0x0000)
struct BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_RandomSpin final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxSpin;                                           // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MinSpin;                                           // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue;         // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_RandomSpin) == 0x000004, "Wrong alignment on BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_RandomSpin");
static_assert(sizeof(BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_RandomSpin) == 0x000020, "Wrong size on BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_RandomSpin");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_RandomSpin, ReturnValue) == 0x000000, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_RandomSpin::ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_RandomSpin, MaxSpin) == 0x000004, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_RandomSpin::MaxSpin' has a wrong offset!");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_RandomSpin, MinSpin) == 0x000008, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_RandomSpin::MinSpin' has a wrong offset!");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_RandomSpin, Temp_bool_Variable) == 0x00000C, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_RandomSpin::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_RandomSpin, CallFunc_RandomBoolWithWeight_ReturnValue) == 0x00000D, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_RandomSpin::CallFunc_RandomBoolWithWeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_RandomSpin, CallFunc_RandomFloatInRange_ReturnValue) == 0x000010, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_RandomSpin::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_RandomSpin, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000014, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_RandomSpin::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_RandomSpin, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000018, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_RandomSpin::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_RandomSpin, K2Node_Select_Default) == 0x00001C, "Member 'BGA_Athena_JollyRascal_ExtraDrop_Ammo_C_RandomSpin::K2Node_Select_Default' has a wrong offset!");

}

