#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BGA_Athena_BadgerBangsStuck

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "BGA_Athena_WithGravity_Parent_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BGA_Athena_BadgerBangsStuck.BGA_Athena_BadgerBangsStuck_C
// 0x0100 (0x0988 - 0x0888)
class ABGA_Athena_BadgerBangsStuck_C final : public ABGA_Athena_WithGravity_Parent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BGA_Athena_BadgerBangsStuck_C;      // 0x0888(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   VisibleMesh;                                       // 0x0890(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        MeshPivot;                                         // 0x0898(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        AmbientHumAudio;                                   // 0x08A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       BeepBlinkTrigger;                                  // 0x08A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       ExplosionTrigger;                                  // 0x08B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_1_Emissve_A0BA3AC74B95087EDA31D5A0925A4A51; // 0x08B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_1_Rotator_A0BA3AC74B95087EDA31D5A0925A4A51; // 0x08BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_1__Direction_A0BA3AC74B95087EDA31D5A0925A4A51; // 0x08C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C1[0x7];                                      // 0x08C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_1;                                        // 0x08C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AB_BGA_Athena_SilverBlazer_V2_C*        SpawnedBGA;                                        // 0x08D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   InteractText;                                      // 0x08D8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          IsExlode_;                                         // 0x08F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8F1[0x7];                                      // 0x08F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           BeepTimer;                                         // 0x08F8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ImpactNormal;                                      // 0x0900(0x000C)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FGameplayTag                           CameraShakeGC;                                     // 0x090C(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_914[0x4];                                      // 0x0914(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         ActorsInBeepRadius;                                // 0x0918(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance)
	bool                                          IsInteract_;                                       // 0x0928(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_929[0x7];                                      // 0x0929(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             ExplodeSound;                                      // 0x0930(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         DamageRadius;                                      // 0x0938(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         TriggerRadius;                                     // 0x0958(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UParticleSystemComponent*               BeepParticles;                                     // 0x0978(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             BeepSound;                                         // 0x0980(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BGA_Athena_BadgerBangsStuck(int32 EntryPoint);
	void BndEvt__ExplosionTrigger_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void StopBeep();
	void TriggerBeep(class AActor* ThePlayerPawnWhoTriggers);
	void Beep(class FName EventName, float EmitterTime, const struct FVector& Location, const struct FVector& Velocity);
	void PlayBeepFX();
	void BndEvt__BeepBlinkTrigger_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void BndEvt__BeepBlinkTrigger_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void BlueprintOnInteract(const class AFortPawn* InteractingPawn);
	void SpawnFXSounds();
	void OnDamageServer(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AController* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void Explode();
	void BndEvt__ExplosionTrigger_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void Destroyed(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum);
	void ReceiveBeginPlay();
	void Timeline_1__UpdateFunc();
	void Timeline_1__FinishedFunc();
	void UserConstructionScript();
	void Launch(const struct FVector& LaunchSource, float Amount);
	void CheckLOSAgain(class AActor* ActorToCheckLOSAgainst);
	void FilterByLOS(TArray<class AActor*>& _Array, TArray<class AActor*>* _Result);

	bool BlueprintCanInteract(const class AFortPawn* InteractingPawn) const;
	class FText BlueprintGetInteractionString(const class AFortPawn* InteractingPawn) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BGA_Athena_BadgerBangsStuck_C">();
	}
	static class ABGA_Athena_BadgerBangsStuck_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABGA_Athena_BadgerBangsStuck_C>();
	}
};
static_assert(alignof(ABGA_Athena_BadgerBangsStuck_C) == 0x000008, "Wrong alignment on ABGA_Athena_BadgerBangsStuck_C");
static_assert(sizeof(ABGA_Athena_BadgerBangsStuck_C) == 0x000988, "Wrong size on ABGA_Athena_BadgerBangsStuck_C");
static_assert(offsetof(ABGA_Athena_BadgerBangsStuck_C, UberGraphFrame_BGA_Athena_BadgerBangsStuck_C) == 0x000888, "Member 'ABGA_Athena_BadgerBangsStuck_C::UberGraphFrame_BGA_Athena_BadgerBangsStuck_C' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_BadgerBangsStuck_C, VisibleMesh) == 0x000890, "Member 'ABGA_Athena_BadgerBangsStuck_C::VisibleMesh' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_BadgerBangsStuck_C, MeshPivot) == 0x000898, "Member 'ABGA_Athena_BadgerBangsStuck_C::MeshPivot' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_BadgerBangsStuck_C, AmbientHumAudio) == 0x0008A0, "Member 'ABGA_Athena_BadgerBangsStuck_C::AmbientHumAudio' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_BadgerBangsStuck_C, BeepBlinkTrigger) == 0x0008A8, "Member 'ABGA_Athena_BadgerBangsStuck_C::BeepBlinkTrigger' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_BadgerBangsStuck_C, ExplosionTrigger) == 0x0008B0, "Member 'ABGA_Athena_BadgerBangsStuck_C::ExplosionTrigger' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_BadgerBangsStuck_C, Timeline_1_Emissve_A0BA3AC74B95087EDA31D5A0925A4A51) == 0x0008B8, "Member 'ABGA_Athena_BadgerBangsStuck_C::Timeline_1_Emissve_A0BA3AC74B95087EDA31D5A0925A4A51' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_BadgerBangsStuck_C, Timeline_1_Rotator_A0BA3AC74B95087EDA31D5A0925A4A51) == 0x0008BC, "Member 'ABGA_Athena_BadgerBangsStuck_C::Timeline_1_Rotator_A0BA3AC74B95087EDA31D5A0925A4A51' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_BadgerBangsStuck_C, Timeline_1__Direction_A0BA3AC74B95087EDA31D5A0925A4A51) == 0x0008C0, "Member 'ABGA_Athena_BadgerBangsStuck_C::Timeline_1__Direction_A0BA3AC74B95087EDA31D5A0925A4A51' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_BadgerBangsStuck_C, Timeline_1) == 0x0008C8, "Member 'ABGA_Athena_BadgerBangsStuck_C::Timeline_1' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_BadgerBangsStuck_C, SpawnedBGA) == 0x0008D0, "Member 'ABGA_Athena_BadgerBangsStuck_C::SpawnedBGA' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_BadgerBangsStuck_C, InteractText) == 0x0008D8, "Member 'ABGA_Athena_BadgerBangsStuck_C::InteractText' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_BadgerBangsStuck_C, IsExlode_) == 0x0008F0, "Member 'ABGA_Athena_BadgerBangsStuck_C::IsExlode_' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_BadgerBangsStuck_C, BeepTimer) == 0x0008F8, "Member 'ABGA_Athena_BadgerBangsStuck_C::BeepTimer' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_BadgerBangsStuck_C, ImpactNormal) == 0x000900, "Member 'ABGA_Athena_BadgerBangsStuck_C::ImpactNormal' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_BadgerBangsStuck_C, CameraShakeGC) == 0x00090C, "Member 'ABGA_Athena_BadgerBangsStuck_C::CameraShakeGC' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_BadgerBangsStuck_C, ActorsInBeepRadius) == 0x000918, "Member 'ABGA_Athena_BadgerBangsStuck_C::ActorsInBeepRadius' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_BadgerBangsStuck_C, IsInteract_) == 0x000928, "Member 'ABGA_Athena_BadgerBangsStuck_C::IsInteract_' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_BadgerBangsStuck_C, ExplodeSound) == 0x000930, "Member 'ABGA_Athena_BadgerBangsStuck_C::ExplodeSound' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_BadgerBangsStuck_C, DamageRadius) == 0x000938, "Member 'ABGA_Athena_BadgerBangsStuck_C::DamageRadius' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_BadgerBangsStuck_C, TriggerRadius) == 0x000958, "Member 'ABGA_Athena_BadgerBangsStuck_C::TriggerRadius' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_BadgerBangsStuck_C, BeepParticles) == 0x000978, "Member 'ABGA_Athena_BadgerBangsStuck_C::BeepParticles' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_BadgerBangsStuck_C, BeepSound) == 0x000980, "Member 'ABGA_Athena_BadgerBangsStuck_C::BeepSound' has a wrong offset!");

}

