#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BGA_Ostrich_ShieldBubble

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BGA_Ostrich_ShieldBubble.BGA_Ostrich_ShieldBubble_C.ExecuteUbergraph_BGA_Ostrich_ShieldBubble
// 0x0210 (0x0210 - 0x0000)
struct BGA_Ostrich_ShieldBubble_C_ExecuteUbergraph_BGA_Ostrich_ShieldBubble final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_Damage;                               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  K2Node_Event_DamageTags;                           // 0x0030(0x0020)(ConstParm)
	struct FVector                                K2Node_Event_Momentum;                             // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitInfo;                              // 0x005C(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            K2Node_Event_InstigatedBy;                         // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser;                         // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext;                        // 0x00F8(0x0018)()
	bool                                          K2Node_CustomEvent_Play_Sound;                     // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x3];                                      // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x3];                                      // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_1;                       // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_2;                       // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12D[0x3];                                      // 0x012D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0130(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0140(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0148(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_151[0x3];                                      // 0x0151(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0154(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_164[0x4];                                      // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_2;        // 0x0168(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x0170(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x017C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_17D[0x3];                                      // 0x017D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetMechMesh_ReturnValue;                  // 0x0180(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_3;        // 0x0188(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x0198(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue_1;         // 0x01A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue; // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue_1; // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue_2; // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x01C0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D1[0x3];                                      // 0x01D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_2;        // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_4;        // 0x01D8(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue_2;         // 0x01E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_3;        // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeUnclamped_ReturnValue;            // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue_3;         // 0x01F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue_4;         // 0x01F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue_5;         // 0x0200(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetHasGunner_ReturnValue;                 // 0x0209(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x020A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_Ostrich_ShieldBubble_C_ExecuteUbergraph_BGA_Ostrich_ShieldBubble) == 0x000008, "Wrong alignment on BGA_Ostrich_ShieldBubble_C_ExecuteUbergraph_BGA_Ostrich_ShieldBubble");
static_assert(sizeof(BGA_Ostrich_ShieldBubble_C_ExecuteUbergraph_BGA_Ostrich_ShieldBubble) == 0x000210, "Wrong size on BGA_Ostrich_ShieldBubble_C_ExecuteUbergraph_BGA_Ostrich_ShieldBubble");
static_assert(offsetof(BGA_Ostrich_ShieldBubble_C_ExecuteUbergraph_BGA_Ostrich_ShieldBubble, EntryPoint) == 0x000000, "Member 'BGA_Ostrich_ShieldBubble_C_ExecuteUbergraph_BGA_Ostrich_ShieldBubble::EntryPoint' has a wrong offset!");
static_assert(offsetof(BGA_Ostrich_ShieldBubble_C_ExecuteUbergraph_BGA_Ostrich_ShieldBubble, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BGA_Ostrich_ShieldBubble_C_ExecuteUbergraph_BGA_Ostrich_ShieldBubble::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BGA_Ostrich_ShieldBubble_C_ExecuteUbergraph_BGA_Ostrich_ShieldBubble, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'BGA_Ostrich_ShieldBubble_C_ExecuteUbergraph_BGA_Ostrich_ShieldBubble::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BGA_Ostrich_ShieldBubble_C_ExecuteUbergraph_BGA_Ostrich_ShieldBubble, CallFunc_IsValid_ReturnValue) == 0x000024, "Member 'BGA_Ostrich_ShieldBubble_C_ExecuteUbergraph_BGA_Ostrich_ShieldBubble::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Ostrich_ShieldBubble_C_ExecuteUbergraph_BGA_Ostrich_ShieldBubble, CallFunc_IsValid_ReturnValue_1) == 0x000025, "Member 'BGA_Ostrich_ShieldBubble_C_ExecuteUbergraph_BGA_Ostrich_ShieldBubble::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Ostrich_ShieldBubble_C_ExecuteUbergraph_BGA_Ostrich_ShieldBubble, K2Node_Event_Damage) == 0x000028, "Member 'BGA_Ostrich_ShieldBubble_C_ExecuteUbergraph_BGA_Ostrich_ShieldBubble::K2Node_Event_Damage' has a wrong offset!");
static_assert(offsetof(BGA_Ostrich_ShieldBubble_C_ExecuteUbergraph_BGA_Ostrich_ShieldBubble, K2Node_Event_DamageTags) == 0x000030, "Member 'BGA_Ostrich_ShieldBubble_C_ExecuteUbergraph_BGA_Ostrich_ShieldBubble::K2Node_Event_DamageTags' has a wrong offset!");
static_assert(offsetof(BGA_Ostrich_ShieldBubble_C_ExecuteUbergraph_BGA_Ostrich_ShieldBubble, K2Node_Event_Momentum) == 0x000050, "Member 'BGA_Ostrich_ShieldBubble_C_ExecuteUbergraph_BGA_Ostrich_ShieldBubble::K2Node_Event_Momentum' has a wrong offset!");
static_assert(offsetof(BGA_Ostrich_ShieldBubble_C_ExecuteUbergraph_BGA_Ostrich_ShieldBubble, K2Node_Event_HitInfo) == 0x00005C, "Member 'BGA_Ostrich_ShieldBubble_C_ExecuteUbergraph_BGA_Ostrich_ShieldBubble::K2Node_Event_HitInfo' has a wrong offset!");
static_assert(offsetof(BGA_Ostrich_ShieldBubble_C_ExecuteUbergraph_BGA_Ostrich_ShieldBubble, K2Node_Event_InstigatedBy) == 0x0000E8, "Member 'BGA_Ostrich_ShieldBubble_C_ExecuteUbergraph_BGA_Ostrich_ShieldBubble::K2Node_Event_InstigatedBy' has a wrong offset!");
static_assert(offsetof(BGA_Ostrich_ShieldBubble_C_ExecuteUbergraph_BGA_Ostrich_ShieldBubble, K2Node_Event_DamageCauser) == 0x0000F0, "Member 'BGA_Ostrich_ShieldBubble_C_ExecuteUbergraph_BGA_Ostrich_ShieldBubble::K2Node_Event_DamageCauser' has a wrong offset!");
static_assert(offsetof(BGA_Ostrich_ShieldBubble_C_ExecuteUbergraph_BGA_Ostrich_ShieldBubble, K2Node_Event_EffectContext) == 0x0000F8, "Member 'BGA_Ostrich_ShieldBubble_C_ExecuteUbergraph_BGA_Ostrich_ShieldBubble::K2Node_Event_EffectContext' has a wrong offset!");
static_assert(offsetof(BGA_Ostrich_ShieldBubble_C_ExecuteUbergraph_BGA_Ostrich_ShieldBubble, K2Node_CustomEvent_Play_Sound) == 0x000110, "Member 'BGA_Ostrich_ShieldBubble_C_ExecuteUbergraph_BGA_Ostrich_ShieldBubble::K2Node_CustomEvent_Play_Sound' has a wrong offset!");
static_assert(offsetof(BGA_Ostrich_ShieldBubble_C_ExecuteUbergraph_BGA_Ostrich_ShieldBubble, CallFunc_Add_FloatFloat_ReturnValue) == 0x000114, "Member 'BGA_Ostrich_ShieldBubble_C_ExecuteUbergraph_BGA_Ostrich_ShieldBubble::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Ostrich_ShieldBubble_C_ExecuteUbergraph_BGA_Ostrich_ShieldBubble, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000118, "Member 'BGA_Ostrich_ShieldBubble_C_ExecuteUbergraph_BGA_Ostrich_ShieldBubble::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Ostrich_ShieldBubble_C_ExecuteUbergraph_BGA_Ostrich_ShieldBubble, CallFunc_Lerp_ReturnValue) == 0x00011C, "Member 'BGA_Ostrich_ShieldBubble_C_ExecuteUbergraph_BGA_Ostrich_ShieldBubble::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Ostrich_ShieldBubble_C_ExecuteUbergraph_BGA_Ostrich_ShieldBubble, CallFunc_Lerp_ReturnValue_1) == 0x000120, "Member 'BGA_Ostrich_ShieldBubble_C_ExecuteUbergraph_BGA_Ostrich_ShieldBubble::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Ostrich_ShieldBubble_C_ExecuteUbergraph_BGA_Ostrich_ShieldBubble, CallFunc_Lerp_ReturnValue_2) == 0x000124, "Member 'BGA_Ostrich_ShieldBubble_C_ExecuteUbergraph_BGA_Ostrich_ShieldBubble::CallFunc_Lerp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BGA_Ostrich_ShieldBubble_C_ExecuteUbergraph_BGA_Ostrich_ShieldBubble, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000128, "Member 'BGA_Ostrich_ShieldBubble_C_ExecuteUbergraph_BGA_Ostrich_ShieldBubble::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Ostrich_ShieldBubble_C_ExecuteUbergraph_BGA_Ostrich_ShieldBubble, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x00012C, "Member 'BGA_Ostrich_ShieldBubble_C_ExecuteUbergraph_BGA_Ostrich_ShieldBubble::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Ostrich_ShieldBubble_C_ExecuteUbergraph_BGA_Ostrich_ShieldBubble, K2Node_CreateDelegate_OutputDelegate_2) == 0x000130, "Member 'BGA_Ostrich_ShieldBubble_C_ExecuteUbergraph_BGA_Ostrich_ShieldBubble::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BGA_Ostrich_ShieldBubble_C_ExecuteUbergraph_BGA_Ostrich_ShieldBubble, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000140, "Member 'BGA_Ostrich_ShieldBubble_C_ExecuteUbergraph_BGA_Ostrich_ShieldBubble::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Ostrich_ShieldBubble_C_ExecuteUbergraph_BGA_Ostrich_ShieldBubble, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x000148, "Member 'BGA_Ostrich_ShieldBubble_C_ExecuteUbergraph_BGA_Ostrich_ShieldBubble::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Ostrich_ShieldBubble_C_ExecuteUbergraph_BGA_Ostrich_ShieldBubble, CallFunc_BooleanOR_ReturnValue) == 0x000150, "Member 'BGA_Ostrich_ShieldBubble_C_ExecuteUbergraph_BGA_Ostrich_ShieldBubble::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Ostrich_ShieldBubble_C_ExecuteUbergraph_BGA_Ostrich_ShieldBubble, K2Node_CreateDelegate_OutputDelegate_3) == 0x000154, "Member 'BGA_Ostrich_ShieldBubble_C_ExecuteUbergraph_BGA_Ostrich_ShieldBubble::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BGA_Ostrich_ShieldBubble_C_ExecuteUbergraph_BGA_Ostrich_ShieldBubble, CallFunc_K2_SetTimerDelegate_ReturnValue_2) == 0x000168, "Member 'BGA_Ostrich_ShieldBubble_C_ExecuteUbergraph_BGA_Ostrich_ShieldBubble::CallFunc_K2_SetTimerDelegate_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BGA_Ostrich_ShieldBubble_C_ExecuteUbergraph_BGA_Ostrich_ShieldBubble, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x000170, "Member 'BGA_Ostrich_ShieldBubble_C_ExecuteUbergraph_BGA_Ostrich_ShieldBubble::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Ostrich_ShieldBubble_C_ExecuteUbergraph_BGA_Ostrich_ShieldBubble, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x000178, "Member 'BGA_Ostrich_ShieldBubble_C_ExecuteUbergraph_BGA_Ostrich_ShieldBubble::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Ostrich_ShieldBubble_C_ExecuteUbergraph_BGA_Ostrich_ShieldBubble, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00017C, "Member 'BGA_Ostrich_ShieldBubble_C_ExecuteUbergraph_BGA_Ostrich_ShieldBubble::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Ostrich_ShieldBubble_C_ExecuteUbergraph_BGA_Ostrich_ShieldBubble, CallFunc_GetMechMesh_ReturnValue) == 0x000180, "Member 'BGA_Ostrich_ShieldBubble_C_ExecuteUbergraph_BGA_Ostrich_ShieldBubble::CallFunc_GetMechMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Ostrich_ShieldBubble_C_ExecuteUbergraph_BGA_Ostrich_ShieldBubble, CallFunc_K2_SetTimerDelegate_ReturnValue_3) == 0x000188, "Member 'BGA_Ostrich_ShieldBubble_C_ExecuteUbergraph_BGA_Ostrich_ShieldBubble::CallFunc_K2_SetTimerDelegate_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BGA_Ostrich_ShieldBubble_C_ExecuteUbergraph_BGA_Ostrich_ShieldBubble, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x000190, "Member 'BGA_Ostrich_ShieldBubble_C_ExecuteUbergraph_BGA_Ostrich_ShieldBubble::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Ostrich_ShieldBubble_C_ExecuteUbergraph_BGA_Ostrich_ShieldBubble, CallFunc_SpawnSoundAttached_ReturnValue) == 0x000198, "Member 'BGA_Ostrich_ShieldBubble_C_ExecuteUbergraph_BGA_Ostrich_ShieldBubble::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Ostrich_ShieldBubble_C_ExecuteUbergraph_BGA_Ostrich_ShieldBubble, CallFunc_SpawnSoundAttached_ReturnValue_1) == 0x0001A0, "Member 'BGA_Ostrich_ShieldBubble_C_ExecuteUbergraph_BGA_Ostrich_ShieldBubble::CallFunc_SpawnSoundAttached_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Ostrich_ShieldBubble_C_ExecuteUbergraph_BGA_Ostrich_ShieldBubble, CallFunc_GetFortPlayerControllerFromActor_ReturnValue) == 0x0001A8, "Member 'BGA_Ostrich_ShieldBubble_C_ExecuteUbergraph_BGA_Ostrich_ShieldBubble::CallFunc_GetFortPlayerControllerFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Ostrich_ShieldBubble_C_ExecuteUbergraph_BGA_Ostrich_ShieldBubble, CallFunc_GetFortPlayerControllerFromActor_ReturnValue_1) == 0x0001B0, "Member 'BGA_Ostrich_ShieldBubble_C_ExecuteUbergraph_BGA_Ostrich_ShieldBubble::CallFunc_GetFortPlayerControllerFromActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Ostrich_ShieldBubble_C_ExecuteUbergraph_BGA_Ostrich_ShieldBubble, CallFunc_GetFortPlayerControllerFromActor_ReturnValue_2) == 0x0001B8, "Member 'BGA_Ostrich_ShieldBubble_C_ExecuteUbergraph_BGA_Ostrich_ShieldBubble::CallFunc_GetFortPlayerControllerFromActor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BGA_Ostrich_ShieldBubble_C_ExecuteUbergraph_BGA_Ostrich_ShieldBubble, K2Node_CreateDelegate_OutputDelegate_4) == 0x0001C0, "Member 'BGA_Ostrich_ShieldBubble_C_ExecuteUbergraph_BGA_Ostrich_ShieldBubble::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BGA_Ostrich_ShieldBubble_C_ExecuteUbergraph_BGA_Ostrich_ShieldBubble, CallFunc_BooleanOR_ReturnValue_1) == 0x0001D0, "Member 'BGA_Ostrich_ShieldBubble_C_ExecuteUbergraph_BGA_Ostrich_ShieldBubble::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Ostrich_ShieldBubble_C_ExecuteUbergraph_BGA_Ostrich_ShieldBubble, CallFunc_Subtract_FloatFloat_ReturnValue_2) == 0x0001D4, "Member 'BGA_Ostrich_ShieldBubble_C_ExecuteUbergraph_BGA_Ostrich_ShieldBubble::CallFunc_Subtract_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BGA_Ostrich_ShieldBubble_C_ExecuteUbergraph_BGA_Ostrich_ShieldBubble, CallFunc_K2_SetTimerDelegate_ReturnValue_4) == 0x0001D8, "Member 'BGA_Ostrich_ShieldBubble_C_ExecuteUbergraph_BGA_Ostrich_ShieldBubble::CallFunc_K2_SetTimerDelegate_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BGA_Ostrich_ShieldBubble_C_ExecuteUbergraph_BGA_Ostrich_ShieldBubble, CallFunc_SpawnSoundAttached_ReturnValue_2) == 0x0001E0, "Member 'BGA_Ostrich_ShieldBubble_C_ExecuteUbergraph_BGA_Ostrich_ShieldBubble::CallFunc_SpawnSoundAttached_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BGA_Ostrich_ShieldBubble_C_ExecuteUbergraph_BGA_Ostrich_ShieldBubble, CallFunc_Subtract_FloatFloat_ReturnValue_3) == 0x0001E8, "Member 'BGA_Ostrich_ShieldBubble_C_ExecuteUbergraph_BGA_Ostrich_ShieldBubble::CallFunc_Subtract_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BGA_Ostrich_ShieldBubble_C_ExecuteUbergraph_BGA_Ostrich_ShieldBubble, CallFunc_MapRangeUnclamped_ReturnValue) == 0x0001EC, "Member 'BGA_Ostrich_ShieldBubble_C_ExecuteUbergraph_BGA_Ostrich_ShieldBubble::CallFunc_MapRangeUnclamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Ostrich_ShieldBubble_C_ExecuteUbergraph_BGA_Ostrich_ShieldBubble, CallFunc_SpawnSoundAttached_ReturnValue_3) == 0x0001F0, "Member 'BGA_Ostrich_ShieldBubble_C_ExecuteUbergraph_BGA_Ostrich_ShieldBubble::CallFunc_SpawnSoundAttached_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BGA_Ostrich_ShieldBubble_C_ExecuteUbergraph_BGA_Ostrich_ShieldBubble, CallFunc_SpawnSoundAttached_ReturnValue_4) == 0x0001F8, "Member 'BGA_Ostrich_ShieldBubble_C_ExecuteUbergraph_BGA_Ostrich_ShieldBubble::CallFunc_SpawnSoundAttached_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BGA_Ostrich_ShieldBubble_C_ExecuteUbergraph_BGA_Ostrich_ShieldBubble, CallFunc_SpawnSoundAttached_ReturnValue_5) == 0x000200, "Member 'BGA_Ostrich_ShieldBubble_C_ExecuteUbergraph_BGA_Ostrich_ShieldBubble::CallFunc_SpawnSoundAttached_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BGA_Ostrich_ShieldBubble_C_ExecuteUbergraph_BGA_Ostrich_ShieldBubble, CallFunc_IsValid_ReturnValue_2) == 0x000208, "Member 'BGA_Ostrich_ShieldBubble_C_ExecuteUbergraph_BGA_Ostrich_ShieldBubble::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BGA_Ostrich_ShieldBubble_C_ExecuteUbergraph_BGA_Ostrich_ShieldBubble, CallFunc_GetHasGunner_ReturnValue) == 0x000209, "Member 'BGA_Ostrich_ShieldBubble_C_ExecuteUbergraph_BGA_Ostrich_ShieldBubble::CallFunc_GetHasGunner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Ostrich_ShieldBubble_C_ExecuteUbergraph_BGA_Ostrich_ShieldBubble, K2Node_Event_EndPlayReason) == 0x00020A, "Member 'BGA_Ostrich_ShieldBubble_C_ExecuteUbergraph_BGA_Ostrich_ShieldBubble::K2Node_Event_EndPlayReason' has a wrong offset!");

// Function BGA_Ostrich_ShieldBubble.BGA_Ostrich_ShieldBubble_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BGA_Ostrich_ShieldBubble_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_Ostrich_ShieldBubble_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BGA_Ostrich_ShieldBubble_C_ReceiveEndPlay");
static_assert(sizeof(BGA_Ostrich_ShieldBubble_C_ReceiveEndPlay) == 0x000001, "Wrong size on BGA_Ostrich_ShieldBubble_C_ReceiveEndPlay");
static_assert(offsetof(BGA_Ostrich_ShieldBubble_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BGA_Ostrich_ShieldBubble_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BGA_Ostrich_ShieldBubble.BGA_Ostrich_ShieldBubble_C.BubbleFlash
// 0x0001 (0x0001 - 0x0000)
struct BGA_Ostrich_ShieldBubble_C_BubbleFlash final
{
public:
	bool                                          Play_Sound;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BGA_Ostrich_ShieldBubble_C_BubbleFlash) == 0x000001, "Wrong alignment on BGA_Ostrich_ShieldBubble_C_BubbleFlash");
static_assert(sizeof(BGA_Ostrich_ShieldBubble_C_BubbleFlash) == 0x000001, "Wrong size on BGA_Ostrich_ShieldBubble_C_BubbleFlash");
static_assert(offsetof(BGA_Ostrich_ShieldBubble_C_BubbleFlash, Play_Sound) == 0x000000, "Member 'BGA_Ostrich_ShieldBubble_C_BubbleFlash::Play_Sound' has a wrong offset!");

// Function BGA_Ostrich_ShieldBubble.BGA_Ostrich_ShieldBubble_C.OnDamageServer
// 0x00E8 (0x00E8 - 0x0000)
struct BGA_Ostrich_ShieldBubble_C_OnDamageServer final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  DamageTags;                                        // 0x0008(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FVector                                Momentum;                                          // 0x0028(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             HitInfo;                                           // 0x0034(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            InstigatedBy;                                      // 0x00C0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x00C8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           EffectContext;                                     // 0x00D0(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(BGA_Ostrich_ShieldBubble_C_OnDamageServer) == 0x000008, "Wrong alignment on BGA_Ostrich_ShieldBubble_C_OnDamageServer");
static_assert(sizeof(BGA_Ostrich_ShieldBubble_C_OnDamageServer) == 0x0000E8, "Wrong size on BGA_Ostrich_ShieldBubble_C_OnDamageServer");
static_assert(offsetof(BGA_Ostrich_ShieldBubble_C_OnDamageServer, Damage) == 0x000000, "Member 'BGA_Ostrich_ShieldBubble_C_OnDamageServer::Damage' has a wrong offset!");
static_assert(offsetof(BGA_Ostrich_ShieldBubble_C_OnDamageServer, DamageTags) == 0x000008, "Member 'BGA_Ostrich_ShieldBubble_C_OnDamageServer::DamageTags' has a wrong offset!");
static_assert(offsetof(BGA_Ostrich_ShieldBubble_C_OnDamageServer, Momentum) == 0x000028, "Member 'BGA_Ostrich_ShieldBubble_C_OnDamageServer::Momentum' has a wrong offset!");
static_assert(offsetof(BGA_Ostrich_ShieldBubble_C_OnDamageServer, HitInfo) == 0x000034, "Member 'BGA_Ostrich_ShieldBubble_C_OnDamageServer::HitInfo' has a wrong offset!");
static_assert(offsetof(BGA_Ostrich_ShieldBubble_C_OnDamageServer, InstigatedBy) == 0x0000C0, "Member 'BGA_Ostrich_ShieldBubble_C_OnDamageServer::InstigatedBy' has a wrong offset!");
static_assert(offsetof(BGA_Ostrich_ShieldBubble_C_OnDamageServer, DamageCauser) == 0x0000C8, "Member 'BGA_Ostrich_ShieldBubble_C_OnDamageServer::DamageCauser' has a wrong offset!");
static_assert(offsetof(BGA_Ostrich_ShieldBubble_C_OnDamageServer, EffectContext) == 0x0000D0, "Member 'BGA_Ostrich_ShieldBubble_C_OnDamageServer::EffectContext' has a wrong offset!");

// Function BGA_Ostrich_ShieldBubble.BGA_Ostrich_ShieldBubble_C.UserConstructionScript
// 0x0028 (0x0028 - 0x0000)
struct BGA_Ostrich_ShieldBubble_C_UserConstructionScript final
{
public:
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_1;            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_2;            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_3;            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_4;            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_5;            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_6;            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_7;            // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_8;            // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_9;            // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_Ostrich_ShieldBubble_C_UserConstructionScript) == 0x000004, "Wrong alignment on BGA_Ostrich_ShieldBubble_C_UserConstructionScript");
static_assert(sizeof(BGA_Ostrich_ShieldBubble_C_UserConstructionScript) == 0x000028, "Wrong size on BGA_Ostrich_ShieldBubble_C_UserConstructionScript");
static_assert(offsetof(BGA_Ostrich_ShieldBubble_C_UserConstructionScript, CallFunc_GetValueAtLevel_ReturnValue) == 0x000000, "Member 'BGA_Ostrich_ShieldBubble_C_UserConstructionScript::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Ostrich_ShieldBubble_C_UserConstructionScript, CallFunc_GetValueAtLevel_ReturnValue_1) == 0x000004, "Member 'BGA_Ostrich_ShieldBubble_C_UserConstructionScript::CallFunc_GetValueAtLevel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Ostrich_ShieldBubble_C_UserConstructionScript, CallFunc_GetValueAtLevel_ReturnValue_2) == 0x000008, "Member 'BGA_Ostrich_ShieldBubble_C_UserConstructionScript::CallFunc_GetValueAtLevel_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BGA_Ostrich_ShieldBubble_C_UserConstructionScript, CallFunc_GetValueAtLevel_ReturnValue_3) == 0x00000C, "Member 'BGA_Ostrich_ShieldBubble_C_UserConstructionScript::CallFunc_GetValueAtLevel_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BGA_Ostrich_ShieldBubble_C_UserConstructionScript, CallFunc_GetValueAtLevel_ReturnValue_4) == 0x000010, "Member 'BGA_Ostrich_ShieldBubble_C_UserConstructionScript::CallFunc_GetValueAtLevel_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BGA_Ostrich_ShieldBubble_C_UserConstructionScript, CallFunc_GetValueAtLevel_ReturnValue_5) == 0x000014, "Member 'BGA_Ostrich_ShieldBubble_C_UserConstructionScript::CallFunc_GetValueAtLevel_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BGA_Ostrich_ShieldBubble_C_UserConstructionScript, CallFunc_GetValueAtLevel_ReturnValue_6) == 0x000018, "Member 'BGA_Ostrich_ShieldBubble_C_UserConstructionScript::CallFunc_GetValueAtLevel_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BGA_Ostrich_ShieldBubble_C_UserConstructionScript, CallFunc_GetValueAtLevel_ReturnValue_7) == 0x00001C, "Member 'BGA_Ostrich_ShieldBubble_C_UserConstructionScript::CallFunc_GetValueAtLevel_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BGA_Ostrich_ShieldBubble_C_UserConstructionScript, CallFunc_GetValueAtLevel_ReturnValue_8) == 0x000020, "Member 'BGA_Ostrich_ShieldBubble_C_UserConstructionScript::CallFunc_GetValueAtLevel_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BGA_Ostrich_ShieldBubble_C_UserConstructionScript, CallFunc_GetValueAtLevel_ReturnValue_9) == 0x000024, "Member 'BGA_Ostrich_ShieldBubble_C_UserConstructionScript::CallFunc_GetValueAtLevel_ReturnValue_9' has a wrong offset!");

// Function BGA_Ostrich_ShieldBubble.BGA_Ostrich_ShieldBubble_C.OnRep_CurrentShield
// 0x0018 (0x0018 - 0x0000)
struct BGA_Ostrich_ShieldBubble_C_OnRep_CurrentShield final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetMechMesh_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BGA_Ostrich_ShieldBubble_C_OnRep_CurrentShield) == 0x000008, "Wrong alignment on BGA_Ostrich_ShieldBubble_C_OnRep_CurrentShield");
static_assert(sizeof(BGA_Ostrich_ShieldBubble_C_OnRep_CurrentShield) == 0x000018, "Wrong size on BGA_Ostrich_ShieldBubble_C_OnRep_CurrentShield");
static_assert(offsetof(BGA_Ostrich_ShieldBubble_C_OnRep_CurrentShield, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BGA_Ostrich_ShieldBubble_C_OnRep_CurrentShield::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Ostrich_ShieldBubble_C_OnRep_CurrentShield, CallFunc_GetMechMesh_ReturnValue) == 0x000008, "Member 'BGA_Ostrich_ShieldBubble_C_OnRep_CurrentShield::CallFunc_GetMechMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Ostrich_ShieldBubble_C_OnRep_CurrentShield, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000010, "Member 'BGA_Ostrich_ShieldBubble_C_OnRep_CurrentShield::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Ostrich_ShieldBubble_C_OnRep_CurrentShield, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000014, "Member 'BGA_Ostrich_ShieldBubble_C_OnRep_CurrentShield::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");

// Function BGA_Ostrich_ShieldBubble.BGA_Ostrich_ShieldBubble_C.OnRep_IsOvercharged
// 0x0010 (0x0010 - 0x0000)
struct BGA_Ostrich_ShieldBubble_C_OnRep_IsOvercharged final
{
public:
	class USkeletalMeshComponent*                 CallFunc_GetMechMesh_ReturnValue;                  // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetMechMesh_ReturnValue_1;                // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_Ostrich_ShieldBubble_C_OnRep_IsOvercharged) == 0x000008, "Wrong alignment on BGA_Ostrich_ShieldBubble_C_OnRep_IsOvercharged");
static_assert(sizeof(BGA_Ostrich_ShieldBubble_C_OnRep_IsOvercharged) == 0x000010, "Wrong size on BGA_Ostrich_ShieldBubble_C_OnRep_IsOvercharged");
static_assert(offsetof(BGA_Ostrich_ShieldBubble_C_OnRep_IsOvercharged, CallFunc_GetMechMesh_ReturnValue) == 0x000000, "Member 'BGA_Ostrich_ShieldBubble_C_OnRep_IsOvercharged::CallFunc_GetMechMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Ostrich_ShieldBubble_C_OnRep_IsOvercharged, CallFunc_GetMechMesh_ReturnValue_1) == 0x000008, "Member 'BGA_Ostrich_ShieldBubble_C_OnRep_IsOvercharged::CallFunc_GetMechMesh_ReturnValue_1' has a wrong offset!");

// Function BGA_Ostrich_ShieldBubble.BGA_Ostrich_ShieldBubble_C.OnRep_ForceCancelOvercharge
// 0x0010 (0x0010 - 0x0000)
struct BGA_Ostrich_ShieldBubble_C_OnRep_ForceCancelOvercharge final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetMechMesh_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_Ostrich_ShieldBubble_C_OnRep_ForceCancelOvercharge) == 0x000008, "Wrong alignment on BGA_Ostrich_ShieldBubble_C_OnRep_ForceCancelOvercharge");
static_assert(sizeof(BGA_Ostrich_ShieldBubble_C_OnRep_ForceCancelOvercharge) == 0x000010, "Wrong size on BGA_Ostrich_ShieldBubble_C_OnRep_ForceCancelOvercharge");
static_assert(offsetof(BGA_Ostrich_ShieldBubble_C_OnRep_ForceCancelOvercharge, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BGA_Ostrich_ShieldBubble_C_OnRep_ForceCancelOvercharge::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Ostrich_ShieldBubble_C_OnRep_ForceCancelOvercharge, CallFunc_GetMechMesh_ReturnValue) == 0x000008, "Member 'BGA_Ostrich_ShieldBubble_C_OnRep_ForceCancelOvercharge::CallFunc_GetMechMesh_ReturnValue' has a wrong offset!");

// Function BGA_Ostrich_ShieldBubble.BGA_Ostrich_ShieldBubble_C.IsShieldActive
// 0x0003 (0x0003 - 0x0000)
struct BGA_Ostrich_ShieldBubble_C_IsShieldActive final
{
public:
	bool                                          Return;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BGA_Ostrich_ShieldBubble_C_IsShieldActive) == 0x000001, "Wrong alignment on BGA_Ostrich_ShieldBubble_C_IsShieldActive");
static_assert(sizeof(BGA_Ostrich_ShieldBubble_C_IsShieldActive) == 0x000003, "Wrong size on BGA_Ostrich_ShieldBubble_C_IsShieldActive");
static_assert(offsetof(BGA_Ostrich_ShieldBubble_C_IsShieldActive, Return) == 0x000000, "Member 'BGA_Ostrich_ShieldBubble_C_IsShieldActive::Return' has a wrong offset!");
static_assert(offsetof(BGA_Ostrich_ShieldBubble_C_IsShieldActive, CallFunc_Not_PreBool_ReturnValue) == 0x000001, "Member 'BGA_Ostrich_ShieldBubble_C_IsShieldActive::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Ostrich_ShieldBubble_C_IsShieldActive, CallFunc_BooleanAND_ReturnValue) == 0x000002, "Member 'BGA_Ostrich_ShieldBubble_C_IsShieldActive::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BGA_Ostrich_ShieldBubble.BGA_Ostrich_ShieldBubble_C.SetOverchargeAudioEnabled
// 0x0018 (0x0018 - 0x0000)
struct BGA_Ostrich_ShieldBubble_C_SetOverchargeAudioEnabled final
{
public:
	bool                                          Enabled;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue_1;         // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_Ostrich_ShieldBubble_C_SetOverchargeAudioEnabled) == 0x000008, "Wrong alignment on BGA_Ostrich_ShieldBubble_C_SetOverchargeAudioEnabled");
static_assert(sizeof(BGA_Ostrich_ShieldBubble_C_SetOverchargeAudioEnabled) == 0x000018, "Wrong size on BGA_Ostrich_ShieldBubble_C_SetOverchargeAudioEnabled");
static_assert(offsetof(BGA_Ostrich_ShieldBubble_C_SetOverchargeAudioEnabled, Enabled) == 0x000000, "Member 'BGA_Ostrich_ShieldBubble_C_SetOverchargeAudioEnabled::Enabled' has a wrong offset!");
static_assert(offsetof(BGA_Ostrich_ShieldBubble_C_SetOverchargeAudioEnabled, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'BGA_Ostrich_ShieldBubble_C_SetOverchargeAudioEnabled::CallFunc_IsValid_ReturnValue' has a wrong offset!");
