#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BGA_Athena_JollyRascal_ExtraDrop_Resource

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BGA_Athena_JollyRascal_ExtraDrop_Resource.BGA_Athena_JollyRascal_ExtraDrop_Resource_C
// 0x0280 (0x09E8 - 0x0768)
class ABGA_Athena_JollyRascal_ExtraDrop_Resource_C final : public ABuildingGameplayActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0768(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class URotatingMovementComponent*             RotatingMovement;                                  // 0x0770(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Trail;                                             // 0x0778(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Mesh;                                              // 0x0780(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       Collision;                                         // 0x0788(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFortProjectileMovementComponent*       FortProjectileMovement;                            // 0x0790(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Audio;                                             // 0x0798(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           GC_Destroy;                                        // 0x07A0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpawnPositionOffset;                               // 0x07A8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortResourceType                             ResourceType;                                      // 0x07B4(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_7B5[0x3];                                      // 0x07B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ItemCountToSpawn;                                  // 0x07B8(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7BC[0x4];                                      // 0x07BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortWorldItemDefinition*               ItemDefToSpawn;                                    // 0x07C0(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MeshIndex;                                         // 0x07C8(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_7CC[0x4];                                      // 0x07CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         Row_MetalToSpawn;                                  // 0x07D0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         Row_StoneToSpawn;                                  // 0x07F0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         Row_WoodToSpawn;                                   // 0x0810(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FHitResult                             NullHit;                                           // 0x0830(0x0088)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	TArray<class UStaticMesh*>                    WoodMeshes;                                        // 0x08B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TMap<int32, struct FTransform>                Map_WoodTransform;                                 // 0x08C8(0x0050)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class UStaticMesh*>                    MetalMeshes;                                       // 0x0918(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TMap<int32, struct FTransform>                Map_MetalTransform;                                // 0x0928(0x0050)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class UStaticMesh*>                    StoneMeshes;                                       // 0x0978(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TMap<int32, struct FTransform>                Map_StoneTransform;                                // 0x0988(0x0050)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	float                                         MinSpin;                                           // 0x09D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxSpin;                                           // 0x09DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HiddenInGame;                                      // 0x09E0(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)

public:
	void ExecuteUbergraph_BGA_Athena_JollyRascal_ExtraDrop_Resource(int32 EntryPoint);
	void RepRotation(float Rotation_Rate_X__Roll_, float Rotation_Rate_Y__Pitch_, float Rotation_Rate_Z__Yaw_);
	void Spawn_Items();
	void ReceiveHit(class UPrimitiveComponent* MyComp, class AActor* Other, class UPrimitiveComponent* OtherComp, bool bSelfMoved, const struct FVector& HitLocation, const struct FVector& HitNormal, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void ReceiveBeginPlay();
	void HideAndKill();
	void SelectResourceType();
	void SelectMesh();
	void SetMesh(TArray<class UStaticMesh*>& Array, const TMap<int32, struct FTransform>& TargetMap);
	float RandomSpin();
	void OnRep_HiddenInGame();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BGA_Athena_JollyRascal_ExtraDrop_Resource_C">();
	}
	static class ABGA_Athena_JollyRascal_ExtraDrop_Resource_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABGA_Athena_JollyRascal_ExtraDrop_Resource_C>();
	}
};
static_assert(alignof(ABGA_Athena_JollyRascal_ExtraDrop_Resource_C) == 0x000008, "Wrong alignment on ABGA_Athena_JollyRascal_ExtraDrop_Resource_C");
static_assert(sizeof(ABGA_Athena_JollyRascal_ExtraDrop_Resource_C) == 0x0009E8, "Wrong size on ABGA_Athena_JollyRascal_ExtraDrop_Resource_C");
static_assert(offsetof(ABGA_Athena_JollyRascal_ExtraDrop_Resource_C, UberGraphFrame) == 0x000768, "Member 'ABGA_Athena_JollyRascal_ExtraDrop_Resource_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_JollyRascal_ExtraDrop_Resource_C, RotatingMovement) == 0x000770, "Member 'ABGA_Athena_JollyRascal_ExtraDrop_Resource_C::RotatingMovement' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_JollyRascal_ExtraDrop_Resource_C, Trail) == 0x000778, "Member 'ABGA_Athena_JollyRascal_ExtraDrop_Resource_C::Trail' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_JollyRascal_ExtraDrop_Resource_C, Mesh) == 0x000780, "Member 'ABGA_Athena_JollyRascal_ExtraDrop_Resource_C::Mesh' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_JollyRascal_ExtraDrop_Resource_C, Collision) == 0x000788, "Member 'ABGA_Athena_JollyRascal_ExtraDrop_Resource_C::Collision' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_JollyRascal_ExtraDrop_Resource_C, FortProjectileMovement) == 0x000790, "Member 'ABGA_Athena_JollyRascal_ExtraDrop_Resource_C::FortProjectileMovement' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_JollyRascal_ExtraDrop_Resource_C, Audio) == 0x000798, "Member 'ABGA_Athena_JollyRascal_ExtraDrop_Resource_C::Audio' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_JollyRascal_ExtraDrop_Resource_C, GC_Destroy) == 0x0007A0, "Member 'ABGA_Athena_JollyRascal_ExtraDrop_Resource_C::GC_Destroy' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_JollyRascal_ExtraDrop_Resource_C, SpawnPositionOffset) == 0x0007A8, "Member 'ABGA_Athena_JollyRascal_ExtraDrop_Resource_C::SpawnPositionOffset' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_JollyRascal_ExtraDrop_Resource_C, ResourceType) == 0x0007B4, "Member 'ABGA_Athena_JollyRascal_ExtraDrop_Resource_C::ResourceType' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_JollyRascal_ExtraDrop_Resource_C, ItemCountToSpawn) == 0x0007B8, "Member 'ABGA_Athena_JollyRascal_ExtraDrop_Resource_C::ItemCountToSpawn' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_JollyRascal_ExtraDrop_Resource_C, ItemDefToSpawn) == 0x0007C0, "Member 'ABGA_Athena_JollyRascal_ExtraDrop_Resource_C::ItemDefToSpawn' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_JollyRascal_ExtraDrop_Resource_C, MeshIndex) == 0x0007C8, "Member 'ABGA_Athena_JollyRascal_ExtraDrop_Resource_C::MeshIndex' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_JollyRascal_ExtraDrop_Resource_C, Row_MetalToSpawn) == 0x0007D0, "Member 'ABGA_Athena_JollyRascal_ExtraDrop_Resource_C::Row_MetalToSpawn' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_JollyRascal_ExtraDrop_Resource_C, Row_StoneToSpawn) == 0x0007F0, "Member 'ABGA_Athena_JollyRascal_ExtraDrop_Resource_C::Row_StoneToSpawn' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_JollyRascal_ExtraDrop_Resource_C, Row_WoodToSpawn) == 0x000810, "Member 'ABGA_Athena_JollyRascal_ExtraDrop_Resource_C::Row_WoodToSpawn' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_JollyRascal_ExtraDrop_Resource_C, NullHit) == 0x000830, "Member 'ABGA_Athena_JollyRascal_ExtraDrop_Resource_C::NullHit' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_JollyRascal_ExtraDrop_Resource_C, WoodMeshes) == 0x0008B8, "Member 'ABGA_Athena_JollyRascal_ExtraDrop_Resource_C::WoodMeshes' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_JollyRascal_ExtraDrop_Resource_C, Map_WoodTransform) == 0x0008C8, "Member 'ABGA_Athena_JollyRascal_ExtraDrop_Resource_C::Map_WoodTransform' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_JollyRascal_ExtraDrop_Resource_C, MetalMeshes) == 0x000918, "Member 'ABGA_Athena_JollyRascal_ExtraDrop_Resource_C::MetalMeshes' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_JollyRascal_ExtraDrop_Resource_C, Map_MetalTransform) == 0x000928, "Member 'ABGA_Athena_JollyRascal_ExtraDrop_Resource_C::Map_MetalTransform' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_JollyRascal_ExtraDrop_Resource_C, StoneMeshes) == 0x000978, "Member 'ABGA_Athena_JollyRascal_ExtraDrop_Resource_C::StoneMeshes' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_JollyRascal_ExtraDrop_Resource_C, Map_StoneTransform) == 0x000988, "Member 'ABGA_Athena_JollyRascal_ExtraDrop_Resource_C::Map_StoneTransform' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_JollyRascal_ExtraDrop_Resource_C, MinSpin) == 0x0009D8, "Member 'ABGA_Athena_JollyRascal_ExtraDrop_Resource_C::MinSpin' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_JollyRascal_ExtraDrop_Resource_C, MaxSpin) == 0x0009DC, "Member 'ABGA_Athena_JollyRascal_ExtraDrop_Resource_C::MaxSpin' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_JollyRascal_ExtraDrop_Resource_C, HiddenInGame) == 0x0009E0, "Member 'ABGA_Athena_JollyRascal_ExtraDrop_Resource_C::HiddenInGame' has a wrong offset!");

}

