#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BGA_Athena_SilverBlazerCore

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BGA_Athena_WithGravity_Parent_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BGA_Athena_SilverBlazerCore.BGA_Athena_SilverBlazerCore_C
// 0x0018 (0x08A0 - 0x0888)
class ABGA_Athena_SilverBlazerCore_C final : public ABGA_Athena_WithGravity_Parent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BGA_Athena_SilverBlazerCore_C;      // 0x0888(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   S_SilverBlazer;                                    // 0x0890(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class AB_BGA_Athena_SilverBlazer_V2_C*        SpawnedBGA;                                        // 0x0898(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BGA_Athena_SilverBlazerCore(int32 EntryPoint);
	void Die(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum);
	void Destroyed(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum);
	void ReceiveBeginPlay();
	void OnRep_SpawnedBGA();
	void Launch(const struct FVector& LaunchSource, float Amount);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BGA_Athena_SilverBlazerCore_C">();
	}
	static class ABGA_Athena_SilverBlazerCore_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABGA_Athena_SilverBlazerCore_C>();
	}
};
static_assert(alignof(ABGA_Athena_SilverBlazerCore_C) == 0x000008, "Wrong alignment on ABGA_Athena_SilverBlazerCore_C");
static_assert(sizeof(ABGA_Athena_SilverBlazerCore_C) == 0x0008A0, "Wrong size on ABGA_Athena_SilverBlazerCore_C");
static_assert(offsetof(ABGA_Athena_SilverBlazerCore_C, UberGraphFrame_BGA_Athena_SilverBlazerCore_C) == 0x000888, "Member 'ABGA_Athena_SilverBlazerCore_C::UberGraphFrame_BGA_Athena_SilverBlazerCore_C' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_SilverBlazerCore_C, S_SilverBlazer) == 0x000890, "Member 'ABGA_Athena_SilverBlazerCore_C::S_SilverBlazer' has a wrong offset!");
static_assert(offsetof(ABGA_Athena_SilverBlazerCore_C, SpawnedBGA) == 0x000898, "Member 'ABGA_Athena_SilverBlazerCore_C::SpawnedBGA' has a wrong offset!");

}

