#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BGA_Athena_BadgerBangsStuck

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function BGA_Athena_BadgerBangsStuck.BGA_Athena_BadgerBangsStuck_C.ExecuteUbergraph_BGA_Athena_BadgerBangsStuck
// 0x0748 (0x0748 - 0x0000)
struct BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetInstigator_ReturnValue_1;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName EventName, float EmitterTime, const struct FVector& Location, const struct FVector& Velocity)> K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_DamagedActor;                   // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Damage;                         // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            K2Node_CustomEvent_InstigatedBy;                   // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DamageCauser;                   // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_HitLocation;                    // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_CustomEvent_FHitComponent;                  // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_BoneName;                       // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Momentum;                       // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_3;  // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_3;           // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_3;            // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_3;       // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep_1;           // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult_1;          // 0x00B0(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0138(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_144[0x4];                                      // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IFortVehicleInterface> K2Node_DynamicCast_AsFort_Vehicle_Interface;       // 0x0148(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortAIPawn*                            K2Node_DynamicCast_AsFort_AIPawn;                  // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AFortPlayerPawn*>                CallFunc_GetAllPassengers_ReturnValue;             // 0x0170(0x0010)(ZeroConstructor, ReferenceParm)
	class APlayerPawn_Athena_C*                   K2Node_DynamicCast_AsPlayer_Pawn_Athena;           // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AllOnSameTeam_Result;                     // 0x0189(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_OnSameTeam_ReturnValue;                   // 0x018A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x018B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABGA_Athena_SuperDingo_C*               K2Node_DynamicCast_AsBGA_Athena_Super_Dingo;       // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19A[0x6];                                      // 0x019A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AAthenaSupplyDropBalloon_C*             K2Node_DynamicCast_AsAthena_Supply_Drop_Balloon;   // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAthena_Player_Bush_C*                  K2Node_DynamicCast_AsAthena_Player_Bush;           // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x01C8(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	float                                         K2Node_Event_Damage;                               // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DC[0x4];                                      // 0x01DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  K2Node_Event_DamageTags;                           // 0x01E0(0x0020)(ConstParm)
	struct FVector                                K2Node_Event_Momentum;                             // 0x0200(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitInfo;                              // 0x020C(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_294[0x4];                                      // 0x0294(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            K2Node_Event_InstigatedBy;                         // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser;                         // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext;                        // 0x02A8(0x0018)()
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x02C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CC[0x4];                                      // 0x02CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABGA_Athena_BadgerBangsStuck_C*         K2Node_DynamicCast_AsBGA_Athena_Badger_Bangs_Stuck; // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D9[0x7];                                      // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue;    // 0x02E0(0x00B8)(ContainsInstancedReference)
	const class AFortPawn*                        K2Node_Event_InteractingPawn;                      // 0x0398(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         K2Node_MakeArray_Array_1;                          // 0x03A0(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  K2Node_DynamicCast_AsFort_Player_Controller;       // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x03C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C1[0x3];                                      // 0x03C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x03C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IFortInventoryOwnerInterface> CallFunc_GiveItemToInventoryOwner_InventoryOwner_CastInput; // 0x03D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x03E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E1[0x7];                                      // 0x03E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_2;  // 0x03E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_2;           // 0x03F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_2;            // 0x03F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_2;       // 0x0400(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x0404(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_405[0x3];                                      // 0x0405(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0408(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x0490(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x0498(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x04A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x04A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x04AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x04AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4AE[0x2];                                      // 0x04AE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x04B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x04BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4BD[0x3];                                      // 0x04BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_EventName;                      // 0x04C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_EmitterTime;                    // 0x04C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Location;                       // 0x04CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Velocity;                       // 0x04D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E4[0x4];                                      // 0x04E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetInstigator_ReturnValue_2;              // 0x04E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x04F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F1[0x7];                                      // 0x04F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_ThePlayerPawnWhoTriggers;       // 0x04F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawnAthena*                  K2Node_DynamicCast_AsFort_Player_Pawn_Athena;      // 0x0500(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x0508(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_509[0x3];                                      // 0x0509(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x050C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OnSameTeam_ReturnValue_1;                 // 0x0510(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_511[0x3];                                      // 0x0511(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0514(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x0518(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue_1;       // 0x0524(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0530(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue_2;       // 0x0538(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_544[0x4];                                      // 0x0544(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue_1;     // 0x0548(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0550(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0560(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue;        // 0x0568(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_569[0x3];                                      // 0x0569(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x056C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0570(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_571[0x3];                                      // 0x0571(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0574(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0578(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0579(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue_2;               // 0x057A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_57B[0x5];                                      // 0x057B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetClosestActorFromArray_ReturnValue;     // 0x0580(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0588(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_589[0x3];                                      // 0x0589(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_4;        // 0x058C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_Distance_ReturnValue;              // 0x0598(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_5;        // 0x059C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_6;        // 0x05A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B4[0x4];                                      // 0x05B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EFortTeamAffiliation>                  K2Node_MakeArray_Array_2;                          // 0x05B8(0x0010)(ZeroConstructor, ReferenceParm)
	uint8                                         CallFunc_GetActorTeam_ReturnValue;                 // 0x05C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_3;               // 0x05C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5CA[0x6];                                      // 0x05CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_1;  // 0x05D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAbilitySystemComponent*            K2Node_DynamicCast_AsFort_Ability_System_Component; // 0x05D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x05E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E1[0x7];                                      // 0x05E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectContextHandle           CallFunc_MakeFortEffectContext_ReturnValue;        // 0x05E8(0x0018)()
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0600(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_7;        // 0x060C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0618(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0624(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckLineOfSightToActor_ReturnValue;      // 0x0628(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_629[0x7];                                      // 0x0629(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_SphereOverlapActors_OutActors;            // 0x0630(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_SphereOverlapActors_ReturnValue;          // 0x0640(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_641[0x7];                                      // 0x0641(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_FilterByLOS__Result;                      // 0x0648(0x0010)(ZeroConstructor, ReferenceParm)
	class UParticleSystem*                        Temp_object_Variable;                              // 0x0658(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0660(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_2;  // 0x0668(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0670(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x0674(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x067C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_67D[0x3];                                      // 0x067D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueAtLevel_ReturnValue_1;            // 0x0680(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_684[0x4];                                      // 0x0684(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0688(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScaledSphereRadius_ReturnValue;        // 0x0690(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_694[0x4];                                      // 0x0694(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetInstigator_ReturnValue_3;              // 0x0698(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_NormalizeToRange_ReturnValue;             // 0x06A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OnSameTeam_ReturnValue_2;                 // 0x06A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A5[0x3];                                      // 0x06A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x06A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_1;                       // 0x06AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AFortPlayerController*>          Temp_object_Variable_1;                            // 0x06B0(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_8;        // 0x06C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_9;        // 0x06CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue_2;     // 0x06D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        Temp_object_Variable_2;                            // 0x06E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_3;  // 0x06E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        K2Node_Select_Default;                             // 0x06F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue_1; // 0x06F8(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x0700(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0708(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0710(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0718(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0720(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_724[0x4];                                      // 0x0724(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_4;  // 0x0728(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RemoveActiveEffectsWithTags_ReturnValue;  // 0x0730(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0734(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_10;       // 0x0738(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck) == 0x000008, "Wrong alignment on BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck");
static_assert(sizeof(BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck) == 0x000748, "Wrong size on BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck");
static_assert(offsetof(BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck, EntryPoint) == 0x000000, "Member 'BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck::EntryPoint' has a wrong offset!");
static_assert(offsetof(BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck, CallFunc_GetInstigator_ReturnValue) == 0x000008, "Member 'BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck, CallFunc_GetInstigator_ReturnValue_1) == 0x000010, "Member 'BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck::CallFunc_GetInstigator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck, K2Node_CreateDelegate_OutputDelegate_1) == 0x000028, "Member 'BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck, Temp_int_Array_Index_Variable) == 0x000038, "Member 'BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck, K2Node_CustomEvent_DamagedActor) == 0x000040, "Member 'BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck::K2Node_CustomEvent_DamagedActor' has a wrong offset!");
static_assert(offsetof(BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck, K2Node_CustomEvent_Damage) == 0x000048, "Member 'BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck::K2Node_CustomEvent_Damage' has a wrong offset!");
static_assert(offsetof(BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck, K2Node_CustomEvent_InstigatedBy) == 0x000050, "Member 'BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck::K2Node_CustomEvent_InstigatedBy' has a wrong offset!");
static_assert(offsetof(BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck, K2Node_CustomEvent_DamageCauser) == 0x000058, "Member 'BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck::K2Node_CustomEvent_DamageCauser' has a wrong offset!");
static_assert(offsetof(BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck, K2Node_CustomEvent_HitLocation) == 0x000060, "Member 'BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck::K2Node_CustomEvent_HitLocation' has a wrong offset!");
static_assert(offsetof(BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck, K2Node_CustomEvent_FHitComponent) == 0x000070, "Member 'BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck::K2Node_CustomEvent_FHitComponent' has a wrong offset!");
static_assert(offsetof(BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck, K2Node_CustomEvent_BoneName) == 0x000078, "Member 'BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck::K2Node_CustomEvent_BoneName' has a wrong offset!");
static_assert(offsetof(BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck, K2Node_CustomEvent_Momentum) == 0x000080, "Member 'BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck::K2Node_CustomEvent_Momentum' has a wrong offset!");
static_assert(offsetof(BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck, K2Node_ComponentBoundEvent_OverlappedComponent_3) == 0x000090, "Member 'BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck::K2Node_ComponentBoundEvent_OverlappedComponent_3' has a wrong offset!");
static_assert(offsetof(BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck, K2Node_ComponentBoundEvent_OtherActor_3) == 0x000098, "Member 'BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck::K2Node_ComponentBoundEvent_OtherActor_3' has a wrong offset!");
static_assert(offsetof(BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck, K2Node_ComponentBoundEvent_OtherComp_3) == 0x0000A0, "Member 'BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck::K2Node_ComponentBoundEvent_OtherComp_3' has a wrong offset!");
static_assert(offsetof(BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck, K2Node_ComponentBoundEvent_OtherBodyIndex_3) == 0x0000A8, "Member 'BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck::K2Node_ComponentBoundEvent_OtherBodyIndex_3' has a wrong offset!");
static_assert(offsetof(BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck, K2Node_ComponentBoundEvent_bFromSweep_1) == 0x0000AC, "Member 'BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck::K2Node_ComponentBoundEvent_bFromSweep_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck, K2Node_ComponentBoundEvent_SweepResult_1) == 0x0000B0, "Member 'BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck::K2Node_ComponentBoundEvent_SweepResult_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000138, "Member 'BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck, K2Node_DynamicCast_AsFort_Vehicle_Interface) == 0x000148, "Member 'BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck::K2Node_DynamicCast_AsFort_Vehicle_Interface' has a wrong offset!");
static_assert(offsetof(BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck, K2Node_DynamicCast_bSuccess) == 0x000158, "Member 'BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck, K2Node_DynamicCast_AsFort_AIPawn) == 0x000160, "Member 'BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck::K2Node_DynamicCast_AsFort_AIPawn' has a wrong offset!");
static_assert(offsetof(BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck, K2Node_DynamicCast_bSuccess_1) == 0x000168, "Member 'BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck, CallFunc_GetAllPassengers_ReturnValue) == 0x000170, "Member 'BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck::CallFunc_GetAllPassengers_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck, K2Node_DynamicCast_AsPlayer_Pawn_Athena) == 0x000180, "Member 'BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck::K2Node_DynamicCast_AsPlayer_Pawn_Athena' has a wrong offset!");
static_assert(offsetof(BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck, K2Node_DynamicCast_bSuccess_2) == 0x000188, "Member 'BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck, CallFunc_AllOnSameTeam_Result) == 0x000189, "Member 'BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck::CallFunc_AllOnSameTeam_Result' has a wrong offset!");
static_assert(offsetof(BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck, CallFunc_OnSameTeam_ReturnValue) == 0x00018A, "Member 'BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck::CallFunc_OnSameTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck, CallFunc_Not_PreBool_ReturnValue) == 0x00018B, "Member 'BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck, CallFunc_Array_Length_ReturnValue) == 0x00018C, "Member 'BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck, K2Node_DynamicCast_AsBGA_Athena_Super_Dingo) == 0x000190, "Member 'BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck::K2Node_DynamicCast_AsBGA_Athena_Super_Dingo' has a wrong offset!");
static_assert(offsetof(BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck, K2Node_DynamicCast_bSuccess_3) == 0x000198, "Member 'BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck, CallFunc_Greater_IntInt_ReturnValue) == 0x000199, "Member 'BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck, K2Node_DynamicCast_AsAthena_Supply_Drop_Balloon) == 0x0001A0, "Member 'BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck::K2Node_DynamicCast_AsAthena_Supply_Drop_Balloon' has a wrong offset!");
static_assert(offsetof(BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck, K2Node_DynamicCast_bSuccess_4) == 0x0001A8, "Member 'BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x0001B0, "Member 'BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck, K2Node_DynamicCast_AsAthena_Player_Bush) == 0x0001B8, "Member 'BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck::K2Node_DynamicCast_AsAthena_Player_Bush' has a wrong offset!");
static_assert(offsetof(BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck, K2Node_DynamicCast_bSuccess_5) == 0x0001C0, "Member 'BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck, K2Node_MakeArray_Array) == 0x0001C8, "Member 'BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck, K2Node_Event_Damage) == 0x0001D8, "Member 'BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck::K2Node_Event_Damage' has a wrong offset!");
static_assert(offsetof(BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck, K2Node_Event_DamageTags) == 0x0001E0, "Member 'BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck::K2Node_Event_DamageTags' has a wrong offset!");
static_assert(offsetof(BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck, K2Node_Event_Momentum) == 0x000200, "Member 'BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck::K2Node_Event_Momentum' has a wrong offset!");
static_assert(offsetof(BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck, K2Node_Event_HitInfo) == 0x00020C, "Member 'BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck::K2Node_Event_HitInfo' has a wrong offset!");
static_assert(offsetof(BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck, K2Node_Event_InstigatedBy) == 0x000298, "Member 'BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck::K2Node_Event_InstigatedBy' has a wrong offset!");
static_assert(offsetof(BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck, K2Node_Event_DamageCauser) == 0x0002A0, "Member 'BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck::K2Node_Event_DamageCauser' has a wrong offset!");
static_assert(offsetof(BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck, K2Node_Event_EffectContext) == 0x0002A8, "Member 'BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck::K2Node_Event_EffectContext' has a wrong offset!");
static_assert(offsetof(BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0002C0, "Member 'BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck, K2Node_DynamicCast_AsBGA_Athena_Badger_Bangs_Stuck) == 0x0002D0, "Member 'BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck::K2Node_DynamicCast_AsBGA_Athena_Badger_Bangs_Stuck' has a wrong offset!");
static_assert(offsetof(BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck, K2Node_DynamicCast_bSuccess_6) == 0x0002D8, "Member 'BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck, CallFunc_MakeGameplayCueParameters_ReturnValue) == 0x0002E0, "Member 'BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck::CallFunc_MakeGameplayCueParameters_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck, K2Node_Event_InteractingPawn) == 0x000398, "Member 'BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck::K2Node_Event_InteractingPawn' has a wrong offset!");
static_assert(offsetof(BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck, K2Node_MakeArray_Array_1) == 0x0003A0, "Member 'BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck, CallFunc_GetController_ReturnValue) == 0x0003B0, "Member 'BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck, K2Node_DynamicCast_AsFort_Player_Controller) == 0x0003B8, "Member 'BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck::K2Node_DynamicCast_AsFort_Player_Controller' has a wrong offset!");
static_assert(offsetof(BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck, K2Node_DynamicCast_bSuccess_7) == 0x0003C0, "Member 'BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x0003C4, "Member 'BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck, CallFunc_GiveItemToInventoryOwner_InventoryOwner_CastInput) == 0x0003D0, "Member 'BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck::CallFunc_GiveItemToInventoryOwner_InventoryOwner_CastInput' has a wrong offset!");
static_assert(offsetof(BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck, CallFunc_HasAuthority_ReturnValue) == 0x0003E0, "Member 'BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck, K2Node_ComponentBoundEvent_OverlappedComponent_2) == 0x0003E8, "Member 'BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck::K2Node_ComponentBoundEvent_OverlappedComponent_2' has a wrong offset!");
static_assert(offsetof(BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck, K2Node_ComponentBoundEvent_OtherActor_2) == 0x0003F0, "Member 'BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck::K2Node_ComponentBoundEvent_OtherActor_2' has a wrong offset!");
static_assert(offsetof(BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck, K2Node_ComponentBoundEvent_OtherComp_2) == 0x0003F8, "Member 'BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck::K2Node_ComponentBoundEvent_OtherComp_2' has a wrong offset!");
static_assert(offsetof(BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck, K2Node_ComponentBoundEvent_OtherBodyIndex_2) == 0x000400, "Member 'BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck::K2Node_ComponentBoundEvent_OtherBodyIndex_2' has a wrong offset!");
static_assert(offsetof(BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck, K2Node_ComponentBoundEvent_bFromSweep) == 0x000404, "Member 'BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck, K2Node_ComponentBoundEvent_SweepResult) == 0x000408, "Member 'BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck, K2Node_ComponentBoundEvent_OverlappedComponent_1) == 0x000490, "Member 'BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck::K2Node_ComponentBoundEvent_OverlappedComponent_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck, K2Node_ComponentBoundEvent_OtherActor_1) == 0x000498, "Member 'BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck::K2Node_ComponentBoundEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck, K2Node_ComponentBoundEvent_OtherComp_1) == 0x0004A0, "Member 'BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck::K2Node_ComponentBoundEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck, K2Node_ComponentBoundEvent_OtherBodyIndex_1) == 0x0004A8, "Member 'BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck::K2Node_ComponentBoundEvent_OtherBodyIndex_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck, CallFunc_IsValid_ReturnValue) == 0x0004AC, "Member 'BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck, CallFunc_IsValid_ReturnValue_1) == 0x0004AD, "Member 'BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck, CallFunc_K2_GetActorLocation_ReturnValue_3) == 0x0004B0, "Member 'BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck::CallFunc_K2_GetActorLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck, CallFunc_HasAuthority_ReturnValue_1) == 0x0004BC, "Member 'BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck, K2Node_CustomEvent_EventName) == 0x0004C0, "Member 'BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck::K2Node_CustomEvent_EventName' has a wrong offset!");
static_assert(offsetof(BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck, K2Node_CustomEvent_EmitterTime) == 0x0004C8, "Member 'BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck::K2Node_CustomEvent_EmitterTime' has a wrong offset!");
static_assert(offsetof(BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck, K2Node_CustomEvent_Location) == 0x0004CC, "Member 'BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck::K2Node_CustomEvent_Location' has a wrong offset!");
static_assert(offsetof(BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck, K2Node_CustomEvent_Velocity) == 0x0004D8, "Member 'BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck::K2Node_CustomEvent_Velocity' has a wrong offset!");
static_assert(offsetof(BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck, CallFunc_GetInstigator_ReturnValue_2) == 0x0004E8, "Member 'BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck::CallFunc_GetInstigator_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck, CallFunc_EqualEqual_NameName_ReturnValue) == 0x0004F0, "Member 'BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck, K2Node_CustomEvent_ThePlayerPawnWhoTriggers) == 0x0004F8, "Member 'BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck::K2Node_CustomEvent_ThePlayerPawnWhoTriggers' has a wrong offset!");
static_assert(offsetof(BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck, K2Node_DynamicCast_AsFort_Player_Pawn_Athena) == 0x000500, "Member 'BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck::K2Node_DynamicCast_AsFort_Player_Pawn_Athena' has a wrong offset!");
static_assert(offsetof(BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck, K2Node_DynamicCast_bSuccess_8) == 0x000508, "Member 'BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck::K2Node_DynamicCast_bSuccess_8' has a wrong offset!");
static_assert(offsetof(BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck, Temp_int_Loop_Counter_Variable) == 0x00050C, "Member 'BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck, CallFunc_OnSameTeam_ReturnValue_1) == 0x000510, "Member 'BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck::CallFunc_OnSameTeam_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck, CallFunc_Add_IntInt_ReturnValue) == 0x000514, "Member 'BGA_Athena_BadgerBangsStuck_C_ExecuteUbergraph_BGA_Athena_BadgerBangsStuck::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
