#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BGA_Athena_SilverBlazerCore

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BGA_Athena_SilverBlazerCore.BGA_Athena_SilverBlazerCore_C.ExecuteUbergraph_BGA_Athena_SilverBlazerCore
// 0x01A0 (0x01A0 - 0x0000)
struct BGA_Athena_SilverBlazerCore_C_ExecuteUbergraph_BGA_Athena_SilverBlazerCore final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum)> K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24[0xC];                                       // 0x0024(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0030(0x0030)(IsPlainOldData, NoDestructor)
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0090(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AB_BGA_Athena_SilverBlazer_V2_C*        CallFunc_FinishSpawningActor_ReturnValue;          // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_DamagedActor_1;                 // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Damage_1;                       // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            K2Node_CustomEvent_InstigatedBy_1;                 // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DamageCauser_1;                 // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_HitLocation_1;                  // 0x0100(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_CustomEvent_FHitComponent_1;                // 0x0110(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_BoneName_1;                     // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Momentum_1;                     // 0x0120(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_DamagedActor;                   // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Damage;                         // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            K2Node_CustomEvent_InstigatedBy;                   // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DamageCauser;                   // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_HitLocation;                    // 0x0150(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_CustomEvent_FHitComponent;                  // 0x0160(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_BoneName;                       // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Momentum;                       // 0x0170(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x017C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0188(0x0010)(ZeroConstructor, NoDestructor)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0198(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_Athena_SilverBlazerCore_C_ExecuteUbergraph_BGA_Athena_SilverBlazerCore) == 0x000010, "Wrong alignment on BGA_Athena_SilverBlazerCore_C_ExecuteUbergraph_BGA_Athena_SilverBlazerCore");
static_assert(sizeof(BGA_Athena_SilverBlazerCore_C_ExecuteUbergraph_BGA_Athena_SilverBlazerCore) == 0x0001A0, "Wrong size on BGA_Athena_SilverBlazerCore_C_ExecuteUbergraph_BGA_Athena_SilverBlazerCore");
static_assert(offsetof(BGA_Athena_SilverBlazerCore_C_ExecuteUbergraph_BGA_Athena_SilverBlazerCore, EntryPoint) == 0x000000, "Member 'BGA_Athena_SilverBlazerCore_C_ExecuteUbergraph_BGA_Athena_SilverBlazerCore::EntryPoint' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SilverBlazerCore_C_ExecuteUbergraph_BGA_Athena_SilverBlazerCore, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000008, "Member 'BGA_Athena_SilverBlazerCore_C_ExecuteUbergraph_BGA_Athena_SilverBlazerCore::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SilverBlazerCore_C_ExecuteUbergraph_BGA_Athena_SilverBlazerCore, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'BGA_Athena_SilverBlazerCore_C_ExecuteUbergraph_BGA_Athena_SilverBlazerCore::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SilverBlazerCore_C_ExecuteUbergraph_BGA_Athena_SilverBlazerCore, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000020, "Member 'BGA_Athena_SilverBlazerCore_C_ExecuteUbergraph_BGA_Athena_SilverBlazerCore::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SilverBlazerCore_C_ExecuteUbergraph_BGA_Athena_SilverBlazerCore, Temp_bool_Has_Been_Initd_Variable) == 0x000021, "Member 'BGA_Athena_SilverBlazerCore_C_ExecuteUbergraph_BGA_Athena_SilverBlazerCore::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SilverBlazerCore_C_ExecuteUbergraph_BGA_Athena_SilverBlazerCore, CallFunc_HasAuthority_ReturnValue) == 0x000022, "Member 'BGA_Athena_SilverBlazerCore_C_ExecuteUbergraph_BGA_Athena_SilverBlazerCore::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SilverBlazerCore_C_ExecuteUbergraph_BGA_Athena_SilverBlazerCore, CallFunc_IsDedicatedServer_ReturnValue) == 0x000023, "Member 'BGA_Athena_SilverBlazerCore_C_ExecuteUbergraph_BGA_Athena_SilverBlazerCore::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SilverBlazerCore_C_ExecuteUbergraph_BGA_Athena_SilverBlazerCore, CallFunc_GetTransform_ReturnValue) == 0x000030, "Member 'BGA_Athena_SilverBlazerCore_C_ExecuteUbergraph_BGA_Athena_SilverBlazerCore::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SilverBlazerCore_C_ExecuteUbergraph_BGA_Athena_SilverBlazerCore, CallFunc_GetInstigator_ReturnValue) == 0x000060, "Member 'BGA_Athena_SilverBlazerCore_C_ExecuteUbergraph_BGA_Athena_SilverBlazerCore::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SilverBlazerCore_C_ExecuteUbergraph_BGA_Athena_SilverBlazerCore, CallFunc_BreakTransform_Location) == 0x000068, "Member 'BGA_Athena_SilverBlazerCore_C_ExecuteUbergraph_BGA_Athena_SilverBlazerCore::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SilverBlazerCore_C_ExecuteUbergraph_BGA_Athena_SilverBlazerCore, CallFunc_BreakTransform_Rotation) == 0x000074, "Member 'BGA_Athena_SilverBlazerCore_C_ExecuteUbergraph_BGA_Athena_SilverBlazerCore::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SilverBlazerCore_C_ExecuteUbergraph_BGA_Athena_SilverBlazerCore, CallFunc_BreakTransform_Scale) == 0x000080, "Member 'BGA_Athena_SilverBlazerCore_C_ExecuteUbergraph_BGA_Athena_SilverBlazerCore::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SilverBlazerCore_C_ExecuteUbergraph_BGA_Athena_SilverBlazerCore, CallFunc_MakeTransform_ReturnValue) == 0x000090, "Member 'BGA_Athena_SilverBlazerCore_C_ExecuteUbergraph_BGA_Athena_SilverBlazerCore::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SilverBlazerCore_C_ExecuteUbergraph_BGA_Athena_SilverBlazerCore, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0000C0, "Member 'BGA_Athena_SilverBlazerCore_C_ExecuteUbergraph_BGA_Athena_SilverBlazerCore::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SilverBlazerCore_C_ExecuteUbergraph_BGA_Athena_SilverBlazerCore, CallFunc_Array_Add_ReturnValue) == 0x0000C8, "Member 'BGA_Athena_SilverBlazerCore_C_ExecuteUbergraph_BGA_Athena_SilverBlazerCore::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SilverBlazerCore_C_ExecuteUbergraph_BGA_Athena_SilverBlazerCore, CallFunc_FinishSpawningActor_ReturnValue) == 0x0000D0, "Member 'BGA_Athena_SilverBlazerCore_C_ExecuteUbergraph_BGA_Athena_SilverBlazerCore::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SilverBlazerCore_C_ExecuteUbergraph_BGA_Athena_SilverBlazerCore, Temp_bool_IsClosed_Variable) == 0x0000D8, "Member 'BGA_Athena_SilverBlazerCore_C_ExecuteUbergraph_BGA_Athena_SilverBlazerCore::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SilverBlazerCore_C_ExecuteUbergraph_BGA_Athena_SilverBlazerCore, K2Node_CustomEvent_DamagedActor_1) == 0x0000E0, "Member 'BGA_Athena_SilverBlazerCore_C_ExecuteUbergraph_BGA_Athena_SilverBlazerCore::K2Node_CustomEvent_DamagedActor_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SilverBlazerCore_C_ExecuteUbergraph_BGA_Athena_SilverBlazerCore, K2Node_CustomEvent_Damage_1) == 0x0000E8, "Member 'BGA_Athena_SilverBlazerCore_C_ExecuteUbergraph_BGA_Athena_SilverBlazerCore::K2Node_CustomEvent_Damage_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SilverBlazerCore_C_ExecuteUbergraph_BGA_Athena_SilverBlazerCore, K2Node_CustomEvent_InstigatedBy_1) == 0x0000F0, "Member 'BGA_Athena_SilverBlazerCore_C_ExecuteUbergraph_BGA_Athena_SilverBlazerCore::K2Node_CustomEvent_InstigatedBy_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SilverBlazerCore_C_ExecuteUbergraph_BGA_Athena_SilverBlazerCore, K2Node_CustomEvent_DamageCauser_1) == 0x0000F8, "Member 'BGA_Athena_SilverBlazerCore_C_ExecuteUbergraph_BGA_Athena_SilverBlazerCore::K2Node_CustomEvent_DamageCauser_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SilverBlazerCore_C_ExecuteUbergraph_BGA_Athena_SilverBlazerCore, K2Node_CustomEvent_HitLocation_1) == 0x000100, "Member 'BGA_Athena_SilverBlazerCore_C_ExecuteUbergraph_BGA_Athena_SilverBlazerCore::K2Node_CustomEvent_HitLocation_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SilverBlazerCore_C_ExecuteUbergraph_BGA_Athena_SilverBlazerCore, K2Node_CustomEvent_FHitComponent_1) == 0x000110, "Member 'BGA_Athena_SilverBlazerCore_C_ExecuteUbergraph_BGA_Athena_SilverBlazerCore::K2Node_CustomEvent_FHitComponent_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SilverBlazerCore_C_ExecuteUbergraph_BGA_Athena_SilverBlazerCore, K2Node_CustomEvent_BoneName_1) == 0x000118, "Member 'BGA_Athena_SilverBlazerCore_C_ExecuteUbergraph_BGA_Athena_SilverBlazerCore::K2Node_CustomEvent_BoneName_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SilverBlazerCore_C_ExecuteUbergraph_BGA_Athena_SilverBlazerCore, K2Node_CustomEvent_Momentum_1) == 0x000120, "Member 'BGA_Athena_SilverBlazerCore_C_ExecuteUbergraph_BGA_Athena_SilverBlazerCore::K2Node_CustomEvent_Momentum_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SilverBlazerCore_C_ExecuteUbergraph_BGA_Athena_SilverBlazerCore, K2Node_CustomEvent_DamagedActor) == 0x000130, "Member 'BGA_Athena_SilverBlazerCore_C_ExecuteUbergraph_BGA_Athena_SilverBlazerCore::K2Node_CustomEvent_DamagedActor' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SilverBlazerCore_C_ExecuteUbergraph_BGA_Athena_SilverBlazerCore, K2Node_CustomEvent_Damage) == 0x000138, "Member 'BGA_Athena_SilverBlazerCore_C_ExecuteUbergraph_BGA_Athena_SilverBlazerCore::K2Node_CustomEvent_Damage' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SilverBlazerCore_C_ExecuteUbergraph_BGA_Athena_SilverBlazerCore, K2Node_CustomEvent_InstigatedBy) == 0x000140, "Member 'BGA_Athena_SilverBlazerCore_C_ExecuteUbergraph_BGA_Athena_SilverBlazerCore::K2Node_CustomEvent_InstigatedBy' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SilverBlazerCore_C_ExecuteUbergraph_BGA_Athena_SilverBlazerCore, K2Node_CustomEvent_DamageCauser) == 0x000148, "Member 'BGA_Athena_SilverBlazerCore_C_ExecuteUbergraph_BGA_Athena_SilverBlazerCore::K2Node_CustomEvent_DamageCauser' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SilverBlazerCore_C_ExecuteUbergraph_BGA_Athena_SilverBlazerCore, K2Node_CustomEvent_HitLocation) == 0x000150, "Member 'BGA_Athena_SilverBlazerCore_C_ExecuteUbergraph_BGA_Athena_SilverBlazerCore::K2Node_CustomEvent_HitLocation' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SilverBlazerCore_C_ExecuteUbergraph_BGA_Athena_SilverBlazerCore, K2Node_CustomEvent_FHitComponent) == 0x000160, "Member 'BGA_Athena_SilverBlazerCore_C_ExecuteUbergraph_BGA_Athena_SilverBlazerCore::K2Node_CustomEvent_FHitComponent' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SilverBlazerCore_C_ExecuteUbergraph_BGA_Athena_SilverBlazerCore, K2Node_CustomEvent_BoneName) == 0x000168, "Member 'BGA_Athena_SilverBlazerCore_C_ExecuteUbergraph_BGA_Athena_SilverBlazerCore::K2Node_CustomEvent_BoneName' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SilverBlazerCore_C_ExecuteUbergraph_BGA_Athena_SilverBlazerCore, K2Node_CustomEvent_Momentum) == 0x000170, "Member 'BGA_Athena_SilverBlazerCore_C_ExecuteUbergraph_BGA_Athena_SilverBlazerCore::K2Node_CustomEvent_Momentum' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SilverBlazerCore_C_ExecuteUbergraph_BGA_Athena_SilverBlazerCore, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00017C, "Member 'BGA_Athena_SilverBlazerCore_C_ExecuteUbergraph_BGA_Athena_SilverBlazerCore::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SilverBlazerCore_C_ExecuteUbergraph_BGA_Athena_SilverBlazerCore, K2Node_CreateDelegate_OutputDelegate_1) == 0x000188, "Member 'BGA_Athena_SilverBlazerCore_C_ExecuteUbergraph_BGA_Athena_SilverBlazerCore::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SilverBlazerCore_C_ExecuteUbergraph_BGA_Athena_SilverBlazerCore, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000198, "Member 'BGA_Athena_SilverBlazerCore_C_ExecuteUbergraph_BGA_Athena_SilverBlazerCore::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");

// Function BGA_Athena_SilverBlazerCore.BGA_Athena_SilverBlazerCore_C.Die
// 0x0050 (0x0050 - 0x0000)
struct BGA_Athena_SilverBlazerCore_C_Die final
{
public:
	class AActor*                                 DamagedActor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Damage;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            InstigatedBy;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitLocation;                                       // 0x0020(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    FHitComponent;                                     // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   BoneName;                                          // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Momentum;                                          // 0x0040(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_Athena_SilverBlazerCore_C_Die) == 0x000008, "Wrong alignment on BGA_Athena_SilverBlazerCore_C_Die");
static_assert(sizeof(BGA_Athena_SilverBlazerCore_C_Die) == 0x000050, "Wrong size on BGA_Athena_SilverBlazerCore_C_Die");
static_assert(offsetof(BGA_Athena_SilverBlazerCore_C_Die, DamagedActor) == 0x000000, "Member 'BGA_Athena_SilverBlazerCore_C_Die::DamagedActor' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SilverBlazerCore_C_Die, Damage) == 0x000008, "Member 'BGA_Athena_SilverBlazerCore_C_Die::Damage' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SilverBlazerCore_C_Die, InstigatedBy) == 0x000010, "Member 'BGA_Athena_SilverBlazerCore_C_Die::InstigatedBy' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SilverBlazerCore_C_Die, DamageCauser) == 0x000018, "Member 'BGA_Athena_SilverBlazerCore_C_Die::DamageCauser' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SilverBlazerCore_C_Die, HitLocation) == 0x000020, "Member 'BGA_Athena_SilverBlazerCore_C_Die::HitLocation' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SilverBlazerCore_C_Die, FHitComponent) == 0x000030, "Member 'BGA_Athena_SilverBlazerCore_C_Die::FHitComponent' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SilverBlazerCore_C_Die, BoneName) == 0x000038, "Member 'BGA_Athena_SilverBlazerCore_C_Die::BoneName' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SilverBlazerCore_C_Die, Momentum) == 0x000040, "Member 'BGA_Athena_SilverBlazerCore_C_Die::Momentum' has a wrong offset!");

// Function BGA_Athena_SilverBlazerCore.BGA_Athena_SilverBlazerCore_C.Destroyed
// 0x0050 (0x0050 - 0x0000)
struct BGA_Athena_SilverBlazerCore_C_Destroyed final
{
public:
	class AActor*                                 DamagedActor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Damage;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            InstigatedBy;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitLocation;                                       // 0x0020(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    FHitComponent;                                     // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   BoneName;                                          // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Momentum;                                          // 0x0040(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_Athena_SilverBlazerCore_C_Destroyed) == 0x000008, "Wrong alignment on BGA_Athena_SilverBlazerCore_C_Destroyed");
static_assert(sizeof(BGA_Athena_SilverBlazerCore_C_Destroyed) == 0x000050, "Wrong size on BGA_Athena_SilverBlazerCore_C_Destroyed");
static_assert(offsetof(BGA_Athena_SilverBlazerCore_C_Destroyed, DamagedActor) == 0x000000, "Member 'BGA_Athena_SilverBlazerCore_C_Destroyed::DamagedActor' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SilverBlazerCore_C_Destroyed, Damage) == 0x000008, "Member 'BGA_Athena_SilverBlazerCore_C_Destroyed::Damage' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SilverBlazerCore_C_Destroyed, InstigatedBy) == 0x000010, "Member 'BGA_Athena_SilverBlazerCore_C_Destroyed::InstigatedBy' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SilverBlazerCore_C_Destroyed, DamageCauser) == 0x000018, "Member 'BGA_Athena_SilverBlazerCore_C_Destroyed::DamageCauser' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SilverBlazerCore_C_Destroyed, HitLocation) == 0x000020, "Member 'BGA_Athena_SilverBlazerCore_C_Destroyed::HitLocation' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SilverBlazerCore_C_Destroyed, FHitComponent) == 0x000030, "Member 'BGA_Athena_SilverBlazerCore_C_Destroyed::FHitComponent' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SilverBlazerCore_C_Destroyed, BoneName) == 0x000038, "Member 'BGA_Athena_SilverBlazerCore_C_Destroyed::BoneName' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SilverBlazerCore_C_Destroyed, Momentum) == 0x000040, "Member 'BGA_Athena_SilverBlazerCore_C_Destroyed::Momentum' has a wrong offset!");

// Function BGA_Athena_SilverBlazerCore.BGA_Athena_SilverBlazerCore_C.OnRep_SpawnedBGA
// 0x000C (0x000C - 0x0000)
struct BGA_Athena_SilverBlazerCore_C_OnRep_SpawnedBGA final
{
public:
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGA_Athena_SilverBlazerCore_C_OnRep_SpawnedBGA) == 0x000004, "Wrong alignment on BGA_Athena_SilverBlazerCore_C_OnRep_SpawnedBGA");
static_assert(sizeof(BGA_Athena_SilverBlazerCore_C_OnRep_SpawnedBGA) == 0x00000C, "Wrong size on BGA_Athena_SilverBlazerCore_C_OnRep_SpawnedBGA");
static_assert(offsetof(BGA_Athena_SilverBlazerCore_C_OnRep_SpawnedBGA, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000000, "Member 'BGA_Athena_SilverBlazerCore_C_OnRep_SpawnedBGA::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");

// Function BGA_Athena_SilverBlazerCore.BGA_Athena_SilverBlazerCore_C.Launch
// 0x0250 (0x0250 - 0x0000)
struct BGA_Athena_SilverBlazerCore_C_Launch final
{
public:
	struct FVector                                LaunchSource;                                      // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Amount;                                            // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0020(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue_1;                     // 0x0078(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_2;       // 0x0084(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_VectorToString_ReturnValue;          // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x00B0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x013A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13B[0x1];                                      // 0x013B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0144(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0150(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x015C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0168(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_174[0x4];                                      // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0188(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x01A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x01AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x01B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x01C4(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x024C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BGA_Athena_SilverBlazerCore_C_Launch) == 0x000008, "Wrong alignment on BGA_Athena_SilverBlazerCore_C_Launch");
static_assert(sizeof(BGA_Athena_SilverBlazerCore_C_Launch) == 0x000250, "Wrong size on BGA_Athena_SilverBlazerCore_C_Launch");
static_assert(offsetof(BGA_Athena_SilverBlazerCore_C_Launch, LaunchSource) == 0x000000, "Member 'BGA_Athena_SilverBlazerCore_C_Launch::LaunchSource' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SilverBlazerCore_C_Launch, Amount) == 0x00000C, "Member 'BGA_Athena_SilverBlazerCore_C_Launch::Amount' has a wrong offset!");
static_assert(offsetof(BGA_Athena_SilverBlazerCore_C_Launch, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000010, "Member 'BGA_Athena_SilverBlazerCore_C_Launch::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
