#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BladeMenu_SocialPanel

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BladeMenu_SocialPanel.BladeMenu_SocialPanel_C
// 0x0020 (0x0278 - 0x0258)
class UBladeMenu_SocialPanel_C final : public UFortBladeMenu_SocialPanel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnClose;                                           // 0x0260(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnOpen;                                            // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_Content;                                  // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void OnOpened();
	void OnInitialized();
	void OnClosed();
	void OnCloseAnimationFinished();
	void ExecuteUbergraph_BladeMenu_SocialPanel(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BladeMenu_SocialPanel_C">();
	}
	static class UBladeMenu_SocialPanel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBladeMenu_SocialPanel_C>();
	}
};
static_assert(alignof(UBladeMenu_SocialPanel_C) == 0x000008, "Wrong alignment on UBladeMenu_SocialPanel_C");
static_assert(sizeof(UBladeMenu_SocialPanel_C) == 0x000278, "Wrong size on UBladeMenu_SocialPanel_C");
static_assert(offsetof(UBladeMenu_SocialPanel_C, UberGraphFrame) == 0x000258, "Member 'UBladeMenu_SocialPanel_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBladeMenu_SocialPanel_C, OnClose) == 0x000260, "Member 'UBladeMenu_SocialPanel_C::OnClose' has a wrong offset!");
static_assert(offsetof(UBladeMenu_SocialPanel_C, OnOpen) == 0x000268, "Member 'UBladeMenu_SocialPanel_C::OnOpen' has a wrong offset!");
static_assert(offsetof(UBladeMenu_SocialPanel_C, SafeZone_Content) == 0x000270, "Member 'UBladeMenu_SocialPanel_C::SafeZone_Content' has a wrong offset!");

}

