#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FrontendBackPlate

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_FrontendBackPlate.BP_FrontendBackPlate_C
// 0x00F0 (0x0308 - 0x0218)
class ABP_FrontendBackPlate_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0218(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               ParticleSystem11;                                  // 0x0220(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               ParticleSystem1;                                   // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_FrontendBackPlate_Floor;                        // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh_fog;                                    // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Suckage_FlareScaleB_26FA49894E4D045B21346598A2D837C2; // 0x0250(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Suckage_FlareScaleA_26FA49894E4D045B21346598A2D837C2; // 0x025C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Suckage_FlareBrightness_26FA49894E4D045B21346598A2D837C2; // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Suckage_NewTrack_0_26FA49894E4D045B21346598A2D837C2; // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Suckage__Direction_26FA49894E4D045B21346598A2D837C2; // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_271[0x7];                                      // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Suckage;                                           // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               BackgroundTexture;                                 // 0x0280(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Material_background;                               // 0x0288(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Material_Fog;                                      // 0x0290(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               BlurMaterial;                                      // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 RenderTarget;                                      // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UpdateFoginRealTime;                               // 0x02A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A9[0x7];                                      // 0x02A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               MID_Floor;                                         // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     PreBlurMaterial;                                   // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 RenderTarget_preblur;                              // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MID_Background;                                    // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MID_Preblur;                                       // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              BeginRockyRidge;                                   // 0x02D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnRockyRidgeFinished;                              // 0x02E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              HidePlayer;                                        // 0x02F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_BP_FrontendBackPlate(int32 EntryPoint);
	void ResetSuckage();
	void TestFrontendSuckage();
	void ReceiveBeginPlay();
	void SetEnableBlackMondayFX(bool IsEnabled);
	void TestBlur();
	void UpdateSettings();
	void ReceiveTick(float DeltaSeconds);
	void Suckage__UpdateFunc();
	void Suckage__FinishedFunc();
	void UserConstructionScript();
	void SetBackgroundTexture(class UTexture* Texture, class UMaterialInterface* Material, class UMaterialInterface* PreBlurMaterial_0);
	void UpdateRenderTarget();
	void EnableRealtimeUpdate(bool Enabled);
	void UpdateRenderTargetRealtime();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_FrontendBackPlate_C">();
	}
	static class ABP_FrontendBackPlate_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_FrontendBackPlate_C>();
	}
};
static_assert(alignof(ABP_FrontendBackPlate_C) == 0x000008, "Wrong alignment on ABP_FrontendBackPlate_C");
static_assert(sizeof(ABP_FrontendBackPlate_C) == 0x000308, "Wrong size on ABP_FrontendBackPlate_C");
static_assert(offsetof(ABP_FrontendBackPlate_C, UberGraphFrame) == 0x000218, "Member 'ABP_FrontendBackPlate_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_FrontendBackPlate_C, ParticleSystem11) == 0x000220, "Member 'ABP_FrontendBackPlate_C::ParticleSystem11' has a wrong offset!");
static_assert(offsetof(ABP_FrontendBackPlate_C, ParticleSystem1) == 0x000228, "Member 'ABP_FrontendBackPlate_C::ParticleSystem1' has a wrong offset!");
static_assert(offsetof(ABP_FrontendBackPlate_C, SM_FrontendBackPlate_Floor) == 0x000230, "Member 'ABP_FrontendBackPlate_C::SM_FrontendBackPlate_Floor' has a wrong offset!");
static_assert(offsetof(ABP_FrontendBackPlate_C, StaticMesh_fog) == 0x000238, "Member 'ABP_FrontendBackPlate_C::StaticMesh_fog' has a wrong offset!");
static_assert(offsetof(ABP_FrontendBackPlate_C, StaticMesh) == 0x000240, "Member 'ABP_FrontendBackPlate_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_FrontendBackPlate_C, DefaultSceneRoot) == 0x000248, "Member 'ABP_FrontendBackPlate_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_FrontendBackPlate_C, Suckage_FlareScaleB_26FA49894E4D045B21346598A2D837C2) == 0x000250, "Member 'ABP_FrontendBackPlate_C::Suckage_FlareScaleB_26FA49894E4D045B21346598A2D837C2' has a wrong offset!");
static_assert(offsetof(ABP_FrontendBackPlate_C, Suckage_FlareScaleA_26FA49894E4D045B21346598A2D837C2) == 0x00025C, "Member 'ABP_FrontendBackPlate_C::Suckage_FlareScaleA_26FA49894E4D045B21346598A2D837C2' has a wrong offset!");
static_assert(offsetof(ABP_FrontendBackPlate_C, Suckage_FlareBrightness_26FA49894E4D045B21346598A2D837C2) == 0x000268, "Member 'ABP_FrontendBackPlate_C::Suckage_FlareBrightness_26FA49894E4D045B21346598A2D837C2' has a wrong offset!");
static_assert(offsetof(ABP_FrontendBackPlate_C, Suckage_NewTrack_0_26FA49894E4D045B21346598A2D837C2) == 0x00026C, "Member 'ABP_FrontendBackPlate_C::Suckage_NewTrack_0_26FA49894E4D045B21346598A2D837C2' has a wrong offset!");
static_assert(offsetof(ABP_FrontendBackPlate_C, Suckage__Direction_26FA49894E4D045B21346598A2D837C2) == 0x000270, "Member 'ABP_FrontendBackPlate_C::Suckage__Direction_26FA49894E4D045B21346598A2D837C2' has a wrong offset!");
static_assert(offsetof(ABP_FrontendBackPlate_C, Suckage) == 0x000278, "Member 'ABP_FrontendBackPlate_C::Suckage' has a wrong offset!");
static_assert(offsetof(ABP_FrontendBackPlate_C, BackgroundTexture) == 0x000280, "Member 'ABP_FrontendBackPlate_C::BackgroundTexture' has a wrong offset!");
static_assert(offsetof(ABP_FrontendBackPlate_C, Material_background) == 0x000288, "Member 'ABP_FrontendBackPlate_C::Material_background' has a wrong offset!");
static_assert(offsetof(ABP_FrontendBackPlate_C, Material_Fog) == 0x000290, "Member 'ABP_FrontendBackPlate_C::Material_Fog' has a wrong offset!");
static_assert(offsetof(ABP_FrontendBackPlate_C, BlurMaterial) == 0x000298, "Member 'ABP_FrontendBackPlate_C::BlurMaterial' has a wrong offset!");
static_assert(offsetof(ABP_FrontendBackPlate_C, RenderTarget) == 0x0002A0, "Member 'ABP_FrontendBackPlate_C::RenderTarget' has a wrong offset!");
static_assert(offsetof(ABP_FrontendBackPlate_C, UpdateFoginRealTime) == 0x0002A8, "Member 'ABP_FrontendBackPlate_C::UpdateFoginRealTime' has a wrong offset!");
static_assert(offsetof(ABP_FrontendBackPlate_C, MID_Floor) == 0x0002B0, "Member 'ABP_FrontendBackPlate_C::MID_Floor' has a wrong offset!");
static_assert(offsetof(ABP_FrontendBackPlate_C, PreBlurMaterial) == 0x0002B8, "Member 'ABP_FrontendBackPlate_C::PreBlurMaterial' has a wrong offset!");
static_assert(offsetof(ABP_FrontendBackPlate_C, RenderTarget_preblur) == 0x0002C0, "Member 'ABP_FrontendBackPlate_C::RenderTarget_preblur' has a wrong offset!");
static_assert(offsetof(ABP_FrontendBackPlate_C, MID_Background) == 0x0002C8, "Member 'ABP_FrontendBackPlate_C::MID_Background' has a wrong offset!");
static_assert(offsetof(ABP_FrontendBackPlate_C, MID_Preblur) == 0x0002D0, "Member 'ABP_FrontendBackPlate_C::MID_Preblur' has a wrong offset!");
static_assert(offsetof(ABP_FrontendBackPlate_C, BeginRockyRidge) == 0x0002D8, "Member 'ABP_FrontendBackPlate_C::BeginRockyRidge' has a wrong offset!");
static_assert(offsetof(ABP_FrontendBackPlate_C, OnRockyRidgeFinished) == 0x0002E8, "Member 'ABP_FrontendBackPlate_C::OnRockyRidgeFinished' has a wrong offset!");
static_assert(offsetof(ABP_FrontendBackPlate_C, HidePlayer) == 0x0002F8, "Member 'ABP_FrontendBackPlate_C::HidePlayer' has a wrong offset!");

}

