#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Frontend_ShopBG

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Frontend_ShopBG.BP_Frontend_ShopBG_C
// 0x00B8 (0x02D0 - 0x0218)
class ABP_Frontend_ShopBG_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0218(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Cone;                                              // 0x0220(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Plane;                                             // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BackgroundTexturePlane;                            // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   VeryLargeBackgroundPlane;                          // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene_Signal;                                      // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         BlackMondayRotation_NewTrack_0_31B6A38F4ACA527A883B3EBC702A1D11; // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            BlackMondayRotation__Direction_31B6A38F4ACA527A883B3EBC702A1D11; // 0x025C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25D[0x3];                                      // 0x025D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     BlackMondayRotation;                               // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SignalIntro_NewTrack_0_CB796D694FE88CB3D9AEFFB3C7CA6D41; // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            SignalIntro__Direction_CB796D694FE88CB3D9AEFFB3C7CA6D41; // 0x026C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26D[0x3];                                      // 0x026D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     SignalIntro;                                       // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SignalAmbientMovement_Float_0C7FC81E45F7A9B3A9FA3E93878D5F70; // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            SignalAmbientMovement__Direction_0C7FC81E45F7A9B3A9FA3E93878D5F70; // 0x027C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27D[0x3];                                      // 0x027D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     SignalAmbientMovement;                             // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Rot_Intro;                                         // 0x0288(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                               NextRot;                                           // 0x0294(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                               Rot_0;                                             // 0x02A0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                               Rot_2;                                             // 0x02AC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         PlayRate;                                          // 0x02B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Rot_IntroStart;                                    // 0x02BC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bHasEvent;                                         // 0x02C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void SignalIntro__UpdateFunc();
	void SignalIntro__FinishedFunc();
	void SignalAmbientMovement__UpdateFunc();
	void SignalAmbientMovement__FinishedFunc();
	void SetupNextRot();
	void SetDynamicEnvironmentEvent(const class FString& InPresetEnvName);
	void SetDynamicBG(class UTexture* InTexture);
	void ReceiveBeginPlay();
	void EnableDynamicShopBG();
	void BlackMondayRotation__UpdateFunc();
	void BlackMondayRotation__FinishedFunc();
	void ExecuteUbergraph_BP_Frontend_ShopBG(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Frontend_ShopBG_C">();
	}
	static class ABP_Frontend_ShopBG_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Frontend_ShopBG_C>();
	}
};
static_assert(alignof(ABP_Frontend_ShopBG_C) == 0x000008, "Wrong alignment on ABP_Frontend_ShopBG_C");
static_assert(sizeof(ABP_Frontend_ShopBG_C) == 0x0002D0, "Wrong size on ABP_Frontend_ShopBG_C");
static_assert(offsetof(ABP_Frontend_ShopBG_C, UberGraphFrame) == 0x000218, "Member 'ABP_Frontend_ShopBG_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_ShopBG_C, Cone) == 0x000220, "Member 'ABP_Frontend_ShopBG_C::Cone' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_ShopBG_C, Plane) == 0x000228, "Member 'ABP_Frontend_ShopBG_C::Plane' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_ShopBG_C, Scene) == 0x000230, "Member 'ABP_Frontend_ShopBG_C::Scene' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_ShopBG_C, BackgroundTexturePlane) == 0x000238, "Member 'ABP_Frontend_ShopBG_C::BackgroundTexturePlane' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_ShopBG_C, VeryLargeBackgroundPlane) == 0x000240, "Member 'ABP_Frontend_ShopBG_C::VeryLargeBackgroundPlane' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_ShopBG_C, Scene_Signal) == 0x000248, "Member 'ABP_Frontend_ShopBG_C::Scene_Signal' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_ShopBG_C, DefaultSceneRoot) == 0x000250, "Member 'ABP_Frontend_ShopBG_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_ShopBG_C, BlackMondayRotation_NewTrack_0_31B6A38F4ACA527A883B3EBC702A1D11) == 0x000258, "Member 'ABP_Frontend_ShopBG_C::BlackMondayRotation_NewTrack_0_31B6A38F4ACA527A883B3EBC702A1D11' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_ShopBG_C, BlackMondayRotation__Direction_31B6A38F4ACA527A883B3EBC702A1D11) == 0x00025C, "Member 'ABP_Frontend_ShopBG_C::BlackMondayRotation__Direction_31B6A38F4ACA527A883B3EBC702A1D11' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_ShopBG_C, BlackMondayRotation) == 0x000260, "Member 'ABP_Frontend_ShopBG_C::BlackMondayRotation' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_ShopBG_C, SignalIntro_NewTrack_0_CB796D694FE88CB3D9AEFFB3C7CA6D41) == 0x000268, "Member 'ABP_Frontend_ShopBG_C::SignalIntro_NewTrack_0_CB796D694FE88CB3D9AEFFB3C7CA6D41' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_ShopBG_C, SignalIntro__Direction_CB796D694FE88CB3D9AEFFB3C7CA6D41) == 0x00026C, "Member 'ABP_Frontend_ShopBG_C::SignalIntro__Direction_CB796D694FE88CB3D9AEFFB3C7CA6D41' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_ShopBG_C, SignalIntro) == 0x000270, "Member 'ABP_Frontend_ShopBG_C::SignalIntro' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_ShopBG_C, SignalAmbientMovement_Float_0C7FC81E45F7A9B3A9FA3E93878D5F70) == 0x000278, "Member 'ABP_Frontend_ShopBG_C::SignalAmbientMovement_Float_0C7FC81E45F7A9B3A9FA3E93878D5F70' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_ShopBG_C, SignalAmbientMovement__Direction_0C7FC81E45F7A9B3A9FA3E93878D5F70) == 0x00027C, "Member 'ABP_Frontend_ShopBG_C::SignalAmbientMovement__Direction_0C7FC81E45F7A9B3A9FA3E93878D5F70' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_ShopBG_C, SignalAmbientMovement) == 0x000280, "Member 'ABP_Frontend_ShopBG_C::SignalAmbientMovement' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_ShopBG_C, Rot_Intro) == 0x000288, "Member 'ABP_Frontend_ShopBG_C::Rot_Intro' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_ShopBG_C, NextRot) == 0x000294, "Member 'ABP_Frontend_ShopBG_C::NextRot' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_ShopBG_C, Rot_0) == 0x0002A0, "Member 'ABP_Frontend_ShopBG_C::Rot_0' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_ShopBG_C, Rot_2) == 0x0002AC, "Member 'ABP_Frontend_ShopBG_C::Rot_2' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_ShopBG_C, PlayRate) == 0x0002B8, "Member 'ABP_Frontend_ShopBG_C::PlayRate' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_ShopBG_C, Rot_IntroStart) == 0x0002BC, "Member 'ABP_Frontend_ShopBG_C::Rot_IntroStart' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_ShopBG_C, bHasEvent) == 0x0002C8, "Member 'ABP_Frontend_ShopBG_C::bHasEvent' has a wrong offset!");

}

