#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ProjectileTrajectory_Athena_SnapBoxToGrid

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_ProjectileTrajectory_Athena_SnapBoxToGrid.BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C.ExecuteUbergraph_BP_ProjectileTrajectory_Athena_SnapBoxToGrid
// 0x01C8 (0x01C8 - 0x0000)
struct BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_ExecuteUbergraph_BP_ProjectileTrajectory_Athena_SnapBoxToGrid final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_OtherActor;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector>                        K2Node_Event_SplinePoints;                         // 0x0020(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<struct FVector>                        K2Node_Event_SplineTangents;                       // 0x0030(0x0010)(ZeroConstructor, ReferenceParm)
	struct FVector                                CallFunc_Array_Get_Item;                           // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Array_Get_Item_1;                         // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue_1;                     // 0x0064(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Array_Get_Item_2;                         // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Array_Get_Item_3;                         // 0x007C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x008C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_LastIndex_ReturnValue_1;            // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x00A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x00B8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue_1;   // 0x0140(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0158(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0164(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171[0x3];                                      // 0x0171(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x017C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_17D[0x3];                                      // 0x017D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USplineMeshComponent*                   CallFunc_Array_Get_Item_4;                         // 0x0188(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAtSplinePoint_ReturnValue;     // 0x0190(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLeaveTangentAtSplinePoint_ReturnValue; // 0x019C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x01AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1AD[0x3];                                      // 0x01AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetArriveTangentAtSplinePoint_ReturnValue; // 0x01B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAtSplinePoint_ReturnValue_1;   // 0x01BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_ExecuteUbergraph_BP_ProjectileTrajectory_Athena_SnapBoxToGrid) == 0x000008, "Wrong alignment on BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_ExecuteUbergraph_BP_ProjectileTrajectory_Athena_SnapBoxToGrid");
static_assert(sizeof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_ExecuteUbergraph_BP_ProjectileTrajectory_Athena_SnapBoxToGrid) == 0x0001C8, "Wrong size on BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_ExecuteUbergraph_BP_ProjectileTrajectory_Athena_SnapBoxToGrid");
static_assert(offsetof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_ExecuteUbergraph_BP_ProjectileTrajectory_Athena_SnapBoxToGrid, EntryPoint) == 0x000000, "Member 'BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_ExecuteUbergraph_BP_ProjectileTrajectory_Athena_SnapBoxToGrid::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_ExecuteUbergraph_BP_ProjectileTrajectory_Athena_SnapBoxToGrid, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_ExecuteUbergraph_BP_ProjectileTrajectory_Athena_SnapBoxToGrid::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_ExecuteUbergraph_BP_ProjectileTrajectory_Athena_SnapBoxToGrid, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_ExecuteUbergraph_BP_ProjectileTrajectory_Athena_SnapBoxToGrid::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_ExecuteUbergraph_BP_ProjectileTrajectory_Athena_SnapBoxToGrid, CallFunc_Multiply_IntInt_ReturnValue) == 0x00000C, "Member 'BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_ExecuteUbergraph_BP_ProjectileTrajectory_Athena_SnapBoxToGrid::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_ExecuteUbergraph_BP_ProjectileTrajectory_Athena_SnapBoxToGrid, CallFunc_Add_IntInt_ReturnValue_1) == 0x000010, "Member 'BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_ExecuteUbergraph_BP_ProjectileTrajectory_Athena_SnapBoxToGrid::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_ExecuteUbergraph_BP_ProjectileTrajectory_Athena_SnapBoxToGrid, K2Node_Event_OtherActor) == 0x000018, "Member 'BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_ExecuteUbergraph_BP_ProjectileTrajectory_Athena_SnapBoxToGrid::K2Node_Event_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_ExecuteUbergraph_BP_ProjectileTrajectory_Athena_SnapBoxToGrid, K2Node_Event_SplinePoints) == 0x000020, "Member 'BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_ExecuteUbergraph_BP_ProjectileTrajectory_Athena_SnapBoxToGrid::K2Node_Event_SplinePoints' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_ExecuteUbergraph_BP_ProjectileTrajectory_Athena_SnapBoxToGrid, K2Node_Event_SplineTangents) == 0x000030, "Member 'BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_ExecuteUbergraph_BP_ProjectileTrajectory_Athena_SnapBoxToGrid::K2Node_Event_SplineTangents' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_ExecuteUbergraph_BP_ProjectileTrajectory_Athena_SnapBoxToGrid, CallFunc_Array_Get_Item) == 0x000040, "Member 'BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_ExecuteUbergraph_BP_ProjectileTrajectory_Athena_SnapBoxToGrid::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_ExecuteUbergraph_BP_ProjectileTrajectory_Athena_SnapBoxToGrid, CallFunc_Array_Get_Item_1) == 0x00004C, "Member 'BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_ExecuteUbergraph_BP_ProjectileTrajectory_Athena_SnapBoxToGrid::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_ExecuteUbergraph_BP_ProjectileTrajectory_Athena_SnapBoxToGrid, CallFunc_Normal_ReturnValue) == 0x000058, "Member 'BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_ExecuteUbergraph_BP_ProjectileTrajectory_Athena_SnapBoxToGrid::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_ExecuteUbergraph_BP_ProjectileTrajectory_Athena_SnapBoxToGrid, CallFunc_Normal_ReturnValue_1) == 0x000064, "Member 'BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_ExecuteUbergraph_BP_ProjectileTrajectory_Athena_SnapBoxToGrid::CallFunc_Normal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_ExecuteUbergraph_BP_ProjectileTrajectory_Athena_SnapBoxToGrid, CallFunc_Array_Get_Item_2) == 0x000070, "Member 'BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_ExecuteUbergraph_BP_ProjectileTrajectory_Athena_SnapBoxToGrid::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_ExecuteUbergraph_BP_ProjectileTrajectory_Athena_SnapBoxToGrid, CallFunc_Array_Get_Item_3) == 0x00007C, "Member 'BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_ExecuteUbergraph_BP_ProjectileTrajectory_Athena_SnapBoxToGrid::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_ExecuteUbergraph_BP_ProjectileTrajectory_Athena_SnapBoxToGrid, CallFunc_Array_LastIndex_ReturnValue) == 0x000088, "Member 'BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_ExecuteUbergraph_BP_ProjectileTrajectory_Athena_SnapBoxToGrid::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_ExecuteUbergraph_BP_ProjectileTrajectory_Athena_SnapBoxToGrid, CallFunc_Subtract_VectorVector_ReturnValue) == 0x00008C, "Member 'BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_ExecuteUbergraph_BP_ProjectileTrajectory_Athena_SnapBoxToGrid::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_ExecuteUbergraph_BP_ProjectileTrajectory_Athena_SnapBoxToGrid, CallFunc_Array_Length_ReturnValue) == 0x000098, "Member 'BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_ExecuteUbergraph_BP_ProjectileTrajectory_Athena_SnapBoxToGrid::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_ExecuteUbergraph_BP_ProjectileTrajectory_Athena_SnapBoxToGrid, CallFunc_VSize_ReturnValue) == 0x00009C, "Member 'BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_ExecuteUbergraph_BP_ProjectileTrajectory_Athena_SnapBoxToGrid::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_ExecuteUbergraph_BP_ProjectileTrajectory_Athena_SnapBoxToGrid, CallFunc_Array_IsValidIndex_ReturnValue) == 0x0000A0, "Member 'BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_ExecuteUbergraph_BP_ProjectileTrajectory_Athena_SnapBoxToGrid::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_ExecuteUbergraph_BP_ProjectileTrajectory_Athena_SnapBoxToGrid, CallFunc_Array_LastIndex_ReturnValue_1) == 0x0000A4, "Member 'BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_ExecuteUbergraph_BP_ProjectileTrajectory_Athena_SnapBoxToGrid::CallFunc_Array_LastIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_ExecuteUbergraph_BP_ProjectileTrajectory_Athena_SnapBoxToGrid, CallFunc_Conv_VectorToLinearColor_ReturnValue) == 0x0000A8, "Member 'BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_ExecuteUbergraph_BP_ProjectileTrajectory_Athena_SnapBoxToGrid::CallFunc_Conv_VectorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_ExecuteUbergraph_BP_ProjectileTrajectory_Athena_SnapBoxToGrid, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x0000B8, "Member 'BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_ExecuteUbergraph_BP_ProjectileTrajectory_Athena_SnapBoxToGrid::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_ExecuteUbergraph_BP_ProjectileTrajectory_Athena_SnapBoxToGrid, CallFunc_Conv_VectorToLinearColor_ReturnValue_1) == 0x000140, "Member 'BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_ExecuteUbergraph_BP_ProjectileTrajectory_Athena_SnapBoxToGrid::CallFunc_Conv_VectorToLinearColor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_ExecuteUbergraph_BP_ProjectileTrajectory_Athena_SnapBoxToGrid, CallFunc_Array_Length_ReturnValue_1) == 0x000150, "Member 'BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_ExecuteUbergraph_BP_ProjectileTrajectory_Athena_SnapBoxToGrid::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_ExecuteUbergraph_BP_ProjectileTrajectory_Athena_SnapBoxToGrid, Temp_int_Loop_Counter_Variable) == 0x000154, "Member 'BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_ExecuteUbergraph_BP_ProjectileTrajectory_Athena_SnapBoxToGrid::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_ExecuteUbergraph_BP_ProjectileTrajectory_Athena_SnapBoxToGrid, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000158, "Member 'BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_ExecuteUbergraph_BP_ProjectileTrajectory_Athena_SnapBoxToGrid::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_ExecuteUbergraph_BP_ProjectileTrajectory_Athena_SnapBoxToGrid, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x000164, "Member 'BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_ExecuteUbergraph_BP_ProjectileTrajectory_Athena_SnapBoxToGrid::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_ExecuteUbergraph_BP_ProjectileTrajectory_Athena_SnapBoxToGrid, CallFunc_Less_IntInt_ReturnValue) == 0x000170, "Member 'BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_ExecuteUbergraph_BP_ProjectileTrajectory_Athena_SnapBoxToGrid::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_ExecuteUbergraph_BP_ProjectileTrajectory_Athena_SnapBoxToGrid, CallFunc_Add_IntInt_ReturnValue_2) == 0x000174, "Member 'BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_ExecuteUbergraph_BP_ProjectileTrajectory_Athena_SnapBoxToGrid::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_ExecuteUbergraph_BP_ProjectileTrajectory_Athena_SnapBoxToGrid, Temp_int_Loop_Counter_Variable_1) == 0x000178, "Member 'BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_ExecuteUbergraph_BP_ProjectileTrajectory_Athena_SnapBoxToGrid::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_ExecuteUbergraph_BP_ProjectileTrajectory_Athena_SnapBoxToGrid, CallFunc_Less_IntInt_ReturnValue_1) == 0x00017C, "Member 'BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_ExecuteUbergraph_BP_ProjectileTrajectory_Athena_SnapBoxToGrid::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_ExecuteUbergraph_BP_ProjectileTrajectory_Athena_SnapBoxToGrid, CallFunc_Add_IntInt_ReturnValue_3) == 0x000180, "Member 'BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_ExecuteUbergraph_BP_ProjectileTrajectory_Athena_SnapBoxToGrid::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_ExecuteUbergraph_BP_ProjectileTrajectory_Athena_SnapBoxToGrid, Temp_int_Array_Index_Variable_1) == 0x000184, "Member 'BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_ExecuteUbergraph_BP_ProjectileTrajectory_Athena_SnapBoxToGrid::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_ExecuteUbergraph_BP_ProjectileTrajectory_Athena_SnapBoxToGrid, CallFunc_Array_Get_Item_4) == 0x000188, "Member 'BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_ExecuteUbergraph_BP_ProjectileTrajectory_Athena_SnapBoxToGrid::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_ExecuteUbergraph_BP_ProjectileTrajectory_Athena_SnapBoxToGrid, CallFunc_GetLocationAtSplinePoint_ReturnValue) == 0x000190, "Member 'BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_ExecuteUbergraph_BP_ProjectileTrajectory_Athena_SnapBoxToGrid::CallFunc_GetLocationAtSplinePoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_ExecuteUbergraph_BP_ProjectileTrajectory_Athena_SnapBoxToGrid, CallFunc_GetLeaveTangentAtSplinePoint_ReturnValue) == 0x00019C, "Member 'BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_ExecuteUbergraph_BP_ProjectileTrajectory_Athena_SnapBoxToGrid::CallFunc_GetLeaveTangentAtSplinePoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_ExecuteUbergraph_BP_ProjectileTrajectory_Athena_SnapBoxToGrid, CallFunc_Add_IntInt_ReturnValue_4) == 0x0001A8, "Member 'BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_ExecuteUbergraph_BP_ProjectileTrajectory_Athena_SnapBoxToGrid::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_ExecuteUbergraph_BP_ProjectileTrajectory_Athena_SnapBoxToGrid, CallFunc_Less_IntInt_ReturnValue_2) == 0x0001AC, "Member 'BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_ExecuteUbergraph_BP_ProjectileTrajectory_Athena_SnapBoxToGrid::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_ExecuteUbergraph_BP_ProjectileTrajectory_Athena_SnapBoxToGrid, CallFunc_GetArriveTangentAtSplinePoint_ReturnValue) == 0x0001B0, "Member 'BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_ExecuteUbergraph_BP_ProjectileTrajectory_Athena_SnapBoxToGrid::CallFunc_GetArriveTangentAtSplinePoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_ExecuteUbergraph_BP_ProjectileTrajectory_Athena_SnapBoxToGrid, CallFunc_GetLocationAtSplinePoint_ReturnValue_1) == 0x0001BC, "Member 'BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_ExecuteUbergraph_BP_ProjectileTrajectory_Athena_SnapBoxToGrid::CallFunc_GetLocationAtSplinePoint_ReturnValue_1' has a wrong offset!");

// Function BP_ProjectileTrajectory_Athena_SnapBoxToGrid.BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C.SetTrajectorySpline
// 0x0020 (0x0020 - 0x0000)
struct BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_SetTrajectorySpline final
{
public:
	TArray<struct FVector>                        SplinePoints;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	TArray<struct FVector>                        SplineTangents;                                    // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
};
static_assert(alignof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_SetTrajectorySpline) == 0x000008, "Wrong alignment on BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_SetTrajectorySpline");
static_assert(sizeof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_SetTrajectorySpline) == 0x000020, "Wrong size on BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_SetTrajectorySpline");
static_assert(offsetof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_SetTrajectorySpline, SplinePoints) == 0x000000, "Member 'BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_SetTrajectorySpline::SplinePoints' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_SetTrajectorySpline, SplineTangents) == 0x000010, "Member 'BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_SetTrajectorySpline::SplineTangents' has a wrong offset!");

// Function BP_ProjectileTrajectory_Athena_SnapBoxToGrid.BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C.ReceiveActorBeginOverlap
// 0x0008 (0x0008 - 0x0000)
struct BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_ReceiveActorBeginOverlap final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong alignment on BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_ReceiveActorBeginOverlap");
static_assert(sizeof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong size on BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_ReceiveActorBeginOverlap");
static_assert(offsetof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_ReceiveActorBeginOverlap, OtherActor) == 0x000000, "Member 'BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_ReceiveActorBeginOverlap::OtherActor' has a wrong offset!");

// Function BP_ProjectileTrajectory_Athena_SnapBoxToGrid.BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C.UserConstructionScript
// 0x0001 (0x0001 - 0x0000)
struct BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_UserConstructionScript) == 0x000001, "Wrong alignment on BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_UserConstructionScript");
static_assert(sizeof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_UserConstructionScript) == 0x000001, "Wrong size on BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_UserConstructionScript");
static_assert(offsetof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue) == 0x000000, "Member 'BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");

// Function BP_ProjectileTrajectory_Athena_SnapBoxToGrid.BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C.HandleGridSnapUpdates
// 0x0260 (0x0260 - 0x0000)
struct BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_HandleGridSnapUpdates final
{
public:
	struct FVector                                NewLocation;                                       // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                AdjustedPosition;                                  // 0x000C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               PlaysetRotation;                                   // 0x0018(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue;                          // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue_1;    // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Abs_ReturnValue_1;                        // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue_2;    // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue_1;                      // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_2;          // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue_1;          // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue_2;                      // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue_2;          // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x008C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_ComposeRotators_ReturnValue;              // 0x0098(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetPlaysetFromController_bSuccess;        // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_AdjustToFinalLocation_ReturnValue;        // 0x00A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_ComposeRotators_ReturnValue_1;            // 0x00B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x00C4(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult_1;     // 0x014C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x01D4(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_NotEqual_RotatorRotator_ReturnValue;      // 0x025C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_VectorVector_ReturnValue;        // 0x025D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x025E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_HandleGridSnapUpdates) == 0x000008, "Wrong alignment on BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_HandleGridSnapUpdates");
static_assert(sizeof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_HandleGridSnapUpdates) == 0x000260, "Wrong size on BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_HandleGridSnapUpdates");
static_assert(offsetof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_HandleGridSnapUpdates, NewLocation) == 0x000000, "Member 'BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_HandleGridSnapUpdates::NewLocation' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_HandleGridSnapUpdates, AdjustedPosition) == 0x00000C, "Member 'BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_HandleGridSnapUpdates::AdjustedPosition' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_HandleGridSnapUpdates, PlaysetRotation) == 0x000018, "Member 'BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_HandleGridSnapUpdates::PlaysetRotation' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_HandleGridSnapUpdates, CallFunc_GetInstigator_ReturnValue) == 0x000028, "Member 'BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_HandleGridSnapUpdates::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_HandleGridSnapUpdates, CallFunc_BreakVector_X) == 0x000030, "Member 'BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_HandleGridSnapUpdates::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_HandleGridSnapUpdates, CallFunc_BreakVector_Y) == 0x000034, "Member 'BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_HandleGridSnapUpdates::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_HandleGridSnapUpdates, CallFunc_BreakVector_Z) == 0x000038, "Member 'BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_HandleGridSnapUpdates::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_HandleGridSnapUpdates, CallFunc_GetActorForwardVector_ReturnValue) == 0x00003C, "Member 'BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_HandleGridSnapUpdates::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_HandleGridSnapUpdates, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000048, "Member 'BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_HandleGridSnapUpdates::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_HandleGridSnapUpdates, CallFunc_BreakVector_X_1) == 0x00004C, "Member 'BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_HandleGridSnapUpdates::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_HandleGridSnapUpdates, CallFunc_BreakVector_Y_1) == 0x000050, "Member 'BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_HandleGridSnapUpdates::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_HandleGridSnapUpdates, CallFunc_BreakVector_Z_1) == 0x000054, "Member 'BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_HandleGridSnapUpdates::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_HandleGridSnapUpdates, CallFunc_Round_ReturnValue) == 0x000058, "Member 'BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_HandleGridSnapUpdates::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_HandleGridSnapUpdates, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x00005C, "Member 'BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_HandleGridSnapUpdates::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_HandleGridSnapUpdates, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000060, "Member 'BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_HandleGridSnapUpdates::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_HandleGridSnapUpdates, CallFunc_Abs_ReturnValue) == 0x000064, "Member 'BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_HandleGridSnapUpdates::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_HandleGridSnapUpdates, CallFunc_GreaterEqual_FloatFloat_ReturnValue_1) == 0x000068, "Member 'BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_HandleGridSnapUpdates::CallFunc_GreaterEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_HandleGridSnapUpdates, CallFunc_Abs_ReturnValue_1) == 0x00006C, "Member 'BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_HandleGridSnapUpdates::CallFunc_Abs_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_HandleGridSnapUpdates, CallFunc_GreaterEqual_FloatFloat_ReturnValue_2) == 0x000070, "Member 'BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_HandleGridSnapUpdates::CallFunc_GreaterEqual_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_HandleGridSnapUpdates, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000074, "Member 'BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_HandleGridSnapUpdates::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_HandleGridSnapUpdates, CallFunc_Round_ReturnValue_1) == 0x000078, "Member 'BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_HandleGridSnapUpdates::CallFunc_Round_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_HandleGridSnapUpdates, CallFunc_Divide_FloatFloat_ReturnValue_2) == 0x00007C, "Member 'BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_HandleGridSnapUpdates::CallFunc_Divide_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_HandleGridSnapUpdates, CallFunc_Multiply_IntFloat_ReturnValue_1) == 0x000080, "Member 'BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_HandleGridSnapUpdates::CallFunc_Multiply_IntFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_HandleGridSnapUpdates, CallFunc_Round_ReturnValue_2) == 0x000084, "Member 'BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_HandleGridSnapUpdates::CallFunc_Round_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_HandleGridSnapUpdates, CallFunc_Multiply_IntFloat_ReturnValue_2) == 0x000088, "Member 'BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_HandleGridSnapUpdates::CallFunc_Multiply_IntFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_HandleGridSnapUpdates, CallFunc_MakeVector_ReturnValue) == 0x00008C, "Member 'BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_HandleGridSnapUpdates::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_HandleGridSnapUpdates, CallFunc_ComposeRotators_ReturnValue) == 0x000098, "Member 'BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_HandleGridSnapUpdates::CallFunc_ComposeRotators_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_HandleGridSnapUpdates, CallFunc_GetPlaysetFromController_bSuccess) == 0x0000A4, "Member 'BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_HandleGridSnapUpdates::CallFunc_GetPlaysetFromController_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_HandleGridSnapUpdates, CallFunc_AdjustToFinalLocation_ReturnValue) == 0x0000A8, "Member 'BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_HandleGridSnapUpdates::CallFunc_AdjustToFinalLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_HandleGridSnapUpdates, CallFunc_IsValid_ReturnValue) == 0x0000B4, "Member 'BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_HandleGridSnapUpdates::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_HandleGridSnapUpdates, CallFunc_ComposeRotators_ReturnValue_1) == 0x0000B8, "Member 'BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_HandleGridSnapUpdates::CallFunc_ComposeRotators_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_HandleGridSnapUpdates, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x0000C4, "Member 'BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_HandleGridSnapUpdates::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_HandleGridSnapUpdates, CallFunc_K2_SetWorldRotation_SweepHitResult_1) == 0x00014C, "Member 'BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_HandleGridSnapUpdates::CallFunc_K2_SetWorldRotation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_HandleGridSnapUpdates, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x0001D4, "Member 'BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_HandleGridSnapUpdates::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_HandleGridSnapUpdates, CallFunc_NotEqual_RotatorRotator_ReturnValue) == 0x00025C, "Member 'BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_HandleGridSnapUpdates::CallFunc_NotEqual_RotatorRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_HandleGridSnapUpdates, CallFunc_NotEqual_VectorVector_ReturnValue) == 0x00025D, "Member 'BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_HandleGridSnapUpdates::CallFunc_NotEqual_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_HandleGridSnapUpdates, CallFunc_BooleanOR_ReturnValue) == 0x00025E, "Member 'BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_HandleGridSnapUpdates::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function BP_ProjectileTrajectory_Athena_SnapBoxToGrid.BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C.UpdateScaleForPlayset
// 0x00A8 (0x00A8 - 0x0000)
struct BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_UpdateScaleForPlayset final
{
public:
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerControllerAthena*            K2Node_DynamicCast_AsFort_Player_Controller_Athena; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetPlaysetSize_SizeX;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetPlaysetSize_SizeY;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPlaysetItemDefinition*             CallFunc_GetPlayset_ReturnValue;                   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentScale_ReturnValue;         // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_Origin;                // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_BoxExtent;             // 0x0064(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetComponentBounds_SphereRadius;          // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Divide_VectorVector_ReturnValue;          // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0098(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_UpdateScaleForPlayset) == 0x000008, "Wrong alignment on BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_UpdateScaleForPlayset");
static_assert(sizeof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_UpdateScaleForPlayset) == 0x0000A8, "Wrong size on BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_UpdateScaleForPlayset");
static_assert(offsetof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_UpdateScaleForPlayset, CallFunc_GetPlayerController_ReturnValue) == 0x000000, "Member 'BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_UpdateScaleForPlayset::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_UpdateScaleForPlayset, K2Node_DynamicCast_AsFort_Player_Controller_Athena) == 0x000008, "Member 'BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_UpdateScaleForPlayset::K2Node_DynamicCast_AsFort_Player_Controller_Athena' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_UpdateScaleForPlayset, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_UpdateScaleForPlayset::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_UpdateScaleForPlayset, CallFunc_GetPlaysetSize_SizeX) == 0x000014, "Member 'BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_UpdateScaleForPlayset::CallFunc_GetPlaysetSize_SizeX' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_UpdateScaleForPlayset, CallFunc_GetPlaysetSize_SizeY) == 0x000018, "Member 'BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_UpdateScaleForPlayset::CallFunc_GetPlaysetSize_SizeY' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_UpdateScaleForPlayset, CallFunc_GetPlayset_ReturnValue) == 0x000020, "Member 'BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_UpdateScaleForPlayset::CallFunc_GetPlayset_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_UpdateScaleForPlayset, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000028, "Member 'BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_UpdateScaleForPlayset::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_UpdateScaleForPlayset, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00002C, "Member 'BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_UpdateScaleForPlayset::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_UpdateScaleForPlayset, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x000030, "Member 'BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_UpdateScaleForPlayset::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_UpdateScaleForPlayset, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000034, "Member 'BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_UpdateScaleForPlayset::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_UpdateScaleForPlayset, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000038, "Member 'BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_UpdateScaleForPlayset::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_UpdateScaleForPlayset, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x00003C, "Member 'BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_UpdateScaleForPlayset::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_UpdateScaleForPlayset, CallFunc_K2_GetComponentScale_ReturnValue) == 0x000040, "Member 'BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_UpdateScaleForPlayset::CallFunc_K2_GetComponentScale_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_UpdateScaleForPlayset, CallFunc_MakeVector_ReturnValue) == 0x00004C, "Member 'BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_UpdateScaleForPlayset::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_UpdateScaleForPlayset, CallFunc_GetComponentBounds_Origin) == 0x000058, "Member 'BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_UpdateScaleForPlayset::CallFunc_GetComponentBounds_Origin' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_UpdateScaleForPlayset, CallFunc_GetComponentBounds_BoxExtent) == 0x000064, "Member 'BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_UpdateScaleForPlayset::CallFunc_GetComponentBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_UpdateScaleForPlayset, CallFunc_GetComponentBounds_SphereRadius) == 0x000070, "Member 'BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_UpdateScaleForPlayset::CallFunc_GetComponentBounds_SphereRadius' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_UpdateScaleForPlayset, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000074, "Member 'BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_UpdateScaleForPlayset::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_UpdateScaleForPlayset, CallFunc_Divide_VectorVector_ReturnValue) == 0x000080, "Member 'BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_UpdateScaleForPlayset::CallFunc_Divide_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_UpdateScaleForPlayset, CallFunc_BreakVector_X) == 0x00008C, "Member 'BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_UpdateScaleForPlayset::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_UpdateScaleForPlayset, CallFunc_BreakVector_Y) == 0x000090, "Member 'BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_UpdateScaleForPlayset::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_UpdateScaleForPlayset, CallFunc_BreakVector_Z) == 0x000094, "Member 'BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_UpdateScaleForPlayset::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_UpdateScaleForPlayset, CallFunc_MakeVector_ReturnValue_1) == 0x000098, "Member 'BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_UpdateScaleForPlayset::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");

// Function BP_ProjectileTrajectory_Athena_SnapBoxToGrid.BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C.GetPlaysetFromController
// 0x0028 (0x0028 - 0x0000)
struct BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_GetPlaysetFromController final
{
public:
	bool                                          bSuccess;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerControllerAthena*            K2Node_DynamicCast_AsFort_Player_Controller_Athena; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPlaysetItemDefinition*             CallFunc_GetPlayset_ReturnValue;                   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_GetPlaysetFromController) == 0x000008, "Wrong alignment on BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_GetPlaysetFromController");
static_assert(sizeof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_GetPlaysetFromController) == 0x000028, "Wrong size on BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_GetPlaysetFromController");
static_assert(offsetof(BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_GetPlaysetFromController, bSuccess) == 0x000000, "Member 'BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C_GetPlaysetFromController::bSuccess' has a wrong offset!");
