#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Pistol_FC_SA

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass BP_Pistol_FC_SA.BP_Pistol_FC_SA_C
// 0x00A0 (0x0308 - 0x0268)
class UBP_Pistol_FC_SA_C final : public UAnimInstance
{
public:
	uint8                                         Pad_268[0x8];                                      // 0x0268(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_59F2F7924C02FD42668752B6AD5C5D7D; // 0x0278(0x0030)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_3C404E374989FC3E37A4538744D810DA; // 0x02A8(0x0048)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_16F5A0174D756BCD3A56E2A54C593E88; // 0x02F0(0x0018)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_BP_Pistol_FC_SA(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Pistol_FC_SA_C">();
	}
	static class UBP_Pistol_FC_SA_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Pistol_FC_SA_C>();
	}
};
static_assert(alignof(UBP_Pistol_FC_SA_C) == 0x000008, "Wrong alignment on UBP_Pistol_FC_SA_C");
static_assert(sizeof(UBP_Pistol_FC_SA_C) == 0x000308, "Wrong size on UBP_Pistol_FC_SA_C");
static_assert(offsetof(UBP_Pistol_FC_SA_C, UberGraphFrame) == 0x000270, "Member 'UBP_Pistol_FC_SA_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_Pistol_FC_SA_C, AnimGraphNode_Root_59F2F7924C02FD42668752B6AD5C5D7D) == 0x000278, "Member 'UBP_Pistol_FC_SA_C::AnimGraphNode_Root_59F2F7924C02FD42668752B6AD5C5D7D' has a wrong offset!");
static_assert(offsetof(UBP_Pistol_FC_SA_C, AnimGraphNode_Slot_3C404E374989FC3E37A4538744D810DA) == 0x0002A8, "Member 'UBP_Pistol_FC_SA_C::AnimGraphNode_Slot_3C404E374989FC3E37A4538744D810DA' has a wrong offset!");
static_assert(offsetof(UBP_Pistol_FC_SA_C, AnimGraphNode_LocalRefPose_16F5A0174D756BCD3A56E2A54C593E88) == 0x0002F0, "Member 'UBP_Pistol_FC_SA_C::AnimGraphNode_LocalRefPose_16F5A0174D756BCD3A56E2A54C593E88' has a wrong offset!");

}

