#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SprayDecal

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SprayDecal.BP_SprayDecal_C
// 0x00C0 (0x0BC8 - 0x0B08)
class ABP_SprayDecal_C final : public AFortSprayDecalInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B08(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         DecalFadeoutTime;                                  // 0x0B10(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B14[0x4];                                      // 0x0B14(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDecalComponent*                        EmissiveDecal;                                     // 0x0B18(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        StainDecal;                                        // 0x0B20(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               EmissiveDecalMID;                                  // 0x0B28(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DecalSize;                                         // 0x0B30(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_B34[0x4];                                      // 0x0B34(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     EmissiveMatSource;                                 // 0x0B38(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DecalDepth;                                        // 0x0B40(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B44[0x4];                                      // 0x0B44(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaSprayItemDefinition*             SprayAsset;                                        // 0x0B48(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         LoadsOutstanding;                                  // 0x0B50(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B54[0x4];                                      // 0x0B54(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              DecalTextureOverrideSoft;                          // 0x0B58(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UTexture2D*                             DecalTextureOverride;                              // 0x0B80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           BannerPrimaryColor;                                // 0x0B88(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           BannerSecondaryColor;                              // 0x0B98(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  SpawningPlayerController;                          // 0x0BA8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	TArray<class AActor*>                         NearbyBuildingActors;                              // 0x0BB0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance)
	float                                         SpawnStartTimeDelay;                               // 0x0BC0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsFrontEndPreview;                                // 0x0BC4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	bool                                          bDestroyOnTrapPlaced;                              // 0x0BC5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_SprayDecal(int32 EntryPoint);
	void OnWallDestoryed(class AActor* DestroyedActor);
	void PostLevelSaveSpawnCleanup();
	void OnNearbyTrapPlaced(class ABuildingTrap* Trap, bool bDetatched);
	void OnBounceOccurs();
	void OnNearbyWallDamaged(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum);
	void OnNearbyWallDied(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum);
	void StartSprayFadeOutDueToNewPlacement();
	void OnSprayInfoReady();
	void OnSprayAssetReplicatedDown();
	void ReceiveBeginPlay();
	void OnReady_B252FED346EAB98D54D786BD15C1CC7B(class AFortGameStateAthena* GameState, const class UFortPlaylist* Playlist, const struct FGameplayTagContainer& PlaylistContextTags);
	void OnLoaded_F925FF00475A018319C73E9FB1540BC6(class UObject* Loaded);
	void OnLoaded_F8AB699B4D8DD22B5A0409B608B7D6FA(class UObject* Loaded);
	void UserConstructionScript();
	void CreateDecalComponents();
	struct FUniqueNetIdRepl GetInstigatorPlayerId();
	void OnRep_DecalFadeoutTime();
	void UnbindAndClearNearbyBuildingActors();
	void FindNearbyBuildingActorsAndBindDelegates();
	void AddBoxCollisionForCreative();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_SprayDecal_C">();
	}
	static class ABP_SprayDecal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_SprayDecal_C>();
	}
};
static_assert(alignof(ABP_SprayDecal_C) == 0x000008, "Wrong alignment on ABP_SprayDecal_C");
static_assert(sizeof(ABP_SprayDecal_C) == 0x000BC8, "Wrong size on ABP_SprayDecal_C");
static_assert(offsetof(ABP_SprayDecal_C, UberGraphFrame) == 0x000B08, "Member 'ABP_SprayDecal_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_SprayDecal_C, DecalFadeoutTime) == 0x000B10, "Member 'ABP_SprayDecal_C::DecalFadeoutTime' has a wrong offset!");
static_assert(offsetof(ABP_SprayDecal_C, EmissiveDecal) == 0x000B18, "Member 'ABP_SprayDecal_C::EmissiveDecal' has a wrong offset!");
static_assert(offsetof(ABP_SprayDecal_C, StainDecal) == 0x000B20, "Member 'ABP_SprayDecal_C::StainDecal' has a wrong offset!");
static_assert(offsetof(ABP_SprayDecal_C, EmissiveDecalMID) == 0x000B28, "Member 'ABP_SprayDecal_C::EmissiveDecalMID' has a wrong offset!");
static_assert(offsetof(ABP_SprayDecal_C, DecalSize) == 0x000B30, "Member 'ABP_SprayDecal_C::DecalSize' has a wrong offset!");
static_assert(offsetof(ABP_SprayDecal_C, EmissiveMatSource) == 0x000B38, "Member 'ABP_SprayDecal_C::EmissiveMatSource' has a wrong offset!");
static_assert(offsetof(ABP_SprayDecal_C, DecalDepth) == 0x000B40, "Member 'ABP_SprayDecal_C::DecalDepth' has a wrong offset!");
static_assert(offsetof(ABP_SprayDecal_C, SprayAsset) == 0x000B48, "Member 'ABP_SprayDecal_C::SprayAsset' has a wrong offset!");
static_assert(offsetof(ABP_SprayDecal_C, LoadsOutstanding) == 0x000B50, "Member 'ABP_SprayDecal_C::LoadsOutstanding' has a wrong offset!");
static_assert(offsetof(ABP_SprayDecal_C, DecalTextureOverrideSoft) == 0x000B58, "Member 'ABP_SprayDecal_C::DecalTextureOverrideSoft' has a wrong offset!");
static_assert(offsetof(ABP_SprayDecal_C, DecalTextureOverride) == 0x000B80, "Member 'ABP_SprayDecal_C::DecalTextureOverride' has a wrong offset!");
static_assert(offsetof(ABP_SprayDecal_C, BannerPrimaryColor) == 0x000B88, "Member 'ABP_SprayDecal_C::BannerPrimaryColor' has a wrong offset!");
static_assert(offsetof(ABP_SprayDecal_C, BannerSecondaryColor) == 0x000B98, "Member 'ABP_SprayDecal_C::BannerSecondaryColor' has a wrong offset!");
static_assert(offsetof(ABP_SprayDecal_C, SpawningPlayerController) == 0x000BA8, "Member 'ABP_SprayDecal_C::SpawningPlayerController' has a wrong offset!");
static_assert(offsetof(ABP_SprayDecal_C, NearbyBuildingActors) == 0x000BB0, "Member 'ABP_SprayDecal_C::NearbyBuildingActors' has a wrong offset!");
static_assert(offsetof(ABP_SprayDecal_C, SpawnStartTimeDelay) == 0x000BC0, "Member 'ABP_SprayDecal_C::SpawnStartTimeDelay' has a wrong offset!");
static_assert(offsetof(ABP_SprayDecal_C, bIsFrontEndPreview) == 0x000BC4, "Member 'ABP_SprayDecal_C::bIsFrontEndPreview' has a wrong offset!");
static_assert(offsetof(ABP_SprayDecal_C, bDestroyOnTrapPlaced) == 0x000BC5, "Member 'ABP_SprayDecal_C::bDestroyOnTrapPlaced' has a wrong offset!");

}

