#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ZippyTroutTrap_Floor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ZippyTroutTrap_Floor.BP_ZippyTroutTrap_Floor_C
// 0x00C8 (0x0D48 - 0x0C80)
class ABP_ZippyTroutTrap_Floor_C : public ABuildingTrapFloor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0C80(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               P_ZippyTrout_Deploy_1;                             // 0x0C88(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               P_ZippyTrout_Idle1;                                // 0x0C90(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               P_ZippyTrout_Lightning2;                           // 0x0C98(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               P_ZippyTrout_Lightning;                            // 0x0CA0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               P_ZippyTrout_Idle;                                 // 0x0CA8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent01;                             // 0x0CB0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        TraceLocation3;                                    // 0x0CB8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        TraceLocation2;                                    // 0x0CC0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Trigger;                                           // 0x0CC8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Root;                                              // 0x0CD0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              Place_Trap_Sound;                                  // 0x0CD8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              Trap_Active_Sound;                                 // 0x0CE0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              Trap_Explode_Sound;                                // 0x0CE8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              Trap_Fire_Sound;                                   // 0x0CF0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     FriendlyTrapMaterial;                              // 0x0CF8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     NormalTrapMaterial;                                // 0x0D00(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bPlayFewerSounds;                                  // 0x0D08(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D09[0x7];                                      // 0x0D09(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           MuzzleSockets;                                     // 0x0D10(0x0010)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance)
	float                                         Timespan_of_Jiggle;                                // 0x0D20(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Vector_of_Jiggle;                                  // 0x0D24(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        DestructionFX;                                     // 0x0D30(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Active_Loop_Audio;                                 // 0x0D38(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsFinishedBuilding;                               // 0x0D40(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)

public:
	void ExecuteUbergraph_BP_ZippyTroutTrap_Floor(int32 EntryPoint);
	void ReceiveDestroyed();
	void Jiggle(const struct FVector& Vector);
	void MuzzleFire(class FName Socket_Name);
	void OnInitTeam();
	void OnWorldReady();
	void GameplayCue_Abilities_Activation_Traps_ActivateTrap(EGameplayCueEvent EventType, const struct FGameplayCueParameters& Parameters);
	void OnFinishedBuilding();
	void OnPlaced();
	void OnReloadEnd();
	void _ChangeToFriendlyMaterial();
	void ChangeToNormalMaterial();
	void OnRep_bIsFinishedBuilding();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ZippyTroutTrap_Floor_C">();
	}
	static class ABP_ZippyTroutTrap_Floor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ZippyTroutTrap_Floor_C>();
	}
};
static_assert(alignof(ABP_ZippyTroutTrap_Floor_C) == 0x000008, "Wrong alignment on ABP_ZippyTroutTrap_Floor_C");
static_assert(sizeof(ABP_ZippyTroutTrap_Floor_C) == 0x000D48, "Wrong size on ABP_ZippyTroutTrap_Floor_C");
static_assert(offsetof(ABP_ZippyTroutTrap_Floor_C, UberGraphFrame) == 0x000C80, "Member 'ABP_ZippyTroutTrap_Floor_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_ZippyTroutTrap_Floor_C, P_ZippyTrout_Deploy_1) == 0x000C88, "Member 'ABP_ZippyTroutTrap_Floor_C::P_ZippyTrout_Deploy_1' has a wrong offset!");
static_assert(offsetof(ABP_ZippyTroutTrap_Floor_C, P_ZippyTrout_Idle1) == 0x000C90, "Member 'ABP_ZippyTroutTrap_Floor_C::P_ZippyTrout_Idle1' has a wrong offset!");
static_assert(offsetof(ABP_ZippyTroutTrap_Floor_C, P_ZippyTrout_Lightning2) == 0x000C98, "Member 'ABP_ZippyTroutTrap_Floor_C::P_ZippyTrout_Lightning2' has a wrong offset!");
static_assert(offsetof(ABP_ZippyTroutTrap_Floor_C, P_ZippyTrout_Lightning) == 0x000CA0, "Member 'ABP_ZippyTroutTrap_Floor_C::P_ZippyTrout_Lightning' has a wrong offset!");
static_assert(offsetof(ABP_ZippyTroutTrap_Floor_C, P_ZippyTrout_Idle) == 0x000CA8, "Member 'ABP_ZippyTroutTrap_Floor_C::P_ZippyTrout_Idle' has a wrong offset!");
static_assert(offsetof(ABP_ZippyTroutTrap_Floor_C, StaticMeshComponent01) == 0x000CB0, "Member 'ABP_ZippyTroutTrap_Floor_C::StaticMeshComponent01' has a wrong offset!");
static_assert(offsetof(ABP_ZippyTroutTrap_Floor_C, TraceLocation3) == 0x000CB8, "Member 'ABP_ZippyTroutTrap_Floor_C::TraceLocation3' has a wrong offset!");
static_assert(offsetof(ABP_ZippyTroutTrap_Floor_C, TraceLocation2) == 0x000CC0, "Member 'ABP_ZippyTroutTrap_Floor_C::TraceLocation2' has a wrong offset!");
static_assert(offsetof(ABP_ZippyTroutTrap_Floor_C, Trigger) == 0x000CC8, "Member 'ABP_ZippyTroutTrap_Floor_C::Trigger' has a wrong offset!");
static_assert(offsetof(ABP_ZippyTroutTrap_Floor_C, Root) == 0x000CD0, "Member 'ABP_ZippyTroutTrap_Floor_C::Root' has a wrong offset!");
static_assert(offsetof(ABP_ZippyTroutTrap_Floor_C, Place_Trap_Sound) == 0x000CD8, "Member 'ABP_ZippyTroutTrap_Floor_C::Place_Trap_Sound' has a wrong offset!");
static_assert(offsetof(ABP_ZippyTroutTrap_Floor_C, Trap_Active_Sound) == 0x000CE0, "Member 'ABP_ZippyTroutTrap_Floor_C::Trap_Active_Sound' has a wrong offset!");
static_assert(offsetof(ABP_ZippyTroutTrap_Floor_C, Trap_Explode_Sound) == 0x000CE8, "Member 'ABP_ZippyTroutTrap_Floor_C::Trap_Explode_Sound' has a wrong offset!");
static_assert(offsetof(ABP_ZippyTroutTrap_Floor_C, Trap_Fire_Sound) == 0x000CF0, "Member 'ABP_ZippyTroutTrap_Floor_C::Trap_Fire_Sound' has a wrong offset!");
static_assert(offsetof(ABP_ZippyTroutTrap_Floor_C, FriendlyTrapMaterial) == 0x000CF8, "Member 'ABP_ZippyTroutTrap_Floor_C::FriendlyTrapMaterial' has a wrong offset!");
static_assert(offsetof(ABP_ZippyTroutTrap_Floor_C, NormalTrapMaterial) == 0x000D00, "Member 'ABP_ZippyTroutTrap_Floor_C::NormalTrapMaterial' has a wrong offset!");
static_assert(offsetof(ABP_ZippyTroutTrap_Floor_C, bPlayFewerSounds) == 0x000D08, "Member 'ABP_ZippyTroutTrap_Floor_C::bPlayFewerSounds' has a wrong offset!");
static_assert(offsetof(ABP_ZippyTroutTrap_Floor_C, MuzzleSockets) == 0x000D10, "Member 'ABP_ZippyTroutTrap_Floor_C::MuzzleSockets' has a wrong offset!");
static_assert(offsetof(ABP_ZippyTroutTrap_Floor_C, Timespan_of_Jiggle) == 0x000D20, "Member 'ABP_ZippyTroutTrap_Floor_C::Timespan_of_Jiggle' has a wrong offset!");
static_assert(offsetof(ABP_ZippyTroutTrap_Floor_C, Vector_of_Jiggle) == 0x000D24, "Member 'ABP_ZippyTroutTrap_Floor_C::Vector_of_Jiggle' has a wrong offset!");
static_assert(offsetof(ABP_ZippyTroutTrap_Floor_C, DestructionFX) == 0x000D30, "Member 'ABP_ZippyTroutTrap_Floor_C::DestructionFX' has a wrong offset!");
static_assert(offsetof(ABP_ZippyTroutTrap_Floor_C, Active_Loop_Audio) == 0x000D38, "Member 'ABP_ZippyTroutTrap_Floor_C::Active_Loop_Audio' has a wrong offset!");
static_assert(offsetof(ABP_ZippyTroutTrap_Floor_C, bIsFinishedBuilding) == 0x000D40, "Member 'ABP_ZippyTroutTrap_Floor_C::bIsFinishedBuilding' has a wrong offset!");

}

