#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ZippyTroutTrap_Floor

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_ZippyTroutTrap_Floor.BP_ZippyTroutTrap_Floor_C.ExecuteUbergraph_BP_ZippyTroutTrap_Floor
// 0x05F0 (0x05F0 - 0x0000)
struct BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam;                // 0x0010(0x0080)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x00A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam_1;              // 0x00B0(0x0080)(IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_X;                            // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam_2;              // 0x0140(0x0080)(IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x01C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x01D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_2;      // 0x01E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_3;      // 0x01EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F8[0x8];                                      // 0x01F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam_3;              // 0x0200(0x0080)(IsPlainOldData, NoDestructor)
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam_4;              // 0x0280(0x0080)(IsPlainOldData, NoDestructor)
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam_5;              // 0x0300(0x0080)(IsPlainOldData, NoDestructor)
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam_6;              // 0x0380(0x0080)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0400(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_401[0x7];                                      // 0x0401(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FParticleSysParam>              K2Node_MakeArray_Array;                            // 0x0408(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x0418(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0419(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x041A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41B[0x1];                                      // 0x041B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x041C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0428(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0430(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x043C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0448(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameplayCueEvent                             K2Node_GameplayCueEvent_EventType;                 // 0x0454(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_455[0x3];                                      // 0x0455(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 K2Node_GameplayCueEvent_Parameters;                // 0x0458(0x00B8)(ContainsInstancedReference)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0510(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0511(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_512[0x6];                                      // 0x0512(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x0518(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0520(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x052C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52D[0x3];                                      // 0x052D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_Socket_Name;                    // 0x0530(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetAllSocketNames_ReturnValue;            // 0x0538(0x0010)(ZeroConstructor, ReferenceParm)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0548(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_2;          // 0x054C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_54D[0x3];                                      // 0x054D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_CustomEvent_Vector;                         // 0x0550(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x055C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x0560(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56C[0x4];                                      // 0x056C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EFortTeamAffiliation>                  K2Node_MakeArray_Array_1;                          // 0x0570(0x0010)(ZeroConstructor, ReferenceParm)
	uint8                                         CallFunc_GetActorTeam_ReturnValue;                 // 0x0580(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_581[0x3];                                      // 0x0581(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_4;        // 0x0584(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EFortTeamAffiliation>                  K2Node_MakeArray_Array_2;                          // 0x0590(0x0010)(ZeroConstructor, ReferenceParm)
	uint8                                         CallFunc_GetActorTeam_ReturnValue_1;               // 0x05A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x05A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A2[0x2];                                      // 0x05A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x05A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x05A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A9[0x7];                                      // 0x05A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x05B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x05B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B9[0x3];                                      // 0x05B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetCameraLocation_ReturnValue;            // 0x05BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x05C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x05D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x05D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x05E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue_1;         // 0x05E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor) == 0x000010, "Wrong alignment on BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor");
static_assert(sizeof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor) == 0x0005F0, "Wrong size on BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, EntryPoint) == 0x000000, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, K2Node_MakeStruct_ParticleSysParam) == 0x000010, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::K2Node_MakeStruct_ParticleSysParam' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000090, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, CallFunc_IsDedicatedServer_ReturnValue) == 0x00009C, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, CallFunc_Multiply_VectorVector_ReturnValue_1) == 0x0000A0, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::CallFunc_Multiply_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, K2Node_MakeStruct_ParticleSysParam_1) == 0x0000B0, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::K2Node_MakeStruct_ParticleSysParam_1' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, CallFunc_BreakVector_X) == 0x000130, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, CallFunc_BreakVector_Y) == 0x000134, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, CallFunc_BreakVector_Z) == 0x000138, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, K2Node_MakeStruct_ParticleSysParam_2) == 0x000140, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::K2Node_MakeStruct_ParticleSysParam_2' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0001C0, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x0001C4, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, CallFunc_MakeVector_ReturnValue) == 0x0001C8, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, CallFunc_MakeVector_ReturnValue_1) == 0x0001D4, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, CallFunc_Multiply_VectorVector_ReturnValue_2) == 0x0001E0, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::CallFunc_Multiply_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, CallFunc_Multiply_VectorVector_ReturnValue_3) == 0x0001EC, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::CallFunc_Multiply_VectorVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, K2Node_MakeStruct_ParticleSysParam_3) == 0x000200, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::K2Node_MakeStruct_ParticleSysParam_3' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, K2Node_MakeStruct_ParticleSysParam_4) == 0x000280, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::K2Node_MakeStruct_ParticleSysParam_4' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, K2Node_MakeStruct_ParticleSysParam_5) == 0x000300, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::K2Node_MakeStruct_ParticleSysParam_5' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, K2Node_MakeStruct_ParticleSysParam_6) == 0x000380, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::K2Node_MakeStruct_ParticleSysParam_6' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, CallFunc_IsValid_ReturnValue) == 0x000400, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, K2Node_MakeArray_Array) == 0x000408, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x000418, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, CallFunc_IsValid_ReturnValue_1) == 0x000419, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, Temp_bool_Has_Been_Initd_Variable) == 0x00041A, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00041C, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000428, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000430, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x00043C, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x000448, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, K2Node_GameplayCueEvent_EventType) == 0x000454, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::K2Node_GameplayCueEvent_EventType' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, K2Node_GameplayCueEvent_Parameters) == 0x000458, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::K2Node_GameplayCueEvent_Parameters' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, K2Node_SwitchEnum_CmpSuccess) == 0x000510, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, CallFunc_IsValid_ReturnValue_2) == 0x000511, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x000518, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x000520, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, Temp_bool_IsClosed_Variable) == 0x00052C, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, K2Node_CustomEvent_Socket_Name) == 0x000530, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::K2Node_CustomEvent_Socket_Name' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, CallFunc_GetAllSocketNames_ReturnValue) == 0x000538, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::CallFunc_GetAllSocketNames_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x000548, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, CallFunc_IsDedicatedServer_ReturnValue_2) == 0x00054C, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::CallFunc_IsDedicatedServer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, K2Node_CustomEvent_Vector) == 0x000550, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::K2Node_CustomEvent_Vector' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, CallFunc_Add_FloatFloat_ReturnValue) == 0x00055C, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, CallFunc_K2_GetActorLocation_ReturnValue_3) == 0x000560, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::CallFunc_K2_GetActorLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, K2Node_MakeArray_Array_1) == 0x000570, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, CallFunc_GetActorTeam_ReturnValue) == 0x000580, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::CallFunc_GetActorTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, CallFunc_K2_GetActorLocation_ReturnValue_4) == 0x000584, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::CallFunc_K2_GetActorLocation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, K2Node_MakeArray_Array_2) == 0x000590, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, CallFunc_GetActorTeam_ReturnValue_1) == 0x0005A0, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::CallFunc_GetActorTeam_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, CallFunc_IsValid_ReturnValue_3) == 0x0005A1, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, Temp_float_Variable) == 0x0005A4, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x0005A8, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x0005B0, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, CallFunc_IsValid_ReturnValue_4) == 0x0005B8, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, CallFunc_GetCameraLocation_ReturnValue) == 0x0005BC, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::CallFunc_GetCameraLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0005C8, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, CallFunc_VSize_ReturnValue) == 0x0005D4, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x0005D8, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, CallFunc_SpawnSoundAttached_ReturnValue) == 0x0005E0, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor, CallFunc_SpawnSoundAttached_ReturnValue_1) == 0x0005E8, "Member 'BP_ZippyTroutTrap_Floor_C_ExecuteUbergraph_BP_ZippyTroutTrap_Floor::CallFunc_SpawnSoundAttached_ReturnValue_1' has a wrong offset!");

// Function BP_ZippyTroutTrap_Floor.BP_ZippyTroutTrap_Floor_C.Jiggle
// 0x000C (0x000C - 0x0000)
struct BP_ZippyTroutTrap_Floor_C_Jiggle final
{
public:
	struct FVector                                Vector;                                            // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ZippyTroutTrap_Floor_C_Jiggle) == 0x000004, "Wrong alignment on BP_ZippyTroutTrap_Floor_C_Jiggle");
static_assert(sizeof(BP_ZippyTroutTrap_Floor_C_Jiggle) == 0x00000C, "Wrong size on BP_ZippyTroutTrap_Floor_C_Jiggle");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_Jiggle, Vector) == 0x000000, "Member 'BP_ZippyTroutTrap_Floor_C_Jiggle::Vector' has a wrong offset!");

// Function BP_ZippyTroutTrap_Floor.BP_ZippyTroutTrap_Floor_C.MuzzleFire
// 0x0008 (0x0008 - 0x0000)
struct BP_ZippyTroutTrap_Floor_C_MuzzleFire final
{
public:
	class FName                                   Socket_Name;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ZippyTroutTrap_Floor_C_MuzzleFire) == 0x000004, "Wrong alignment on BP_ZippyTroutTrap_Floor_C_MuzzleFire");
static_assert(sizeof(BP_ZippyTroutTrap_Floor_C_MuzzleFire) == 0x000008, "Wrong size on BP_ZippyTroutTrap_Floor_C_MuzzleFire");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_MuzzleFire, Socket_Name) == 0x000000, "Member 'BP_ZippyTroutTrap_Floor_C_MuzzleFire::Socket_Name' has a wrong offset!");

// Function BP_ZippyTroutTrap_Floor.BP_ZippyTroutTrap_Floor_C.GameplayCue.Abilities.Activation.Traps.ActivateTrap
// 0x00C0 (0x00C0 - 0x0000)
struct BP_ZippyTroutTrap_Floor_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap final
{
public:
	EGameplayCueEvent                             EventType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
};
static_assert(alignof(BP_ZippyTroutTrap_Floor_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap) == 0x000008, "Wrong alignment on BP_ZippyTroutTrap_Floor_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap");
static_assert(sizeof(BP_ZippyTroutTrap_Floor_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap) == 0x0000C0, "Wrong size on BP_ZippyTroutTrap_Floor_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap, EventType) == 0x000000, "Member 'BP_ZippyTroutTrap_Floor_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap::EventType' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap, Parameters) == 0x000008, "Member 'BP_ZippyTroutTrap_Floor_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap::Parameters' has a wrong offset!");

// Function BP_ZippyTroutTrap_Floor.BP_ZippyTroutTrap_Floor_C. ChangeToFriendlyMaterial
// 0x0030 (0x0030 - 0x0000)
struct BP_ZippyTroutTrap_Floor_C__ChangeToFriendlyMaterial final
{
public:
	ESubGame                                      CallFunc_GetSubGame_ReturnValue;                   // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AFortPlayerController*>          CallFunc_GetLocalFortPlayerControllers_ReturnValue; // 0x0008(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetActorTeam_ReturnValue;                 // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x002F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ZippyTroutTrap_Floor_C__ChangeToFriendlyMaterial) == 0x000008, "Wrong alignment on BP_ZippyTroutTrap_Floor_C__ChangeToFriendlyMaterial");
static_assert(sizeof(BP_ZippyTroutTrap_Floor_C__ChangeToFriendlyMaterial) == 0x000030, "Wrong size on BP_ZippyTroutTrap_Floor_C__ChangeToFriendlyMaterial");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C__ChangeToFriendlyMaterial, CallFunc_GetSubGame_ReturnValue) == 0x000000, "Member 'BP_ZippyTroutTrap_Floor_C__ChangeToFriendlyMaterial::CallFunc_GetSubGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ZippyTroutTrap_Floor_C__ChangeToFriendlyMaterial, CallFunc_GetLocalFortPlayerControllers_ReturnValue) == 0x000008, "Member 'BP_ZippyTroutTrap_Floor_C__ChangeToFriendlyMaterial::CallFunc_GetLocalFortPlayerControllers_ReturnValue' has a wrong offset!");
