#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChallengeTile_Weekly

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ChallengeTile_Weekly.ChallengeTile_Weekly_C
// 0x0060 (0x0BE8 - 0x0B88)
class UChallengeTile_Weekly_C final : public UAthenaChallengeSetTile_Weekly
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B88(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       AmbientPartyAssistAttention;                       // 0x0B90(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Outro;                                             // 0x0B98(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnHover;                                           // 0x0BA0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 ImageBackground;                                   // 0x0BA8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageCompletionBackground;                         // 0x0BB0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageLockIcon;                                     // 0x0BB8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                LockedMessageSpacer;                               // 0x0BC0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               OverlayPartyAssist;                                // 0x0BC8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        SwitcherBackground;                                // 0x0BD0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  SwitcherProgressInfo;                              // 0x0BD8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                TextSpacer;                                        // 0x0BE0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void SetDynamicColors(class UImage* WeeklyDynamicMaterialTarget, const struct FFortChallengeSetStyle& FortChallengeSetStyle);
	void OnChallengeSetEstablished(const struct FFortChallengeSetStyle& DisplayStyle, bool bIsComplete, bool bIsLocked);
	void BP_OnHovered();
	void BP_OnUnhovered();
	void OnContainsPartyAssistedChallengeChanged(bool bHasPartyAssistedChallenge);
	void ExecuteUbergraph_ChallengeTile_Weekly(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ChallengeTile_Weekly_C">();
	}
	static class UChallengeTile_Weekly_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChallengeTile_Weekly_C>();
	}
};
static_assert(alignof(UChallengeTile_Weekly_C) == 0x000008, "Wrong alignment on UChallengeTile_Weekly_C");
static_assert(sizeof(UChallengeTile_Weekly_C) == 0x000BE8, "Wrong size on UChallengeTile_Weekly_C");
static_assert(offsetof(UChallengeTile_Weekly_C, UberGraphFrame) == 0x000B88, "Member 'UChallengeTile_Weekly_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UChallengeTile_Weekly_C, AmbientPartyAssistAttention) == 0x000B90, "Member 'UChallengeTile_Weekly_C::AmbientPartyAssistAttention' has a wrong offset!");
static_assert(offsetof(UChallengeTile_Weekly_C, Outro) == 0x000B98, "Member 'UChallengeTile_Weekly_C::Outro' has a wrong offset!");
static_assert(offsetof(UChallengeTile_Weekly_C, OnHover) == 0x000BA0, "Member 'UChallengeTile_Weekly_C::OnHover' has a wrong offset!");
static_assert(offsetof(UChallengeTile_Weekly_C, ImageBackground) == 0x000BA8, "Member 'UChallengeTile_Weekly_C::ImageBackground' has a wrong offset!");
static_assert(offsetof(UChallengeTile_Weekly_C, ImageCompletionBackground) == 0x000BB0, "Member 'UChallengeTile_Weekly_C::ImageCompletionBackground' has a wrong offset!");
static_assert(offsetof(UChallengeTile_Weekly_C, ImageLockIcon) == 0x000BB8, "Member 'UChallengeTile_Weekly_C::ImageLockIcon' has a wrong offset!");
static_assert(offsetof(UChallengeTile_Weekly_C, LockedMessageSpacer) == 0x000BC0, "Member 'UChallengeTile_Weekly_C::LockedMessageSpacer' has a wrong offset!");
static_assert(offsetof(UChallengeTile_Weekly_C, OverlayPartyAssist) == 0x000BC8, "Member 'UChallengeTile_Weekly_C::OverlayPartyAssist' has a wrong offset!");
static_assert(offsetof(UChallengeTile_Weekly_C, SwitcherBackground) == 0x000BD0, "Member 'UChallengeTile_Weekly_C::SwitcherBackground' has a wrong offset!");
static_assert(offsetof(UChallengeTile_Weekly_C, SwitcherProgressInfo) == 0x000BD8, "Member 'UChallengeTile_Weekly_C::SwitcherProgressInfo' has a wrong offset!");
static_assert(offsetof(UChallengeTile_Weekly_C, TextSpacer) == 0x000BE0, "Member 'UChallengeTile_Weekly_C::TextSpacer' has a wrong offset!");

}

