#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChallengeTile_Daily

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ChallengeTile_Daily.ChallengeTile_Daily_C
// 0x0038 (0x0BA0 - 0x0B68)
class UChallengeTile_Daily_C final : public UAthenaChallengeScreenTile_Daily
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B68(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       AmbientPartyAssistAttention;                       // 0x0B70(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Outro;                                             // 0x0B78(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnHover;                                           // 0x0B80(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 ImageBackground;                                   // 0x0B88(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               OverlayPartyAssist;                                // 0x0B90(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_ChallengeContext;                             // 0x0B98(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void SetDynamicColors(class UImage* WeeklyDynamicMaterialTarget, const struct FFortChallengeSetStyle& FortChallengeSetStyle);
	void OnChallengeSetEstablished(const struct FFortChallengeSetStyle& DisplayStyle, bool bIsComplete, bool bIsLocked);
	void BP_OnHovered();
	void BP_OnUnhovered();
	void OnContainsPartyAssistedChallengeChanged(bool bHasPartyAssistedChallenge);
	void ExecuteUbergraph_ChallengeTile_Daily(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ChallengeTile_Daily_C">();
	}
	static class UChallengeTile_Daily_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChallengeTile_Daily_C>();
	}
};
static_assert(alignof(UChallengeTile_Daily_C) == 0x000008, "Wrong alignment on UChallengeTile_Daily_C");
static_assert(sizeof(UChallengeTile_Daily_C) == 0x000BA0, "Wrong size on UChallengeTile_Daily_C");
static_assert(offsetof(UChallengeTile_Daily_C, UberGraphFrame) == 0x000B68, "Member 'UChallengeTile_Daily_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UChallengeTile_Daily_C, AmbientPartyAssistAttention) == 0x000B70, "Member 'UChallengeTile_Daily_C::AmbientPartyAssistAttention' has a wrong offset!");
static_assert(offsetof(UChallengeTile_Daily_C, Outro) == 0x000B78, "Member 'UChallengeTile_Daily_C::Outro' has a wrong offset!");
static_assert(offsetof(UChallengeTile_Daily_C, OnHover) == 0x000B80, "Member 'UChallengeTile_Daily_C::OnHover' has a wrong offset!");
static_assert(offsetof(UChallengeTile_Daily_C, ImageBackground) == 0x000B88, "Member 'UChallengeTile_Daily_C::ImageBackground' has a wrong offset!");
static_assert(offsetof(UChallengeTile_Daily_C, OverlayPartyAssist) == 0x000B90, "Member 'UChallengeTile_Daily_C::OverlayPartyAssist' has a wrong offset!");
static_assert(offsetof(UChallengeTile_Daily_C, Text_ChallengeContext) == 0x000B98, "Member 'UChallengeTile_Daily_C::Text_ChallengeContext' has a wrong offset!");

}

