#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChallengeSetDetails

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ChallengeSetDetails.ChallengeSetDetails_C
// 0x0058 (0x0558 - 0x0500)
class UChallengeSetDetails_C final : public UAthenaChallengeSetDetails
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0500(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ItemInfoIntroOutro;                                // 0x0508(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x0510(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class USizeBox*                               CameraFramingWidget;                               // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CloseIcon;                                         // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HeaderBase;                                        // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HeaderBolt;                                        // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           ItemInfo;                                          // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPanelButton_C*                         MobileCloseButton;                                 // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               OverlayCloseButton;                                // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_0;                                        // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void SetDynamicColors(class UImage* DetailsDynamicMaterialTarget, const struct FFortChallengeSetStyle& FortChallengeSetStyle);
	class UWidget* GetWidgetForFramingViewedItem();
	void HandleBack(bool* PassThrough);
	void OnChallengeSetEstablished(const struct FFortChallengeSetStyle& DisplayStyle, bool bIsComplete);
	void Construct();
	void BndEvt__MobileCloseButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void ExecuteUbergraph_ChallengeSetDetails(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ChallengeSetDetails_C">();
	}
	static class UChallengeSetDetails_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChallengeSetDetails_C>();
	}
};
static_assert(alignof(UChallengeSetDetails_C) == 0x000008, "Wrong alignment on UChallengeSetDetails_C");
static_assert(sizeof(UChallengeSetDetails_C) == 0x000558, "Wrong size on UChallengeSetDetails_C");
static_assert(offsetof(UChallengeSetDetails_C, UberGraphFrame) == 0x000500, "Member 'UChallengeSetDetails_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UChallengeSetDetails_C, ItemInfoIntroOutro) == 0x000508, "Member 'UChallengeSetDetails_C::ItemInfoIntroOutro' has a wrong offset!");
static_assert(offsetof(UChallengeSetDetails_C, Intro) == 0x000510, "Member 'UChallengeSetDetails_C::Intro' has a wrong offset!");
static_assert(offsetof(UChallengeSetDetails_C, CameraFramingWidget) == 0x000518, "Member 'UChallengeSetDetails_C::CameraFramingWidget' has a wrong offset!");
static_assert(offsetof(UChallengeSetDetails_C, CloseIcon) == 0x000520, "Member 'UChallengeSetDetails_C::CloseIcon' has a wrong offset!");
static_assert(offsetof(UChallengeSetDetails_C, HeaderBase) == 0x000528, "Member 'UChallengeSetDetails_C::HeaderBase' has a wrong offset!");
static_assert(offsetof(UChallengeSetDetails_C, HeaderBolt) == 0x000530, "Member 'UChallengeSetDetails_C::HeaderBolt' has a wrong offset!");
static_assert(offsetof(UChallengeSetDetails_C, ItemInfo) == 0x000538, "Member 'UChallengeSetDetails_C::ItemInfo' has a wrong offset!");
static_assert(offsetof(UChallengeSetDetails_C, MobileCloseButton) == 0x000540, "Member 'UChallengeSetDetails_C::MobileCloseButton' has a wrong offset!");
static_assert(offsetof(UChallengeSetDetails_C, OverlayCloseButton) == 0x000548, "Member 'UChallengeSetDetails_C::OverlayCloseButton' has a wrong offset!");
static_assert(offsetof(UChallengeSetDetails_C, SafeZone_0) == 0x000550, "Member 'UChallengeSetDetails_C::SafeZone_0' has a wrong offset!");

}

