#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChallengeSetImageGrid

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ChallengeSetImageGrid.ChallengeSetImageGrid_C
// 0x0068 (0x0570 - 0x0508)
class UChallengeSetImageGrid_C final : public UAthenaChallengeSetImageGrid
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0508(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Intro;                                             // 0x0510(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 CloseIcon;                                         // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   CommonRichTextBlock_110;                           // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 GridBackFill;                                      // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HeaderBase;                                        // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HeaderBolt;                                        // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPanelButton_C*                         MobileCloseButton;                                 // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               NoBattlePassContainer;                             // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 NoBattlePassImage;                                 // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   NoBattlePassText;                                  // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               OverlayCloseButton;                                // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_0;                                        // 0x0568(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ChangeSortFunction(bool* PassThrough);
	class UWidget* GetWidgetForFramingViewedItem();
	void SetDynamicColors(class UImage* DetailsDynamicMaterialTarget, const struct FFortChallengeSetStyle& FortChallengeSetStyle);
	void HandleBack(bool* PassThrough);
	void OnChallengeSetEstablished(const struct FFortChallengeSetStyle& DisplayStyle, bool bIsComplete);
	void Construct();
	void BndEvt__MobileCloseButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void ExecuteUbergraph_ChallengeSetImageGrid(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ChallengeSetImageGrid_C">();
	}
	static class UChallengeSetImageGrid_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChallengeSetImageGrid_C>();
	}
};
static_assert(alignof(UChallengeSetImageGrid_C) == 0x000008, "Wrong alignment on UChallengeSetImageGrid_C");
static_assert(sizeof(UChallengeSetImageGrid_C) == 0x000570, "Wrong size on UChallengeSetImageGrid_C");
static_assert(offsetof(UChallengeSetImageGrid_C, UberGraphFrame) == 0x000508, "Member 'UChallengeSetImageGrid_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UChallengeSetImageGrid_C, Intro) == 0x000510, "Member 'UChallengeSetImageGrid_C::Intro' has a wrong offset!");
static_assert(offsetof(UChallengeSetImageGrid_C, CloseIcon) == 0x000518, "Member 'UChallengeSetImageGrid_C::CloseIcon' has a wrong offset!");
static_assert(offsetof(UChallengeSetImageGrid_C, CommonRichTextBlock_110) == 0x000520, "Member 'UChallengeSetImageGrid_C::CommonRichTextBlock_110' has a wrong offset!");
static_assert(offsetof(UChallengeSetImageGrid_C, GridBackFill) == 0x000528, "Member 'UChallengeSetImageGrid_C::GridBackFill' has a wrong offset!");
static_assert(offsetof(UChallengeSetImageGrid_C, HeaderBase) == 0x000530, "Member 'UChallengeSetImageGrid_C::HeaderBase' has a wrong offset!");
static_assert(offsetof(UChallengeSetImageGrid_C, HeaderBolt) == 0x000538, "Member 'UChallengeSetImageGrid_C::HeaderBolt' has a wrong offset!");
static_assert(offsetof(UChallengeSetImageGrid_C, MobileCloseButton) == 0x000540, "Member 'UChallengeSetImageGrid_C::MobileCloseButton' has a wrong offset!");
static_assert(offsetof(UChallengeSetImageGrid_C, NoBattlePassContainer) == 0x000548, "Member 'UChallengeSetImageGrid_C::NoBattlePassContainer' has a wrong offset!");
static_assert(offsetof(UChallengeSetImageGrid_C, NoBattlePassImage) == 0x000550, "Member 'UChallengeSetImageGrid_C::NoBattlePassImage' has a wrong offset!");
static_assert(offsetof(UChallengeSetImageGrid_C, NoBattlePassText) == 0x000558, "Member 'UChallengeSetImageGrid_C::NoBattlePassText' has a wrong offset!");
static_assert(offsetof(UChallengeSetImageGrid_C, OverlayCloseButton) == 0x000560, "Member 'UChallengeSetImageGrid_C::OverlayCloseButton' has a wrong offset!");
static_assert(offsetof(UChallengeSetImageGrid_C, SafeZone_0) == 0x000568, "Member 'UChallengeSetImageGrid_C::SafeZone_0' has a wrong offset!");

}

