#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChallengeScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ChallengeScreen.ChallengeScreen_C
// 0x0028 (0x0418 - 0x03F0)
class UChallengeScreen_C final : public UAthenaChallengeScreen
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnPartyAssistEnabledHover;                         // 0x03F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonActionWidget*                    CommonActionWidget_0;                              // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActionWidget*                    CommonActionWidget_1;                              // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   CommonRichTextBlock_0;                             // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void OnDeactivated();
	void OnActivated();
	void ExecuteUbergraph_ChallengeScreen(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ChallengeScreen_C">();
	}
	static class UChallengeScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChallengeScreen_C>();
	}
};
static_assert(alignof(UChallengeScreen_C) == 0x000008, "Wrong alignment on UChallengeScreen_C");
static_assert(sizeof(UChallengeScreen_C) == 0x000418, "Wrong size on UChallengeScreen_C");
static_assert(offsetof(UChallengeScreen_C, UberGraphFrame) == 0x0003F0, "Member 'UChallengeScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UChallengeScreen_C, OnPartyAssistEnabledHover) == 0x0003F8, "Member 'UChallengeScreen_C::OnPartyAssistEnabledHover' has a wrong offset!");
static_assert(offsetof(UChallengeScreen_C, CommonActionWidget_0) == 0x000400, "Member 'UChallengeScreen_C::CommonActionWidget_0' has a wrong offset!");
static_assert(offsetof(UChallengeScreen_C, CommonActionWidget_1) == 0x000408, "Member 'UChallengeScreen_C::CommonActionWidget_1' has a wrong offset!");
static_assert(offsetof(UChallengeScreen_C, CommonRichTextBlock_0) == 0x000410, "Member 'UChallengeScreen_C::CommonRichTextBlock_0' has a wrong offset!");

}

