#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CircleArrowButtonComTutorial

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CommonUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CircleArrowButtonComTutorial.CircleArrowButtonComTutorial_C
// 0x0070 (0x0BB0 - 0x0B40)
class UCircleArrowButtonComTutorial_C final : public UCommonButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B40(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Click;                                             // 0x0B48(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover;                                             // 0x0B50(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_Arrow;                                       // 0x0B58(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Shadow;                                      // 0x0B60(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_ButtonContainer;                           // 0x0B68(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Flip;                                              // 0x0B70(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B71[0x3];                                      // 0x0B71(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           ArrowColor;                                        // 0x0B74(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FLinearColor                           ShadowColor;                                       // 0x0B84(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NewVar_0;                                          // 0x0B94(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B95[0x3];                                      // 0x0B95(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         EdgeSoftness;                                      // 0x0B98(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           HoverColor;                                        // 0x0B9C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          UseShadow;                                         // 0x0BAC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void UpdateArrowColor(const struct FLinearColor& Color, const struct FLinearColor& HoverColor_0);
	void PreConstruct(bool IsDesignTime);
	void BP_OnHovered();
	void BP_OnUnhovered();
	void BP_OnClicked();
	void ExecuteUbergraph_CircleArrowButtonComTutorial(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CircleArrowButtonComTutorial_C">();
	}
	static class UCircleArrowButtonComTutorial_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCircleArrowButtonComTutorial_C>();
	}
};
static_assert(alignof(UCircleArrowButtonComTutorial_C) == 0x000008, "Wrong alignment on UCircleArrowButtonComTutorial_C");
static_assert(sizeof(UCircleArrowButtonComTutorial_C) == 0x000BB0, "Wrong size on UCircleArrowButtonComTutorial_C");
static_assert(offsetof(UCircleArrowButtonComTutorial_C, UberGraphFrame) == 0x000B40, "Member 'UCircleArrowButtonComTutorial_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCircleArrowButtonComTutorial_C, Click) == 0x000B48, "Member 'UCircleArrowButtonComTutorial_C::Click' has a wrong offset!");
static_assert(offsetof(UCircleArrowButtonComTutorial_C, Hover) == 0x000B50, "Member 'UCircleArrowButtonComTutorial_C::Hover' has a wrong offset!");
static_assert(offsetof(UCircleArrowButtonComTutorial_C, Image_Arrow) == 0x000B58, "Member 'UCircleArrowButtonComTutorial_C::Image_Arrow' has a wrong offset!");
static_assert(offsetof(UCircleArrowButtonComTutorial_C, Image_Shadow) == 0x000B60, "Member 'UCircleArrowButtonComTutorial_C::Image_Shadow' has a wrong offset!");
static_assert(offsetof(UCircleArrowButtonComTutorial_C, Overlay_ButtonContainer) == 0x000B68, "Member 'UCircleArrowButtonComTutorial_C::Overlay_ButtonContainer' has a wrong offset!");
static_assert(offsetof(UCircleArrowButtonComTutorial_C, Flip) == 0x000B70, "Member 'UCircleArrowButtonComTutorial_C::Flip' has a wrong offset!");
static_assert(offsetof(UCircleArrowButtonComTutorial_C, ArrowColor) == 0x000B74, "Member 'UCircleArrowButtonComTutorial_C::ArrowColor' has a wrong offset!");
static_assert(offsetof(UCircleArrowButtonComTutorial_C, ShadowColor) == 0x000B84, "Member 'UCircleArrowButtonComTutorial_C::ShadowColor' has a wrong offset!");
static_assert(offsetof(UCircleArrowButtonComTutorial_C, NewVar_0) == 0x000B94, "Member 'UCircleArrowButtonComTutorial_C::NewVar_0' has a wrong offset!");
static_assert(offsetof(UCircleArrowButtonComTutorial_C, EdgeSoftness) == 0x000B98, "Member 'UCircleArrowButtonComTutorial_C::EdgeSoftness' has a wrong offset!");
static_assert(offsetof(UCircleArrowButtonComTutorial_C, HoverColor) == 0x000B9C, "Member 'UCircleArrowButtonComTutorial_C::HoverColor' has a wrong offset!");
static_assert(offsetof(UCircleArrowButtonComTutorial_C, UseShadow) == 0x000BAC, "Member 'UCircleArrowButtonComTutorial_C::UseShadow' has a wrong offset!");

}

