#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Com_Countdown

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Com_Countdown.Com_Countdown_C
// 0x0040 (0x0288 - 0x0248)
class UCom_Countdown_C final : public UFortCommunityVotingCountdown
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0248(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Clock;                                             // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         PaddingHB;                                         // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RedBoxBorder;                                      // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_TimeRemainingTag;                             // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              TextScale;                                         // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               TransformOvr;                                      // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsLargeDisplay;                                    // 0x0280(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void PreConstruct(bool IsDesignTime);
	void Construct();
	void ExecuteUbergraph_Com_Countdown(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Com_Countdown_C">();
	}
	static class UCom_Countdown_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCom_Countdown_C>();
	}
};
static_assert(alignof(UCom_Countdown_C) == 0x000008, "Wrong alignment on UCom_Countdown_C");
static_assert(sizeof(UCom_Countdown_C) == 0x000288, "Wrong size on UCom_Countdown_C");
static_assert(offsetof(UCom_Countdown_C, UberGraphFrame) == 0x000248, "Member 'UCom_Countdown_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCom_Countdown_C, Clock) == 0x000250, "Member 'UCom_Countdown_C::Clock' has a wrong offset!");
static_assert(offsetof(UCom_Countdown_C, PaddingHB) == 0x000258, "Member 'UCom_Countdown_C::PaddingHB' has a wrong offset!");
static_assert(offsetof(UCom_Countdown_C, RedBoxBorder) == 0x000260, "Member 'UCom_Countdown_C::RedBoxBorder' has a wrong offset!");
static_assert(offsetof(UCom_Countdown_C, Text_TimeRemainingTag) == 0x000268, "Member 'UCom_Countdown_C::Text_TimeRemainingTag' has a wrong offset!");
static_assert(offsetof(UCom_Countdown_C, TextScale) == 0x000270, "Member 'UCom_Countdown_C::TextScale' has a wrong offset!");
static_assert(offsetof(UCom_Countdown_C, TransformOvr) == 0x000278, "Member 'UCom_Countdown_C::TransformOvr' has a wrong offset!");
static_assert(offsetof(UCom_Countdown_C, IsLargeDisplay) == 0x000280, "Member 'UCom_Countdown_C::IsLargeDisplay' has a wrong offset!");

}

