#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Com_Countdown

#include "Basic.hpp"


namespace SDK::Params
{

// Function Com_Countdown.Com_Countdown_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct Com_Countdown_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Com_Countdown_C_PreConstruct) == 0x000001, "Wrong alignment on Com_Countdown_C_PreConstruct");
static_assert(sizeof(Com_Countdown_C_PreConstruct) == 0x000001, "Wrong size on Com_Countdown_C_PreConstruct");
static_assert(offsetof(Com_Countdown_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'Com_Countdown_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function Com_Countdown.Com_Countdown_C.ExecuteUbergraph_Com_Countdown
// 0x0014 (0x0014 - 0x0000)
struct Com_Countdown_C_ExecuteUbergraph_Com_Countdown final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeLiteralFloat_ReturnValue;             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_MakeLiteralFloat_ReturnValue_1;           // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Com_Countdown_C_ExecuteUbergraph_Com_Countdown) == 0x000004, "Wrong alignment on Com_Countdown_C_ExecuteUbergraph_Com_Countdown");
static_assert(sizeof(Com_Countdown_C_ExecuteUbergraph_Com_Countdown) == 0x000014, "Wrong size on Com_Countdown_C_ExecuteUbergraph_Com_Countdown");
static_assert(offsetof(Com_Countdown_C_ExecuteUbergraph_Com_Countdown, EntryPoint) == 0x000000, "Member 'Com_Countdown_C_ExecuteUbergraph_Com_Countdown::EntryPoint' has a wrong offset!");
static_assert(offsetof(Com_Countdown_C_ExecuteUbergraph_Com_Countdown, CallFunc_MakeLiteralFloat_ReturnValue) == 0x000004, "Member 'Com_Countdown_C_ExecuteUbergraph_Com_Countdown::CallFunc_MakeLiteralFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Com_Countdown_C_ExecuteUbergraph_Com_Countdown, K2Node_Event_IsDesignTime) == 0x000008, "Member 'Com_Countdown_C_ExecuteUbergraph_Com_Countdown::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(Com_Countdown_C_ExecuteUbergraph_Com_Countdown, CallFunc_MakeLiteralFloat_ReturnValue_1) == 0x00000C, "Member 'Com_Countdown_C_ExecuteUbergraph_Com_Countdown::CallFunc_MakeLiteralFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Com_Countdown_C_ExecuteUbergraph_Com_Countdown, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000010, "Member 'Com_Countdown_C_ExecuteUbergraph_Com_Countdown::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");

}

