#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: comLogoTitle

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass comLogoTitle.comLogoTitle_C
// 0x0020 (0x0248 - 0x0228)
class UcomLogoTitle_C final : public UUserWidget
{
public:
	class UImage*                                 Image_59;                                          // 0x0228(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         RichTextBlock_Choice;                              // 0x0230(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         RichTextBlock_Community;                           // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 VoteImage;                                         // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"comLogoTitle_C">();
	}
	static class UcomLogoTitle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UcomLogoTitle_C>();
	}
};
static_assert(alignof(UcomLogoTitle_C) == 0x000008, "Wrong alignment on UcomLogoTitle_C");
static_assert(sizeof(UcomLogoTitle_C) == 0x000248, "Wrong size on UcomLogoTitle_C");
static_assert(offsetof(UcomLogoTitle_C, Image_59) == 0x000228, "Member 'UcomLogoTitle_C::Image_59' has a wrong offset!");
static_assert(offsetof(UcomLogoTitle_C, RichTextBlock_Choice) == 0x000230, "Member 'UcomLogoTitle_C::RichTextBlock_Choice' has a wrong offset!");
static_assert(offsetof(UcomLogoTitle_C, RichTextBlock_Community) == 0x000238, "Member 'UcomLogoTitle_C::RichTextBlock_Community' has a wrong offset!");
static_assert(offsetof(UcomLogoTitle_C, VoteImage) == 0x000240, "Member 'UcomLogoTitle_C::VoteImage' has a wrong offset!");

}

