#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ComModalTutorialPopup

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ComModalTutorialPopup.ComModalTutorialPopup_C
// 0x00A8 (0x0458 - 0x03B0)
class UComModalTutorialPopup_C final : public UFortCommunityVotingTutorialPopup
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       TutorialSlide3Out;                                 // 0x03B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       TutorialSlide2Out;                                 // 0x03C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       TutorialSlide1Out;                                 // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeIn;                                            // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       TutorialSlide3In;                                  // 0x03D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       TutorialSlide2In;                                  // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       TutorialSlide1In;                                  // 0x03E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonBorder*                          Border_TapToCloseZone;                             // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCircleArrowButtonComTutorial_C*        CircleArrowButtonComTutorial_Next;                 // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCircleArrowButtonComTutorial_C*        CircleArrowButtonComTutorial_Previous;             // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 comTutorialImage_1;                                // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 comTutorialImage_4;                                // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         Comtutorialtext1;                                  // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         Comtutorialtext2;                                  // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         Comtutorialtext3;                                  // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Darken;                                            // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                DoT_1;                                             // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                DoT_2;                                             // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                DoT_3;                                             // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 flametuto;                                         // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	struct FEventReply TapToClose(const struct FGeometry& MyGeometry, struct FPointerEvent& Mouse_Event);
	void PlayInSlideAnimation(int32 Index_0);
	void PlayOutSlideAnimation(int32 Index_0);
	void Construct();
	void ExecuteUbergraph_ComModalTutorialPopup(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ComModalTutorialPopup_C">();
	}
	static class UComModalTutorialPopup_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UComModalTutorialPopup_C>();
	}
};
static_assert(alignof(UComModalTutorialPopup_C) == 0x000008, "Wrong alignment on UComModalTutorialPopup_C");
static_assert(sizeof(UComModalTutorialPopup_C) == 0x000458, "Wrong size on UComModalTutorialPopup_C");
static_assert(offsetof(UComModalTutorialPopup_C, UberGraphFrame) == 0x0003B0, "Member 'UComModalTutorialPopup_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UComModalTutorialPopup_C, TutorialSlide3Out) == 0x0003B8, "Member 'UComModalTutorialPopup_C::TutorialSlide3Out' has a wrong offset!");
static_assert(offsetof(UComModalTutorialPopup_C, TutorialSlide2Out) == 0x0003C0, "Member 'UComModalTutorialPopup_C::TutorialSlide2Out' has a wrong offset!");
static_assert(offsetof(UComModalTutorialPopup_C, TutorialSlide1Out) == 0x0003C8, "Member 'UComModalTutorialPopup_C::TutorialSlide1Out' has a wrong offset!");
static_assert(offsetof(UComModalTutorialPopup_C, FadeIn) == 0x0003D0, "Member 'UComModalTutorialPopup_C::FadeIn' has a wrong offset!");
static_assert(offsetof(UComModalTutorialPopup_C, TutorialSlide3In) == 0x0003D8, "Member 'UComModalTutorialPopup_C::TutorialSlide3In' has a wrong offset!");
static_assert(offsetof(UComModalTutorialPopup_C, TutorialSlide2In) == 0x0003E0, "Member 'UComModalTutorialPopup_C::TutorialSlide2In' has a wrong offset!");
static_assert(offsetof(UComModalTutorialPopup_C, TutorialSlide1In) == 0x0003E8, "Member 'UComModalTutorialPopup_C::TutorialSlide1In' has a wrong offset!");
static_assert(offsetof(UComModalTutorialPopup_C, Border_TapToCloseZone) == 0x0003F0, "Member 'UComModalTutorialPopup_C::Border_TapToCloseZone' has a wrong offset!");
static_assert(offsetof(UComModalTutorialPopup_C, CircleArrowButtonComTutorial_Next) == 0x0003F8, "Member 'UComModalTutorialPopup_C::CircleArrowButtonComTutorial_Next' has a wrong offset!");
static_assert(offsetof(UComModalTutorialPopup_C, CircleArrowButtonComTutorial_Previous) == 0x000400, "Member 'UComModalTutorialPopup_C::CircleArrowButtonComTutorial_Previous' has a wrong offset!");
static_assert(offsetof(UComModalTutorialPopup_C, comTutorialImage_1) == 0x000408, "Member 'UComModalTutorialPopup_C::comTutorialImage_1' has a wrong offset!");
static_assert(offsetof(UComModalTutorialPopup_C, comTutorialImage_4) == 0x000410, "Member 'UComModalTutorialPopup_C::comTutorialImage_4' has a wrong offset!");
static_assert(offsetof(UComModalTutorialPopup_C, Comtutorialtext1) == 0x000418, "Member 'UComModalTutorialPopup_C::Comtutorialtext1' has a wrong offset!");
static_assert(offsetof(UComModalTutorialPopup_C, Comtutorialtext2) == 0x000420, "Member 'UComModalTutorialPopup_C::Comtutorialtext2' has a wrong offset!");
static_assert(offsetof(UComModalTutorialPopup_C, Comtutorialtext3) == 0x000428, "Member 'UComModalTutorialPopup_C::Comtutorialtext3' has a wrong offset!");
static_assert(offsetof(UComModalTutorialPopup_C, Darken) == 0x000430, "Member 'UComModalTutorialPopup_C::Darken' has a wrong offset!");
static_assert(offsetof(UComModalTutorialPopup_C, DoT_1) == 0x000438, "Member 'UComModalTutorialPopup_C::DoT_1' has a wrong offset!");
static_assert(offsetof(UComModalTutorialPopup_C, DoT_2) == 0x000440, "Member 'UComModalTutorialPopup_C::DoT_2' has a wrong offset!");
static_assert(offsetof(UComModalTutorialPopup_C, DoT_3) == 0x000448, "Member 'UComModalTutorialPopup_C::DoT_3' has a wrong offset!");
static_assert(offsetof(UComModalTutorialPopup_C, flametuto) == 0x000450, "Member 'UComModalTutorialPopup_C::flametuto' has a wrong offset!");

}

