#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ComOptionDetails

#include "Basic.hpp"


namespace SDK::Params
{

// Function ComOptionDetails.ComOptionDetails_C.PlayeFadeOut
// 0x0008 (0x0008 - 0x0000)
struct ComOptionDetails_C_PlayeFadeOut final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ComOptionDetails_C_PlayeFadeOut) == 0x000008, "Wrong alignment on ComOptionDetails_C_PlayeFadeOut");
static_assert(sizeof(ComOptionDetails_C_PlayeFadeOut) == 0x000008, "Wrong size on ComOptionDetails_C_PlayeFadeOut");
static_assert(offsetof(ComOptionDetails_C_PlayeFadeOut, CallFunc_PlayAnimationForward_ReturnValue) == 0x000000, "Member 'ComOptionDetails_C_PlayeFadeOut::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

// Function ComOptionDetails.ComOptionDetails_C.PlayeFadeIn
// 0x0008 (0x0008 - 0x0000)
struct ComOptionDetails_C_PlayeFadeIn final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ComOptionDetails_C_PlayeFadeIn) == 0x000008, "Wrong alignment on ComOptionDetails_C_PlayeFadeIn");
static_assert(sizeof(ComOptionDetails_C_PlayeFadeIn) == 0x000008, "Wrong size on ComOptionDetails_C_PlayeFadeIn");
static_assert(offsetof(ComOptionDetails_C_PlayeFadeIn, CallFunc_PlayAnimationForward_ReturnValue) == 0x000000, "Member 'ComOptionDetails_C_PlayeFadeIn::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

// Function ComOptionDetails.ComOptionDetails_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct ComOptionDetails_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ComOptionDetails_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong alignment on ComOptionDetails_C_BP_OnItemExpansionChanged");
static_assert(sizeof(ComOptionDetails_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong size on ComOptionDetails_C_BP_OnItemExpansionChanged");
static_assert(offsetof(ComOptionDetails_C_BP_OnItemExpansionChanged, bIsExpanded) == 0x000000, "Member 'ComOptionDetails_C_BP_OnItemExpansionChanged::bIsExpanded' has a wrong offset!");

// Function ComOptionDetails.ComOptionDetails_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct ComOptionDetails_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ComOptionDetails_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong alignment on ComOptionDetails_C_BP_OnItemSelectionChanged");
static_assert(sizeof(ComOptionDetails_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong size on ComOptionDetails_C_BP_OnItemSelectionChanged");
static_assert(offsetof(ComOptionDetails_C_BP_OnItemSelectionChanged, bIsSelected) == 0x000000, "Member 'ComOptionDetails_C_BP_OnItemSelectionChanged::bIsSelected' has a wrong offset!");

// Function ComOptionDetails.ComOptionDetails_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct ComOptionDetails_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ComOptionDetails_C_OnListItemObjectSet) == 0x000008, "Wrong alignment on ComOptionDetails_C_OnListItemObjectSet");
static_assert(sizeof(ComOptionDetails_C_OnListItemObjectSet) == 0x000008, "Wrong size on ComOptionDetails_C_OnListItemObjectSet");
static_assert(offsetof(ComOptionDetails_C_OnListItemObjectSet, ListItemObject) == 0x000000, "Member 'ComOptionDetails_C_OnListItemObjectSet::ListItemObject' has a wrong offset!");

// Function ComOptionDetails.ComOptionDetails_C.ExecuteUbergraph_ComOptionDetails
// 0x0020 (0x0020 - 0x0000)
struct ComOptionDetails_C_ExecuteUbergraph_ComOptionDetails final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsExpanded;                          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(ComOptionDetails_C_ExecuteUbergraph_ComOptionDetails) == 0x000008, "Wrong alignment on ComOptionDetails_C_ExecuteUbergraph_ComOptionDetails");
static_assert(sizeof(ComOptionDetails_C_ExecuteUbergraph_ComOptionDetails) == 0x000020, "Wrong size on ComOptionDetails_C_ExecuteUbergraph_ComOptionDetails");
static_assert(offsetof(ComOptionDetails_C_ExecuteUbergraph_ComOptionDetails, EntryPoint) == 0x000000, "Member 'ComOptionDetails_C_ExecuteUbergraph_ComOptionDetails::EntryPoint' has a wrong offset!");
static_assert(offsetof(ComOptionDetails_C_ExecuteUbergraph_ComOptionDetails, K2Node_Event_bIsExpanded) == 0x000004, "Member 'ComOptionDetails_C_ExecuteUbergraph_ComOptionDetails::K2Node_Event_bIsExpanded' has a wrong offset!");
static_assert(offsetof(ComOptionDetails_C_ExecuteUbergraph_ComOptionDetails, K2Node_Event_bIsSelected) == 0x000005, "Member 'ComOptionDetails_C_ExecuteUbergraph_ComOptionDetails::K2Node_Event_bIsSelected' has a wrong offset!");
static_assert(offsetof(ComOptionDetails_C_ExecuteUbergraph_ComOptionDetails, K2Node_Event_ListItemObject) == 0x000008, "Member 'ComOptionDetails_C_ExecuteUbergraph_ComOptionDetails::K2Node_Event_ListItemObject' has a wrong offset!");
static_assert(offsetof(ComOptionDetails_C_ExecuteUbergraph_ComOptionDetails, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'ComOptionDetails_C_ExecuteUbergraph_ComOptionDetails::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

}

