#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ComOptionVote

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ComOptionVote.ComOptionVote_C
// 0x0018 (0x0B58 - 0x0B40)
class UComOptionVote_C final : public UCommonButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B40(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeOut;                                           // 0x0B48(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeIn;                                            // 0x0B50(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)

public:
	void PlayFadeOut();
	void PlayFadeIn();
	void BP_OnEntryReleased();
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void OnListItemObjectSet(class UObject* ListItemObject);
	void FadeOutFinished();
	void Construct();
	void ExecuteUbergraph_ComOptionVote(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ComOptionVote_C">();
	}
	static class UComOptionVote_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UComOptionVote_C>();
	}
};
static_assert(alignof(UComOptionVote_C) == 0x000008, "Wrong alignment on UComOptionVote_C");
static_assert(sizeof(UComOptionVote_C) == 0x000B58, "Wrong size on UComOptionVote_C");
static_assert(offsetof(UComOptionVote_C, UberGraphFrame) == 0x000B40, "Member 'UComOptionVote_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UComOptionVote_C, FadeOut) == 0x000B48, "Member 'UComOptionVote_C::FadeOut' has a wrong offset!");
static_assert(offsetof(UComOptionVote_C, FadeIn) == 0x000B50, "Member 'UComOptionVote_C::FadeIn' has a wrong offset!");

}

