#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ComOptionPreview

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ComOptionPreview.ComOptionPreview_C
// 0x0128 (0x0390 - 0x0268)
class UComOptionPreview_C final : public UFortCommunityVotingOptionPreview
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0268(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Vote_Action;                                       // 0x0270(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Focus_Out;                                         // 0x0278(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Focus_Loop;                                        // 0x0280(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Focus_In;                                          // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Idle_Color;                                        // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Idle_Tint;                                         // 0x0298(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CarouselTransition;                                // 0x02A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover;                                             // 0x02A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UItemSeriesOrRarity_C*                  ItemSeriesOrRarity;                                // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MID_StrikeThrough;                                 // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MID_CarouselTimerProgressBar;                      // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            Carousel_NextItemImage;                            // 0x02C8(0x0088)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         CarouselLoopTimeRemaining;                         // 0x0350(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CarouselLoopTimer;                                 // 0x0354(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              LargeSoftImage;                                    // 0x0358(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UTexture2D*                             Carousel_NextLargeTexture;                         // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItemDefinition*                    BattleStarTemplate;                                // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnEntryReleased();
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void OnListItemObjectSet(class UObject* ListItemObject);
	void PlayHoveredAnimation();
	void PlayUnhoveredAnimation();
	void PlayVotingAnimation();
	void Construct();
	void ExecuteUbergraph_ComOptionPreview(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ComOptionPreview_C">();
	}
	static class UComOptionPreview_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UComOptionPreview_C>();
	}
};
static_assert(alignof(UComOptionPreview_C) == 0x000008, "Wrong alignment on UComOptionPreview_C");
static_assert(sizeof(UComOptionPreview_C) == 0x000390, "Wrong size on UComOptionPreview_C");
static_assert(offsetof(UComOptionPreview_C, UberGraphFrame) == 0x000268, "Member 'UComOptionPreview_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UComOptionPreview_C, Vote_Action) == 0x000270, "Member 'UComOptionPreview_C::Vote_Action' has a wrong offset!");
static_assert(offsetof(UComOptionPreview_C, Focus_Out) == 0x000278, "Member 'UComOptionPreview_C::Focus_Out' has a wrong offset!");
static_assert(offsetof(UComOptionPreview_C, Focus_Loop) == 0x000280, "Member 'UComOptionPreview_C::Focus_Loop' has a wrong offset!");
static_assert(offsetof(UComOptionPreview_C, Focus_In) == 0x000288, "Member 'UComOptionPreview_C::Focus_In' has a wrong offset!");
static_assert(offsetof(UComOptionPreview_C, Idle_Color) == 0x000290, "Member 'UComOptionPreview_C::Idle_Color' has a wrong offset!");
static_assert(offsetof(UComOptionPreview_C, Idle_Tint) == 0x000298, "Member 'UComOptionPreview_C::Idle_Tint' has a wrong offset!");
static_assert(offsetof(UComOptionPreview_C, CarouselTransition) == 0x0002A0, "Member 'UComOptionPreview_C::CarouselTransition' has a wrong offset!");
static_assert(offsetof(UComOptionPreview_C, Hover) == 0x0002A8, "Member 'UComOptionPreview_C::Hover' has a wrong offset!");
static_assert(offsetof(UComOptionPreview_C, ItemSeriesOrRarity) == 0x0002B0, "Member 'UComOptionPreview_C::ItemSeriesOrRarity' has a wrong offset!");
static_assert(offsetof(UComOptionPreview_C, MID_StrikeThrough) == 0x0002B8, "Member 'UComOptionPreview_C::MID_StrikeThrough' has a wrong offset!");
static_assert(offsetof(UComOptionPreview_C, MID_CarouselTimerProgressBar) == 0x0002C0, "Member 'UComOptionPreview_C::MID_CarouselTimerProgressBar' has a wrong offset!");
static_assert(offsetof(UComOptionPreview_C, Carousel_NextItemImage) == 0x0002C8, "Member 'UComOptionPreview_C::Carousel_NextItemImage' has a wrong offset!");
static_assert(offsetof(UComOptionPreview_C, CarouselLoopTimeRemaining) == 0x000350, "Member 'UComOptionPreview_C::CarouselLoopTimeRemaining' has a wrong offset!");
static_assert(offsetof(UComOptionPreview_C, CarouselLoopTimer) == 0x000354, "Member 'UComOptionPreview_C::CarouselLoopTimer' has a wrong offset!");
static_assert(offsetof(UComOptionPreview_C, LargeSoftImage) == 0x000358, "Member 'UComOptionPreview_C::LargeSoftImage' has a wrong offset!");
static_assert(offsetof(UComOptionPreview_C, Carousel_NextLargeTexture) == 0x000380, "Member 'UComOptionPreview_C::Carousel_NextLargeTexture' has a wrong offset!");
static_assert(offsetof(UComOptionPreview_C, BattleStarTemplate) == 0x000388, "Member 'UComOptionPreview_C::BattleStarTemplate' has a wrong offset!");

}

