#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ComOptionReveal

#include "Basic.hpp"


namespace SDK::Params
{

// Function ComOptionReveal.ComOptionReveal_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct ComOptionReveal_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ComOptionReveal_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong alignment on ComOptionReveal_C_BP_OnItemExpansionChanged");
static_assert(sizeof(ComOptionReveal_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong size on ComOptionReveal_C_BP_OnItemExpansionChanged");
static_assert(offsetof(ComOptionReveal_C_BP_OnItemExpansionChanged, bIsExpanded) == 0x000000, "Member 'ComOptionReveal_C_BP_OnItemExpansionChanged::bIsExpanded' has a wrong offset!");

// Function ComOptionReveal.ComOptionReveal_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct ComOptionReveal_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ComOptionReveal_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong alignment on ComOptionReveal_C_BP_OnItemSelectionChanged");
static_assert(sizeof(ComOptionReveal_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong size on ComOptionReveal_C_BP_OnItemSelectionChanged");
static_assert(offsetof(ComOptionReveal_C_BP_OnItemSelectionChanged, bIsSelected) == 0x000000, "Member 'ComOptionReveal_C_BP_OnItemSelectionChanged::bIsSelected' has a wrong offset!");

// Function ComOptionReveal.ComOptionReveal_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct ComOptionReveal_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ComOptionReveal_C_OnListItemObjectSet) == 0x000008, "Wrong alignment on ComOptionReveal_C_OnListItemObjectSet");
static_assert(sizeof(ComOptionReveal_C_OnListItemObjectSet) == 0x000008, "Wrong size on ComOptionReveal_C_OnListItemObjectSet");
static_assert(offsetof(ComOptionReveal_C_OnListItemObjectSet, ListItemObject) == 0x000000, "Member 'ComOptionReveal_C_OnListItemObjectSet::ListItemObject' has a wrong offset!");

// Function ComOptionReveal.ComOptionReveal_C.StartRevealAnimation
// 0x0004 (0x0004 - 0x0000)
struct ComOptionReveal_C_StartRevealAnimation final
{
public:
	float                                         PlayRate;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ComOptionReveal_C_StartRevealAnimation) == 0x000004, "Wrong alignment on ComOptionReveal_C_StartRevealAnimation");
static_assert(sizeof(ComOptionReveal_C_StartRevealAnimation) == 0x000004, "Wrong size on ComOptionReveal_C_StartRevealAnimation");
static_assert(offsetof(ComOptionReveal_C_StartRevealAnimation, PlayRate) == 0x000000, "Member 'ComOptionReveal_C_StartRevealAnimation::PlayRate' has a wrong offset!");

// Function ComOptionReveal.ComOptionReveal_C.ExecuteUbergraph_ComOptionReveal
// 0x0048 (0x0048 - 0x0000)
struct ComOptionReveal_C_ExecuteUbergraph_ComOptionReveal final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bIsExpanded;                          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13[0x5];                                       // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_PlayRate;                             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(ComOptionReveal_C_ExecuteUbergraph_ComOptionReveal) == 0x000008, "Wrong alignment on ComOptionReveal_C_ExecuteUbergraph_ComOptionReveal");
static_assert(sizeof(ComOptionReveal_C_ExecuteUbergraph_ComOptionReveal) == 0x000048, "Wrong size on ComOptionReveal_C_ExecuteUbergraph_ComOptionReveal");
static_assert(offsetof(ComOptionReveal_C_ExecuteUbergraph_ComOptionReveal, EntryPoint) == 0x000000, "Member 'ComOptionReveal_C_ExecuteUbergraph_ComOptionReveal::EntryPoint' has a wrong offset!");
static_assert(offsetof(ComOptionReveal_C_ExecuteUbergraph_ComOptionReveal, CallFunc_SpawnSound2D_ReturnValue) == 0x000008, "Member 'ComOptionReveal_C_ExecuteUbergraph_ComOptionReveal::CallFunc_SpawnSound2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(ComOptionReveal_C_ExecuteUbergraph_ComOptionReveal, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'ComOptionReveal_C_ExecuteUbergraph_ComOptionReveal::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ComOptionReveal_C_ExecuteUbergraph_ComOptionReveal, K2Node_Event_bIsExpanded) == 0x000011, "Member 'ComOptionReveal_C_ExecuteUbergraph_ComOptionReveal::K2Node_Event_bIsExpanded' has a wrong offset!");
static_assert(offsetof(ComOptionReveal_C_ExecuteUbergraph_ComOptionReveal, K2Node_Event_bIsSelected) == 0x000012, "Member 'ComOptionReveal_C_ExecuteUbergraph_ComOptionReveal::K2Node_Event_bIsSelected' has a wrong offset!");
static_assert(offsetof(ComOptionReveal_C_ExecuteUbergraph_ComOptionReveal, K2Node_Event_ListItemObject) == 0x000018, "Member 'ComOptionReveal_C_ExecuteUbergraph_ComOptionReveal::K2Node_Event_ListItemObject' has a wrong offset!");
static_assert(offsetof(ComOptionReveal_C_ExecuteUbergraph_ComOptionReveal, K2Node_Event_PlayRate) == 0x000020, "Member 'ComOptionReveal_C_ExecuteUbergraph_ComOptionReveal::K2Node_Event_PlayRate' has a wrong offset!");
static_assert(offsetof(ComOptionReveal_C_ExecuteUbergraph_ComOptionReveal, CallFunc_PlayAnimation_ReturnValue) == 0x000028, "Member 'ComOptionReveal_C_ExecuteUbergraph_ComOptionReveal::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ComOptionReveal_C_ExecuteUbergraph_ComOptionReveal, CallFunc_PlayAnimation_ReturnValue_1) == 0x000030, "Member 'ComOptionReveal_C_ExecuteUbergraph_ComOptionReveal::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ComOptionReveal_C_ExecuteUbergraph_ComOptionReveal, K2Node_CreateDelegate_OutputDelegate) == 0x000038, "Member 'ComOptionReveal_C_ExecuteUbergraph_ComOptionReveal::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

}

