#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ComOptionDetails

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ComOptionDetails.ComOptionDetails_C
// 0x0018 (0x0B58 - 0x0B40)
class UComOptionDetails_C final : public UCommonButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B40(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeIn;                                            // 0x0B48(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeOut;                                           // 0x0B50(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)

public:
	void PlayeFadeOut();
	void PlayeFadeIn();
	void BP_OnEntryReleased();
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void OnListItemObjectSet(class UObject* ListItemObject);
	void FadeOutFinished();
	void Construct();
	void ExecuteUbergraph_ComOptionDetails(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ComOptionDetails_C">();
	}
	static class UComOptionDetails_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UComOptionDetails_C>();
	}
};
static_assert(alignof(UComOptionDetails_C) == 0x000008, "Wrong alignment on UComOptionDetails_C");
static_assert(sizeof(UComOptionDetails_C) == 0x000B58, "Wrong size on UComOptionDetails_C");
static_assert(offsetof(UComOptionDetails_C, UberGraphFrame) == 0x000B40, "Member 'UComOptionDetails_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UComOptionDetails_C, FadeIn) == 0x000B48, "Member 'UComOptionDetails_C::FadeIn' has a wrong offset!");
static_assert(offsetof(UComOptionDetails_C, FadeOut) == 0x000B50, "Member 'UComOptionDetails_C::FadeOut' has a wrong offset!");

}

