#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ComOptionReveal

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ComOptionReveal.ComOptionReveal_C
// 0x00A0 (0x0310 - 0x0270)
class UComOptionReveal_C final : public UFortCommunityVotingOptionReveal
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Reveal_Win;                                        // 0x0278(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Reveal_Fail;                                       // 0x0280(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Activities1;                                       // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Activities2;                                       // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Border;                                            // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 digit0;                                            // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 digit1;                                            // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 digit2;                                            // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 digit3;                                            // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 digit4;                                            // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 digit5;                                            // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 digit6;                                            // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 digit7;                                            // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 digit8;                                            // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 digit9;                                            // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SpeedLines_1;                                      // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SqrActivities1;                                    // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SqrActivities2;                                    // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAudioComponent*                        Winner_Animation_Sound;                            // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void OnListItemObjectSet(class UObject* ListItemObject);
	void StartRevealAnimation(float PlayRate);
	void RevealWinnerAnimation();
	void Construct();
	void BP_OnEntryReleased();
	void Destruct();
	void ExecuteUbergraph_ComOptionReveal(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ComOptionReveal_C">();
	}
	static class UComOptionReveal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UComOptionReveal_C>();
	}
};
static_assert(alignof(UComOptionReveal_C) == 0x000008, "Wrong alignment on UComOptionReveal_C");
static_assert(sizeof(UComOptionReveal_C) == 0x000310, "Wrong size on UComOptionReveal_C");
static_assert(offsetof(UComOptionReveal_C, UberGraphFrame) == 0x000270, "Member 'UComOptionReveal_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UComOptionReveal_C, Reveal_Win) == 0x000278, "Member 'UComOptionReveal_C::Reveal_Win' has a wrong offset!");
static_assert(offsetof(UComOptionReveal_C, Reveal_Fail) == 0x000280, "Member 'UComOptionReveal_C::Reveal_Fail' has a wrong offset!");
static_assert(offsetof(UComOptionReveal_C, Activities1) == 0x000288, "Member 'UComOptionReveal_C::Activities1' has a wrong offset!");
static_assert(offsetof(UComOptionReveal_C, Activities2) == 0x000290, "Member 'UComOptionReveal_C::Activities2' has a wrong offset!");
static_assert(offsetof(UComOptionReveal_C, Border) == 0x000298, "Member 'UComOptionReveal_C::Border' has a wrong offset!");
static_assert(offsetof(UComOptionReveal_C, digit0) == 0x0002A0, "Member 'UComOptionReveal_C::digit0' has a wrong offset!");
static_assert(offsetof(UComOptionReveal_C, digit1) == 0x0002A8, "Member 'UComOptionReveal_C::digit1' has a wrong offset!");
static_assert(offsetof(UComOptionReveal_C, digit2) == 0x0002B0, "Member 'UComOptionReveal_C::digit2' has a wrong offset!");
static_assert(offsetof(UComOptionReveal_C, digit3) == 0x0002B8, "Member 'UComOptionReveal_C::digit3' has a wrong offset!");
static_assert(offsetof(UComOptionReveal_C, digit4) == 0x0002C0, "Member 'UComOptionReveal_C::digit4' has a wrong offset!");
static_assert(offsetof(UComOptionReveal_C, digit5) == 0x0002C8, "Member 'UComOptionReveal_C::digit5' has a wrong offset!");
static_assert(offsetof(UComOptionReveal_C, digit6) == 0x0002D0, "Member 'UComOptionReveal_C::digit6' has a wrong offset!");
static_assert(offsetof(UComOptionReveal_C, digit7) == 0x0002D8, "Member 'UComOptionReveal_C::digit7' has a wrong offset!");
static_assert(offsetof(UComOptionReveal_C, digit8) == 0x0002E0, "Member 'UComOptionReveal_C::digit8' has a wrong offset!");
static_assert(offsetof(UComOptionReveal_C, digit9) == 0x0002E8, "Member 'UComOptionReveal_C::digit9' has a wrong offset!");
static_assert(offsetof(UComOptionReveal_C, SpeedLines_1) == 0x0002F0, "Member 'UComOptionReveal_C::SpeedLines_1' has a wrong offset!");
static_assert(offsetof(UComOptionReveal_C, SqrActivities1) == 0x0002F8, "Member 'UComOptionReveal_C::SqrActivities1' has a wrong offset!");
static_assert(offsetof(UComOptionReveal_C, SqrActivities2) == 0x000300, "Member 'UComOptionReveal_C::SqrActivities2' has a wrong offset!");
static_assert(offsetof(UComOptionReveal_C, Winner_Animation_Sound) == 0x000308, "Member 'UComOptionReveal_C::Winner_Animation_Sound' has a wrong offset!");

}

