#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ComPreviewDetail

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameSubCatalog_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ComPreviewDetail.ComPreviewDetail_C
// 0x0390 (0x08D8 - 0x0548)
class UComPreviewDetail_C final : public UFortCommunityVotingDetailPreview
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0548(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Idle;                                              // 0x0550(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Outro;                                             // 0x0558(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x0560(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBox*                         AffilateInfo;                                      // 0x0568(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       AffiliateName;                                     // 0x0570(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaDirectAcquisitionOffer_SalesTextBanner_C* AthenaDirectAcquisitionOffer_PercentageOffBanner;  // 0x0578(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaDirectAcquisitonDetails_BattlePassStarDetails_C* AthenaDirectAcquisitonDetails_BattlePassStarDetails; // 0x0580(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               CameraFramingWidget;                               // 0x0588(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CatalogOfferName;                                  // 0x0590(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               CatalogOfferSB;                                    // 0x0598(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Check;                                             // 0x05A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CloseIcon;                                         // 0x05A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          CommonBorder_0;                                    // 0x05B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlockAlreadyOwnedItems;                  // 0x05B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlockRemainingItems;                     // 0x05C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Currency1ItemImage2;                               // 0x05C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEventStoreHostPanels_C*                EventStoreHostPanels;                              // 0x05D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_PriceContainer;                      // 0x05D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UComDetailHeader_C*                     ItemInfoHeaderWidget;                              // 0x05E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ItemRewardsSB;                                     // 0x05E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               LeftPanelSB;                                       // 0x05F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPanelButton_C*                         MobileCloseButton;                                 // 0x05F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMTXButton_C*                           MTXButton;                                         // 0x0600(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               MTXButtonBox;                                      // 0x0608(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          MultipleItemCB;                                    // 0x0610(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaDirectAcquisitonDetails_RefundDisclaimer_C* NonrefundableText;                                 // 0x0618(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               O_Sale_PreviousPrice;                              // 0x0620(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         OfferDetailsHB;                                    // 0x0628(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               OverlayCloseButton;                                // 0x0630(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       OwnedText;                                         // 0x0638(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SB_MainContent;                                    // 0x0640(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       SeasonVariantUnlockCondition;                      // 0x0648(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Owned;                                     // 0x0650(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortSwipePanel*                        SwipePanel;                                        // 0x0658(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_2FA;                                          // 0x0660(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextOfferDisplayPrice1;                            // 0x0668(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextOriginalPrice1;                                // 0x0670(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VariantSetInfoBlock;                               // 0x0678(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       VariantUnlockPreviewSet;                           // 0x0680(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          CanPurchase;                                       // 0x0688(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsPurchasing;                                      // 0x0689(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_68A[0x2];                                      // 0x068A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NumberToPurchase;                                  // 0x068C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CanPurchaseLeft;                                   // 0x0690(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          CanPurchaseRight;                                  // 0x0691(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          CanChangeQuantity;                                 // 0x0692(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_693[0x5];                                      // 0x0693(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           DelayGiftingHandle;                                // 0x0698(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FCatalogOffer                          CatalogOffer;                                      // 0x06A0(0x0238)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ShopVariantPreviewInfoUpdated();
	int32 GetNumBattlepassStars();
	bool GetHasBattlepassStars();
	void ShowHideGiftingButton();
	int32 GetOwnedIndex();
	bool IsNonRefundable();
	void DisableGiftButton();
	void EnableGiftButton();
	bool IsDynamicBundleBP();
	bool DoesOfferAllowQuantity();
	void SetupDynamicBundle();
	void GetSalesText(class FText* NewParam);
	void SetupPrerollItemHeaderInfo();
	class FText GetDisplayName(const struct FFortItemQuantityPair& ItemQuantityPair);
	void GetSortedItems(TArray<struct FFortItemQuantityPair>* ItemQuantityPairs);
	void UpdateDetails(class UFortItem* Reward);
	ESlateVisibility GetPagingVisibility();
	void GetOfferDetailsSlotMargin(struct FMargin* Margin);
	void CreateAndAddRewardItem(const struct FFortItemQuantityPair& ItemQuantity, int32 ItemIndex, TArray<struct FFortItemQuantityPair>& SortedItemQuantities, bool PreviewPlaceholder);
	bool GetShowDescription();
	bool GetShowDetails();
	void GetShowCard(bool* Result);
	EFortItemCardSize GetCardSize();
	void IsSingleGrantedItem(bool* Result);
	void Owned_Bundle_Item_Count(int32* Owned_Items, int32* UnOwned_Items, bool* bNoneOwned, bool* bAllOwned);
	void UpdateFromOffer_RefreshButtons();
	void CanGiftOffer(EOfferPurchaseError* Result);
	void HandleGetVBucksClicked();
	void UpdateCamera();
	void UpdateViewedItem(class UFortItem* ViewedItem);
	void FixupBackpack(class UFortItemDefinition* ItemDef, TArray<struct FFortItemQuantityPair>& AllItemQuantityPairs, class UAthenaStoreReward_C* RewardWidget);
	void UpdateCatalogOfferName();
	void UpdateItemList();
	class UWidget* GetWidgetForFramingViewedItem();
	void SetupSaleInfo(bool bHasSale, const class FString& BannerOverrideTag, const class FText& NormalPrice, bool bHasBattlePassStars, int32 NumOfBattlePassStars);
	void UpdateAvailability();
	void Update_Locked_Information();
	void SetupPrice(class UWidget* PriceContainer, class UTextBlock* NormalPriceText, class UWidget* SalePriceContainer, class UTextBlock* SalePriceText, class UImage* CurrencyImage);
	void PopDetails();
	void HandleBack(bool* PassThrough);
	void UpdateFromOffer();
	void DialogResult_DB8826E445B08AB3434D879B101CDE83(EFortDialogResult Result, class FName ResultName);
	void OnActivated();
	void Construct();
	void OnUpdateStatus();
	void Show_Not_Enough_Currency();
	void BndEvt__SwipePanel_K2Node_ComponentBoundEvent_11_OnFortSwipeEvent__DelegateSignature();
	void BndEvt__SwipePanel_K2Node_ComponentBoundEvent_29_OnFortSwipeEvent__DelegateSignature();
	void OnBeginIntro();
	void HandleVaultViewItem(class UFortItem* Item);
	void UpdateCenterandBinding();
	void BndEvt__PreviewStylesButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void OnDeactivated();
	void UpdateItemViewModeBP();
	void WidgetAnimationEvt_Intro_K2Node_WidgetAnimationEvent_0();
	void OnOfferSet();
	void BndEvt__MobileCloseButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void ExecuteUbergraph_ComPreviewDetail(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ComPreviewDetail_C">();
	}
	static class UComPreviewDetail_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UComPreviewDetail_C>();
	}
};
static_assert(alignof(UComPreviewDetail_C) == 0x000008, "Wrong alignment on UComPreviewDetail_C");
static_assert(sizeof(UComPreviewDetail_C) == 0x0008D8, "Wrong size on UComPreviewDetail_C");
static_assert(offsetof(UComPreviewDetail_C, UberGraphFrame) == 0x000548, "Member 'UComPreviewDetail_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UComPreviewDetail_C, Idle) == 0x000550, "Member 'UComPreviewDetail_C::Idle' has a wrong offset!");
static_assert(offsetof(UComPreviewDetail_C, Outro) == 0x000558, "Member 'UComPreviewDetail_C::Outro' has a wrong offset!");
static_assert(offsetof(UComPreviewDetail_C, Intro) == 0x000560, "Member 'UComPreviewDetail_C::Intro' has a wrong offset!");
static_assert(offsetof(UComPreviewDetail_C, AffilateInfo) == 0x000568, "Member 'UComPreviewDetail_C::AffilateInfo' has a wrong offset!");
static_assert(offsetof(UComPreviewDetail_C, AffiliateName) == 0x000570, "Member 'UComPreviewDetail_C::AffiliateName' has a wrong offset!");
static_assert(offsetof(UComPreviewDetail_C, AthenaDirectAcquisitionOffer_PercentageOffBanner) == 0x000578, "Member 'UComPreviewDetail_C::AthenaDirectAcquisitionOffer_PercentageOffBanner' has a wrong offset!");
static_assert(offsetof(UComPreviewDetail_C, AthenaDirectAcquisitonDetails_BattlePassStarDetails) == 0x000580, "Member 'UComPreviewDetail_C::AthenaDirectAcquisitonDetails_BattlePassStarDetails' has a wrong offset!");
static_assert(offsetof(UComPreviewDetail_C, CameraFramingWidget) == 0x000588, "Member 'UComPreviewDetail_C::CameraFramingWidget' has a wrong offset!");
static_assert(offsetof(UComPreviewDetail_C, CatalogOfferName) == 0x000590, "Member 'UComPreviewDetail_C::CatalogOfferName' has a wrong offset!");
static_assert(offsetof(UComPreviewDetail_C, CatalogOfferSB) == 0x000598, "Member 'UComPreviewDetail_C::CatalogOfferSB' has a wrong offset!");
static_assert(offsetof(UComPreviewDetail_C, Check) == 0x0005A0, "Member 'UComPreviewDetail_C::Check' has a wrong offset!");
static_assert(offsetof(UComPreviewDetail_C, CloseIcon) == 0x0005A8, "Member 'UComPreviewDetail_C::CloseIcon' has a wrong offset!");
static_assert(offsetof(UComPreviewDetail_C, CommonBorder_0) == 0x0005B0, "Member 'UComPreviewDetail_C::CommonBorder_0' has a wrong offset!");
static_assert(offsetof(UComPreviewDetail_C, CommonTextBlockAlreadyOwnedItems) == 0x0005B8, "Member 'UComPreviewDetail_C::CommonTextBlockAlreadyOwnedItems' has a wrong offset!");
static_assert(offsetof(UComPreviewDetail_C, CommonTextBlockRemainingItems) == 0x0005C0, "Member 'UComPreviewDetail_C::CommonTextBlockRemainingItems' has a wrong offset!");
static_assert(offsetof(UComPreviewDetail_C, Currency1ItemImage2) == 0x0005C8, "Member 'UComPreviewDetail_C::Currency1ItemImage2' has a wrong offset!");
static_assert(offsetof(UComPreviewDetail_C, EventStoreHostPanels) == 0x0005D0, "Member 'UComPreviewDetail_C::EventStoreHostPanels' has a wrong offset!");
static_assert(offsetof(UComPreviewDetail_C, HorizontalBox_PriceContainer) == 0x0005D8, "Member 'UComPreviewDetail_C::HorizontalBox_PriceContainer' has a wrong offset!");
static_assert(offsetof(UComPreviewDetail_C, ItemInfoHeaderWidget) == 0x0005E0, "Member 'UComPreviewDetail_C::ItemInfoHeaderWidget' has a wrong offset!");
static_assert(offsetof(UComPreviewDetail_C, ItemRewardsSB) == 0x0005E8, "Member 'UComPreviewDetail_C::ItemRewardsSB' has a wrong offset!");
static_assert(offsetof(UComPreviewDetail_C, LeftPanelSB) == 0x0005F0, "Member 'UComPreviewDetail_C::LeftPanelSB' has a wrong offset!");
static_assert(offsetof(UComPreviewDetail_C, MobileCloseButton) == 0x0005F8, "Member 'UComPreviewDetail_C::MobileCloseButton' has a wrong offset!");
static_assert(offsetof(UComPreviewDetail_C, MTXButton) == 0x000600, "Member 'UComPreviewDetail_C::MTXButton' has a wrong offset!");
static_assert(offsetof(UComPreviewDetail_C, MTXButtonBox) == 0x000608, "Member 'UComPreviewDetail_C::MTXButtonBox' has a wrong offset!");
static_assert(offsetof(UComPreviewDetail_C, MultipleItemCB) == 0x000610, "Member 'UComPreviewDetail_C::MultipleItemCB' has a wrong offset!");
static_assert(offsetof(UComPreviewDetail_C, NonrefundableText) == 0x000618, "Member 'UComPreviewDetail_C::NonrefundableText' has a wrong offset!");
static_assert(offsetof(UComPreviewDetail_C, O_Sale_PreviousPrice) == 0x000620, "Member 'UComPreviewDetail_C::O_Sale_PreviousPrice' has a wrong offset!");
static_assert(offsetof(UComPreviewDetail_C, OfferDetailsHB) == 0x000628, "Member 'UComPreviewDetail_C::OfferDetailsHB' has a wrong offset!");
static_assert(offsetof(UComPreviewDetail_C, OverlayCloseButton) == 0x000630, "Member 'UComPreviewDetail_C::OverlayCloseButton' has a wrong offset!");
static_assert(offsetof(UComPreviewDetail_C, OwnedText) == 0x000638, "Member 'UComPreviewDetail_C::OwnedText' has a wrong offset!");
static_assert(offsetof(UComPreviewDetail_C, SB_MainContent) == 0x000640, "Member 'UComPreviewDetail_C::SB_MainContent' has a wrong offset!");
static_assert(offsetof(UComPreviewDetail_C, SeasonVariantUnlockCondition) == 0x000648, "Member 'UComPreviewDetail_C::SeasonVariantUnlockCondition' has a wrong offset!");
static_assert(offsetof(UComPreviewDetail_C, SizeBox_Owned) == 0x000650, "Member 'UComPreviewDetail_C::SizeBox_Owned' has a wrong offset!");
static_assert(offsetof(UComPreviewDetail_C, SwipePanel) == 0x000658, "Member 'UComPreviewDetail_C::SwipePanel' has a wrong offset!");
static_assert(offsetof(UComPreviewDetail_C, Text_2FA) == 0x000660, "Member 'UComPreviewDetail_C::Text_2FA' has a wrong offset!");
static_assert(offsetof(UComPreviewDetail_C, TextOfferDisplayPrice1) == 0x000668, "Member 'UComPreviewDetail_C::TextOfferDisplayPrice1' has a wrong offset!");
static_assert(offsetof(UComPreviewDetail_C, TextOriginalPrice1) == 0x000670, "Member 'UComPreviewDetail_C::TextOriginalPrice1' has a wrong offset!");
static_assert(offsetof(UComPreviewDetail_C, VariantSetInfoBlock) == 0x000678, "Member 'UComPreviewDetail_C::VariantSetInfoBlock' has a wrong offset!");
static_assert(offsetof(UComPreviewDetail_C, VariantUnlockPreviewSet) == 0x000680, "Member 'UComPreviewDetail_C::VariantUnlockPreviewSet' has a wrong offset!");
static_assert(offsetof(UComPreviewDetail_C, CanPurchase) == 0x000688, "Member 'UComPreviewDetail_C::CanPurchase' has a wrong offset!");
static_assert(offsetof(UComPreviewDetail_C, IsPurchasing) == 0x000689, "Member 'UComPreviewDetail_C::IsPurchasing' has a wrong offset!");
static_assert(offsetof(UComPreviewDetail_C, NumberToPurchase) == 0x00068C, "Member 'UComPreviewDetail_C::NumberToPurchase' has a wrong offset!");
static_assert(offsetof(UComPreviewDetail_C, CanPurchaseLeft) == 0x000690, "Member 'UComPreviewDetail_C::CanPurchaseLeft' has a wrong offset!");
static_assert(offsetof(UComPreviewDetail_C, CanPurchaseRight) == 0x000691, "Member 'UComPreviewDetail_C::CanPurchaseRight' has a wrong offset!");
static_assert(offsetof(UComPreviewDetail_C, CanChangeQuantity) == 0x000692, "Member 'UComPreviewDetail_C::CanChangeQuantity' has a wrong offset!");
static_assert(offsetof(UComPreviewDetail_C, DelayGiftingHandle) == 0x000698, "Member 'UComPreviewDetail_C::DelayGiftingHandle' has a wrong offset!");
static_assert(offsetof(UComPreviewDetail_C, CatalogOffer) == 0x0006A0, "Member 'UComPreviewDetail_C::CatalogOffer' has a wrong offset!");

}

