#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ComRevealScreen_Popup

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ComRevealScreen_Popup.ComRevealScreen_Popup_C
// 0x00C0 (0x0488 - 0x03C8)
class UComRevealScreen_Popup_C final : public UFortCommunityVotingRevealScreen
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       PopIn;                                             // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeOut;                                           // 0x03D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Reveal;                                            // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonBorder*                          Border_TapToCloseZone;                             // 0x03E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ComCenterImageBackground;                          // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ComDivider2_1;                                     // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ComDivider2_2;                                     // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ComLeftImageBackground;                            // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UcomLogoTitle_C*                        comLogoTitle;                                      // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ComPopUpBgarrows;                                  // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 comPopUpWhiteBorder;                               // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 comPopUpWhiteBorder_1;                             // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 comRevealFlashFullScreen;                          // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ComRightImageBackground;                           // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Currency1ItemImage2;                               // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Darken_1;                                          // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 faki;                                              // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 faki2;                                             // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 faki3;                                             // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 footerimage;                                       // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 footerimage_2;                                     // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Reveal_screenBackground;                           // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextOfferDisplayPrice1;                            // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	struct FEventReply TapToClose(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void StartFinalAnimation();
	void StartFadeOutScreen(float Delay);
	void Construct();
	void ExecuteUbergraph_ComRevealScreen_Popup(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ComRevealScreen_Popup_C">();
	}
	static class UComRevealScreen_Popup_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UComRevealScreen_Popup_C>();
	}
};
static_assert(alignof(UComRevealScreen_Popup_C) == 0x000008, "Wrong alignment on UComRevealScreen_Popup_C");
static_assert(sizeof(UComRevealScreen_Popup_C) == 0x000488, "Wrong size on UComRevealScreen_Popup_C");
static_assert(offsetof(UComRevealScreen_Popup_C, UberGraphFrame) == 0x0003C8, "Member 'UComRevealScreen_Popup_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UComRevealScreen_Popup_C, PopIn) == 0x0003D0, "Member 'UComRevealScreen_Popup_C::PopIn' has a wrong offset!");
static_assert(offsetof(UComRevealScreen_Popup_C, FadeOut) == 0x0003D8, "Member 'UComRevealScreen_Popup_C::FadeOut' has a wrong offset!");
static_assert(offsetof(UComRevealScreen_Popup_C, Reveal) == 0x0003E0, "Member 'UComRevealScreen_Popup_C::Reveal' has a wrong offset!");
static_assert(offsetof(UComRevealScreen_Popup_C, Border_TapToCloseZone) == 0x0003E8, "Member 'UComRevealScreen_Popup_C::Border_TapToCloseZone' has a wrong offset!");
static_assert(offsetof(UComRevealScreen_Popup_C, ComCenterImageBackground) == 0x0003F0, "Member 'UComRevealScreen_Popup_C::ComCenterImageBackground' has a wrong offset!");
static_assert(offsetof(UComRevealScreen_Popup_C, ComDivider2_1) == 0x0003F8, "Member 'UComRevealScreen_Popup_C::ComDivider2_1' has a wrong offset!");
static_assert(offsetof(UComRevealScreen_Popup_C, ComDivider2_2) == 0x000400, "Member 'UComRevealScreen_Popup_C::ComDivider2_2' has a wrong offset!");
static_assert(offsetof(UComRevealScreen_Popup_C, ComLeftImageBackground) == 0x000408, "Member 'UComRevealScreen_Popup_C::ComLeftImageBackground' has a wrong offset!");
static_assert(offsetof(UComRevealScreen_Popup_C, comLogoTitle) == 0x000410, "Member 'UComRevealScreen_Popup_C::comLogoTitle' has a wrong offset!");
static_assert(offsetof(UComRevealScreen_Popup_C, ComPopUpBgarrows) == 0x000418, "Member 'UComRevealScreen_Popup_C::ComPopUpBgarrows' has a wrong offset!");
static_assert(offsetof(UComRevealScreen_Popup_C, comPopUpWhiteBorder) == 0x000420, "Member 'UComRevealScreen_Popup_C::comPopUpWhiteBorder' has a wrong offset!");
static_assert(offsetof(UComRevealScreen_Popup_C, comPopUpWhiteBorder_1) == 0x000428, "Member 'UComRevealScreen_Popup_C::comPopUpWhiteBorder_1' has a wrong offset!");
static_assert(offsetof(UComRevealScreen_Popup_C, comRevealFlashFullScreen) == 0x000430, "Member 'UComRevealScreen_Popup_C::comRevealFlashFullScreen' has a wrong offset!");
static_assert(offsetof(UComRevealScreen_Popup_C, ComRightImageBackground) == 0x000438, "Member 'UComRevealScreen_Popup_C::ComRightImageBackground' has a wrong offset!");
static_assert(offsetof(UComRevealScreen_Popup_C, Currency1ItemImage2) == 0x000440, "Member 'UComRevealScreen_Popup_C::Currency1ItemImage2' has a wrong offset!");
static_assert(offsetof(UComRevealScreen_Popup_C, Darken_1) == 0x000448, "Member 'UComRevealScreen_Popup_C::Darken_1' has a wrong offset!");
static_assert(offsetof(UComRevealScreen_Popup_C, faki) == 0x000450, "Member 'UComRevealScreen_Popup_C::faki' has a wrong offset!");
static_assert(offsetof(UComRevealScreen_Popup_C, faki2) == 0x000458, "Member 'UComRevealScreen_Popup_C::faki2' has a wrong offset!");
static_assert(offsetof(UComRevealScreen_Popup_C, faki3) == 0x000460, "Member 'UComRevealScreen_Popup_C::faki3' has a wrong offset!");
static_assert(offsetof(UComRevealScreen_Popup_C, footerimage) == 0x000468, "Member 'UComRevealScreen_Popup_C::footerimage' has a wrong offset!");
static_assert(offsetof(UComRevealScreen_Popup_C, footerimage_2) == 0x000470, "Member 'UComRevealScreen_Popup_C::footerimage_2' has a wrong offset!");
static_assert(offsetof(UComRevealScreen_Popup_C, Reveal_screenBackground) == 0x000478, "Member 'UComRevealScreen_Popup_C::Reveal_screenBackground' has a wrong offset!");
static_assert(offsetof(UComRevealScreen_Popup_C, TextOfferDisplayPrice1) == 0x000480, "Member 'UComRevealScreen_Popup_C::TextOfferDisplayPrice1' has a wrong offset!");

}

