#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ComScreen

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ComScreen.ComScreen_C
// 0x0078 (0x0458 - 0x03E0)
class UComScreen_C final : public UFortCommunityVotingScreen
{
public:
	class UWidgetAnimation*                       Fade;                                              // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 CloseIcon;                                         // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ComBgImage;                                        // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ComCenterImageBackground;                          // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ComDivider2;                                       // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ComDivider2_3;                                     // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ComLeftImageBackground;                            // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UcomLogoTitle_C*                        comLogoTitle;                                      // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ComRightImageBackground;                           // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 footerimage;                                       // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPanelButton_C*                         MobileCloseButton;                                 // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               OverlayCloseButton;                                // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 VFX;                                               // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 VFX_1;                                             // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 VFX_2;                                             // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ComScreen_C">();
	}
	static class UComScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UComScreen_C>();
	}
};
static_assert(alignof(UComScreen_C) == 0x000008, "Wrong alignment on UComScreen_C");
static_assert(sizeof(UComScreen_C) == 0x000458, "Wrong size on UComScreen_C");
static_assert(offsetof(UComScreen_C, Fade) == 0x0003E0, "Member 'UComScreen_C::Fade' has a wrong offset!");
static_assert(offsetof(UComScreen_C, CloseIcon) == 0x0003E8, "Member 'UComScreen_C::CloseIcon' has a wrong offset!");
static_assert(offsetof(UComScreen_C, ComBgImage) == 0x0003F0, "Member 'UComScreen_C::ComBgImage' has a wrong offset!");
static_assert(offsetof(UComScreen_C, ComCenterImageBackground) == 0x0003F8, "Member 'UComScreen_C::ComCenterImageBackground' has a wrong offset!");
static_assert(offsetof(UComScreen_C, ComDivider2) == 0x000400, "Member 'UComScreen_C::ComDivider2' has a wrong offset!");
static_assert(offsetof(UComScreen_C, ComDivider2_3) == 0x000408, "Member 'UComScreen_C::ComDivider2_3' has a wrong offset!");
static_assert(offsetof(UComScreen_C, ComLeftImageBackground) == 0x000410, "Member 'UComScreen_C::ComLeftImageBackground' has a wrong offset!");
static_assert(offsetof(UComScreen_C, comLogoTitle) == 0x000418, "Member 'UComScreen_C::comLogoTitle' has a wrong offset!");
static_assert(offsetof(UComScreen_C, ComRightImageBackground) == 0x000420, "Member 'UComScreen_C::ComRightImageBackground' has a wrong offset!");
static_assert(offsetof(UComScreen_C, footerimage) == 0x000428, "Member 'UComScreen_C::footerimage' has a wrong offset!");
static_assert(offsetof(UComScreen_C, MobileCloseButton) == 0x000430, "Member 'UComScreen_C::MobileCloseButton' has a wrong offset!");
static_assert(offsetof(UComScreen_C, OverlayCloseButton) == 0x000438, "Member 'UComScreen_C::OverlayCloseButton' has a wrong offset!");
static_assert(offsetof(UComScreen_C, VFX) == 0x000440, "Member 'UComScreen_C::VFX' has a wrong offset!");
static_assert(offsetof(UComScreen_C, VFX_1) == 0x000448, "Member 'UComScreen_C::VFX_1' has a wrong offset!");
static_assert(offsetof(UComScreen_C, VFX_2) == 0x000450, "Member 'UComScreen_C::VFX_2' has a wrong offset!");

}

