#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ComScreenTile

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ComScreenTile.ComScreenTile_C
// 0x0148 (0x0D18 - 0x0BD0)
class UComScreenTile_C final : public UFortCommunityVotingTile
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0BD0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       CallToAction;                                      // 0x0BD8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CarouselTransition;                                // 0x0BE0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover;                                             // 0x0BE8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 ComCenterImageBackground;                          // 0x0BF0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ComDivider2_1;                                     // 0x0BF8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ComDivider2_2;                                     // 0x0C00(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ComLeftImageBackground;                            // 0x0C08(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UcomLogoTitle_C*                        comLogoTitle;                                      // 0x0C10(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ComRightImageBackground;                           // 0x0C18(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ComVoteActivitiesImage;                            // 0x0C20(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ComVoteActivitiesImage_1;                          // 0x0C28(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ComVoteActivitiesImage_2;                          // 0x0C30(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 poUpHeader;                                        // 0x0C38(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MID_StrikeThrough;                                 // 0x0C40(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MID_CarouselTimerProgressBar;                      // 0x0C48(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            Carousel_NextItemImage;                            // 0x0C50(0x0088)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         CarouselLoopTimeRemaining;                         // 0x0CD8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CarouselLoopTimer;                                 // 0x0CDC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              LargeSoftImage;                                    // 0x0CE0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UTexture2D*                             Carousel_NextLargeTexture;                         // 0x0D08(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItemDefinition*                    BattleStarTemplate;                                // 0x0D10(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnEntryReleased();
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void OnListItemObjectSet(class UObject* ListItemObject);
	void ExecuteUbergraph_ComScreenTile(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ComScreenTile_C">();
	}
	static class UComScreenTile_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UComScreenTile_C>();
	}
};
static_assert(alignof(UComScreenTile_C) == 0x000008, "Wrong alignment on UComScreenTile_C");
static_assert(sizeof(UComScreenTile_C) == 0x000D18, "Wrong size on UComScreenTile_C");
static_assert(offsetof(UComScreenTile_C, UberGraphFrame) == 0x000BD0, "Member 'UComScreenTile_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UComScreenTile_C, CallToAction) == 0x000BD8, "Member 'UComScreenTile_C::CallToAction' has a wrong offset!");
static_assert(offsetof(UComScreenTile_C, CarouselTransition) == 0x000BE0, "Member 'UComScreenTile_C::CarouselTransition' has a wrong offset!");
static_assert(offsetof(UComScreenTile_C, Hover) == 0x000BE8, "Member 'UComScreenTile_C::Hover' has a wrong offset!");
static_assert(offsetof(UComScreenTile_C, ComCenterImageBackground) == 0x000BF0, "Member 'UComScreenTile_C::ComCenterImageBackground' has a wrong offset!");
static_assert(offsetof(UComScreenTile_C, ComDivider2_1) == 0x000BF8, "Member 'UComScreenTile_C::ComDivider2_1' has a wrong offset!");
static_assert(offsetof(UComScreenTile_C, ComDivider2_2) == 0x000C00, "Member 'UComScreenTile_C::ComDivider2_2' has a wrong offset!");
static_assert(offsetof(UComScreenTile_C, ComLeftImageBackground) == 0x000C08, "Member 'UComScreenTile_C::ComLeftImageBackground' has a wrong offset!");
static_assert(offsetof(UComScreenTile_C, comLogoTitle) == 0x000C10, "Member 'UComScreenTile_C::comLogoTitle' has a wrong offset!");
static_assert(offsetof(UComScreenTile_C, ComRightImageBackground) == 0x000C18, "Member 'UComScreenTile_C::ComRightImageBackground' has a wrong offset!");
static_assert(offsetof(UComScreenTile_C, ComVoteActivitiesImage) == 0x000C20, "Member 'UComScreenTile_C::ComVoteActivitiesImage' has a wrong offset!");
static_assert(offsetof(UComScreenTile_C, ComVoteActivitiesImage_1) == 0x000C28, "Member 'UComScreenTile_C::ComVoteActivitiesImage_1' has a wrong offset!");
static_assert(offsetof(UComScreenTile_C, ComVoteActivitiesImage_2) == 0x000C30, "Member 'UComScreenTile_C::ComVoteActivitiesImage_2' has a wrong offset!");
static_assert(offsetof(UComScreenTile_C, poUpHeader) == 0x000C38, "Member 'UComScreenTile_C::poUpHeader' has a wrong offset!");
static_assert(offsetof(UComScreenTile_C, MID_StrikeThrough) == 0x000C40, "Member 'UComScreenTile_C::MID_StrikeThrough' has a wrong offset!");
static_assert(offsetof(UComScreenTile_C, MID_CarouselTimerProgressBar) == 0x000C48, "Member 'UComScreenTile_C::MID_CarouselTimerProgressBar' has a wrong offset!");
static_assert(offsetof(UComScreenTile_C, Carousel_NextItemImage) == 0x000C50, "Member 'UComScreenTile_C::Carousel_NextItemImage' has a wrong offset!");
static_assert(offsetof(UComScreenTile_C, CarouselLoopTimeRemaining) == 0x000CD8, "Member 'UComScreenTile_C::CarouselLoopTimeRemaining' has a wrong offset!");
static_assert(offsetof(UComScreenTile_C, CarouselLoopTimer) == 0x000CDC, "Member 'UComScreenTile_C::CarouselLoopTimer' has a wrong offset!");
static_assert(offsetof(UComScreenTile_C, LargeSoftImage) == 0x000CE0, "Member 'UComScreenTile_C::LargeSoftImage' has a wrong offset!");
static_assert(offsetof(UComScreenTile_C, Carousel_NextLargeTexture) == 0x000D08, "Member 'UComScreenTile_C::Carousel_NextLargeTexture' has a wrong offset!");
static_assert(offsetof(UComScreenTile_C, BattleStarTemplate) == 0x000D10, "Member 'UComScreenTile_C::BattleStarTemplate' has a wrong offset!");

}

