#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ComVoteFeedback

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ComVoteFeedback.ComVoteFeedback_C
// 0x0038 (0x0268 - 0x0230)
class UComVoteFeedback_C final : public UFortCommunityVotingFeedback
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       voting_activities;                                 // 0x0238(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Once;                                              // 0x0240(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 RoundedSquare1;                                    // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RoundedSquare2;                                    // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RoundedSquare3;                                    // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Vote01;                                            // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_ComVoteFeedback(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ComVoteFeedback_C">();
	}
	static class UComVoteFeedback_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UComVoteFeedback_C>();
	}
};
static_assert(alignof(UComVoteFeedback_C) == 0x000008, "Wrong alignment on UComVoteFeedback_C");
static_assert(sizeof(UComVoteFeedback_C) == 0x000268, "Wrong size on UComVoteFeedback_C");
static_assert(offsetof(UComVoteFeedback_C, UberGraphFrame) == 0x000230, "Member 'UComVoteFeedback_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UComVoteFeedback_C, voting_activities) == 0x000238, "Member 'UComVoteFeedback_C::voting_activities' has a wrong offset!");
static_assert(offsetof(UComVoteFeedback_C, Once) == 0x000240, "Member 'UComVoteFeedback_C::Once' has a wrong offset!");
static_assert(offsetof(UComVoteFeedback_C, RoundedSquare1) == 0x000248, "Member 'UComVoteFeedback_C::RoundedSquare1' has a wrong offset!");
static_assert(offsetof(UComVoteFeedback_C, RoundedSquare2) == 0x000250, "Member 'UComVoteFeedback_C::RoundedSquare2' has a wrong offset!");
static_assert(offsetof(UComVoteFeedback_C, RoundedSquare3) == 0x000258, "Member 'UComVoteFeedback_C::RoundedSquare3' has a wrong offset!");
static_assert(offsetof(UComVoteFeedback_C, Vote01) == 0x000260, "Member 'UComVoteFeedback_C::Vote01' has a wrong offset!");

}

