#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ConsoleProfileWidget

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function ConsoleProfileWidget.ConsoleProfileWidget_C.SetDisplayName
// 0x0058 (0x0058 - 0x0000)
struct ConsoleProfileWidget_C_SetDisplayName final
{
public:
	class FText                                   DisplayName_0;                                     // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0020(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0038(0x0018)()
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue;          // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IgnoreCase_TextText_ReturnValue; // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0053(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ConsoleProfileWidget_C_SetDisplayName) == 0x000008, "Wrong alignment on ConsoleProfileWidget_C_SetDisplayName");
static_assert(sizeof(ConsoleProfileWidget_C_SetDisplayName) == 0x000058, "Wrong size on ConsoleProfileWidget_C_SetDisplayName");
static_assert(offsetof(ConsoleProfileWidget_C_SetDisplayName, DisplayName_0) == 0x000000, "Member 'ConsoleProfileWidget_C_SetDisplayName::DisplayName_0' has a wrong offset!");
static_assert(offsetof(ConsoleProfileWidget_C_SetDisplayName, Temp_bool_Variable) == 0x000018, "Member 'ConsoleProfileWidget_C_SetDisplayName::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ConsoleProfileWidget_C_SetDisplayName, CallFunc_TextIsEmpty_ReturnValue) == 0x000019, "Member 'ConsoleProfileWidget_C_SetDisplayName::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(ConsoleProfileWidget_C_SetDisplayName, Temp_byte_Variable) == 0x00001A, "Member 'ConsoleProfileWidget_C_SetDisplayName::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ConsoleProfileWidget_C_SetDisplayName, Temp_byte_Variable_1) == 0x00001B, "Member 'ConsoleProfileWidget_C_SetDisplayName::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(ConsoleProfileWidget_C_SetDisplayName, CallFunc_Conv_StringToText_ReturnValue) == 0x000020, "Member 'ConsoleProfileWidget_C_SetDisplayName::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(ConsoleProfileWidget_C_SetDisplayName, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000038, "Member 'ConsoleProfileWidget_C_SetDisplayName::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ConsoleProfileWidget_C_SetDisplayName, CallFunc_EqualEqual_TextText_ReturnValue) == 0x000050, "Member 'ConsoleProfileWidget_C_SetDisplayName::CallFunc_EqualEqual_TextText_ReturnValue' has a wrong offset!");
static_assert(offsetof(ConsoleProfileWidget_C_SetDisplayName, CallFunc_EqualEqual_IgnoreCase_TextText_ReturnValue) == 0x000051, "Member 'ConsoleProfileWidget_C_SetDisplayName::CallFunc_EqualEqual_IgnoreCase_TextText_ReturnValue' has a wrong offset!");
static_assert(offsetof(ConsoleProfileWidget_C_SetDisplayName, CallFunc_BooleanOR_ReturnValue) == 0x000052, "Member 'ConsoleProfileWidget_C_SetDisplayName::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(ConsoleProfileWidget_C_SetDisplayName, CallFunc_BooleanOR_ReturnValue_1) == 0x000053, "Member 'ConsoleProfileWidget_C_SetDisplayName::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ConsoleProfileWidget_C_SetDisplayName, K2Node_Select_Default) == 0x000054, "Member 'ConsoleProfileWidget_C_SetDisplayName::K2Node_Select_Default' has a wrong offset!");

}

