#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DA_AshtonPack

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass DA_AshtonPack.DA_AshtonPack_C
// 0x0088 (0x0A58 - 0x09D0)
class ADA_AshtonPack_C final : public AFortCustomizableAbilityDecoTool
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x09D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         TimePressed;                                       // 0x09D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PunchPicker;                                       // 0x09DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasLanded;                                         // 0x09E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9E1[0x7];                                      // 0x09E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  AshtonAbilityTags;                                 // 0x09E8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  GC_JumpTrails;                                     // 0x0A08(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  GC_SkydiveTrails;                                  // 0x0A28(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTag                           PrimaryFireEventTag;                               // 0x0A48(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           SecondaryFireEventTag;                             // 0x0A50(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_DA_AshtonPack(int32 EntryPoint);
	void BPPressSecondaryFire(class AFortDecoHelper* FortDecoHelper);
	void BPPressTrigger(class AFortDecoHelper* FortDecoHelper);
	void Landed(const struct FHitResult& Hit);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DA_AshtonPack_C">();
	}
	static class ADA_AshtonPack_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADA_AshtonPack_C>();
	}
};
static_assert(alignof(ADA_AshtonPack_C) == 0x000008, "Wrong alignment on ADA_AshtonPack_C");
static_assert(sizeof(ADA_AshtonPack_C) == 0x000A58, "Wrong size on ADA_AshtonPack_C");
static_assert(offsetof(ADA_AshtonPack_C, UberGraphFrame) == 0x0009D0, "Member 'ADA_AshtonPack_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ADA_AshtonPack_C, TimePressed) == 0x0009D8, "Member 'ADA_AshtonPack_C::TimePressed' has a wrong offset!");
static_assert(offsetof(ADA_AshtonPack_C, PunchPicker) == 0x0009DC, "Member 'ADA_AshtonPack_C::PunchPicker' has a wrong offset!");
static_assert(offsetof(ADA_AshtonPack_C, HasLanded) == 0x0009E0, "Member 'ADA_AshtonPack_C::HasLanded' has a wrong offset!");
static_assert(offsetof(ADA_AshtonPack_C, AshtonAbilityTags) == 0x0009E8, "Member 'ADA_AshtonPack_C::AshtonAbilityTags' has a wrong offset!");
static_assert(offsetof(ADA_AshtonPack_C, GC_JumpTrails) == 0x000A08, "Member 'ADA_AshtonPack_C::GC_JumpTrails' has a wrong offset!");
static_assert(offsetof(ADA_AshtonPack_C, GC_SkydiveTrails) == 0x000A28, "Member 'ADA_AshtonPack_C::GC_SkydiveTrails' has a wrong offset!");
static_assert(offsetof(ADA_AshtonPack_C, PrimaryFireEventTag) == 0x000A48, "Member 'ADA_AshtonPack_C::PrimaryFireEventTag' has a wrong offset!");
static_assert(offsetof(ADA_AshtonPack_C, SecondaryFireEventTag) == 0x000A50, "Member 'ADA_AshtonPack_C::SecondaryFireEventTag' has a wrong offset!");

}

