#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DA_BadgerBangs

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass DA_BadgerBangs.DA_BadgerBangs_C
// 0x0048 (0x0A18 - 0x09D0)
class ADA_BadgerBangs_C final : public AFortCustomizableAbilityDecoTool
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x09D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FGameplayTag                           SecondaryFireEventTag;                             // 0x09D8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           PrimaryFireEventTag;                               // 0x09E0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        PlayerPawn;                                        // 0x09E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsAshtonChicago;                                   // 0x09F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9F1[0x7];                                      // 0x09F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  ShieldOutTag;                                      // 0x09F8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_DA_BadgerBangs(int32 EntryPoint);
	void BPPressSecondaryFire(class AFortDecoHelper* FortDecoHelper);
	void BPPressTrigger(class AFortDecoHelper* FortDecoHelper);
	void BPReleaseSecondaryFire(class AFortDecoHelper* FortDecoHelper);
	void BPReleaseTrigger(class AFortDecoHelper* FortDecoHelper);
	void K2_OnUnEquip();
	void OnWeaponAttached();
	void UnhideWeaponMeshAll();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DA_BadgerBangs_C">();
	}
	static class ADA_BadgerBangs_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADA_BadgerBangs_C>();
	}
};
static_assert(alignof(ADA_BadgerBangs_C) == 0x000008, "Wrong alignment on ADA_BadgerBangs_C");
static_assert(sizeof(ADA_BadgerBangs_C) == 0x000A18, "Wrong size on ADA_BadgerBangs_C");
static_assert(offsetof(ADA_BadgerBangs_C, UberGraphFrame) == 0x0009D0, "Member 'ADA_BadgerBangs_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ADA_BadgerBangs_C, SecondaryFireEventTag) == 0x0009D8, "Member 'ADA_BadgerBangs_C::SecondaryFireEventTag' has a wrong offset!");
static_assert(offsetof(ADA_BadgerBangs_C, PrimaryFireEventTag) == 0x0009E0, "Member 'ADA_BadgerBangs_C::PrimaryFireEventTag' has a wrong offset!");
static_assert(offsetof(ADA_BadgerBangs_C, PlayerPawn) == 0x0009E8, "Member 'ADA_BadgerBangs_C::PlayerPawn' has a wrong offset!");
static_assert(offsetof(ADA_BadgerBangs_C, IsAshtonChicago) == 0x0009F0, "Member 'ADA_BadgerBangs_C::IsAshtonChicago' has a wrong offset!");
static_assert(offsetof(ADA_BadgerBangs_C, ShieldOutTag) == 0x0009F8, "Member 'ADA_BadgerBangs_C::ShieldOutTag' has a wrong offset!");

}

