#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EnableMultiFactorAuthModalBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass EnableMultiFactorAuthModalBP.EnableMultiFactorAuthModalBP_C
// 0x0120 (0x04D0 - 0x03B0)
class UEnableMultiFactorAuthModalBP_C final : public UEnableMultiFactorModal
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Intro_V2;                                          // 0x03B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ArrowPulse;                                        // 0x03C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonTextBlock*                       ConsoleTextBlock;                                  // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CT_LimitedTimeHeader;                              // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CT_TakenToWebsite;                                 // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        EnableButtonSwitcher;                              // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UItemInfoWidget_C*                      ItemInfoWidget_FromSocialImport;                   // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone;                                          // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              ScaleBox_TitleHeader;                              // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EFrontEndCamera                               DesiredFrontEndCamera;                             // 0x0418(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_419[0x7];                                      // 0x0419(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItemDefinition*                    PreviewItemDef;                                    // 0x0420(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HeartbeatDelayIntroAnimation;                      // 0x0428(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         debugSocialImportType;                             // 0x042C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bHasReward;                                        // 0x042D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42E[0x2];                                      // 0x042E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   FacebookHeader;                                    // 0x0430(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   VKHeader;                                          // 0x0448(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   SteamHeader;                                       // 0x0460(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   PlaystationHeader;                                 // 0x0478(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   XboxHeader;                                        // 0x0490(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	ESocialImportPanelPlatform                    SocialPlatform;                                    // 0x04A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A9[0x7];                                      // 0x04A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   NewVar_0;                                          // 0x04B0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UClass*                                 MobileLimitedTimeHeaderStyle;                      // 0x04C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ScaleTitleForCulture();
	void AnimationFullyCompleteBP();
	void HandleSetScreenMode();
	void NavDown();
	void NavUp();
	void NavRight();
	void NavLeft();
	void OnActivated();
	void BndEvt__Button_RemindMeLater_K2Node_ComponentBoundEvent_796_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void HandleHeaderText();
	void PreConstruct(bool IsDesignTime);
	void OnPanelTypeSet(ESocialImportPanelType NewType);
	void OnIncentivizedSet(bool bIncentivized);
	void OnSetExitButtonText(const class FText& NewButtonText);
	void OnConsoleDisplayURLProvided(const class FText& UniquePlayerURLText);
	void OnSetScreenConfiguration(bool bIsConsole);
	void Construct();
	void ExecuteUbergraph_EnableMultiFactorAuthModalBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"EnableMultiFactorAuthModalBP_C">();
	}
	static class UEnableMultiFactorAuthModalBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEnableMultiFactorAuthModalBP_C>();
	}
};
static_assert(alignof(UEnableMultiFactorAuthModalBP_C) == 0x000008, "Wrong alignment on UEnableMultiFactorAuthModalBP_C");
static_assert(sizeof(UEnableMultiFactorAuthModalBP_C) == 0x0004D0, "Wrong size on UEnableMultiFactorAuthModalBP_C");
static_assert(offsetof(UEnableMultiFactorAuthModalBP_C, UberGraphFrame) == 0x0003B0, "Member 'UEnableMultiFactorAuthModalBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UEnableMultiFactorAuthModalBP_C, Intro_V2) == 0x0003B8, "Member 'UEnableMultiFactorAuthModalBP_C::Intro_V2' has a wrong offset!");
static_assert(offsetof(UEnableMultiFactorAuthModalBP_C, ArrowPulse) == 0x0003C0, "Member 'UEnableMultiFactorAuthModalBP_C::ArrowPulse' has a wrong offset!");
static_assert(offsetof(UEnableMultiFactorAuthModalBP_C, Intro) == 0x0003C8, "Member 'UEnableMultiFactorAuthModalBP_C::Intro' has a wrong offset!");
static_assert(offsetof(UEnableMultiFactorAuthModalBP_C, ConsoleTextBlock) == 0x0003D0, "Member 'UEnableMultiFactorAuthModalBP_C::ConsoleTextBlock' has a wrong offset!");
static_assert(offsetof(UEnableMultiFactorAuthModalBP_C, CT_LimitedTimeHeader) == 0x0003D8, "Member 'UEnableMultiFactorAuthModalBP_C::CT_LimitedTimeHeader' has a wrong offset!");
static_assert(offsetof(UEnableMultiFactorAuthModalBP_C, CT_TakenToWebsite) == 0x0003E0, "Member 'UEnableMultiFactorAuthModalBP_C::CT_TakenToWebsite' has a wrong offset!");
static_assert(offsetof(UEnableMultiFactorAuthModalBP_C, EnableButtonSwitcher) == 0x0003E8, "Member 'UEnableMultiFactorAuthModalBP_C::EnableButtonSwitcher' has a wrong offset!");
static_assert(offsetof(UEnableMultiFactorAuthModalBP_C, Image_0) == 0x0003F0, "Member 'UEnableMultiFactorAuthModalBP_C::Image_0' has a wrong offset!");
static_assert(offsetof(UEnableMultiFactorAuthModalBP_C, Image_1) == 0x0003F8, "Member 'UEnableMultiFactorAuthModalBP_C::Image_1' has a wrong offset!");
static_assert(offsetof(UEnableMultiFactorAuthModalBP_C, ItemInfoWidget_FromSocialImport) == 0x000400, "Member 'UEnableMultiFactorAuthModalBP_C::ItemInfoWidget_FromSocialImport' has a wrong offset!");
static_assert(offsetof(UEnableMultiFactorAuthModalBP_C, SafeZone) == 0x000408, "Member 'UEnableMultiFactorAuthModalBP_C::SafeZone' has a wrong offset!");
static_assert(offsetof(UEnableMultiFactorAuthModalBP_C, ScaleBox_TitleHeader) == 0x000410, "Member 'UEnableMultiFactorAuthModalBP_C::ScaleBox_TitleHeader' has a wrong offset!");
static_assert(offsetof(UEnableMultiFactorAuthModalBP_C, DesiredFrontEndCamera) == 0x000418, "Member 'UEnableMultiFactorAuthModalBP_C::DesiredFrontEndCamera' has a wrong offset!");
static_assert(offsetof(UEnableMultiFactorAuthModalBP_C, PreviewItemDef) == 0x000420, "Member 'UEnableMultiFactorAuthModalBP_C::PreviewItemDef' has a wrong offset!");
static_assert(offsetof(UEnableMultiFactorAuthModalBP_C, HeartbeatDelayIntroAnimation) == 0x000428, "Member 'UEnableMultiFactorAuthModalBP_C::HeartbeatDelayIntroAnimation' has a wrong offset!");
static_assert(offsetof(UEnableMultiFactorAuthModalBP_C, debugSocialImportType) == 0x00042C, "Member 'UEnableMultiFactorAuthModalBP_C::debugSocialImportType' has a wrong offset!");
static_assert(offsetof(UEnableMultiFactorAuthModalBP_C, bHasReward) == 0x00042D, "Member 'UEnableMultiFactorAuthModalBP_C::bHasReward' has a wrong offset!");
static_assert(offsetof(UEnableMultiFactorAuthModalBP_C, FacebookHeader) == 0x000430, "Member 'UEnableMultiFactorAuthModalBP_C::FacebookHeader' has a wrong offset!");
static_assert(offsetof(UEnableMultiFactorAuthModalBP_C, VKHeader) == 0x000448, "Member 'UEnableMultiFactorAuthModalBP_C::VKHeader' has a wrong offset!");
static_assert(offsetof(UEnableMultiFactorAuthModalBP_C, SteamHeader) == 0x000460, "Member 'UEnableMultiFactorAuthModalBP_C::SteamHeader' has a wrong offset!");
static_assert(offsetof(UEnableMultiFactorAuthModalBP_C, PlaystationHeader) == 0x000478, "Member 'UEnableMultiFactorAuthModalBP_C::PlaystationHeader' has a wrong offset!");
static_assert(offsetof(UEnableMultiFactorAuthModalBP_C, XboxHeader) == 0x000490, "Member 'UEnableMultiFactorAuthModalBP_C::XboxHeader' has a wrong offset!");
static_assert(offsetof(UEnableMultiFactorAuthModalBP_C, SocialPlatform) == 0x0004A8, "Member 'UEnableMultiFactorAuthModalBP_C::SocialPlatform' has a wrong offset!");
static_assert(offsetof(UEnableMultiFactorAuthModalBP_C, NewVar_0) == 0x0004B0, "Member 'UEnableMultiFactorAuthModalBP_C::NewVar_0' has a wrong offset!");
static_assert(offsetof(UEnableMultiFactorAuthModalBP_C, MobileLimitedTimeHeaderStyle) == 0x0004C8, "Member 'UEnableMultiFactorAuthModalBP_C::MobileLimitedTimeHeaderStyle' has a wrong offset!");

}

