#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EventPlayerStatProfileSelector

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass EventPlayerStatProfileSelector.EventPlayerStatProfileSelector_C
// 0x0030 (0x0388 - 0x0358)
class UEventPlayerStatProfileSelector_C final : public UFortEventPlayerStatProfileSelector
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0358(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Intro;                                             // 0x0360(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UIconTextButton_C*                      CloseMainPanel;                                    // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_2;                                 // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_0;                                        // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        Switcher_Content;                                  // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void OnActivated();
	void BndEvt__CloseMainPanel_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void ExecuteUbergraph_EventPlayerStatProfileSelector(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"EventPlayerStatProfileSelector_C">();
	}
	static class UEventPlayerStatProfileSelector_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEventPlayerStatProfileSelector_C>();
	}
};
static_assert(alignof(UEventPlayerStatProfileSelector_C) == 0x000008, "Wrong alignment on UEventPlayerStatProfileSelector_C");
static_assert(sizeof(UEventPlayerStatProfileSelector_C) == 0x000388, "Wrong size on UEventPlayerStatProfileSelector_C");
static_assert(offsetof(UEventPlayerStatProfileSelector_C, UberGraphFrame) == 0x000358, "Member 'UEventPlayerStatProfileSelector_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UEventPlayerStatProfileSelector_C, Intro) == 0x000360, "Member 'UEventPlayerStatProfileSelector_C::Intro' has a wrong offset!");
static_assert(offsetof(UEventPlayerStatProfileSelector_C, CloseMainPanel) == 0x000368, "Member 'UEventPlayerStatProfileSelector_C::CloseMainPanel' has a wrong offset!");
static_assert(offsetof(UEventPlayerStatProfileSelector_C, CommonTextBlock_2) == 0x000370, "Member 'UEventPlayerStatProfileSelector_C::CommonTextBlock_2' has a wrong offset!");
static_assert(offsetof(UEventPlayerStatProfileSelector_C, SafeZone_0) == 0x000378, "Member 'UEventPlayerStatProfileSelector_C::SafeZone_0' has a wrong offset!");
static_assert(offsetof(UEventPlayerStatProfileSelector_C, Switcher_Content) == 0x000380, "Member 'UEventPlayerStatProfileSelector_C::Switcher_Content' has a wrong offset!");

}

