#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EventLeaderboardPlayerPerformance

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass EventLeaderboardPlayerPerformance.EventLeaderboardPlayerPerformance_C
// 0x0038 (0x0610 - 0x05D8)
class UEventLeaderboardPlayerPerformance_C final : public UFortShowdownDetailView
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UEventsSimpleButton_C*                  Button_MyPosition;                                 // 0x05E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_0;                                 // 0x05E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_1;                                 // 0x05F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_Container;                           // 0x05F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_PlayerPerformance;                            // 0x0600(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_PlayerScore;                                  // 0x0608(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void RefreshDataBP();
	void ExecuteUbergraph_EventLeaderboardPlayerPerformance(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"EventLeaderboardPlayerPerformance_C">();
	}
	static class UEventLeaderboardPlayerPerformance_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEventLeaderboardPlayerPerformance_C>();
	}
};
static_assert(alignof(UEventLeaderboardPlayerPerformance_C) == 0x000008, "Wrong alignment on UEventLeaderboardPlayerPerformance_C");
static_assert(sizeof(UEventLeaderboardPlayerPerformance_C) == 0x000610, "Wrong size on UEventLeaderboardPlayerPerformance_C");
static_assert(offsetof(UEventLeaderboardPlayerPerformance_C, UberGraphFrame) == 0x0005D8, "Member 'UEventLeaderboardPlayerPerformance_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardPlayerPerformance_C, Button_MyPosition) == 0x0005E0, "Member 'UEventLeaderboardPlayerPerformance_C::Button_MyPosition' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardPlayerPerformance_C, CommonTextBlock_0) == 0x0005E8, "Member 'UEventLeaderboardPlayerPerformance_C::CommonTextBlock_0' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardPlayerPerformance_C, CommonTextBlock_1) == 0x0005F0, "Member 'UEventLeaderboardPlayerPerformance_C::CommonTextBlock_1' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardPlayerPerformance_C, HorizontalBox_Container) == 0x0005F8, "Member 'UEventLeaderboardPlayerPerformance_C::HorizontalBox_Container' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardPlayerPerformance_C, Text_PlayerPerformance) == 0x000600, "Member 'UEventLeaderboardPlayerPerformance_C::Text_PlayerPerformance' has a wrong offset!");
static_assert(offsetof(UEventLeaderboardPlayerPerformance_C, Text_PlayerScore) == 0x000608, "Member 'UEventLeaderboardPlayerPerformance_C::Text_PlayerScore' has a wrong offset!");

}

