#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortniteUI

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "CommonUI_structs.hpp"
#include "CommonUI_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CommonInput_structs.hpp"
#include "CommonInput_classes.hpp"
#include "BlueprintContext_classes.hpp"
#include "FortniteUI_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "SlateCore_structs.hpp"
#include "SocialUMG_structs.hpp"
#include "SocialUMG_classes.hpp"
#include "InputCore_structs.hpp"
#include "GameSubCatalog_structs.hpp"
#include "EpicCMSUIFramework_classes.hpp"
#include "McpProfileSys_structs.hpp"
#include "Party_structs.hpp"
#include "Slate_structs.hpp"
#include "LauncherSocialTypes_structs.hpp"


namespace SDK
{

// Class FortniteUI.FortHUDElementWidget
// 0x0040 (0x0270 - 0x0230)
class UFortHUDElementWidget : public UCommonUserWidget
{
public:
	uint8                                         Pad_230[0x8];                                      // 0x0230(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           ElementTag;                                        // 0x0238(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  HUDElementTag;                                     // 0x0240(0x0020)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	ESlateVisibility                              HiddenVisibility;                                  // 0x0260(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_261[0x7];                                      // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTutorialHighlight*                     TutorialHighlight;                                 // 0x0268(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void HandleOnHUDElementVisibilityChanged(const struct FGameplayTagContainer& HiddenHUDElementTags);
	void HandleOnHUDResetToDefaults();
	void OnVisibilitySetEvent(ESlateVisibility InVisibility);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortHUDElementWidget">();
	}
	static class UFortHUDElementWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortHUDElementWidget>();
	}
};
static_assert(alignof(UFortHUDElementWidget) == 0x000008, "Wrong alignment on UFortHUDElementWidget");
static_assert(sizeof(UFortHUDElementWidget) == 0x000270, "Wrong size on UFortHUDElementWidget");
static_assert(offsetof(UFortHUDElementWidget, ElementTag) == 0x000238, "Member 'UFortHUDElementWidget::ElementTag' has a wrong offset!");
static_assert(offsetof(UFortHUDElementWidget, HUDElementTag) == 0x000240, "Member 'UFortHUDElementWidget::HUDElementTag' has a wrong offset!");
static_assert(offsetof(UFortHUDElementWidget, HiddenVisibility) == 0x000260, "Member 'UFortHUDElementWidget::HiddenVisibility' has a wrong offset!");
static_assert(offsetof(UFortHUDElementWidget, TutorialHighlight) == 0x000268, "Member 'UFortHUDElementWidget::TutorialHighlight' has a wrong offset!");

// Class FortniteUI.FortQuestMapDetailsPanelBase
// 0x0018 (0x0248 - 0x0230)
class UFortQuestMapDetailsPanelBase : public UCommonUserWidget
{
public:
	TSubclassOf<class AFortClientAnnouncement_Conversation> QuestConversationClass;                            // 0x0230(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         QuestUpdateDelayTime;                              // 0x0238(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_23C[0x4];                                      // 0x023C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           QuestUpdateTimerHandle;                            // 0x0240(0x0008)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void HandleQuestsUpdatedInternal();
	void SetQuestToDisplay(class UFortQuestItemDefinition* QuestDef);
	void SetScrollWidget();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortQuestMapDetailsPanelBase">();
	}
	static class UFortQuestMapDetailsPanelBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortQuestMapDetailsPanelBase>();
	}
};
static_assert(alignof(UFortQuestMapDetailsPanelBase) == 0x000008, "Wrong alignment on UFortQuestMapDetailsPanelBase");
static_assert(sizeof(UFortQuestMapDetailsPanelBase) == 0x000248, "Wrong size on UFortQuestMapDetailsPanelBase");
static_assert(offsetof(UFortQuestMapDetailsPanelBase, QuestConversationClass) == 0x000230, "Member 'UFortQuestMapDetailsPanelBase::QuestConversationClass' has a wrong offset!");
static_assert(offsetof(UFortQuestMapDetailsPanelBase, QuestUpdateDelayTime) == 0x000238, "Member 'UFortQuestMapDetailsPanelBase::QuestUpdateDelayTime' has a wrong offset!");
static_assert(offsetof(UFortQuestMapDetailsPanelBase, QuestUpdateTimerHandle) == 0x000240, "Member 'UFortQuestMapDetailsPanelBase::QuestUpdateTimerHandle' has a wrong offset!");

// Class FortniteUI.FortQuestMapEventDetailsPanel
// 0x0098 (0x02E0 - 0x0248)
class UFortQuestMapEventDetailsPanel final : public UFortQuestMapDetailsPanelBase
{
public:
	TSubclassOf<class UCommonBorderStyle>         CurrentQuestBorder;                                // 0x0248(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UCommonBorderStyle>         CompletedQuestBorder;                              // 0x0250(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UCommonBorderStyle>         FutureQuestBorder;                                 // 0x0258(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UVerticalBox*                           VBox_QuestContainer;                               // 0x0260(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UVerticalBox*                           VBox_CompletedQuestContainer;                      // 0x0268(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonWidgetSwitcher*                  Switcher_Quests;                                   // 0x0270(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonBorder*                          Border_NextQuest;                                  // 0x0278(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_QuestName;                                    // 0x0280(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_QuestDescription;                             // 0x0288(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_Title;                                        // 0x0290(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonListView*                        List_Tasks;                                        // 0x0298(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                 Image_QuestIcon;                                   // 0x02A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UScrollBox*                             ScrollBox_SideBar;                                 // 0x02A8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDataTable*                             EventQuestTable;                                   // 0x02B0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UFortQuestMapEventSideEntry> SideBarEntryClass;                                 // 0x02B8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortQuestItemDefinition*               UnlockEventQuestDefinition;                        // 0x02C0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortQuestItemDefinition*               CurrentQuestDef;                                   // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UFortQuestObjectiveInfo*>        VisibleObjectives;                                 // 0x02D0(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortQuestMapEventDetailsPanel">();
	}
	static class UFortQuestMapEventDetailsPanel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortQuestMapEventDetailsPanel>();
	}
};
static_assert(alignof(UFortQuestMapEventDetailsPanel) == 0x000008, "Wrong alignment on UFortQuestMapEventDetailsPanel");
static_assert(sizeof(UFortQuestMapEventDetailsPanel) == 0x0002E0, "Wrong size on UFortQuestMapEventDetailsPanel");
static_assert(offsetof(UFortQuestMapEventDetailsPanel, CurrentQuestBorder) == 0x000248, "Member 'UFortQuestMapEventDetailsPanel::CurrentQuestBorder' has a wrong offset!");
static_assert(offsetof(UFortQuestMapEventDetailsPanel, CompletedQuestBorder) == 0x000250, "Member 'UFortQuestMapEventDetailsPanel::CompletedQuestBorder' has a wrong offset!");
static_assert(offsetof(UFortQuestMapEventDetailsPanel, FutureQuestBorder) == 0x000258, "Member 'UFortQuestMapEventDetailsPanel::FutureQuestBorder' has a wrong offset!");
static_assert(offsetof(UFortQuestMapEventDetailsPanel, VBox_QuestContainer) == 0x000260, "Member 'UFortQuestMapEventDetailsPanel::VBox_QuestContainer' has a wrong offset!");
static_assert(offsetof(UFortQuestMapEventDetailsPanel, VBox_CompletedQuestContainer) == 0x000268, "Member 'UFortQuestMapEventDetailsPanel::VBox_CompletedQuestContainer' has a wrong offset!");
static_assert(offsetof(UFortQuestMapEventDetailsPanel, Switcher_Quests) == 0x000270, "Member 'UFortQuestMapEventDetailsPanel::Switcher_Quests' has a wrong offset!");
static_assert(offsetof(UFortQuestMapEventDetailsPanel, Border_NextQuest) == 0x000278, "Member 'UFortQuestMapEventDetailsPanel::Border_NextQuest' has a wrong offset!");
static_assert(offsetof(UFortQuestMapEventDetailsPanel, Text_QuestName) == 0x000280, "Member 'UFortQuestMapEventDetailsPanel::Text_QuestName' has a wrong offset!");
static_assert(offsetof(UFortQuestMapEventDetailsPanel, Text_QuestDescription) == 0x000288, "Member 'UFortQuestMapEventDetailsPanel::Text_QuestDescription' has a wrong offset!");
static_assert(offsetof(UFortQuestMapEventDetailsPanel, Text_Title) == 0x000290, "Member 'UFortQuestMapEventDetailsPanel::Text_Title' has a wrong offset!");
static_assert(offsetof(UFortQuestMapEventDetailsPanel, List_Tasks) == 0x000298, "Member 'UFortQuestMapEventDetailsPanel::List_Tasks' has a wrong offset!");
static_assert(offsetof(UFortQuestMapEventDetailsPanel, Image_QuestIcon) == 0x0002A0, "Member 'UFortQuestMapEventDetailsPanel::Image_QuestIcon' has a wrong offset!");
static_assert(offsetof(UFortQuestMapEventDetailsPanel, ScrollBox_SideBar) == 0x0002A8, "Member 'UFortQuestMapEventDetailsPanel::ScrollBox_SideBar' has a wrong offset!");
static_assert(offsetof(UFortQuestMapEventDetailsPanel, EventQuestTable) == 0x0002B0, "Member 'UFortQuestMapEventDetailsPanel::EventQuestTable' has a wrong offset!");
static_assert(offsetof(UFortQuestMapEventDetailsPanel, SideBarEntryClass) == 0x0002B8, "Member 'UFortQuestMapEventDetailsPanel::SideBarEntryClass' has a wrong offset!");
static_assert(offsetof(UFortQuestMapEventDetailsPanel, UnlockEventQuestDefinition) == 0x0002C0, "Member 'UFortQuestMapEventDetailsPanel::UnlockEventQuestDefinition' has a wrong offset!");
static_assert(offsetof(UFortQuestMapEventDetailsPanel, CurrentQuestDef) == 0x0002C8, "Member 'UFortQuestMapEventDetailsPanel::CurrentQuestDef' has a wrong offset!");
static_assert(offsetof(UFortQuestMapEventDetailsPanel, VisibleObjectives) == 0x0002D0, "Member 'UFortQuestMapEventDetailsPanel::VisibleObjectives' has a wrong offset!");

// Class FortniteUI.FortTransformResultsList
// 0x0008 (0x0238 - 0x0230)
class UFortTransformResultsList final : public UCommonUserWidget
{
public:
	class UFortItemQuantityListBase*              ResultsList;                                       // 0x0230(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void ShowRecycleResults(const TArray<class UFortItem*>& SacrificeItems);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortTransformResultsList">();
	}
	static class UFortTransformResultsList* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortTransformResultsList>();
	}
};
static_assert(alignof(UFortTransformResultsList) == 0x000008, "Wrong alignment on UFortTransformResultsList");
static_assert(sizeof(UFortTransformResultsList) == 0x000238, "Wrong size on UFortTransformResultsList");
static_assert(offsetof(UFortTransformResultsList, ResultsList) == 0x000230, "Member 'UFortTransformResultsList::ResultsList' has a wrong offset!");

// Class FortniteUI.FortChatWidget
// 0x0048 (0x0158 - 0x0110)
class UFortChatWidget final : public UNativeWidgetHost
{
public:
	bool                                          MinimizeEnabled;                                   // 0x0110(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AutoReleaseFocus;                                  // 0x0111(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AllowEmotes;                                       // 0x0112(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_113[0x1];                                      // 0x0113(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ListFadeTime;                                      // 0x0114(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MinimizedChatMessageNum;                           // 0x0118(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ThrottleChat;                                      // 0x011C(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11D[0x3];                                      // 0x011D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ThrottleTicketTime;                                // 0x0120(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ThrottleTicketCount;                               // 0x0124(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(bool bEnteringChat)> OnChatEnteredEvent;                                // 0x0128(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(bool bOpen)>    OnUserListChanged;                                 // 0x0138(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_148[0x10];                                     // 0x0148(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void FocusChatEntry();
	void MinimizeChatWidget();
	void SetControllerActionBrush(const struct FSlateBrush& SlateBrush);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortChatWidget">();
	}
	static class UFortChatWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortChatWidget>();
	}
};
static_assert(alignof(UFortChatWidget) == 0x000008, "Wrong alignment on UFortChatWidget");
static_assert(sizeof(UFortChatWidget) == 0x000158, "Wrong size on UFortChatWidget");
static_assert(offsetof(UFortChatWidget, MinimizeEnabled) == 0x000110, "Member 'UFortChatWidget::MinimizeEnabled' has a wrong offset!");
static_assert(offsetof(UFortChatWidget, AutoReleaseFocus) == 0x000111, "Member 'UFortChatWidget::AutoReleaseFocus' has a wrong offset!");
static_assert(offsetof(UFortChatWidget, AllowEmotes) == 0x000112, "Member 'UFortChatWidget::AllowEmotes' has a wrong offset!");
static_assert(offsetof(UFortChatWidget, ListFadeTime) == 0x000114, "Member 'UFortChatWidget::ListFadeTime' has a wrong offset!");
static_assert(offsetof(UFortChatWidget, MinimizedChatMessageNum) == 0x000118, "Member 'UFortChatWidget::MinimizedChatMessageNum' has a wrong offset!");
static_assert(offsetof(UFortChatWidget, ThrottleChat) == 0x00011C, "Member 'UFortChatWidget::ThrottleChat' has a wrong offset!");
static_assert(offsetof(UFortChatWidget, ThrottleTicketTime) == 0x000120, "Member 'UFortChatWidget::ThrottleTicketTime' has a wrong offset!");
static_assert(offsetof(UFortChatWidget, ThrottleTicketCount) == 0x000124, "Member 'UFortChatWidget::ThrottleTicketCount' has a wrong offset!");
static_assert(offsetof(UFortChatWidget, OnChatEnteredEvent) == 0x000128, "Member 'UFortChatWidget::OnChatEnteredEvent' has a wrong offset!");
static_assert(offsetof(UFortChatWidget, OnUserListChanged) == 0x000138, "Member 'UFortChatWidget::OnUserListChanged' has a wrong offset!");

// Class FortniteUI.LTMWidgetBase
// 0x0010 (0x0280 - 0x0270)
class ULTMWidgetBase : public UFortHUDElementWidget
{
public:
	TSubclassOf<class AFortGameplayMutator>       MutatorClassToWaitFor;                             // 0x0270(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_278[0x8];                                      // 0x0278(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnGamePhaseChanged(EAthenaGamePhase NewPhase);
	void OnHandleSpectatingChanged(class AFortPlayerStateZone* SpectatingTarget);

	uint8 GetViewingTeam() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LTMWidgetBase">();
	}
	static class ULTMWidgetBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULTMWidgetBase>();
	}
};
static_assert(alignof(ULTMWidgetBase) == 0x000008, "Wrong alignment on ULTMWidgetBase");
static_assert(sizeof(ULTMWidgetBase) == 0x000280, "Wrong size on ULTMWidgetBase");
static_assert(offsetof(ULTMWidgetBase, MutatorClassToWaitFor) == 0x000270, "Member 'ULTMWidgetBase::MutatorClassToWaitFor' has a wrong offset!");

// Class FortniteUI.FortRewardNotificationData
// 0x0008 (0x0030 - 0x0028)
class UFortRewardNotificationData : public UObject
{
public:
	EFrontEndRewardType                           RewardType;                                        // 0x0028(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool GetIconBrush(struct FSlateBrush* IconBrush, EFortBrushSize BrushSize);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortRewardNotificationData">();
	}
	static class UFortRewardNotificationData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortRewardNotificationData>();
	}
};
static_assert(alignof(UFortRewardNotificationData) == 0x000008, "Wrong alignment on UFortRewardNotificationData");
static_assert(sizeof(UFortRewardNotificationData) == 0x000030, "Wrong size on UFortRewardNotificationData");
static_assert(offsetof(UFortRewardNotificationData, RewardType) == 0x000028, "Member 'UFortRewardNotificationData::RewardType' has a wrong offset!");

// Class FortniteUI.FortRewardEpicQuestData
// 0x0008 (0x0038 - 0x0030)
class UFortRewardEpicQuestData final : public UFortRewardNotificationData
{
public:
	class UFortQuestItem*                         Quest;                                             // 0x0030(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortRewardEpicQuestData">();
	}
	static class UFortRewardEpicQuestData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortRewardEpicQuestData>();
	}
};
static_assert(alignof(UFortRewardEpicQuestData) == 0x000008, "Wrong alignment on UFortRewardEpicQuestData");
static_assert(sizeof(UFortRewardEpicQuestData) == 0x000038, "Wrong size on UFortRewardEpicQuestData");
static_assert(offsetof(UFortRewardEpicQuestData, Quest) == 0x000030, "Member 'UFortRewardEpicQuestData::Quest' has a wrong offset!");

// Class FortniteUI.AshtonWidgetBase
// 0x0018 (0x0298 - 0x0280)
class UAshtonWidgetBase final : public ULTMWidgetBase
{
public:
	class AFortAthenaMutator_Ashton*              AshtonMutatorRef;                                  // 0x0280(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_288[0x10];                                     // 0x0288(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnCloseWidget();
	void OnOpenWidget();
	void OnStoneChanged(EAshtonStoneType StoneType, EAshtonStoneStateType StoneState);
	void OnStoneListChanged();
	void OnVillainRespawnCountChanged(int32 NumRespawnsLeft, float RespawnPercentLeft);
	void OnVillainRespawnsRemainingChanged();
	void UpdateAllUI(bool bFirstUpdate);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AshtonWidgetBase">();
	}
	static class UAshtonWidgetBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAshtonWidgetBase>();
	}
};
static_assert(alignof(UAshtonWidgetBase) == 0x000008, "Wrong alignment on UAshtonWidgetBase");
static_assert(sizeof(UAshtonWidgetBase) == 0x000298, "Wrong size on UAshtonWidgetBase");
static_assert(offsetof(UAshtonWidgetBase, AshtonMutatorRef) == 0x000280, "Member 'UAshtonWidgetBase::AshtonMutatorRef' has a wrong offset!");

// Class FortniteUI.FortCampaignMinimap
// 0x0008 (0x0108 - 0x0100)
class UFortCampaignMinimap final : public UWidget
{
public:
	struct FVector2D                              DesiredSize;                                       // 0x0100(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCampaignMinimap">();
	}
	static class UFortCampaignMinimap* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCampaignMinimap>();
	}
};
static_assert(alignof(UFortCampaignMinimap) == 0x000008, "Wrong alignment on UFortCampaignMinimap");
static_assert(sizeof(UFortCampaignMinimap) == 0x000108, "Wrong size on UFortCampaignMinimap");
static_assert(offsetof(UFortCampaignMinimap, DesiredSize) == 0x000100, "Member 'UFortCampaignMinimap::DesiredSize' has a wrong offset!");

// Class FortniteUI.AsyncAction_FortPlayerSurveyDispatcherDisplaySurveys
// 0x0020 (0x0050 - 0x0030)
class UAsyncAction_FortPlayerSurveyDispatcherDisplaySurveys final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void()>              Finished;                                          // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UFortPlayerSurveyDispatcher*            Dispatcher;                                        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAsyncAction_FortPlayerSurveyDispatcherDisplaySurveys* DisplaySurveys(class UFortPlayerSurveyDispatcher* Dispatcher_0, int32 SurveyCount);

	void HandleAllSurveysFinished(class UObject* Source);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AsyncAction_FortPlayerSurveyDispatcherDisplaySurveys">();
	}
	static class UAsyncAction_FortPlayerSurveyDispatcherDisplaySurveys* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAsyncAction_FortPlayerSurveyDispatcherDisplaySurveys>();
	}
};
static_assert(alignof(UAsyncAction_FortPlayerSurveyDispatcherDisplaySurveys) == 0x000008, "Wrong alignment on UAsyncAction_FortPlayerSurveyDispatcherDisplaySurveys");
static_assert(sizeof(UAsyncAction_FortPlayerSurveyDispatcherDisplaySurveys) == 0x000050, "Wrong size on UAsyncAction_FortPlayerSurveyDispatcherDisplaySurveys");
static_assert(offsetof(UAsyncAction_FortPlayerSurveyDispatcherDisplaySurveys, Finished) == 0x000030, "Member 'UAsyncAction_FortPlayerSurveyDispatcherDisplaySurveys::Finished' has a wrong offset!");
static_assert(offsetof(UAsyncAction_FortPlayerSurveyDispatcherDisplaySurveys, Dispatcher) == 0x000040, "Member 'UAsyncAction_FortPlayerSurveyDispatcherDisplaySurveys::Dispatcher' has a wrong offset!");

// Class FortniteUI.FortRewardNotificationWidget
// 0x00B8 (0x03D0 - 0x0318)
class UFortRewardNotificationWidget final : public UCommonActivatablePanel
{
public:
	TArray<class UFortRewardNotificationData*>    NotificationDataList;                              // 0x0318(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_328[0x10];                                     // 0x0328(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UOverlay*                               OverlayMain;                                       // 0x0338(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFortSwipeDetector                     SwipeDetector;                                     // 0x0340(0x0070)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	uint8                                         Pad_3B0[0x20];                                     // 0x03B0(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddCollectionBookData(const struct FFortCollectionBookRewards& CollectionBookRewards);
	void AddDifficultyIncreaseRewardData();
	void AddEpicQuestData(class UFortQuestItem* Quest);
	void AddExpeditionData(class UFortExpeditionItem* ExpeditionItem);
	void AddGiftBoxData();
	void AddItemCacheRewardData(class UFortItem* ItemCache);
	void AddMissionAlertData();
	void AddMissionData();
	void AddQuestData(class UFortQuestItem* Quest);
	void InspectItem(class UFortItem* ItemToInspect, int32 QuantityOverride);
	void IsPrimaryActionEnabled(bool* bEnabled);
	void IsPrimaryActionHidden(bool* bHidden);
	void OnNavigationDown();
	void OnNavigationLeft();
	void OnNavigationRight();
	void OnNavigationUp();
	void OnPrimaryActionDisabled();
	void OnPrimaryActionEnabled();
	void OnPrimaryActionHidden();
	void OnPrimaryActionTextChanged(const class FText& Text);
	void ResetAllRewardData();
	void SetPrimaryActionEnabled(bool bEnabled);
	void SetPrimaryActionHidden();
	void SetPrimaryActionText(const class FText& Text);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortRewardNotificationWidget">();
	}
	static class UFortRewardNotificationWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortRewardNotificationWidget>();
	}
};
static_assert(alignof(UFortRewardNotificationWidget) == 0x000008, "Wrong alignment on UFortRewardNotificationWidget");
static_assert(sizeof(UFortRewardNotificationWidget) == 0x0003D0, "Wrong size on UFortRewardNotificationWidget");
static_assert(offsetof(UFortRewardNotificationWidget, NotificationDataList) == 0x000318, "Member 'UFortRewardNotificationWidget::NotificationDataList' has a wrong offset!");
static_assert(offsetof(UFortRewardNotificationWidget, OverlayMain) == 0x000338, "Member 'UFortRewardNotificationWidget::OverlayMain' has a wrong offset!");
static_assert(offsetof(UFortRewardNotificationWidget, SwipeDetector) == 0x000340, "Member 'UFortRewardNotificationWidget::SwipeDetector' has a wrong offset!");

// Class FortniteUI.AthenaAccoladesWidget
// 0x0030 (0x02A0 - 0x0270)
class UAthenaAccoladesWidget final : public UFortHUDElementWidget
{
public:
	class UAthenaXPDisplayData*                   DisplayData;                                       // 0x0270(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void(bool bNewlyOpened)> OnOpenOrClosed;                                    // 0x0278(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	TArray<struct FXPEventEntry>                  XPEvents;                                          // 0x0288(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_298[0x8];                                      // 0x0298(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void CloseWidget();
	void OnXPEvent(const struct FXPEventEntry& XPEvent);
	void OpenWidget(const struct FXPDisplayData& XPEventDisplayData, int32 Amount);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaAccoladesWidget">();
	}
	static class UAthenaAccoladesWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaAccoladesWidget>();
	}
};
static_assert(alignof(UAthenaAccoladesWidget) == 0x000008, "Wrong alignment on UAthenaAccoladesWidget");
static_assert(sizeof(UAthenaAccoladesWidget) == 0x0002A0, "Wrong size on UAthenaAccoladesWidget");
static_assert(offsetof(UAthenaAccoladesWidget, DisplayData) == 0x000270, "Member 'UAthenaAccoladesWidget::DisplayData' has a wrong offset!");
static_assert(offsetof(UAthenaAccoladesWidget, OnOpenOrClosed) == 0x000278, "Member 'UAthenaAccoladesWidget::OnOpenOrClosed' has a wrong offset!");
static_assert(offsetof(UAthenaAccoladesWidget, XPEvents) == 0x000288, "Member 'UAthenaAccoladesWidget::XPEvents' has a wrong offset!");

// Class FortniteUI.FortTooltipUIContext
// 0x0000 (0x0030 - 0x0030)
class UFortTooltipUIContext final : public UBlueprintContextBase
{
public:
	TArray<struct FGameplayAttribute> GetTooltipAttributes(const class UObject* Object);
	bool HasTooltipStats(const class UObject* Object);

	bool GetCombinedDescription(const class UObject* Object, const class UFortTooltipContext* TooltipContext, class FText* OutDescription, bool bSummaryDescription) const;
	TArray<struct FFortDisplayAttribute> GetComparisonStats(const class UObject* Object, const class UObject* ComparisonObject, const class UFortTooltipContext* TooltipContext, bool bUseSummaryTooltip) const;
	bool GetDescription(const class UObject* Object, const class UFortTooltipContext* TooltipContext, TArray<class FText>* OutDescription, bool bSummaryDescription) const;
	bool GetDisplayNameAndMultiBrushForTag(const struct FGameplayTag& Tag, class FText* OutDisplayName, struct FFortMultiSizeBrush* OutBrush) const;
	class UFortTooltipLoadingWrapper* GetTooltipLoadingWrapper(const class UObject* Object, bool bSummaryDescription) const;
	bool GetTooltipStat(const class UObject* Object, class UFortTooltipContext* TooltipContext, const struct FGameplayTag& Token, struct FFortDisplayAttribute* OutDisplayAttribute, bool bUseSummaryTooltip) const;
	TArray<struct FFortDisplayAttribute> GetTooltipStats(const class UObject* Object, const class UFortTooltipContext* TooltipContext, bool bSummaryStats) const;
	bool GetUIDataForTag(const struct FGameplayTag& Tag, struct FFortTagUIData* OutData) const;
	TArray<struct FFortDisplayAttribute> GetUpgradeStats(const class UObject* Object, class UFortTooltipContext* TooltipContext, bool bUseSummaryTooltip) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortTooltipUIContext">();
	}
	static class UFortTooltipUIContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortTooltipUIContext>();
	}
};
static_assert(alignof(UFortTooltipUIContext) == 0x000008, "Wrong alignment on UFortTooltipUIContext");
static_assert(sizeof(UFortTooltipUIContext) == 0x000030, "Wrong size on UFortTooltipUIContext");

// Class FortniteUI.FortCollectionBookRewardCardWidget
// 0x0088 (0x02B8 - 0x0230)
class UFortCollectionBookRewardCardWidget final : public UCommonUserWidget
{
public:
	TMulticastInlineDelegate<void(class UFortItem* DisplayedItem)> OnDisplayedItemChangedEvent;                       // 0x0230(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UFortMultiSizeItemCard*                 ItemCardWidget;                                    // 0x0240(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidget*                                MultiItemRewardOverlay;                            // 0x0248(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidget*                                ChoiceRewardOverlay;                               // 0x0250(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidget*                                CheckmarkImage;                                    // 0x0258(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         UpdateCardInterval;                                // 0x0260(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EFortItemCardSize                             ItemCardSize;                                      // 0x0264(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bDisplayAsRewardCard;                              // 0x0265(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_266[0x2];                                      // 0x0266(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortRewardInfo                        RepresentedRewards;                                // 0x0268(0x0030)(Transient, Protected, NativeAccessSpecifierProtected)
	TArray<class UFortItem*>                      DummyItems;                                        // 0x0298(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	struct FTimerHandle                           UpdateCardTimer;                                   // 0x02A8(0x0008)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2B0[0x8];                                      // 0x02B0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ClearRewards();
	void SetRewards(const struct FFortRewardInfo& Rewards);

	bool HasRewards() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCollectionBookRewardCardWidget">();
	}
	static class UFortCollectionBookRewardCardWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCollectionBookRewardCardWidget>();
	}
};
static_assert(alignof(UFortCollectionBookRewardCardWidget) == 0x000008, "Wrong alignment on UFortCollectionBookRewardCardWidget");
static_assert(sizeof(UFortCollectionBookRewardCardWidget) == 0x0002B8, "Wrong size on UFortCollectionBookRewardCardWidget");
static_assert(offsetof(UFortCollectionBookRewardCardWidget, OnDisplayedItemChangedEvent) == 0x000230, "Member 'UFortCollectionBookRewardCardWidget::OnDisplayedItemChangedEvent' has a wrong offset!");
static_assert(offsetof(UFortCollectionBookRewardCardWidget, ItemCardWidget) == 0x000240, "Member 'UFortCollectionBookRewardCardWidget::ItemCardWidget' has a wrong offset!");
static_assert(offsetof(UFortCollectionBookRewardCardWidget, MultiItemRewardOverlay) == 0x000248, "Member 'UFortCollectionBookRewardCardWidget::MultiItemRewardOverlay' has a wrong offset!");
static_assert(offsetof(UFortCollectionBookRewardCardWidget, ChoiceRewardOverlay) == 0x000250, "Member 'UFortCollectionBookRewardCardWidget::ChoiceRewardOverlay' has a wrong offset!");
static_assert(offsetof(UFortCollectionBookRewardCardWidget, CheckmarkImage) == 0x000258, "Member 'UFortCollectionBookRewardCardWidget::CheckmarkImage' has a wrong offset!");
static_assert(offsetof(UFortCollectionBookRewardCardWidget, UpdateCardInterval) == 0x000260, "Member 'UFortCollectionBookRewardCardWidget::UpdateCardInterval' has a wrong offset!");
static_assert(offsetof(UFortCollectionBookRewardCardWidget, ItemCardSize) == 0x000264, "Member 'UFortCollectionBookRewardCardWidget::ItemCardSize' has a wrong offset!");
static_assert(offsetof(UFortCollectionBookRewardCardWidget, bDisplayAsRewardCard) == 0x000265, "Member 'UFortCollectionBookRewardCardWidget::bDisplayAsRewardCard' has a wrong offset!");
static_assert(offsetof(UFortCollectionBookRewardCardWidget, RepresentedRewards) == 0x000268, "Member 'UFortCollectionBookRewardCardWidget::RepresentedRewards' has a wrong offset!");
static_assert(offsetof(UFortCollectionBookRewardCardWidget, DummyItems) == 0x000298, "Member 'UFortCollectionBookRewardCardWidget::DummyItems' has a wrong offset!");
static_assert(offsetof(UFortCollectionBookRewardCardWidget, UpdateCardTimer) == 0x0002A8, "Member 'UFortCollectionBookRewardCardWidget::UpdateCardTimer' has a wrong offset!");

// Class FortniteUI.AthenaAccountContext
// 0x0000 (0x0030 - 0x0030)
class UAthenaAccountContext final : public UBlueprintContextBase
{
public:
	void GetBattleBookPurchaseLimit(int32* MaxNumLevelsPossibleToPurchase, int32* BonusLevelsGranted);
	class UAthenaSeasonItemDefinition* GetCurrentSeasonDefinition();
	void SimulateBattleBookPurchase(int32 NumLevelsToPurchase, int32* BonusLevelsGranted, bool* bOverLimit);

	class FText GetCurrentSeasonName() const;
	int32 GetCurrentSeasonNumber() const;
	class FText GetCurrentSeasonNumberAsText() const;
	bool IsAtMaxBattlePassTier() const;
	bool ShouldReplaceBattleStarsWithAlternateReward() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaAccountContext">();
	}
	static class UAthenaAccountContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaAccountContext>();
	}
};
static_assert(alignof(UAthenaAccountContext) == 0x000008, "Wrong alignment on UAthenaAccountContext");
static_assert(sizeof(UAthenaAccountContext) == 0x000030, "Wrong size on UAthenaAccountContext");

// Class FortniteUI.AthenaAIKillsBase
// 0x0018 (0x0288 - 0x0270)
class UAthenaAIKillsBase final : public UFortHUDElementWidget
{
public:
	class UTextBlock*                             KillsText;                                         // 0x0270(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UObject*                                KillsSource;                                       // 0x0278(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bCustomKillSource;                                 // 0x0280(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_281[0x7];                                      // 0x0281(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetKillsSourcePlayerController(class AFortPlayerControllerAthena* InPlayerController);
	void SetKillsSourcePlayerState(class AFortPlayerStateAthena* InPlayerState);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaAIKillsBase">();
	}
	static class UAthenaAIKillsBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaAIKillsBase>();
	}
};
static_assert(alignof(UAthenaAIKillsBase) == 0x000008, "Wrong alignment on UAthenaAIKillsBase");
static_assert(sizeof(UAthenaAIKillsBase) == 0x000288, "Wrong size on UAthenaAIKillsBase");
static_assert(offsetof(UAthenaAIKillsBase, KillsText) == 0x000270, "Member 'UAthenaAIKillsBase::KillsText' has a wrong offset!");
static_assert(offsetof(UAthenaAIKillsBase, KillsSource) == 0x000278, "Member 'UAthenaAIKillsBase::KillsSource' has a wrong offset!");
static_assert(offsetof(UAthenaAIKillsBase, bCustomKillSource) == 0x000280, "Member 'UAthenaAIKillsBase::bCustomKillSource' has a wrong offset!");

// Class FortniteUI.FortSettingsListEntryBase
// 0x0018 (0x0248 - 0x0230)
class UFortSettingsListEntryBase : public UCommonUserWidget
{
public:
	uint8                                         Pad_230[0x10];                                     // 0x0230(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortSetting*                           Setting;                                           // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	class UWidget* GetPrimaryGamepadFocusWidget();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortSettingsListEntryBase">();
	}
	static class UFortSettingsListEntryBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortSettingsListEntryBase>();
	}
};
static_assert(alignof(UFortSettingsListEntryBase) == 0x000008, "Wrong alignment on UFortSettingsListEntryBase");
static_assert(sizeof(UFortSettingsListEntryBase) == 0x000248, "Wrong size on UFortSettingsListEntryBase");
static_assert(offsetof(UFortSettingsListEntryBase, Setting) == 0x000240, "Member 'UFortSettingsListEntryBase::Setting' has a wrong offset!");

// Class FortniteUI.FortSettingsListEntry_Setting
// 0x0008 (0x0250 - 0x0248)
class UFortSettingsListEntry_Setting : public UFortSettingsListEntryBase
{
public:
	class UCommonTextBlock*                       Text_SettingName;                                  // 0x0248(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortSettingsListEntry_Setting">();
	}
	static class UFortSettingsListEntry_Setting* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortSettingsListEntry_Setting>();
	}
};
static_assert(alignof(UFortSettingsListEntry_Setting) == 0x000008, "Wrong alignment on UFortSettingsListEntry_Setting");
static_assert(sizeof(UFortSettingsListEntry_Setting) == 0x000250, "Wrong size on UFortSettingsListEntry_Setting");
static_assert(offsetof(UFortSettingsListEntry_Setting, Text_SettingName) == 0x000248, "Member 'UFortSettingsListEntry_Setting::Text_SettingName' has a wrong offset!");

// Class FortniteUI.FortSettingsListEntrySetting_Discrete
// 0x0028 (0x0278 - 0x0250)
class UFortSettingsListEntrySetting_Discrete : public UFortSettingsListEntry_Setting
{
public:
	class UFortSettingValueDiscrete*              DiscreteSetting;                                   // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPanelWidget*                           Panel_Value;                                       // 0x0258(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortSettingsRotator*                   Rotator_SettingValue;                              // 0x0260(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButton*                          Button_Decrease;                                   // 0x0268(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButton*                          Button_Increase;                                   // 0x0270(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortSettingsListEntrySetting_Discrete">();
	}
	static class UFortSettingsListEntrySetting_Discrete* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortSettingsListEntrySetting_Discrete>();
	}
};
static_assert(alignof(UFortSettingsListEntrySetting_Discrete) == 0x000008, "Wrong alignment on UFortSettingsListEntrySetting_Discrete");
static_assert(sizeof(UFortSettingsListEntrySetting_Discrete) == 0x000278, "Wrong size on UFortSettingsListEntrySetting_Discrete");
static_assert(offsetof(UFortSettingsListEntrySetting_Discrete, DiscreteSetting) == 0x000250, "Member 'UFortSettingsListEntrySetting_Discrete::DiscreteSetting' has a wrong offset!");
static_assert(offsetof(UFortSettingsListEntrySetting_Discrete, Panel_Value) == 0x000258, "Member 'UFortSettingsListEntrySetting_Discrete::Panel_Value' has a wrong offset!");
static_assert(offsetof(UFortSettingsListEntrySetting_Discrete, Rotator_SettingValue) == 0x000260, "Member 'UFortSettingsListEntrySetting_Discrete::Rotator_SettingValue' has a wrong offset!");
static_assert(offsetof(UFortSettingsListEntrySetting_Discrete, Button_Decrease) == 0x000268, "Member 'UFortSettingsListEntrySetting_Discrete::Button_Decrease' has a wrong offset!");
static_assert(offsetof(UFortSettingsListEntrySetting_Discrete, Button_Increase) == 0x000270, "Member 'UFortSettingsListEntrySetting_Discrete::Button_Increase' has a wrong offset!");

// Class FortniteUI.FortTeamMemberEntryBase
// 0x0028 (0x0B68 - 0x0B40)
class UFortTeamMemberEntryBase : public UCommonButton
{
public:
	uint8                                         Pad_B40[0x28];                                     // 0x0B40(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BP_OnTeamMemberEstablished(bool bHasValidMember);
	void OnMemberGameReadinessChanged(EGameReadiness ReadyStatus);
	void OnMemberIsInFrontendChanged(bool bIsInFrontend);

	EGameReadiness GetCurrentMemberGameReadiness() const;
	bool IsCurrentMemberInFrontend() const;
	bool IsCurrentMemberLocal() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortTeamMemberEntryBase">();
	}
	static class UFortTeamMemberEntryBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortTeamMemberEntryBase>();
	}
};
static_assert(alignof(UFortTeamMemberEntryBase) == 0x000008, "Wrong alignment on UFortTeamMemberEntryBase");
static_assert(sizeof(UFortTeamMemberEntryBase) == 0x000B68, "Wrong size on UFortTeamMemberEntryBase");

// Class FortniteUI.FortCampaignTeamMemberEntry
// 0x0008 (0x0B70 - 0x0B68)
class UFortCampaignTeamMemberEntry : public UFortTeamMemberEntryBase
{
public:
	int32                                         RepresentedMemberIndex;                            // 0x0B68(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EFortMemberConnectionState                    CurrentConnectionState;                            // 0x0B6C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_B6D[0x3];                                      // 0x0B6D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnTeamMemberConnectionStateChanged(EFortMemberConnectionState NewConnectionState);

	bool HasTeamMembers() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCampaignTeamMemberEntry">();
	}
	static class UFortCampaignTeamMemberEntry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCampaignTeamMemberEntry>();
	}
};
static_assert(alignof(UFortCampaignTeamMemberEntry) == 0x000008, "Wrong alignment on UFortCampaignTeamMemberEntry");
static_assert(sizeof(UFortCampaignTeamMemberEntry) == 0x000B70, "Wrong size on UFortCampaignTeamMemberEntry");
static_assert(offsetof(UFortCampaignTeamMemberEntry, RepresentedMemberIndex) == 0x000B68, "Member 'UFortCampaignTeamMemberEntry::RepresentedMemberIndex' has a wrong offset!");
static_assert(offsetof(UFortCampaignTeamMemberEntry, CurrentConnectionState) == 0x000B6C, "Member 'UFortCampaignTeamMemberEntry::CurrentConnectionState' has a wrong offset!");

// Class FortniteUI.FortCampaignTeamMemberItemTracker
// 0x0010 (0x0B80 - 0x0B70)
class UFortCampaignTeamMemberItemTracker : public UFortCampaignTeamMemberEntry
{
public:
	TArray<class FString>                         TemplateIdsToTrack;                                // 0x0B70(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)

public:
	void OnTrackedItemsUpdated();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCampaignTeamMemberItemTracker">();
	}
	static class UFortCampaignTeamMemberItemTracker* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCampaignTeamMemberItemTracker>();
	}
};
static_assert(alignof(UFortCampaignTeamMemberItemTracker) == 0x000008, "Wrong alignment on UFortCampaignTeamMemberItemTracker");
static_assert(sizeof(UFortCampaignTeamMemberItemTracker) == 0x000B80, "Wrong size on UFortCampaignTeamMemberItemTracker");
static_assert(offsetof(UFortCampaignTeamMemberItemTracker, TemplateIdsToTrack) == 0x000B70, "Member 'UFortCampaignTeamMemberItemTracker::TemplateIdsToTrack' has a wrong offset!");

// Class FortniteUI.FortCampaignTeamMemberDailyBonusXpBoost
// 0x0018 (0x0B98 - 0x0B80)
class UFortCampaignTeamMemberDailyBonusXpBoost final : public UFortCampaignTeamMemberItemTracker
{
public:
	uint8                                         Pad_B80[0x8];                                      // 0x0B80(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonTextBlock*                       Text_Boost;                                        // 0x0B88(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                 Image_BoostIcon;                                   // 0x0B90(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnBoostAmountChanged();

	int32 GetCurrentBoostAmount() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortCampaignTeamMemberDailyBonusXpBoost">();
	}
	static class UFortCampaignTeamMemberDailyBonusXpBoost* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCampaignTeamMemberDailyBonusXpBoost>();
	}
};
static_assert(alignof(UFortCampaignTeamMemberDailyBonusXpBoost) == 0x000008, "Wrong alignment on UFortCampaignTeamMemberDailyBonusXpBoost");
static_assert(sizeof(UFortCampaignTeamMemberDailyBonusXpBoost) == 0x000B98, "Wrong size on UFortCampaignTeamMemberDailyBonusXpBoost");
static_assert(offsetof(UFortCampaignTeamMemberDailyBonusXpBoost, Text_Boost) == 0x000B88, "Member 'UFortCampaignTeamMemberDailyBonusXpBoost::Text_Boost' has a wrong offset!");
static_assert(offsetof(UFortCampaignTeamMemberDailyBonusXpBoost, Image_BoostIcon) == 0x000B90, "Member 'UFortCampaignTeamMemberDailyBonusXpBoost::Image_BoostIcon' has a wrong offset!");

// Class FortniteUI.AthenaAwardAlertBase
// 0x0008 (0x0230 - 0x0228)
class UAthenaAwardAlertBase final : public UUserWidget
{
public:
	class UAthenaPlayerViewModel*                 PlayerVM;                                          // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void OnAwardGranted(class UFortAwardItemDefinition* AwardDefinition);
	void SetDataSource(class UAthenaPlayerViewModel* PlayerViewModel);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaAwardAlertBase">();
	}
	static class UAthenaAwardAlertBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaAwardAlertBase>();
	}
};
static_assert(alignof(UAthenaAwardAlertBase) == 0x000008, "Wrong alignment on UAthenaAwardAlertBase");
static_assert(sizeof(UAthenaAwardAlertBase) == 0x000230, "Wrong size on UAthenaAwardAlertBase");
static_assert(offsetof(UAthenaAwardAlertBase, PlayerVM) == 0x000228, "Member 'UAthenaAwardAlertBase::PlayerVM' has a wrong offset!");

// Class FortniteUI.AthenaBattleMapClickHandler
// 0x0008 (0x0230 - 0x0228)
class UAthenaBattleMapClickHandler final : public UUserWidget
{
public:
	uint8                                         Pad_228[0x8];                                      // 0x0228(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleToggledBattleMapLive(class ABattleMapPawnLive* BattleMapPawn);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaBattleMapClickHandler">();
	}
	static class UAthenaBattleMapClickHandler* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaBattleMapClickHandler>();
	}
};
static_assert(alignof(UAthenaBattleMapClickHandler) == 0x000008, "Wrong alignment on UAthenaBattleMapClickHandler");
static_assert(sizeof(UAthenaBattleMapClickHandler) == 0x000230, "Wrong size on UAthenaBattleMapClickHandler");

// Class FortniteUI.FortSettingDetailView
// 0x0110 (0x0338 - 0x0228)
class UFortSettingDetailView : public UUserWidget
{
public:
	TMap<class FString, TSoftClassPtr<class UClass>> Extensions;                                        // 0x0228(0x0050)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	struct FUserWidgetPool                        ExtensionWidgetPool;                               // 0x0278(0x0080)(Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	class UFortSetting*                           CurrentSetting;                                    // 0x02F8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_300[0x10];                                     // 0x0300(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonTextBlock*                       Text_SettingName;                                  // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                   RichText_Description;                              // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                   RichText_DynamicDetails;                           // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                   RichText_DisabledDetails;                          // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UVerticalBox*                           Box_DetailsExtension;                              // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	TArray<TSoftClassPtr<class UClass>> GatherDetailExtensions(class UFortSetting* InSetting);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortSettingDetailView">();
	}
	static class UFortSettingDetailView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortSettingDetailView>();
	}
};
static_assert(alignof(UFortSettingDetailView) == 0x000008, "Wrong alignment on UFortSettingDetailView");
static_assert(sizeof(UFortSettingDetailView) == 0x000338, "Wrong size on UFortSettingDetailView");
