#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Fortnite_Base_Head_Export_Skeleton_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "LiveLink_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Fortnite_Base_Head_Export_Skeleton_AnimBP.Fortnite_Base_Head_Export_Skeleton_AnimBP_C
// 0x0E90 (0x1290 - 0x0400)
class UFortnite_Base_Head_Export_Skeleton_AnimBP_C : public UHeadPartAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0400(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_PoseBlendNode                AnimGraphNode_PoseBlendNode_0E491F3A4C933A03AAE42DA602295362; // 0x0408(0x0098)()
	struct FAnimNode_Root                         AnimGraphNode_Root_C9D648834AA29F5B677902BB5A9DC15C; // 0x04A0(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_94E41D364E86D3FFC2D042845913D0EE; // 0x04D0(0x0078)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh_9AC0772D481A4B85CE045AA17CE0F79E; // 0x0548(0x0140)(ContainsInstancedReference)
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_B0BAEC37412A3BDE897683AA32FAE4E1; // 0x0688(0x00C0)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_3971854A46E6B529767EA2AB708A8D46; // 0x0748(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_D687C7FB4A07645ECE24DBB182B71823; // 0x0810(0x00B8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_19E6568A48732F90AD2036B56ECA0D46; // 0x08C8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_C898D19D46B0E9723DD75AA4710C2707; // 0x08F0(0x0028)()
	struct FAnimNode_LiveLinkPose                 AnimGraphNode_LiveLinkPose_67AFEC6E4E43108E1E699081080B9448; // 0x0918(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_E8FB05504628ECA52ADD038CBD818957; // 0x0960(0x00C0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_91F05C994C7B4758BA35D2B1F94A7663; // 0x0A20(0x00B8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_53F166F14732C8ECBEC8C0A540192456; // 0x0AD8(0x0028)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_BF175D4149F235AF8059B38CB3517406; // 0x0B00(0x00C8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_59950130431F160E70FA618201DA0ED0; // 0x0BC8(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_4B2D173F4261FBC709962B837E22DAA7; // 0x0C10(0x00C0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_C50053764A5016625E742C8401AAD202; // 0x0CD0(0x00B8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_540FAC8A423311B343A66CBDD1A68E4E; // 0x0D88(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_5C0CA1E44DCE78D6CEF568B89CA4B27B; // 0x0DB0(0x0028)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_C5BEAB564689BE7F396B479553755894; // 0x0DD8(0x0108)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_F7D256644C446D0E0E7A1FAE450C7158; // 0x0EE0(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_E876E3114CDEF692F73DBF884F9BD650; // 0x0F00(0x0020)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_17658B34440A047EB64B94A7175013F1; // 0x0F20(0x00B8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_04405D3D4F8BCFD02C681D8D229C0D2E; // 0x0FD8(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_C68E6B0E407D0454643482B1A7183F5B; // 0x1000(0x00A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_EDDAFEAC483866651C7E3FAC553065FD; // 0x10A0(0x0028)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_08630207438BC89444088F8788608168; // 0x10C8(0x00B0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_FABFCD4648E517EB4D1F55956E6A4DD2; // 0x1178(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_0E3FE42145D747BC790D9C8B3B86A438; // 0x11A0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_534B120E48854DC8D7F075B794D33C5F; // 0x11C8(0x0028)()
	struct FAnimNode_LiveLinkPose                 AnimGraphNode_LiveLinkPose_99C9F7884620B6D189A49A8BB1023059; // 0x11F0(0x0048)()
	struct FAnimNode_LiveLinkPose                 AnimGraphNode_LiveLinkPose_904059874BC7464442D2C4A54AA56DB6; // 0x1238(0x0048)()
	class USkeletalMeshComponent*                 MeshToCopy;                                        // 0x1280(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          GetPlayerListUsesCustomCharacterParts;             // 0x1288(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_Fortnite_Base_Head_Export_Skeleton_AnimBP(int32 EntryPoint);
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void BlueprintInitializeAnimation();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Fortnite_Base_Head_Export_Skeleton_AnimBP_C">();
	}
	static class UFortnite_Base_Head_Export_Skeleton_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortnite_Base_Head_Export_Skeleton_AnimBP_C>();
	}
};
static_assert(alignof(UFortnite_Base_Head_Export_Skeleton_AnimBP_C) == 0x000008, "Wrong alignment on UFortnite_Base_Head_Export_Skeleton_AnimBP_C");
static_assert(sizeof(UFortnite_Base_Head_Export_Skeleton_AnimBP_C) == 0x001290, "Wrong size on UFortnite_Base_Head_Export_Skeleton_AnimBP_C");
static_assert(offsetof(UFortnite_Base_Head_Export_Skeleton_AnimBP_C, UberGraphFrame) == 0x000400, "Member 'UFortnite_Base_Head_Export_Skeleton_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UFortnite_Base_Head_Export_Skeleton_AnimBP_C, AnimGraphNode_PoseBlendNode_0E491F3A4C933A03AAE42DA602295362) == 0x000408, "Member 'UFortnite_Base_Head_Export_Skeleton_AnimBP_C::AnimGraphNode_PoseBlendNode_0E491F3A4C933A03AAE42DA602295362' has a wrong offset!");
static_assert(offsetof(UFortnite_Base_Head_Export_Skeleton_AnimBP_C, AnimGraphNode_Root_C9D648834AA29F5B677902BB5A9DC15C) == 0x0004A0, "Member 'UFortnite_Base_Head_Export_Skeleton_AnimBP_C::AnimGraphNode_Root_C9D648834AA29F5B677902BB5A9DC15C' has a wrong offset!");
static_assert(offsetof(UFortnite_Base_Head_Export_Skeleton_AnimBP_C, AnimGraphNode_SequencePlayer_94E41D364E86D3FFC2D042845913D0EE) == 0x0004D0, "Member 'UFortnite_Base_Head_Export_Skeleton_AnimBP_C::AnimGraphNode_SequencePlayer_94E41D364E86D3FFC2D042845913D0EE' has a wrong offset!");
static_assert(offsetof(UFortnite_Base_Head_Export_Skeleton_AnimBP_C, AnimGraphNode_CopyPoseFromMesh_9AC0772D481A4B85CE045AA17CE0F79E) == 0x000548, "Member 'UFortnite_Base_Head_Export_Skeleton_AnimBP_C::AnimGraphNode_CopyPoseFromMesh_9AC0772D481A4B85CE045AA17CE0F79E' has a wrong offset!");
static_assert(offsetof(UFortnite_Base_Head_Export_Skeleton_AnimBP_C, AnimGraphNode_LayeredBoneBlend_B0BAEC37412A3BDE897683AA32FAE4E1) == 0x000688, "Member 'UFortnite_Base_Head_Export_Skeleton_AnimBP_C::AnimGraphNode_LayeredBoneBlend_B0BAEC37412A3BDE897683AA32FAE4E1' has a wrong offset!");
static_assert(offsetof(UFortnite_Base_Head_Export_Skeleton_AnimBP_C, AnimGraphNode_TwoWayBlend_3971854A46E6B529767EA2AB708A8D46) == 0x000748, "Member 'UFortnite_Base_Head_Export_Skeleton_AnimBP_C::AnimGraphNode_TwoWayBlend_3971854A46E6B529767EA2AB708A8D46' has a wrong offset!");
static_assert(offsetof(UFortnite_Base_Head_Export_Skeleton_AnimBP_C, AnimGraphNode_SaveCachedPose_D687C7FB4A07645ECE24DBB182B71823) == 0x000810, "Member 'UFortnite_Base_Head_Export_Skeleton_AnimBP_C::AnimGraphNode_SaveCachedPose_D687C7FB4A07645ECE24DBB182B71823' has a wrong offset!");
static_assert(offsetof(UFortnite_Base_Head_Export_Skeleton_AnimBP_C, AnimGraphNode_UseCachedPose_19E6568A48732F90AD2036B56ECA0D46) == 0x0008C8, "Member 'UFortnite_Base_Head_Export_Skeleton_AnimBP_C::AnimGraphNode_UseCachedPose_19E6568A48732F90AD2036B56ECA0D46' has a wrong offset!");
static_assert(offsetof(UFortnite_Base_Head_Export_Skeleton_AnimBP_C, AnimGraphNode_UseCachedPose_C898D19D46B0E9723DD75AA4710C2707) == 0x0008F0, "Member 'UFortnite_Base_Head_Export_Skeleton_AnimBP_C::AnimGraphNode_UseCachedPose_C898D19D46B0E9723DD75AA4710C2707' has a wrong offset!");
static_assert(offsetof(UFortnite_Base_Head_Export_Skeleton_AnimBP_C, AnimGraphNode_LiveLinkPose_67AFEC6E4E43108E1E699081080B9448) == 0x000918, "Member 'UFortnite_Base_Head_Export_Skeleton_AnimBP_C::AnimGraphNode_LiveLinkPose_67AFEC6E4E43108E1E699081080B9448' has a wrong offset!");
static_assert(offsetof(UFortnite_Base_Head_Export_Skeleton_AnimBP_C, AnimGraphNode_LayeredBoneBlend_E8FB05504628ECA52ADD038CBD818957) == 0x000960, "Member 'UFortnite_Base_Head_Export_Skeleton_AnimBP_C::AnimGraphNode_LayeredBoneBlend_E8FB05504628ECA52ADD038CBD818957' has a wrong offset!");
static_assert(offsetof(UFortnite_Base_Head_Export_Skeleton_AnimBP_C, AnimGraphNode_SaveCachedPose_91F05C994C7B4758BA35D2B1F94A7663) == 0x000A20, "Member 'UFortnite_Base_Head_Export_Skeleton_AnimBP_C::AnimGraphNode_SaveCachedPose_91F05C994C7B4758BA35D2B1F94A7663' has a wrong offset!");
static_assert(offsetof(UFortnite_Base_Head_Export_Skeleton_AnimBP_C, AnimGraphNode_UseCachedPose_53F166F14732C8ECBEC8C0A540192456) == 0x000AD8, "Member 'UFortnite_Base_Head_Export_Skeleton_AnimBP_C::AnimGraphNode_UseCachedPose_53F166F14732C8ECBEC8C0A540192456' has a wrong offset!");
static_assert(offsetof(UFortnite_Base_Head_Export_Skeleton_AnimBP_C, AnimGraphNode_TwoWayBlend_BF175D4149F235AF8059B38CB3517406) == 0x000B00, "Member 'UFortnite_Base_Head_Export_Skeleton_AnimBP_C::AnimGraphNode_TwoWayBlend_BF175D4149F235AF8059B38CB3517406' has a wrong offset!");
static_assert(offsetof(UFortnite_Base_Head_Export_Skeleton_AnimBP_C, AnimGraphNode_Slot_59950130431F160E70FA618201DA0ED0) == 0x000BC8, "Member 'UFortnite_Base_Head_Export_Skeleton_AnimBP_C::AnimGraphNode_Slot_59950130431F160E70FA618201DA0ED0' has a wrong offset!");
static_assert(offsetof(UFortnite_Base_Head_Export_Skeleton_AnimBP_C, AnimGraphNode_LayeredBoneBlend_4B2D173F4261FBC709962B837E22DAA7) == 0x000C10, "Member 'UFortnite_Base_Head_Export_Skeleton_AnimBP_C::AnimGraphNode_LayeredBoneBlend_4B2D173F4261FBC709962B837E22DAA7' has a wrong offset!");
static_assert(offsetof(UFortnite_Base_Head_Export_Skeleton_AnimBP_C, AnimGraphNode_SaveCachedPose_C50053764A5016625E742C8401AAD202) == 0x000CD0, "Member 'UFortnite_Base_Head_Export_Skeleton_AnimBP_C::AnimGraphNode_SaveCachedPose_C50053764A5016625E742C8401AAD202' has a wrong offset!");
static_assert(offsetof(UFortnite_Base_Head_Export_Skeleton_AnimBP_C, AnimGraphNode_UseCachedPose_540FAC8A423311B343A66CBDD1A68E4E) == 0x000D88, "Member 'UFortnite_Base_Head_Export_Skeleton_AnimBP_C::AnimGraphNode_UseCachedPose_540FAC8A423311B343A66CBDD1A68E4E' has a wrong offset!");
static_assert(offsetof(UFortnite_Base_Head_Export_Skeleton_AnimBP_C, AnimGraphNode_UseCachedPose_5C0CA1E44DCE78D6CEF568B89CA4B27B) == 0x000DB0, "Member 'UFortnite_Base_Head_Export_Skeleton_AnimBP_C::AnimGraphNode_UseCachedPose_5C0CA1E44DCE78D6CEF568B89CA4B27B' has a wrong offset!");
static_assert(offsetof(UFortnite_Base_Head_Export_Skeleton_AnimBP_C, AnimGraphNode_ModifyBone_C5BEAB564689BE7F396B479553755894) == 0x000DD8, "Member 'UFortnite_Base_Head_Export_Skeleton_AnimBP_C::AnimGraphNode_ModifyBone_C5BEAB564689BE7F396B479553755894' has a wrong offset!");
static_assert(offsetof(UFortnite_Base_Head_Export_Skeleton_AnimBP_C, AnimGraphNode_LocalToComponentSpace_F7D256644C446D0E0E7A1FAE450C7158) == 0x000EE0, "Member 'UFortnite_Base_Head_Export_Skeleton_AnimBP_C::AnimGraphNode_LocalToComponentSpace_F7D256644C446D0E0E7A1FAE450C7158' has a wrong offset!");
static_assert(offsetof(UFortnite_Base_Head_Export_Skeleton_AnimBP_C, AnimGraphNode_ComponentToLocalSpace_E876E3114CDEF692F73DBF884F9BD650) == 0x000F00, "Member 'UFortnite_Base_Head_Export_Skeleton_AnimBP_C::AnimGraphNode_ComponentToLocalSpace_E876E3114CDEF692F73DBF884F9BD650' has a wrong offset!");
static_assert(offsetof(UFortnite_Base_Head_Export_Skeleton_AnimBP_C, AnimGraphNode_SaveCachedPose_17658B34440A047EB64B94A7175013F1) == 0x000F20, "Member 'UFortnite_Base_Head_Export_Skeleton_AnimBP_C::AnimGraphNode_SaveCachedPose_17658B34440A047EB64B94A7175013F1' has a wrong offset!");
static_assert(offsetof(UFortnite_Base_Head_Export_Skeleton_AnimBP_C, AnimGraphNode_UseCachedPose_04405D3D4F8BCFD02C681D8D229C0D2E) == 0x000FD8, "Member 'UFortnite_Base_Head_Export_Skeleton_AnimBP_C::AnimGraphNode_UseCachedPose_04405D3D4F8BCFD02C681D8D229C0D2E' has a wrong offset!");
static_assert(offsetof(UFortnite_Base_Head_Export_Skeleton_AnimBP_C, AnimGraphNode_BlendListByBool_C68E6B0E407D0454643482B1A7183F5B) == 0x001000, "Member 'UFortnite_Base_Head_Export_Skeleton_AnimBP_C::AnimGraphNode_BlendListByBool_C68E6B0E407D0454643482B1A7183F5B' has a wrong offset!");
static_assert(offsetof(UFortnite_Base_Head_Export_Skeleton_AnimBP_C, AnimGraphNode_UseCachedPose_EDDAFEAC483866651C7E3FAC553065FD) == 0x0010A0, "Member 'UFortnite_Base_Head_Export_Skeleton_AnimBP_C::AnimGraphNode_UseCachedPose_EDDAFEAC483866651C7E3FAC553065FD' has a wrong offset!");
static_assert(offsetof(UFortnite_Base_Head_Export_Skeleton_AnimBP_C, AnimGraphNode_BlendListByEnum_08630207438BC89444088F8788608168) == 0x0010C8, "Member 'UFortnite_Base_Head_Export_Skeleton_AnimBP_C::AnimGraphNode_BlendListByEnum_08630207438BC89444088F8788608168' has a wrong offset!");
static_assert(offsetof(UFortnite_Base_Head_Export_Skeleton_AnimBP_C, AnimGraphNode_UseCachedPose_FABFCD4648E517EB4D1F55956E6A4DD2) == 0x001178, "Member 'UFortnite_Base_Head_Export_Skeleton_AnimBP_C::AnimGraphNode_UseCachedPose_FABFCD4648E517EB4D1F55956E6A4DD2' has a wrong offset!");
static_assert(offsetof(UFortnite_Base_Head_Export_Skeleton_AnimBP_C, AnimGraphNode_UseCachedPose_0E3FE42145D747BC790D9C8B3B86A438) == 0x0011A0, "Member 'UFortnite_Base_Head_Export_Skeleton_AnimBP_C::AnimGraphNode_UseCachedPose_0E3FE42145D747BC790D9C8B3B86A438' has a wrong offset!");
static_assert(offsetof(UFortnite_Base_Head_Export_Skeleton_AnimBP_C, AnimGraphNode_UseCachedPose_534B120E48854DC8D7F075B794D33C5F) == 0x0011C8, "Member 'UFortnite_Base_Head_Export_Skeleton_AnimBP_C::AnimGraphNode_UseCachedPose_534B120E48854DC8D7F075B794D33C5F' has a wrong offset!");
static_assert(offsetof(UFortnite_Base_Head_Export_Skeleton_AnimBP_C, AnimGraphNode_LiveLinkPose_99C9F7884620B6D189A49A8BB1023059) == 0x0011F0, "Member 'UFortnite_Base_Head_Export_Skeleton_AnimBP_C::AnimGraphNode_LiveLinkPose_99C9F7884620B6D189A49A8BB1023059' has a wrong offset!");
static_assert(offsetof(UFortnite_Base_Head_Export_Skeleton_AnimBP_C, AnimGraphNode_LiveLinkPose_904059874BC7464442D2C4A54AA56DB6) == 0x001238, "Member 'UFortnite_Base_Head_Export_Skeleton_AnimBP_C::AnimGraphNode_LiveLinkPose_904059874BC7464442D2C4A54AA56DB6' has a wrong offset!");
static_assert(offsetof(UFortnite_Base_Head_Export_Skeleton_AnimBP_C, MeshToCopy) == 0x001280, "Member 'UFortnite_Base_Head_Export_Skeleton_AnimBP_C::MeshToCopy' has a wrong offset!");
static_assert(offsetof(UFortnite_Base_Head_Export_Skeleton_AnimBP_C, GetPlayerListUsesCustomCharacterParts) == 0x001288, "Member 'UFortnite_Base_Head_Export_Skeleton_AnimBP_C::GetPlayerListUsesCustomCharacterParts' has a wrong offset!");

}

