#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortTutorial_LobbyPopup_2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass FortTutorial_LobbyPopup_2.FortTutorial_LobbyPopup_2_C
// 0x0070 (0x03F0 - 0x0380)
class UFortTutorial_LobbyPopup_2_C final : public UFortTutorialLobbyPopup
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0380(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       In_V2;                                             // 0x0388(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In_V1;                                             // 0x0390(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Out;                                               // 0x0398(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x03A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_Darken;                                     // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Header_1;                                          // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_Character;                                     // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_Character_BG;                                  // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PH1;                                               // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PH2;                                               // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         RichText_Desc_1;                                   // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      Skip_Button;                                       // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      YesButton;                                         // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void BndEvt__Skip_Button_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__Cancel_Button_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void ExecuteUbergraph_FortTutorial_LobbyPopup_2(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FortTutorial_LobbyPopup_2_C">();
	}
	static class UFortTutorial_LobbyPopup_2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortTutorial_LobbyPopup_2_C>();
	}
};
static_assert(alignof(UFortTutorial_LobbyPopup_2_C) == 0x000008, "Wrong alignment on UFortTutorial_LobbyPopup_2_C");
static_assert(sizeof(UFortTutorial_LobbyPopup_2_C) == 0x0003F0, "Wrong size on UFortTutorial_LobbyPopup_2_C");
static_assert(offsetof(UFortTutorial_LobbyPopup_2_C, UberGraphFrame) == 0x000380, "Member 'UFortTutorial_LobbyPopup_2_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UFortTutorial_LobbyPopup_2_C, In_V2) == 0x000388, "Member 'UFortTutorial_LobbyPopup_2_C::In_V2' has a wrong offset!");
static_assert(offsetof(UFortTutorial_LobbyPopup_2_C, In_V1) == 0x000390, "Member 'UFortTutorial_LobbyPopup_2_C::In_V1' has a wrong offset!");
static_assert(offsetof(UFortTutorial_LobbyPopup_2_C, Out) == 0x000398, "Member 'UFortTutorial_LobbyPopup_2_C::Out' has a wrong offset!");
static_assert(offsetof(UFortTutorial_LobbyPopup_2_C, In) == 0x0003A0, "Member 'UFortTutorial_LobbyPopup_2_C::In' has a wrong offset!");
static_assert(offsetof(UFortTutorial_LobbyPopup_2_C, Border_Darken) == 0x0003A8, "Member 'UFortTutorial_LobbyPopup_2_C::Border_Darken' has a wrong offset!");
static_assert(offsetof(UFortTutorial_LobbyPopup_2_C, Header_1) == 0x0003B0, "Member 'UFortTutorial_LobbyPopup_2_C::Header_1' has a wrong offset!");
static_assert(offsetof(UFortTutorial_LobbyPopup_2_C, IMG_Character) == 0x0003B8, "Member 'UFortTutorial_LobbyPopup_2_C::IMG_Character' has a wrong offset!");
static_assert(offsetof(UFortTutorial_LobbyPopup_2_C, IMG_Character_BG) == 0x0003C0, "Member 'UFortTutorial_LobbyPopup_2_C::IMG_Character_BG' has a wrong offset!");
static_assert(offsetof(UFortTutorial_LobbyPopup_2_C, PH1) == 0x0003C8, "Member 'UFortTutorial_LobbyPopup_2_C::PH1' has a wrong offset!");
static_assert(offsetof(UFortTutorial_LobbyPopup_2_C, PH2) == 0x0003D0, "Member 'UFortTutorial_LobbyPopup_2_C::PH2' has a wrong offset!");
static_assert(offsetof(UFortTutorial_LobbyPopup_2_C, RichText_Desc_1) == 0x0003D8, "Member 'UFortTutorial_LobbyPopup_2_C::RichText_Desc_1' has a wrong offset!");
static_assert(offsetof(UFortTutorial_LobbyPopup_2_C, Skip_Button) == 0x0003E0, "Member 'UFortTutorial_LobbyPopup_2_C::Skip_Button' has a wrong offset!");
static_assert(offsetof(UFortTutorial_LobbyPopup_2_C, YesButton) == 0x0003E8, "Member 'UFortTutorial_LobbyPopup_2_C::YesButton' has a wrong offset!");

}

