#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Frontend_Lobby_Background

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Frontend_Lobby_Background.Frontend_Lobby_Background_C.ExecuteUbergraph_Frontend_Lobby_Background
// 0x0040 (0x0040 - 0x0000)
struct Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScalarParameterValue_ReturnValue;      // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScalarParameterValue_ReturnValue_1;    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_ActorBoundEvent_PresetEnvironmentName;      // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UTexture*                               K2Node_ActorBoundEvent_BackgroundImage;            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchString_CmpSuccess;                    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue;                    // 0x002C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background) == 0x000008, "Wrong alignment on Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background");
static_assert(sizeof(Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background) == 0x000040, "Wrong size on Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background");
static_assert(offsetof(Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background, EntryPoint) == 0x000000, "Member 'Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background::EntryPoint' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background, CallFunc_GetScalarParameterValue_ReturnValue) == 0x000004, "Member 'Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background::CallFunc_GetScalarParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background, CallFunc_GetScalarParameterValue_ReturnValue_1) == 0x000008, "Member 'Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background::CallFunc_GetScalarParameterValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background, K2Node_ActorBoundEvent_PresetEnvironmentName) == 0x000010, "Member 'Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background::K2Node_ActorBoundEvent_PresetEnvironmentName' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background, K2Node_ActorBoundEvent_BackgroundImage) == 0x000020, "Member 'Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background::K2Node_ActorBoundEvent_BackgroundImage' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background, K2Node_SwitchString_CmpSuccess) == 0x000028, "Member 'Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background::K2Node_SwitchString_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background, CallFunc_MakeColor_ReturnValue) == 0x00002C, "Member 'Frontend_Lobby_Background_C_ExecuteUbergraph_Frontend_Lobby_Background::CallFunc_MakeColor_ReturnValue' has a wrong offset!");

// Function Frontend_Lobby_Background.Frontend_Lobby_Background_C.BndEvt__CMSLobbyDirector_3_K2Node_ActorBoundEvent_1_OnEnvironmentBackgroundTextureChangedDynamic__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct Frontend_Lobby_Background_C_BndEvt__CMSLobbyDirector_3_K2Node_ActorBoundEvent_1_OnEnvironmentBackgroundTextureChangedDynamic__DelegateSignature final
{
public:
	class UTexture*                               BackgroundImage;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Frontend_Lobby_Background_C_BndEvt__CMSLobbyDirector_3_K2Node_ActorBoundEvent_1_OnEnvironmentBackgroundTextureChangedDynamic__DelegateSignature) == 0x000008, "Wrong alignment on Frontend_Lobby_Background_C_BndEvt__CMSLobbyDirector_3_K2Node_ActorBoundEvent_1_OnEnvironmentBackgroundTextureChangedDynamic__DelegateSignature");
static_assert(sizeof(Frontend_Lobby_Background_C_BndEvt__CMSLobbyDirector_3_K2Node_ActorBoundEvent_1_OnEnvironmentBackgroundTextureChangedDynamic__DelegateSignature) == 0x000008, "Wrong size on Frontend_Lobby_Background_C_BndEvt__CMSLobbyDirector_3_K2Node_ActorBoundEvent_1_OnEnvironmentBackgroundTextureChangedDynamic__DelegateSignature");
static_assert(offsetof(Frontend_Lobby_Background_C_BndEvt__CMSLobbyDirector_3_K2Node_ActorBoundEvent_1_OnEnvironmentBackgroundTextureChangedDynamic__DelegateSignature, BackgroundImage) == 0x000000, "Member 'Frontend_Lobby_Background_C_BndEvt__CMSLobbyDirector_3_K2Node_ActorBoundEvent_1_OnEnvironmentBackgroundTextureChangedDynamic__DelegateSignature::BackgroundImage' has a wrong offset!");

// Function Frontend_Lobby_Background.Frontend_Lobby_Background_C.BndEvt__CMSLobbyDirector_3_K2Node_ActorBoundEvent_0_OnEnvironmentChangedDynamic__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct Frontend_Lobby_Background_C_BndEvt__CMSLobbyDirector_3_K2Node_ActorBoundEvent_0_OnEnvironmentChangedDynamic__DelegateSignature final
{
public:
	class FString                                 PresetEnvironmentName;                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Frontend_Lobby_Background_C_BndEvt__CMSLobbyDirector_3_K2Node_ActorBoundEvent_0_OnEnvironmentChangedDynamic__DelegateSignature) == 0x000008, "Wrong alignment on Frontend_Lobby_Background_C_BndEvt__CMSLobbyDirector_3_K2Node_ActorBoundEvent_0_OnEnvironmentChangedDynamic__DelegateSignature");
static_assert(sizeof(Frontend_Lobby_Background_C_BndEvt__CMSLobbyDirector_3_K2Node_ActorBoundEvent_0_OnEnvironmentChangedDynamic__DelegateSignature) == 0x000010, "Wrong size on Frontend_Lobby_Background_C_BndEvt__CMSLobbyDirector_3_K2Node_ActorBoundEvent_0_OnEnvironmentChangedDynamic__DelegateSignature");
static_assert(offsetof(Frontend_Lobby_Background_C_BndEvt__CMSLobbyDirector_3_K2Node_ActorBoundEvent_0_OnEnvironmentChangedDynamic__DelegateSignature, PresetEnvironmentName) == 0x000000, "Member 'Frontend_Lobby_Background_C_BndEvt__CMSLobbyDirector_3_K2Node_ActorBoundEvent_0_OnEnvironmentChangedDynamic__DelegateSignature::PresetEnvironmentName' has a wrong offset!");

// Function Frontend_Lobby_Background.Frontend_Lobby_Background_C.UpdateFade
// 0x0014 (0x0014 - 0x0000)
struct Frontend_Lobby_Background_C_UpdateFade final
{
public:
	float                                         FadeValue;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FadeFloorToBlack;                                  // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InFadeGrid;                                        // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_1;                       // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Frontend_Lobby_Background_C_UpdateFade) == 0x000004, "Wrong alignment on Frontend_Lobby_Background_C_UpdateFade");
static_assert(sizeof(Frontend_Lobby_Background_C_UpdateFade) == 0x000014, "Wrong size on Frontend_Lobby_Background_C_UpdateFade");
static_assert(offsetof(Frontend_Lobby_Background_C_UpdateFade, FadeValue) == 0x000000, "Member 'Frontend_Lobby_Background_C_UpdateFade::FadeValue' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_UpdateFade, FadeFloorToBlack) == 0x000004, "Member 'Frontend_Lobby_Background_C_UpdateFade::FadeFloorToBlack' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_UpdateFade, InFadeGrid) == 0x000008, "Member 'Frontend_Lobby_Background_C_UpdateFade::InFadeGrid' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_UpdateFade, CallFunc_Lerp_ReturnValue) == 0x00000C, "Member 'Frontend_Lobby_Background_C_UpdateFade::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Frontend_Lobby_Background_C_UpdateFade, CallFunc_Lerp_ReturnValue_1) == 0x000010, "Member 'Frontend_Lobby_Background_C_UpdateFade::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");

}

