#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FrontendCamera_Main

#include "Basic.hpp"


namespace SDK::Params
{

// Function FrontendCamera_Main.FrontendCamera_Main_C.ExecuteUbergraph_FrontendCamera_Main
// 0x0040 (0x0040 - 0x0000)
struct FrontendCamera_Main_C_ExecuteUbergraph_FrontendCamera_Main final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortTimeOfDayManager*                  CallFunc_GetTimeOfDayManagerFromContext_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ATVPostProcessBP_C*>             CallFunc_GetAllActorsOfClass_OutActors;            // 0x0018(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATVPostProcessBP_C*                     CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FrontendCamera_Main_C_ExecuteUbergraph_FrontendCamera_Main) == 0x000008, "Wrong alignment on FrontendCamera_Main_C_ExecuteUbergraph_FrontendCamera_Main");
static_assert(sizeof(FrontendCamera_Main_C_ExecuteUbergraph_FrontendCamera_Main) == 0x000040, "Wrong size on FrontendCamera_Main_C_ExecuteUbergraph_FrontendCamera_Main");
static_assert(offsetof(FrontendCamera_Main_C_ExecuteUbergraph_FrontendCamera_Main, EntryPoint) == 0x000000, "Member 'FrontendCamera_Main_C_ExecuteUbergraph_FrontendCamera_Main::EntryPoint' has a wrong offset!");
static_assert(offsetof(FrontendCamera_Main_C_ExecuteUbergraph_FrontendCamera_Main, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'FrontendCamera_Main_C_ExecuteUbergraph_FrontendCamera_Main::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(FrontendCamera_Main_C_ExecuteUbergraph_FrontendCamera_Main, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'FrontendCamera_Main_C_ExecuteUbergraph_FrontendCamera_Main::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontendCamera_Main_C_ExecuteUbergraph_FrontendCamera_Main, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'FrontendCamera_Main_C_ExecuteUbergraph_FrontendCamera_Main::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(FrontendCamera_Main_C_ExecuteUbergraph_FrontendCamera_Main, CallFunc_GetTimeOfDayManagerFromContext_ReturnValue) == 0x000010, "Member 'FrontendCamera_Main_C_ExecuteUbergraph_FrontendCamera_Main::CallFunc_GetTimeOfDayManagerFromContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontendCamera_Main_C_ExecuteUbergraph_FrontendCamera_Main, CallFunc_GetAllActorsOfClass_OutActors) == 0x000018, "Member 'FrontendCamera_Main_C_ExecuteUbergraph_FrontendCamera_Main::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(FrontendCamera_Main_C_ExecuteUbergraph_FrontendCamera_Main, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'FrontendCamera_Main_C_ExecuteUbergraph_FrontendCamera_Main::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontendCamera_Main_C_ExecuteUbergraph_FrontendCamera_Main, CallFunc_Array_Get_Item) == 0x000030, "Member 'FrontendCamera_Main_C_ExecuteUbergraph_FrontendCamera_Main::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(FrontendCamera_Main_C_ExecuteUbergraph_FrontendCamera_Main, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'FrontendCamera_Main_C_ExecuteUbergraph_FrontendCamera_Main::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

}

