#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Frontend

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Frontend.FrontEnd_C
// 0x0018 (0x0248 - 0x0230)
class AFrontEnd_C final : public AFortLevelScriptActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          NewLobby;                                          // 0x0238(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          NewVar_0;                                          // 0x0239(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23A[0x6];                                      // 0x023A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AHBOnboardingFlow_C*                    HBOnboardingFlow_ExecuteUbergraph_Frontend_RefProperty; // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void PlaySpeech(const class FString& Filename, int32 SampleRate, class USoundWave* AssetFile);
	void OnMatchStarted();
	void EnableTutorial();
	void ExecuteUbergraph_FrontEnd(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FrontEnd_C">();
	}
	static class AFrontEnd_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFrontEnd_C>();
	}
};
static_assert(alignof(AFrontEnd_C) == 0x000008, "Wrong alignment on AFrontEnd_C");
static_assert(sizeof(AFrontEnd_C) == 0x000248, "Wrong size on AFrontEnd_C");
static_assert(offsetof(AFrontEnd_C, UberGraphFrame) == 0x000230, "Member 'AFrontEnd_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AFrontEnd_C, NewLobby) == 0x000238, "Member 'AFrontEnd_C::NewLobby' has a wrong offset!");
static_assert(offsetof(AFrontEnd_C, NewVar_0) == 0x000239, "Member 'AFrontEnd_C::NewVar_0' has a wrong offset!");
static_assert(offsetof(AFrontEnd_C, HBOnboardingFlow_ExecuteUbergraph_Frontend_RefProperty) == 0x000240, "Member 'AFrontEnd_C::HBOnboardingFlow_ExecuteUbergraph_Frontend_RefProperty' has a wrong offset!");

}

