#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_ChillBronco

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GA_ThrowConsumable_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Athena_ChillBronco.GA_Athena_ChillBronco_C
// 0x0010 (0x0B90 - 0x0B80)
class UGA_Athena_ChillBronco_C final : public UGA_ThrowConsumable_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_Athena_ChillBronco_C;            // 0x0B80(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         Added_X_SpawnRotation;                             // 0x0B88(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Added_Y_SpawnRotation;                             // 0x0B8C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Athena_ChillBronco(int32 EntryPoint);
	void OnProjectileSpawned(class AFortProjectileBase* SpawnedProjectile_0);
	void SpawnThrownProjectile(class UClass* ProjectileClass_0, const struct FVector& ProjectileSpawnLocation, const struct FRotator& ProjectileSpawnDirection, const struct FFortGameplayEffectContainerSpec& HitEffectContainerSpec_0, const struct FFortGameplayEffectContainerSpec& ExplosionEffectContainerSpec_0, float ProjectileInitialSpeed, float ProjectileGravityScale_0, class AFortProjectileBase** SpawnedProjectile_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Athena_ChillBronco_C">();
	}
	static class UGA_Athena_ChillBronco_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Athena_ChillBronco_C>();
	}
};
static_assert(alignof(UGA_Athena_ChillBronco_C) == 0x000008, "Wrong alignment on UGA_Athena_ChillBronco_C");
static_assert(sizeof(UGA_Athena_ChillBronco_C) == 0x000B90, "Wrong size on UGA_Athena_ChillBronco_C");
static_assert(offsetof(UGA_Athena_ChillBronco_C, UberGraphFrame_GA_Athena_ChillBronco_C) == 0x000B80, "Member 'UGA_Athena_ChillBronco_C::UberGraphFrame_GA_Athena_ChillBronco_C' has a wrong offset!");
static_assert(offsetof(UGA_Athena_ChillBronco_C, Added_X_SpawnRotation) == 0x000B88, "Member 'UGA_Athena_ChillBronco_C::Added_X_SpawnRotation' has a wrong offset!");
static_assert(offsetof(UGA_Athena_ChillBronco_C, Added_Y_SpawnRotation) == 0x000B8C, "Member 'UGA_Athena_ChillBronco_C::Added_Y_SpawnRotation' has a wrong offset!");

}

