#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_BadgerBangs_Throw

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GA_Athena_BadgerBangs_Throw.GA_Athena_BadgerBangs_Throw_C.ExecuteUbergraph_GA_Athena_BadgerBangs_Throw
// 0x0218 (0x0218 - 0x0000)
struct GA_Athena_BadgerBangs_Throw_C_ExecuteUbergraph_GA_Athena_BadgerBangs_Throw final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_1;            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityActorInfo              CallFunc_GetActorInfo_ReturnValue;                 // 0x0010(0x0040)(ContainsInstancedReference)
	struct FGameplayAbilityActorInfo              CallFunc_GetActorInfo_ReturnValue_1;               // 0x0050(0x0040)(ContainsInstancedReference)
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue; // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue_1; // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_2;            // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_3;            // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              CallFunc_GetAimedAtEnemy_ReturnValue;              // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetPlayer_Player;                         // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             K2Node_DynamicCast_AsCharacter;                    // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CA[0x2];                                       // 0x00CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x00CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_ProjectileTrajectory_BadgerBangs_C* K2Node_DynamicCast_AsBP_Projectile_Trajectory_Badger_Bangs; // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x00F4(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_17C[0x4];                                      // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityActorInfo              CallFunc_GetActorInfo_ReturnValue_2;               // 0x0180(0x0040)(ContainsInstancedReference)
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue_2; // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              CallFunc_GetAimedAtEnemy_ReturnValue_1;            // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetPlayer_Player_1;                       // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E1[0x3];                                      // 0x01E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_ApplyGlobalEnvironmentGameplayEffectToActor_ReturnValue; // 0x01E4(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_4;            // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortProjectileBase*                    K2Node_Event_ProjectileReference;                  // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AB_Prj_Athena_BadgerBangs_C*            K2Node_DynamicCast_AsB_Prj_Athena_Badger_Bangs;    // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_201[0x3];                                      // 0x0201(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueAtLevel_ReturnValue_5;            // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              CallFunc_GetAimedAtEnemy_ReturnValue_2;            // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetPlayer_Player_2;                       // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_BadgerBangs_Throw_C_ExecuteUbergraph_GA_Athena_BadgerBangs_Throw) == 0x000008, "Wrong alignment on GA_Athena_BadgerBangs_Throw_C_ExecuteUbergraph_GA_Athena_BadgerBangs_Throw");
static_assert(sizeof(GA_Athena_BadgerBangs_Throw_C_ExecuteUbergraph_GA_Athena_BadgerBangs_Throw) == 0x000218, "Wrong size on GA_Athena_BadgerBangs_Throw_C_ExecuteUbergraph_GA_Athena_BadgerBangs_Throw");
static_assert(offsetof(GA_Athena_BadgerBangs_Throw_C_ExecuteUbergraph_GA_Athena_BadgerBangs_Throw, EntryPoint) == 0x000000, "Member 'GA_Athena_BadgerBangs_Throw_C_ExecuteUbergraph_GA_Athena_BadgerBangs_Throw::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Athena_BadgerBangs_Throw_C_ExecuteUbergraph_GA_Athena_BadgerBangs_Throw, CallFunc_GetValueAtLevel_ReturnValue) == 0x000004, "Member 'GA_Athena_BadgerBangs_Throw_C_ExecuteUbergraph_GA_Athena_BadgerBangs_Throw::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_BadgerBangs_Throw_C_ExecuteUbergraph_GA_Athena_BadgerBangs_Throw, CallFunc_GetValueAtLevel_ReturnValue_1) == 0x000008, "Member 'GA_Athena_BadgerBangs_Throw_C_ExecuteUbergraph_GA_Athena_BadgerBangs_Throw::CallFunc_GetValueAtLevel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_BadgerBangs_Throw_C_ExecuteUbergraph_GA_Athena_BadgerBangs_Throw, CallFunc_GetActorInfo_ReturnValue) == 0x000010, "Member 'GA_Athena_BadgerBangs_Throw_C_ExecuteUbergraph_GA_Athena_BadgerBangs_Throw::CallFunc_GetActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_BadgerBangs_Throw_C_ExecuteUbergraph_GA_Athena_BadgerBangs_Throw, CallFunc_GetActorInfo_ReturnValue_1) == 0x000050, "Member 'GA_Athena_BadgerBangs_Throw_C_ExecuteUbergraph_GA_Athena_BadgerBangs_Throw::CallFunc_GetActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_BadgerBangs_Throw_C_ExecuteUbergraph_GA_Athena_BadgerBangs_Throw, CallFunc_GetFortPlayerControllerFromActor_ReturnValue) == 0x000090, "Member 'GA_Athena_BadgerBangs_Throw_C_ExecuteUbergraph_GA_Athena_BadgerBangs_Throw::CallFunc_GetFortPlayerControllerFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_BadgerBangs_Throw_C_ExecuteUbergraph_GA_Athena_BadgerBangs_Throw, CallFunc_GetFortPlayerControllerFromActor_ReturnValue_1) == 0x000098, "Member 'GA_Athena_BadgerBangs_Throw_C_ExecuteUbergraph_GA_Athena_BadgerBangs_Throw::CallFunc_GetFortPlayerControllerFromActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_BadgerBangs_Throw_C_ExecuteUbergraph_GA_Athena_BadgerBangs_Throw, CallFunc_GetValueAtLevel_ReturnValue_2) == 0x0000A0, "Member 'GA_Athena_BadgerBangs_Throw_C_ExecuteUbergraph_GA_Athena_BadgerBangs_Throw::CallFunc_GetValueAtLevel_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_BadgerBangs_Throw_C_ExecuteUbergraph_GA_Athena_BadgerBangs_Throw, CallFunc_GetValueAtLevel_ReturnValue_3) == 0x0000A4, "Member 'GA_Athena_BadgerBangs_Throw_C_ExecuteUbergraph_GA_Athena_BadgerBangs_Throw::CallFunc_GetValueAtLevel_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Athena_BadgerBangs_Throw_C_ExecuteUbergraph_GA_Athena_BadgerBangs_Throw, CallFunc_GetAimedAtEnemy_ReturnValue) == 0x0000A8, "Member 'GA_Athena_BadgerBangs_Throw_C_ExecuteUbergraph_GA_Athena_BadgerBangs_Throw::CallFunc_GetAimedAtEnemy_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_BadgerBangs_Throw_C_ExecuteUbergraph_GA_Athena_BadgerBangs_Throw, CallFunc_GetPlayer_Player) == 0x0000B0, "Member 'GA_Athena_BadgerBangs_Throw_C_ExecuteUbergraph_GA_Athena_BadgerBangs_Throw::CallFunc_GetPlayer_Player' has a wrong offset!");
static_assert(offsetof(GA_Athena_BadgerBangs_Throw_C_ExecuteUbergraph_GA_Athena_BadgerBangs_Throw, CallFunc_IsValid_ReturnValue) == 0x0000B8, "Member 'GA_Athena_BadgerBangs_Throw_C_ExecuteUbergraph_GA_Athena_BadgerBangs_Throw::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_BadgerBangs_Throw_C_ExecuteUbergraph_GA_Athena_BadgerBangs_Throw, K2Node_DynamicCast_AsCharacter) == 0x0000C0, "Member 'GA_Athena_BadgerBangs_Throw_C_ExecuteUbergraph_GA_Athena_BadgerBangs_Throw::K2Node_DynamicCast_AsCharacter' has a wrong offset!");
static_assert(offsetof(GA_Athena_BadgerBangs_Throw_C_ExecuteUbergraph_GA_Athena_BadgerBangs_Throw, K2Node_DynamicCast_bSuccess) == 0x0000C8, "Member 'GA_Athena_BadgerBangs_Throw_C_ExecuteUbergraph_GA_Athena_BadgerBangs_Throw::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Athena_BadgerBangs_Throw_C_ExecuteUbergraph_GA_Athena_BadgerBangs_Throw, K2Node_Event_bWasCancelled) == 0x0000C9, "Member 'GA_Athena_BadgerBangs_Throw_C_ExecuteUbergraph_GA_Athena_BadgerBangs_Throw::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_Athena_BadgerBangs_Throw_C_ExecuteUbergraph_GA_Athena_BadgerBangs_Throw, CallFunc_GetSocketLocation_ReturnValue) == 0x0000CC, "Member 'GA_Athena_BadgerBangs_Throw_C_ExecuteUbergraph_GA_Athena_BadgerBangs_Throw::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_BadgerBangs_Throw_C_ExecuteUbergraph_GA_Athena_BadgerBangs_Throw, CallFunc_Add_VectorVector_ReturnValue) == 0x0000D8, "Member 'GA_Athena_BadgerBangs_Throw_C_ExecuteUbergraph_GA_Athena_BadgerBangs_Throw::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_BadgerBangs_Throw_C_ExecuteUbergraph_GA_Athena_BadgerBangs_Throw, K2Node_DynamicCast_AsBP_Projectile_Trajectory_Badger_Bangs) == 0x0000E8, "Member 'GA_Athena_BadgerBangs_Throw_C_ExecuteUbergraph_GA_Athena_BadgerBangs_Throw::K2Node_DynamicCast_AsBP_Projectile_Trajectory_Badger_Bangs' has a wrong offset!");
static_assert(offsetof(GA_Athena_BadgerBangs_Throw_C_ExecuteUbergraph_GA_Athena_BadgerBangs_Throw, K2Node_DynamicCast_bSuccess_1) == 0x0000F0, "Member 'GA_Athena_BadgerBangs_Throw_C_ExecuteUbergraph_GA_Athena_BadgerBangs_Throw::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_BadgerBangs_Throw_C_ExecuteUbergraph_GA_Athena_BadgerBangs_Throw, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x0000F4, "Member 'GA_Athena_BadgerBangs_Throw_C_ExecuteUbergraph_GA_Athena_BadgerBangs_Throw::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(GA_Athena_BadgerBangs_Throw_C_ExecuteUbergraph_GA_Athena_BadgerBangs_Throw, CallFunc_GetActorInfo_ReturnValue_2) == 0x000180, "Member 'GA_Athena_BadgerBangs_Throw_C_ExecuteUbergraph_GA_Athena_BadgerBangs_Throw::CallFunc_GetActorInfo_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_BadgerBangs_Throw_C_ExecuteUbergraph_GA_Athena_BadgerBangs_Throw, CallFunc_GetFortPlayerControllerFromActor_ReturnValue_2) == 0x0001C0, "Member 'GA_Athena_BadgerBangs_Throw_C_ExecuteUbergraph_GA_Athena_BadgerBangs_Throw::CallFunc_GetFortPlayerControllerFromActor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_BadgerBangs_Throw_C_ExecuteUbergraph_GA_Athena_BadgerBangs_Throw, CallFunc_GetAimedAtEnemy_ReturnValue_1) == 0x0001C8, "Member 'GA_Athena_BadgerBangs_Throw_C_ExecuteUbergraph_GA_Athena_BadgerBangs_Throw::CallFunc_GetAimedAtEnemy_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_BadgerBangs_Throw_C_ExecuteUbergraph_GA_Athena_BadgerBangs_Throw, CallFunc_GetPlayer_Player_1) == 0x0001D0, "Member 'GA_Athena_BadgerBangs_Throw_C_ExecuteUbergraph_GA_Athena_BadgerBangs_Throw::CallFunc_GetPlayer_Player_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_BadgerBangs_Throw_C_ExecuteUbergraph_GA_Athena_BadgerBangs_Throw, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x0001D8, "Member 'GA_Athena_BadgerBangs_Throw_C_ExecuteUbergraph_GA_Athena_BadgerBangs_Throw::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_BadgerBangs_Throw_C_ExecuteUbergraph_GA_Athena_BadgerBangs_Throw, CallFunc_IsValid_ReturnValue_1) == 0x0001E0, "Member 'GA_Athena_BadgerBangs_Throw_C_ExecuteUbergraph_GA_Athena_BadgerBangs_Throw::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_BadgerBangs_Throw_C_ExecuteUbergraph_GA_Athena_BadgerBangs_Throw, CallFunc_ApplyGlobalEnvironmentGameplayEffectToActor_ReturnValue) == 0x0001E4, "Member 'GA_Athena_BadgerBangs_Throw_C_ExecuteUbergraph_GA_Athena_BadgerBangs_Throw::CallFunc_ApplyGlobalEnvironmentGameplayEffectToActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_BadgerBangs_Throw_C_ExecuteUbergraph_GA_Athena_BadgerBangs_Throw, CallFunc_GetValueAtLevel_ReturnValue_4) == 0x0001EC, "Member 'GA_Athena_BadgerBangs_Throw_C_ExecuteUbergraph_GA_Athena_BadgerBangs_Throw::CallFunc_GetValueAtLevel_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_Athena_BadgerBangs_Throw_C_ExecuteUbergraph_GA_Athena_BadgerBangs_Throw, K2Node_Event_ProjectileReference) == 0x0001F0, "Member 'GA_Athena_BadgerBangs_Throw_C_ExecuteUbergraph_GA_Athena_BadgerBangs_Throw::K2Node_Event_ProjectileReference' has a wrong offset!");
static_assert(offsetof(GA_Athena_BadgerBangs_Throw_C_ExecuteUbergraph_GA_Athena_BadgerBangs_Throw, K2Node_DynamicCast_AsB_Prj_Athena_Badger_Bangs) == 0x0001F8, "Member 'GA_Athena_BadgerBangs_Throw_C_ExecuteUbergraph_GA_Athena_BadgerBangs_Throw::K2Node_DynamicCast_AsB_Prj_Athena_Badger_Bangs' has a wrong offset!");
static_assert(offsetof(GA_Athena_BadgerBangs_Throw_C_ExecuteUbergraph_GA_Athena_BadgerBangs_Throw, K2Node_DynamicCast_bSuccess_2) == 0x000200, "Member 'GA_Athena_BadgerBangs_Throw_C_ExecuteUbergraph_GA_Athena_BadgerBangs_Throw::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_BadgerBangs_Throw_C_ExecuteUbergraph_GA_Athena_BadgerBangs_Throw, CallFunc_GetValueAtLevel_ReturnValue_5) == 0x000204, "Member 'GA_Athena_BadgerBangs_Throw_C_ExecuteUbergraph_GA_Athena_BadgerBangs_Throw::CallFunc_GetValueAtLevel_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GA_Athena_BadgerBangs_Throw_C_ExecuteUbergraph_GA_Athena_BadgerBangs_Throw, CallFunc_GetAimedAtEnemy_ReturnValue_2) == 0x000208, "Member 'GA_Athena_BadgerBangs_Throw_C_ExecuteUbergraph_GA_Athena_BadgerBangs_Throw::CallFunc_GetAimedAtEnemy_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_BadgerBangs_Throw_C_ExecuteUbergraph_GA_Athena_BadgerBangs_Throw, CallFunc_GetPlayer_Player_2) == 0x000210, "Member 'GA_Athena_BadgerBangs_Throw_C_ExecuteUbergraph_GA_Athena_BadgerBangs_Throw::CallFunc_GetPlayer_Player_2' has a wrong offset!");

// Function GA_Athena_BadgerBangs_Throw.GA_Athena_BadgerBangs_Throw_C.AthenaProjectileSpawned
// 0x0008 (0x0008 - 0x0000)
struct GA_Athena_BadgerBangs_Throw_C_AthenaProjectileSpawned final
{
public:
	class AFortProjectileBase*                    ProjectileReference_0;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_BadgerBangs_Throw_C_AthenaProjectileSpawned) == 0x000008, "Wrong alignment on GA_Athena_BadgerBangs_Throw_C_AthenaProjectileSpawned");
static_assert(sizeof(GA_Athena_BadgerBangs_Throw_C_AthenaProjectileSpawned) == 0x000008, "Wrong size on GA_Athena_BadgerBangs_Throw_C_AthenaProjectileSpawned");
static_assert(offsetof(GA_Athena_BadgerBangs_Throw_C_AthenaProjectileSpawned, ProjectileReference_0) == 0x000000, "Member 'GA_Athena_BadgerBangs_Throw_C_AthenaProjectileSpawned::ProjectileReference_0' has a wrong offset!");

// Function GA_Athena_BadgerBangs_Throw.GA_Athena_BadgerBangs_Throw_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_Athena_BadgerBangs_Throw_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Athena_BadgerBangs_Throw_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_Athena_BadgerBangs_Throw_C_K2_OnEndAbility");
static_assert(sizeof(GA_Athena_BadgerBangs_Throw_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_Athena_BadgerBangs_Throw_C_K2_OnEndAbility");
static_assert(offsetof(GA_Athena_BadgerBangs_Throw_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_Athena_BadgerBangs_Throw_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GA_Athena_BadgerBangs_Throw.GA_Athena_BadgerBangs_Throw_C.GetPlayer
// 0x0078 (0x0078 - 0x0000)
struct GA_Athena_BadgerBangs_Throw_C_GetPlayer final
{
public:
	class AActor*                                 PlayerOrVehicle;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Player;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  PropTag;                                           // 0x0010(0x0020)(Edit, BlueprintVisible)
	class APlayerPawn_Athena_C*                   K2Node_DynamicCast_AsPlayer_Pawn_Athena;           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABuildingGameplayActorPlayerPropAttachment* CallFunc_GetPossessedProp_ReturnValue;             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IFortVehicleInterface> K2Node_DynamicCast_AsFort_Vehicle_Interface;       // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AFortPlayerPawn*>                CallFunc_GetAllPassengers_ReturnValue;             // 0x0060(0x0010)(ZeroConstructor, ReferenceParm)
	class AFortPlayerPawn*                        CallFunc_Array_Get_Item;                           // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_BadgerBangs_Throw_C_GetPlayer) == 0x000008, "Wrong alignment on GA_Athena_BadgerBangs_Throw_C_GetPlayer");
static_assert(sizeof(GA_Athena_BadgerBangs_Throw_C_GetPlayer) == 0x000078, "Wrong size on GA_Athena_BadgerBangs_Throw_C_GetPlayer");
static_assert(offsetof(GA_Athena_BadgerBangs_Throw_C_GetPlayer, PlayerOrVehicle) == 0x000000, "Member 'GA_Athena_BadgerBangs_Throw_C_GetPlayer::PlayerOrVehicle' has a wrong offset!");
static_assert(offsetof(GA_Athena_BadgerBangs_Throw_C_GetPlayer, Player) == 0x000008, "Member 'GA_Athena_BadgerBangs_Throw_C_GetPlayer::Player' has a wrong offset!");
static_assert(offsetof(GA_Athena_BadgerBangs_Throw_C_GetPlayer, PropTag) == 0x000010, "Member 'GA_Athena_BadgerBangs_Throw_C_GetPlayer::PropTag' has a wrong offset!");
static_assert(offsetof(GA_Athena_BadgerBangs_Throw_C_GetPlayer, K2Node_DynamicCast_AsPlayer_Pawn_Athena) == 0x000030, "Member 'GA_Athena_BadgerBangs_Throw_C_GetPlayer::K2Node_DynamicCast_AsPlayer_Pawn_Athena' has a wrong offset!");
static_assert(offsetof(GA_Athena_BadgerBangs_Throw_C_GetPlayer, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'GA_Athena_BadgerBangs_Throw_C_GetPlayer::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Athena_BadgerBangs_Throw_C_GetPlayer, CallFunc_GetPossessedProp_ReturnValue) == 0x000040, "Member 'GA_Athena_BadgerBangs_Throw_C_GetPlayer::CallFunc_GetPossessedProp_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_BadgerBangs_Throw_C_GetPlayer, K2Node_DynamicCast_AsFort_Vehicle_Interface) == 0x000048, "Member 'GA_Athena_BadgerBangs_Throw_C_GetPlayer::K2Node_DynamicCast_AsFort_Vehicle_Interface' has a wrong offset!");
static_assert(offsetof(GA_Athena_BadgerBangs_Throw_C_GetPlayer, K2Node_DynamicCast_bSuccess_1) == 0x000058, "Member 'GA_Athena_BadgerBangs_Throw_C_GetPlayer::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_BadgerBangs_Throw_C_GetPlayer, CallFunc_IsValid_ReturnValue) == 0x000059, "Member 'GA_Athena_BadgerBangs_Throw_C_GetPlayer::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_BadgerBangs_Throw_C_GetPlayer, CallFunc_GetAllPassengers_ReturnValue) == 0x000060, "Member 'GA_Athena_BadgerBangs_Throw_C_GetPlayer::CallFunc_GetAllPassengers_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_BadgerBangs_Throw_C_GetPlayer, CallFunc_Array_Get_Item) == 0x000070, "Member 'GA_Athena_BadgerBangs_Throw_C_GetPlayer::CallFunc_Array_Get_Item' has a wrong offset!");

// Function GA_Athena_BadgerBangs_Throw.GA_Athena_BadgerBangs_Throw_C.GetProjectileTrajectoryPoints
// 0x0150 (0x0150 - 0x0000)
struct GA_Athena_BadgerBangs_Throw_C_GetProjectileTrajectoryPoints final
{
public:
	TArray<struct FVector>                        OutSplinePoints;                                   // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor)
	TArray<struct FVector>                        OutSplineTangents;                                 // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor)
	struct FHitResult                             OutHitResult;                                      // 0x0020(0x0088)(Parm, OutParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	TArray<struct FVector>                        CallFunc_GetProjectileTrajectoryPoints_OutSplinePoints; // 0x00A8(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<struct FVector>                        CallFunc_GetProjectileTrajectoryPoints_OutSplineTangents; // 0x00B8(0x0010)(ZeroConstructor, ReferenceParm)
	struct FHitResult                             CallFunc_GetProjectileTrajectoryPoints_OutHitResult; // 0x00C8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(GA_Athena_BadgerBangs_Throw_C_GetProjectileTrajectoryPoints) == 0x000008, "Wrong alignment on GA_Athena_BadgerBangs_Throw_C_GetProjectileTrajectoryPoints");
static_assert(sizeof(GA_Athena_BadgerBangs_Throw_C_GetProjectileTrajectoryPoints) == 0x000150, "Wrong size on GA_Athena_BadgerBangs_Throw_C_GetProjectileTrajectoryPoints");
static_assert(offsetof(GA_Athena_BadgerBangs_Throw_C_GetProjectileTrajectoryPoints, OutSplinePoints) == 0x000000, "Member 'GA_Athena_BadgerBangs_Throw_C_GetProjectileTrajectoryPoints::OutSplinePoints' has a wrong offset!");
static_assert(offsetof(GA_Athena_BadgerBangs_Throw_C_GetProjectileTrajectoryPoints, OutSplineTangents) == 0x000010, "Member 'GA_Athena_BadgerBangs_Throw_C_GetProjectileTrajectoryPoints::OutSplineTangents' has a wrong offset!");
static_assert(offsetof(GA_Athena_BadgerBangs_Throw_C_GetProjectileTrajectoryPoints, OutHitResult) == 0x000020, "Member 'GA_Athena_BadgerBangs_Throw_C_GetProjectileTrajectoryPoints::OutHitResult' has a wrong offset!");
static_assert(offsetof(GA_Athena_BadgerBangs_Throw_C_GetProjectileTrajectoryPoints, CallFunc_GetProjectileTrajectoryPoints_OutSplinePoints) == 0x0000A8, "Member 'GA_Athena_BadgerBangs_Throw_C_GetProjectileTrajectoryPoints::CallFunc_GetProjectileTrajectoryPoints_OutSplinePoints' has a wrong offset!");
static_assert(offsetof(GA_Athena_BadgerBangs_Throw_C_GetProjectileTrajectoryPoints, CallFunc_GetProjectileTrajectoryPoints_OutSplineTangents) == 0x0000B8, "Member 'GA_Athena_BadgerBangs_Throw_C_GetProjectileTrajectoryPoints::CallFunc_GetProjectileTrajectoryPoints_OutSplineTangents' has a wrong offset!");
static_assert(offsetof(GA_Athena_BadgerBangs_Throw_C_GetProjectileTrajectoryPoints, CallFunc_GetProjectileTrajectoryPoints_OutHitResult) == 0x0000C8, "Member 'GA_Athena_BadgerBangs_Throw_C_GetProjectileTrajectoryPoints::CallFunc_GetProjectileTrajectoryPoints_OutHitResult' has a wrong offset!");

}

