#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_BadgerBangs_Throw

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GA_Athena_Grenade_WithTrajectory_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Athena_BadgerBangs_Throw.GA_Athena_BadgerBangs_Throw_C
// 0x0060 (0x0CF8 - 0x0C98)
class UGA_Athena_BadgerBangs_Throw_C final : public UGA_Athena_Grenade_WithTrajectory_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_Athena_BadgerBangs_Throw_C;      // 0x0C98(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               FX_OnHand;                                         // 0x0CA0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ChargeUpCue;                                       // 0x0CA8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         RectSize;                                          // 0x0CB0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         Range;                                             // 0x0CD0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class AActor*                                 AimedPlayer;                                       // 0x0CF0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Athena_BadgerBangs_Throw(int32 EntryPoint);
	void AthenaProjectileSpawned(class AFortProjectileBase* ProjectileReference_0);
	void TossGrenade();
	void UpdateTrajectorySpline();
	void UpdateTrajectory();
	void K2_OnEndAbility(bool bWasCancelled);
	void K2_ActivateAbility();
	void GetPlayer(class AActor* PlayerOrVehicle, class AActor** Player);

	void GetProjectileTrajectoryPoints(TArray<struct FVector>* OutSplinePoints, TArray<struct FVector>* OutSplineTangents, struct FHitResult* OutHitResult) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Athena_BadgerBangs_Throw_C">();
	}
	static class UGA_Athena_BadgerBangs_Throw_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Athena_BadgerBangs_Throw_C>();
	}
};
static_assert(alignof(UGA_Athena_BadgerBangs_Throw_C) == 0x000008, "Wrong alignment on UGA_Athena_BadgerBangs_Throw_C");
static_assert(sizeof(UGA_Athena_BadgerBangs_Throw_C) == 0x000CF8, "Wrong size on UGA_Athena_BadgerBangs_Throw_C");
static_assert(offsetof(UGA_Athena_BadgerBangs_Throw_C, UberGraphFrame_GA_Athena_BadgerBangs_Throw_C) == 0x000C98, "Member 'UGA_Athena_BadgerBangs_Throw_C::UberGraphFrame_GA_Athena_BadgerBangs_Throw_C' has a wrong offset!");
static_assert(offsetof(UGA_Athena_BadgerBangs_Throw_C, FX_OnHand) == 0x000CA0, "Member 'UGA_Athena_BadgerBangs_Throw_C::FX_OnHand' has a wrong offset!");
static_assert(offsetof(UGA_Athena_BadgerBangs_Throw_C, ChargeUpCue) == 0x000CA8, "Member 'UGA_Athena_BadgerBangs_Throw_C::ChargeUpCue' has a wrong offset!");
static_assert(offsetof(UGA_Athena_BadgerBangs_Throw_C, RectSize) == 0x000CB0, "Member 'UGA_Athena_BadgerBangs_Throw_C::RectSize' has a wrong offset!");
static_assert(offsetof(UGA_Athena_BadgerBangs_Throw_C, Range) == 0x000CD0, "Member 'UGA_Athena_BadgerBangs_Throw_C::Range' has a wrong offset!");
static_assert(offsetof(UGA_Athena_BadgerBangs_Throw_C, AimedPlayer) == 0x000CF0, "Member 'UGA_Athena_BadgerBangs_Throw_C::AimedPlayer' has a wrong offset!");

}

