#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GA_Athena_UtilityGrenade_WithTrajectory_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout.GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C
// 0x0028 (0x0CC0 - 0x0C98)
class UGA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C final : public UGA_Athena_UtilityGrenade_WithTrajectory_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C; // 0x0C98(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFortContextTrapItemDefinition*         TrapDefinition;                                    // 0x0CA0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_ProjectileTrajectory_C*             ProjectileTrajectoryRed;                           // 0x0CA8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 TrajectoryIndicatorRedClass;                       // 0x0CB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InvalidTrapLocation;                               // 0x0CB8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout(int32 EntryPoint);
	void InitTrajectoryVariables();
	void Server_SpawnProjectile(const struct FVector& Location, const struct FRotator& Direction);
	void CleanupTrajectoryDisplay();
	void UpdateTrajectorySpline();
	void K2_OnEndAbility(bool bWasCancelled);
	void InitializeDecoHelper();
	void EndTrapPreview();
	void SetUpDummyProjectileRed();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C">();
	}
	static class UGA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C>();
	}
};
static_assert(alignof(UGA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C) == 0x000008, "Wrong alignment on UGA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C");
static_assert(sizeof(UGA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C) == 0x000CC0, "Wrong size on UGA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C");
static_assert(offsetof(UGA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C, UberGraphFrame_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C) == 0x000C98, "Member 'UGA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C::UberGraphFrame_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C' has a wrong offset!");
static_assert(offsetof(UGA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C, TrapDefinition) == 0x000CA0, "Member 'UGA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C::TrapDefinition' has a wrong offset!");
static_assert(offsetof(UGA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C, ProjectileTrajectoryRed) == 0x000CA8, "Member 'UGA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C::ProjectileTrajectoryRed' has a wrong offset!");
static_assert(offsetof(UGA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C, TrajectoryIndicatorRedClass) == 0x000CB0, "Member 'UGA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C::TrajectoryIndicatorRedClass' has a wrong offset!");
static_assert(offsetof(UGA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C, InvalidTrapLocation) == 0x000CB8, "Member 'UGA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C::InvalidTrapLocation' has a wrong offset!");

}

