#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_Bush

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function GA_Athena_Bush.GA_Athena_Bush_C.ExecuteUbergraph_GA_Athena_Bush
// 0x0360 (0x0360 - 0x0000)
struct GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x0004(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable_1;                            // 0x0010(0x0028)()
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData_2;                   // 0x0038(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag_2;               // 0x0060(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityActorInfo              CallFunc_GetActorInfo_ReturnValue;                 // 0x0070(0x0040)(ContainsInstancedReference)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate;              // 0x00B0(0x0010)(ZeroConstructor, NoDestructor)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       CallFunc_AbilityTargetDataFromActor_ReturnValue;   // 0x00D0(0x0028)()
	class UFortAbilityTask_PlayMontageWaitTarget* CallFunc_PlayMontageInfoAndWaitForTrigger_ReturnValue; // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x0100(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x3];                                      // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x0114(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue;    // 0x0120(0x00B8)(ContainsInstancedReference)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData;                     // 0x01D8(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag;                 // 0x0200(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_209[0x7];                                      // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDBNO_ReturnValue;                       // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  K2Node_DynamicCast_AsFort_Player_Controller;       // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0229(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22A[0x6];                                      // 0x022A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AFortPlayerController*>          K2Node_MakeArray_Array;                            // 0x0230(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_241[0x3];                                      // 0x0241(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0244(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_254[0x4];                                      // 0x0254(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortGameStateAthena*                   K2Node_DynamicCast_AsFort_Game_State_Athena;       // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_269[0x7];                                      // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData_1;                   // 0x0270(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag_1;               // 0x0298(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_GetAthenaPlaylistContextTags_ReturnValue; // 0x02A0(0x0020)()
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C1[0x3];                                      // 0x02C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_1; // 0x02C4(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesTargetHaveTags_ReturnValue;           // 0x02CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x02CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2CE[0x2];                                      // 0x02CE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x02D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x02DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x02EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x02F4(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0304(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0308(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue_1;           // 0x0314(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_315[0xB];                                      // 0x0315(0x000B)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0320(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAthena_Player_Bush_C*                  CallFunc_FinishSpawningActor_ReturnValue;          // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush) == 0x000010, "Wrong alignment on GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush");
static_assert(sizeof(GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush) == 0x000360, "Wrong size on GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush");
static_assert(offsetof(GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush, EntryPoint) == 0x000000, "Member 'GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush, Temp_struct_Variable) == 0x000004, "Member 'GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush, Temp_struct_Variable_1) == 0x000010, "Member 'GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush, K2Node_CustomEvent_TargetData_2) == 0x000038, "Member 'GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush::K2Node_CustomEvent_TargetData_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush, K2Node_CustomEvent_ApplicationTag_2) == 0x000060, "Member 'GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush::K2Node_CustomEvent_ApplicationTag_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush, CallFunc_IsDedicatedServer_ReturnValue) == 0x000068, "Member 'GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush, CallFunc_K2_CommitAbility_ReturnValue) == 0x000069, "Member 'GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush, CallFunc_GetActorInfo_ReturnValue) == 0x000070, "Member 'GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush::CallFunc_GetActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush, K2Node_CreateDelegate_OutputDelegate) == 0x0000B0, "Member 'GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x0000C0, "Member 'GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush, K2Node_DynamicCast_bSuccess) == 0x0000C8, "Member 'GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush, CallFunc_AbilityTargetDataFromActor_ReturnValue) == 0x0000D0, "Member 'GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush::CallFunc_AbilityTargetDataFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush, CallFunc_PlayMontageInfoAndWaitForTrigger_ReturnValue) == 0x0000F8, "Member 'GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush::CallFunc_PlayMontageInfoAndWaitForTrigger_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x000100, "Member 'GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush, CallFunc_IsValid_ReturnValue) == 0x000110, "Member 'GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x000114, "Member 'GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush, CallFunc_MakeGameplayCueParameters_ReturnValue) == 0x000120, "Member 'GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush::CallFunc_MakeGameplayCueParameters_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush, K2Node_CustomEvent_TargetData) == 0x0001D8, "Member 'GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush::K2Node_CustomEvent_TargetData' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush, K2Node_CustomEvent_ApplicationTag) == 0x000200, "Member 'GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush::K2Node_CustomEvent_ApplicationTag' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush, CallFunc_IsValid_ReturnValue_1) == 0x000208, "Member 'GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush, CallFunc_GetController_ReturnValue) == 0x000210, "Member 'GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush, CallFunc_IsDBNO_ReturnValue) == 0x000218, "Member 'GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush::CallFunc_IsDBNO_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush, K2Node_DynamicCast_AsFort_Player_Controller) == 0x000220, "Member 'GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush::K2Node_DynamicCast_AsFort_Player_Controller' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush, K2Node_DynamicCast_bSuccess_1) == 0x000228, "Member 'GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush, CallFunc_Not_PreBool_ReturnValue) == 0x000229, "Member 'GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush, K2Node_MakeArray_Array) == 0x000230, "Member 'GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush, K2Node_Event_bWasCancelled) == 0x000240, "Member 'GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush, K2Node_CreateDelegate_OutputDelegate_1) == 0x000244, "Member 'GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush, CallFunc_GetGameState_ReturnValue) == 0x000258, "Member 'GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush, K2Node_DynamicCast_AsFort_Game_State_Athena) == 0x000260, "Member 'GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush::K2Node_DynamicCast_AsFort_Game_State_Athena' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush, K2Node_DynamicCast_bSuccess_2) == 0x000268, "Member 'GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush, K2Node_CustomEvent_TargetData_1) == 0x000270, "Member 'GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush::K2Node_CustomEvent_TargetData_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush, K2Node_CustomEvent_ApplicationTag_1) == 0x000298, "Member 'GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush::K2Node_CustomEvent_ApplicationTag_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush, CallFunc_GetAthenaPlaylistContextTags_ReturnValue) == 0x0002A0, "Member 'GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush::CallFunc_GetAthenaPlaylistContextTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush, CallFunc_HasTag_ReturnValue) == 0x0002C0, "Member 'GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_1) == 0x0002C4, "Member 'GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush, CallFunc_DoesTargetHaveTags_ReturnValue) == 0x0002CC, "Member 'GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush::CallFunc_DoesTargetHaveTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush, CallFunc_Not_PreBool_ReturnValue_1) == 0x0002CD, "Member 'GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush, CallFunc_K2_GetActorRotation_ReturnValue) == 0x0002D0, "Member 'GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0002DC, "Member 'GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush, CallFunc_BreakVector_X) == 0x0002E8, "Member 'GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush, CallFunc_BreakVector_Y) == 0x0002EC, "Member 'GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush, CallFunc_BreakVector_Z) == 0x0002F0, "Member 'GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush, K2Node_CreateDelegate_OutputDelegate_2) == 0x0002F4, "Member 'GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000304, "Member 'GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush, CallFunc_MakeVector_ReturnValue) == 0x000308, "Member 'GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush, CallFunc_K2_CommitAbility_ReturnValue_1) == 0x000314, "Member 'GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush::CallFunc_K2_CommitAbility_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush, CallFunc_MakeTransform_ReturnValue) == 0x000320, "Member 'GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000350, "Member 'GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush, CallFunc_FinishSpawningActor_ReturnValue) == 0x000358, "Member 'GA_Athena_Bush_C_ExecuteUbergraph_GA_Athena_Bush::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

// Function GA_Athena_Bush.GA_Athena_Bush_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_Athena_Bush_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Athena_Bush_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_Athena_Bush_C_K2_OnEndAbility");
static_assert(sizeof(GA_Athena_Bush_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_Athena_Bush_C_K2_OnEndAbility");
static_assert(offsetof(GA_Athena_Bush_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_Athena_Bush_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GA_Athena_Bush.GA_Athena_Bush_C.Triggered_6FA77BEE4AD5C961BBDC6682C81BD718
// 0x0030 (0x0030 - 0x0000)
struct GA_Athena_Bush_C_Triggered_6FA77BEE4AD5C961BBDC6682C81BD718 final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Bush_C_Triggered_6FA77BEE4AD5C961BBDC6682C81BD718) == 0x000008, "Wrong alignment on GA_Athena_Bush_C_Triggered_6FA77BEE4AD5C961BBDC6682C81BD718");
static_assert(sizeof(GA_Athena_Bush_C_Triggered_6FA77BEE4AD5C961BBDC6682C81BD718) == 0x000030, "Wrong size on GA_Athena_Bush_C_Triggered_6FA77BEE4AD5C961BBDC6682C81BD718");
static_assert(offsetof(GA_Athena_Bush_C_Triggered_6FA77BEE4AD5C961BBDC6682C81BD718, TargetData) == 0x000000, "Member 'GA_Athena_Bush_C_Triggered_6FA77BEE4AD5C961BBDC6682C81BD718::TargetData' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_Triggered_6FA77BEE4AD5C961BBDC6682C81BD718, ApplicationTag) == 0x000028, "Member 'GA_Athena_Bush_C_Triggered_6FA77BEE4AD5C961BBDC6682C81BD718::ApplicationTag' has a wrong offset!");

// Function GA_Athena_Bush.GA_Athena_Bush_C.Cancelled_6FA77BEE4AD5C961BBDC6682C81BD718
// 0x0030 (0x0030 - 0x0000)
struct GA_Athena_Bush_C_Cancelled_6FA77BEE4AD5C961BBDC6682C81BD718 final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Bush_C_Cancelled_6FA77BEE4AD5C961BBDC6682C81BD718) == 0x000008, "Wrong alignment on GA_Athena_Bush_C_Cancelled_6FA77BEE4AD5C961BBDC6682C81BD718");
static_assert(sizeof(GA_Athena_Bush_C_Cancelled_6FA77BEE4AD5C961BBDC6682C81BD718) == 0x000030, "Wrong size on GA_Athena_Bush_C_Cancelled_6FA77BEE4AD5C961BBDC6682C81BD718");
static_assert(offsetof(GA_Athena_Bush_C_Cancelled_6FA77BEE4AD5C961BBDC6682C81BD718, TargetData) == 0x000000, "Member 'GA_Athena_Bush_C_Cancelled_6FA77BEE4AD5C961BBDC6682C81BD718::TargetData' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_Cancelled_6FA77BEE4AD5C961BBDC6682C81BD718, ApplicationTag) == 0x000028, "Member 'GA_Athena_Bush_C_Cancelled_6FA77BEE4AD5C961BBDC6682C81BD718::ApplicationTag' has a wrong offset!");

// Function GA_Athena_Bush.GA_Athena_Bush_C.Completed_6FA77BEE4AD5C961BBDC6682C81BD718
// 0x0030 (0x0030 - 0x0000)
struct GA_Athena_Bush_C_Completed_6FA77BEE4AD5C961BBDC6682C81BD718 final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Bush_C_Completed_6FA77BEE4AD5C961BBDC6682C81BD718) == 0x000008, "Wrong alignment on GA_Athena_Bush_C_Completed_6FA77BEE4AD5C961BBDC6682C81BD718");
static_assert(sizeof(GA_Athena_Bush_C_Completed_6FA77BEE4AD5C961BBDC6682C81BD718) == 0x000030, "Wrong size on GA_Athena_Bush_C_Completed_6FA77BEE4AD5C961BBDC6682C81BD718");
static_assert(offsetof(GA_Athena_Bush_C_Completed_6FA77BEE4AD5C961BBDC6682C81BD718, TargetData) == 0x000000, "Member 'GA_Athena_Bush_C_Completed_6FA77BEE4AD5C961BBDC6682C81BD718::TargetData' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_Completed_6FA77BEE4AD5C961BBDC6682C81BD718, ApplicationTag) == 0x000028, "Member 'GA_Athena_Bush_C_Completed_6FA77BEE4AD5C961BBDC6682C81BD718::ApplicationTag' has a wrong offset!");

// Function GA_Athena_Bush.GA_Athena_Bush_C.K2_CanActivateAbility
// 0x0090 (0x0090 - 0x0000)
struct GA_Athena_Bush_C_K2_CanActivateAbility final
{
public:
	struct FGameplayAbilityActorInfo              ActorInfo;                                         // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
	struct FGameplayTagContainer                  RelevantTags;                                      // 0x0040(0x0020)(Parm, OutParm)
	bool                                          ReturnValue;                                       // 0x0060(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawnAthena*                  K2Node_DynamicCast_AsFort_Player_Pawn_Athena;      // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput;    // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Athena_Bush_C_K2_CanActivateAbility) == 0x000008, "Wrong alignment on GA_Athena_Bush_C_K2_CanActivateAbility");
static_assert(sizeof(GA_Athena_Bush_C_K2_CanActivateAbility) == 0x000090, "Wrong size on GA_Athena_Bush_C_K2_CanActivateAbility");
static_assert(offsetof(GA_Athena_Bush_C_K2_CanActivateAbility, ActorInfo) == 0x000000, "Member 'GA_Athena_Bush_C_K2_CanActivateAbility::ActorInfo' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_K2_CanActivateAbility, RelevantTags) == 0x000040, "Member 'GA_Athena_Bush_C_K2_CanActivateAbility::RelevantTags' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bush_C_K2_CanActivateAbility, ReturnValue) == 0x000060, "Member 'GA_Athena_Bush_C_K2_CanActivateAbility::ReturnValue' has a wrong offset!");
