#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout.GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C.ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout
// 0x01C8 (0x01C8 - 0x0000)
struct GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector>                        CallFunc_GetProjectileTrajectoryPoints_OutSplinePoints; // 0x0008(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<struct FVector>                        CallFunc_GetProjectileTrajectoryPoints_OutSplineTangents; // 0x0018(0x0010)(ZeroConstructor, ReferenceParm)
	struct FHitResult                             CallFunc_GetProjectileTrajectoryPoints_OutHitResult; // 0x0028(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B3[0x1];                                       // 0x00B3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x00BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x00C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x00D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x00E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0118(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0124(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortProjectileBase*                    K2Node_DynamicCast_AsFort_Projectile_Base;         // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAthenaSupplyDropBalloon_C*             K2Node_DynamicCast_AsAthena_Supply_Drop_Balloon;   // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortAthenaSupplyDrop*                  K2Node_DynamicCast_AsFort_Athena_Supply_Drop;      // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn;                    // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABuildingProp*                          K2Node_DynamicCast_AsBuilding_Prop;                // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAthenaFillFloor*                       K2Node_DynamicCast_AsAthena_Fill_Floor;            // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0189(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x018A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x018B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x018C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x018D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x018E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x018F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_191[0x3];                                      // 0x0191(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_Location;                             // 0x0194(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               K2Node_Event_Direction;                            // 0x01A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetInFallbackPosition_ReturnValue;        // 0x01AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x01AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x01AE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x01AF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x01B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetInvalidThrowTrapPosition_ReturnValue;  // 0x01B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x01B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x01B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B5[0x3];                                      // 0x01B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_ProjectileTrajectory_C*             K2Node_Select_Default;                             // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_ProjectileTrajectory_C*             K2Node_Select_Default_1;                           // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout) == 0x000008, "Wrong alignment on GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout");
static_assert(sizeof(GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout) == 0x0001C8, "Wrong size on GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout");
static_assert(offsetof(GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout, EntryPoint) == 0x000000, "Member 'GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout, Temp_bool_Variable) == 0x000004, "Member 'GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout, Temp_bool_Has_Been_Initd_Variable) == 0x000005, "Member 'GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout, K2Node_Event_bWasCancelled) == 0x000006, "Member 'GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout, CallFunc_GetProjectileTrajectoryPoints_OutSplinePoints) == 0x000008, "Member 'GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout::CallFunc_GetProjectileTrajectoryPoints_OutSplinePoints' has a wrong offset!");
static_assert(offsetof(GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout, CallFunc_GetProjectileTrajectoryPoints_OutSplineTangents) == 0x000018, "Member 'GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout::CallFunc_GetProjectileTrajectoryPoints_OutSplineTangents' has a wrong offset!");
static_assert(offsetof(GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout, CallFunc_GetProjectileTrajectoryPoints_OutHitResult) == 0x000028, "Member 'GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout::CallFunc_GetProjectileTrajectoryPoints_OutHitResult' has a wrong offset!");
static_assert(offsetof(GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout, CallFunc_IsValid_ReturnValue) == 0x0000B0, "Member 'GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout, CallFunc_BreakHitResult_bBlockingHit) == 0x0000B1, "Member 'GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout, CallFunc_BreakHitResult_bInitialOverlap) == 0x0000B2, "Member 'GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout, CallFunc_BreakHitResult_Time) == 0x0000B4, "Member 'GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout, CallFunc_BreakHitResult_Distance) == 0x0000B8, "Member 'GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout, CallFunc_BreakHitResult_Location) == 0x0000BC, "Member 'GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout, CallFunc_BreakHitResult_ImpactPoint) == 0x0000C8, "Member 'GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout, CallFunc_BreakHitResult_Normal) == 0x0000D4, "Member 'GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout, CallFunc_BreakHitResult_ImpactNormal) == 0x0000E0, "Member 'GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout, CallFunc_BreakHitResult_PhysMat) == 0x0000F0, "Member 'GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout, CallFunc_BreakHitResult_HitActor) == 0x0000F8, "Member 'GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout, CallFunc_BreakHitResult_HitComponent) == 0x000100, "Member 'GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout, CallFunc_BreakHitResult_HitBoneName) == 0x000108, "Member 'GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout, CallFunc_BreakHitResult_HitItem) == 0x000110, "Member 'GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout, CallFunc_BreakHitResult_FaceIndex) == 0x000114, "Member 'GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout, CallFunc_BreakHitResult_TraceStart) == 0x000118, "Member 'GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout, CallFunc_BreakHitResult_TraceEnd) == 0x000124, "Member 'GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout, K2Node_DynamicCast_AsFort_Projectile_Base) == 0x000130, "Member 'GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout::K2Node_DynamicCast_AsFort_Projectile_Base' has a wrong offset!");
static_assert(offsetof(GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout, K2Node_DynamicCast_bSuccess) == 0x000138, "Member 'GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout, K2Node_DynamicCast_AsAthena_Supply_Drop_Balloon) == 0x000140, "Member 'GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout::K2Node_DynamicCast_AsAthena_Supply_Drop_Balloon' has a wrong offset!");
static_assert(offsetof(GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout, K2Node_DynamicCast_bSuccess_1) == 0x000148, "Member 'GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout, K2Node_DynamicCast_AsFort_Athena_Supply_Drop) == 0x000150, "Member 'GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout::K2Node_DynamicCast_AsFort_Athena_Supply_Drop' has a wrong offset!");
static_assert(offsetof(GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout, K2Node_DynamicCast_bSuccess_2) == 0x000158, "Member 'GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout, K2Node_DynamicCast_AsFort_Pawn) == 0x000160, "Member 'GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout::K2Node_DynamicCast_AsFort_Pawn' has a wrong offset!");
static_assert(offsetof(GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout, K2Node_DynamicCast_bSuccess_3) == 0x000168, "Member 'GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout, K2Node_DynamicCast_AsBuilding_Prop) == 0x000170, "Member 'GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout::K2Node_DynamicCast_AsBuilding_Prop' has a wrong offset!");
static_assert(offsetof(GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout, K2Node_DynamicCast_bSuccess_4) == 0x000178, "Member 'GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout, K2Node_DynamicCast_AsAthena_Fill_Floor) == 0x000180, "Member 'GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout::K2Node_DynamicCast_AsAthena_Fill_Floor' has a wrong offset!");
static_assert(offsetof(GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout, K2Node_DynamicCast_bSuccess_5) == 0x000188, "Member 'GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout, CallFunc_BooleanOR_ReturnValue) == 0x000189, "Member 'GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout, CallFunc_Not_PreBool_ReturnValue) == 0x00018A, "Member 'GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout, CallFunc_BooleanOR_ReturnValue_1) == 0x00018B, "Member 'GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout, Temp_bool_Variable_1) == 0x00018C, "Member 'GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout, CallFunc_BooleanOR_ReturnValue_2) == 0x00018D, "Member 'GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout, CallFunc_BooleanOR_ReturnValue_3) == 0x00018E, "Member 'GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout::CallFunc_BooleanOR_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout, CallFunc_BooleanAND_ReturnValue) == 0x00018F, "Member 'GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout, CallFunc_Not_PreBool_ReturnValue_1) == 0x000190, "Member 'GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout, K2Node_Event_Location) == 0x000194, "Member 'GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout::K2Node_Event_Location' has a wrong offset!");
static_assert(offsetof(GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout, K2Node_Event_Direction) == 0x0001A0, "Member 'GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout::K2Node_Event_Direction' has a wrong offset!");
static_assert(offsetof(GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout, CallFunc_GetInFallbackPosition_ReturnValue) == 0x0001AC, "Member 'GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout::CallFunc_GetInFallbackPosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout, CallFunc_Not_PreBool_ReturnValue_2) == 0x0001AD, "Member 'GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout, CallFunc_BooleanAND_ReturnValue_1) == 0x0001AE, "Member 'GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout, Temp_bool_IsClosed_Variable) == 0x0001AF, "Member 'GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout, CallFunc_IsValid_ReturnValue_1) == 0x0001B0, "Member 'GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout, CallFunc_IsValid_ReturnValue_2) == 0x0001B1, "Member 'GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout, CallFunc_GetInvalidThrowTrapPosition_ReturnValue) == 0x0001B2, "Member 'GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout::CallFunc_GetInvalidThrowTrapPosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout, CallFunc_Not_PreBool_ReturnValue_3) == 0x0001B3, "Member 'GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout, CallFunc_BooleanAND_ReturnValue_2) == 0x0001B4, "Member 'GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout, K2Node_Select_Default) == 0x0001B8, "Member 'GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout, K2Node_Select_Default_1) == 0x0001C0, "Member 'GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_ExecuteUbergraph_GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout::K2Node_Select_Default_1' has a wrong offset!");

// Function GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout.GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C.Server_SpawnProjectile
// 0x0018 (0x0018 - 0x0000)
struct GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_Server_SpawnProjectile final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Direction;                                         // 0x000C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_Server_SpawnProjectile) == 0x000004, "Wrong alignment on GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_Server_SpawnProjectile");
static_assert(sizeof(GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_Server_SpawnProjectile) == 0x000018, "Wrong size on GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_Server_SpawnProjectile");
static_assert(offsetof(GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_Server_SpawnProjectile, Location) == 0x000000, "Member 'GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_Server_SpawnProjectile::Location' has a wrong offset!");
static_assert(offsetof(GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_Server_SpawnProjectile, Direction) == 0x00000C, "Member 'GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_Server_SpawnProjectile::Direction' has a wrong offset!");

// Function GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout.GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_K2_OnEndAbility");
static_assert(sizeof(GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_K2_OnEndAbility");
static_assert(offsetof(GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout.GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C.InitializeDecoHelper
// 0x00B0 (0x00B0 - 0x0000)
struct GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_InitializeDecoHelper final
{
public:
	class AFortPlayerPawn*                        CallFunc_GetOwningPlayer_Player_Pawn;              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        CallFunc_GetOwningPlayer_Player_Pawn_1;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0xF];                                       // 0x0011(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0020(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_GetTransform_ReturnValue_1;               // 0x0050(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortProjectileDecoHelper*              CallFunc_FinishSpawningActor_ReturnValue;          // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortDecoTool_ContextTrap*              CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_InitializeDecoHelper) == 0x000010, "Wrong alignment on GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_InitializeDecoHelper");
static_assert(sizeof(GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_InitializeDecoHelper) == 0x0000B0, "Wrong size on GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_InitializeDecoHelper");
static_assert(offsetof(GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_InitializeDecoHelper, CallFunc_GetOwningPlayer_Player_Pawn) == 0x000000, "Member 'GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_InitializeDecoHelper::CallFunc_GetOwningPlayer_Player_Pawn' has a wrong offset!");
static_assert(offsetof(GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_InitializeDecoHelper, CallFunc_GetOwningPlayer_Player_Pawn_1) == 0x000008, "Member 'GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_InitializeDecoHelper::CallFunc_GetOwningPlayer_Player_Pawn_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_InitializeDecoHelper, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_InitializeDecoHelper::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_InitializeDecoHelper, CallFunc_GetTransform_ReturnValue) == 0x000020, "Member 'GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_InitializeDecoHelper::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_InitializeDecoHelper, CallFunc_GetTransform_ReturnValue_1) == 0x000050, "Member 'GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_InitializeDecoHelper::CallFunc_GetTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_InitializeDecoHelper, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000080, "Member 'GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_InitializeDecoHelper::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_InitializeDecoHelper, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x000088, "Member 'GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_InitializeDecoHelper::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_InitializeDecoHelper, CallFunc_FinishSpawningActor_ReturnValue) == 0x000090, "Member 'GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_InitializeDecoHelper::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_InitializeDecoHelper, CallFunc_FinishSpawningActor_ReturnValue_1) == 0x000098, "Member 'GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_InitializeDecoHelper::CallFunc_FinishSpawningActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_InitializeDecoHelper, CallFunc_IsValid_ReturnValue_1) == 0x0000A0, "Member 'GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_InitializeDecoHelper::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_InitializeDecoHelper, CallFunc_IsValid_ReturnValue_2) == 0x0000A1, "Member 'GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_InitializeDecoHelper::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");

// Function GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout.GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C.EndTrapPreview
// 0x0001 (0x0001 - 0x0000)
struct GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_EndTrapPreview final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_EndTrapPreview) == 0x000001, "Wrong alignment on GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_EndTrapPreview");
static_assert(sizeof(GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_EndTrapPreview) == 0x000001, "Wrong size on GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_EndTrapPreview");
static_assert(offsetof(GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_EndTrapPreview, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_EndTrapPreview::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout.GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C.SetUpDummyProjectileRed
// 0x0050 (0x0050 - 0x0000)
struct GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_SetUpDummyProjectileRed final
{
public:
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0000(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_ProjectileTrajectory_C*             K2Node_DynamicCast_AsBP_Projectile_Trajectory;     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_SetUpDummyProjectileRed) == 0x000010, "Wrong alignment on GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_SetUpDummyProjectileRed");
static_assert(sizeof(GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_SetUpDummyProjectileRed) == 0x000050, "Wrong size on GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_SetUpDummyProjectileRed");
static_assert(offsetof(GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_SetUpDummyProjectileRed, CallFunc_GetTransform_ReturnValue) == 0x000000, "Member 'GA_Athena_TrapGrenade_WithTrajectory_ZippyTrout_C_SetUpDummyProjectileRed::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
