#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_SuperTowerGrenadeWithTrajectory

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GA_Athena_UtilityGrenade_WithTrajectory_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Athena_SuperTowerGrenadeWithTrajectory.GA_Athena_SuperTowerGrenadeWithTrajectory_C
// 0x0030 (0x0CC8 - 0x0C98)
class UGA_Athena_SuperTowerGrenadeWithTrajectory_C final : public UGA_Athena_UtilityGrenade_WithTrajectory_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_Athena_SuperTowerGrenadeWithTrajectory_C; // 0x0C98(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ABP_ProjectileTrajectory_C*             ProjectileTrajectoryRed;                           // 0x0CA0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 TrajectoryIndicatorRedClass;                       // 0x0CA8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDataTableRowHandle                    ObjectiveStat;                                     // 0x0CB0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	class UFortQuestItemDefinition*               QuestItemUsePortafort;                             // 0x0CC0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Athena_SuperTowerGrenadeWithTrajectory(int32 EntryPoint);
	void CleanupTrajectoryDisplay();
	void UpdateTrajectorySpline();
	void Server_SpawnProjectile(const struct FVector& Location, const struct FRotator& Direction);
	void SetUpDummyProjectileRed();
	class AFortProjectileTrajectory* SpawnTrajectoryIndicator(bool bSpawnOnEquip);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Athena_SuperTowerGrenadeWithTrajectory_C">();
	}
	static class UGA_Athena_SuperTowerGrenadeWithTrajectory_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Athena_SuperTowerGrenadeWithTrajectory_C>();
	}
};
static_assert(alignof(UGA_Athena_SuperTowerGrenadeWithTrajectory_C) == 0x000008, "Wrong alignment on UGA_Athena_SuperTowerGrenadeWithTrajectory_C");
static_assert(sizeof(UGA_Athena_SuperTowerGrenadeWithTrajectory_C) == 0x000CC8, "Wrong size on UGA_Athena_SuperTowerGrenadeWithTrajectory_C");
static_assert(offsetof(UGA_Athena_SuperTowerGrenadeWithTrajectory_C, UberGraphFrame_GA_Athena_SuperTowerGrenadeWithTrajectory_C) == 0x000C98, "Member 'UGA_Athena_SuperTowerGrenadeWithTrajectory_C::UberGraphFrame_GA_Athena_SuperTowerGrenadeWithTrajectory_C' has a wrong offset!");
static_assert(offsetof(UGA_Athena_SuperTowerGrenadeWithTrajectory_C, ProjectileTrajectoryRed) == 0x000CA0, "Member 'UGA_Athena_SuperTowerGrenadeWithTrajectory_C::ProjectileTrajectoryRed' has a wrong offset!");
static_assert(offsetof(UGA_Athena_SuperTowerGrenadeWithTrajectory_C, TrajectoryIndicatorRedClass) == 0x000CA8, "Member 'UGA_Athena_SuperTowerGrenadeWithTrajectory_C::TrajectoryIndicatorRedClass' has a wrong offset!");
static_assert(offsetof(UGA_Athena_SuperTowerGrenadeWithTrajectory_C, ObjectiveStat) == 0x000CB0, "Member 'UGA_Athena_SuperTowerGrenadeWithTrajectory_C::ObjectiveStat' has a wrong offset!");
static_assert(offsetof(UGA_Athena_SuperTowerGrenadeWithTrajectory_C, QuestItemUsePortafort) == 0x000CC0, "Member 'UGA_Athena_SuperTowerGrenadeWithTrajectory_C::QuestItemUsePortafort' has a wrong offset!");

}

