#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_BadgerBangs_ExplosionApplyer

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function GA_BadgerBangs_ExplosionApplyer.GA_BadgerBangs_ExplosionApplyer_C.ExecuteUbergraph_GA_BadgerBangs_ExplosionApplyer
// 0x0190 (0x0190 - 0x0000)
struct GA_BadgerBangs_ExplosionApplyer_C_ExecuteUbergraph_GA_BadgerBangs_ExplosionApplyer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABGA_Athena_BadgerBangsStuck_C*         K2Node_DynamicCast_AsBGA_Athena_Badger_Bangs_Stuck; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate;              // 0x001C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0030(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0078(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0084(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData_1;                   // 0x0090(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag_1;               // 0x00B8(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00D0(0x0030)(IsPlainOldData, NoDestructor)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0100(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData;                     // 0x0110(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag;                 // 0x0138(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x0140(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable_1;                            // 0x0148(0x0028)()
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_ApplyGameplayEffectContainer_ReturnValue; // 0x0170(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	class UFortAbilityTask_WaitTargetSelection*   CallFunc_WaitTargetSelection_ReturnValue;          // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_BadgerBangs_ExplosionApplyer_C_ExecuteUbergraph_GA_BadgerBangs_ExplosionApplyer) == 0x000010, "Wrong alignment on GA_BadgerBangs_ExplosionApplyer_C_ExecuteUbergraph_GA_BadgerBangs_ExplosionApplyer");
static_assert(sizeof(GA_BadgerBangs_ExplosionApplyer_C_ExecuteUbergraph_GA_BadgerBangs_ExplosionApplyer) == 0x000190, "Wrong size on GA_BadgerBangs_ExplosionApplyer_C_ExecuteUbergraph_GA_BadgerBangs_ExplosionApplyer");
static_assert(offsetof(GA_BadgerBangs_ExplosionApplyer_C_ExecuteUbergraph_GA_BadgerBangs_ExplosionApplyer, EntryPoint) == 0x000000, "Member 'GA_BadgerBangs_ExplosionApplyer_C_ExecuteUbergraph_GA_BadgerBangs_ExplosionApplyer::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_BadgerBangs_ExplosionApplyer_C_ExecuteUbergraph_GA_BadgerBangs_ExplosionApplyer, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000008, "Member 'GA_BadgerBangs_ExplosionApplyer_C_ExecuteUbergraph_GA_BadgerBangs_ExplosionApplyer::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BadgerBangs_ExplosionApplyer_C_ExecuteUbergraph_GA_BadgerBangs_ExplosionApplyer, K2Node_DynamicCast_AsBGA_Athena_Badger_Bangs_Stuck) == 0x000010, "Member 'GA_BadgerBangs_ExplosionApplyer_C_ExecuteUbergraph_GA_BadgerBangs_ExplosionApplyer::K2Node_DynamicCast_AsBGA_Athena_Badger_Bangs_Stuck' has a wrong offset!");
static_assert(offsetof(GA_BadgerBangs_ExplosionApplyer_C_ExecuteUbergraph_GA_BadgerBangs_ExplosionApplyer, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'GA_BadgerBangs_ExplosionApplyer_C_ExecuteUbergraph_GA_BadgerBangs_ExplosionApplyer::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_BadgerBangs_ExplosionApplyer_C_ExecuteUbergraph_GA_BadgerBangs_ExplosionApplyer, K2Node_CreateDelegate_OutputDelegate) == 0x00001C, "Member 'GA_BadgerBangs_ExplosionApplyer_C_ExecuteUbergraph_GA_BadgerBangs_ExplosionApplyer::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_BadgerBangs_ExplosionApplyer_C_ExecuteUbergraph_GA_BadgerBangs_ExplosionApplyer, CallFunc_GetTransform_ReturnValue) == 0x000030, "Member 'GA_BadgerBangs_ExplosionApplyer_C_ExecuteUbergraph_GA_BadgerBangs_ExplosionApplyer::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BadgerBangs_ExplosionApplyer_C_ExecuteUbergraph_GA_BadgerBangs_ExplosionApplyer, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000060, "Member 'GA_BadgerBangs_ExplosionApplyer_C_ExecuteUbergraph_GA_BadgerBangs_ExplosionApplyer::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BadgerBangs_ExplosionApplyer_C_ExecuteUbergraph_GA_BadgerBangs_ExplosionApplyer, CallFunc_BreakTransform_Location) == 0x00006C, "Member 'GA_BadgerBangs_ExplosionApplyer_C_ExecuteUbergraph_GA_BadgerBangs_ExplosionApplyer::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(GA_BadgerBangs_ExplosionApplyer_C_ExecuteUbergraph_GA_BadgerBangs_ExplosionApplyer, CallFunc_BreakTransform_Rotation) == 0x000078, "Member 'GA_BadgerBangs_ExplosionApplyer_C_ExecuteUbergraph_GA_BadgerBangs_ExplosionApplyer::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(GA_BadgerBangs_ExplosionApplyer_C_ExecuteUbergraph_GA_BadgerBangs_ExplosionApplyer, CallFunc_BreakTransform_Scale) == 0x000084, "Member 'GA_BadgerBangs_ExplosionApplyer_C_ExecuteUbergraph_GA_BadgerBangs_ExplosionApplyer::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(GA_BadgerBangs_ExplosionApplyer_C_ExecuteUbergraph_GA_BadgerBangs_ExplosionApplyer, K2Node_CustomEvent_TargetData_1) == 0x000090, "Member 'GA_BadgerBangs_ExplosionApplyer_C_ExecuteUbergraph_GA_BadgerBangs_ExplosionApplyer::K2Node_CustomEvent_TargetData_1' has a wrong offset!");
static_assert(offsetof(GA_BadgerBangs_ExplosionApplyer_C_ExecuteUbergraph_GA_BadgerBangs_ExplosionApplyer, K2Node_CustomEvent_ApplicationTag_1) == 0x0000B8, "Member 'GA_BadgerBangs_ExplosionApplyer_C_ExecuteUbergraph_GA_BadgerBangs_ExplosionApplyer::K2Node_CustomEvent_ApplicationTag_1' has a wrong offset!");
static_assert(offsetof(GA_BadgerBangs_ExplosionApplyer_C_ExecuteUbergraph_GA_BadgerBangs_ExplosionApplyer, CallFunc_Add_VectorVector_ReturnValue) == 0x0000C0, "Member 'GA_BadgerBangs_ExplosionApplyer_C_ExecuteUbergraph_GA_BadgerBangs_ExplosionApplyer::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BadgerBangs_ExplosionApplyer_C_ExecuteUbergraph_GA_BadgerBangs_ExplosionApplyer, CallFunc_MakeTransform_ReturnValue) == 0x0000D0, "Member 'GA_BadgerBangs_ExplosionApplyer_C_ExecuteUbergraph_GA_BadgerBangs_ExplosionApplyer::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BadgerBangs_ExplosionApplyer_C_ExecuteUbergraph_GA_BadgerBangs_ExplosionApplyer, K2Node_CreateDelegate_OutputDelegate_1) == 0x000100, "Member 'GA_BadgerBangs_ExplosionApplyer_C_ExecuteUbergraph_GA_BadgerBangs_ExplosionApplyer::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_BadgerBangs_ExplosionApplyer_C_ExecuteUbergraph_GA_BadgerBangs_ExplosionApplyer, K2Node_CustomEvent_TargetData) == 0x000110, "Member 'GA_BadgerBangs_ExplosionApplyer_C_ExecuteUbergraph_GA_BadgerBangs_ExplosionApplyer::K2Node_CustomEvent_TargetData' has a wrong offset!");
static_assert(offsetof(GA_BadgerBangs_ExplosionApplyer_C_ExecuteUbergraph_GA_BadgerBangs_ExplosionApplyer, K2Node_CustomEvent_ApplicationTag) == 0x000138, "Member 'GA_BadgerBangs_ExplosionApplyer_C_ExecuteUbergraph_GA_BadgerBangs_ExplosionApplyer::K2Node_CustomEvent_ApplicationTag' has a wrong offset!");
static_assert(offsetof(GA_BadgerBangs_ExplosionApplyer_C_ExecuteUbergraph_GA_BadgerBangs_ExplosionApplyer, Temp_struct_Variable) == 0x000140, "Member 'GA_BadgerBangs_ExplosionApplyer_C_ExecuteUbergraph_GA_BadgerBangs_ExplosionApplyer::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_BadgerBangs_ExplosionApplyer_C_ExecuteUbergraph_GA_BadgerBangs_ExplosionApplyer, Temp_struct_Variable_1) == 0x000148, "Member 'GA_BadgerBangs_ExplosionApplyer_C_ExecuteUbergraph_GA_BadgerBangs_ExplosionApplyer::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_BadgerBangs_ExplosionApplyer_C_ExecuteUbergraph_GA_BadgerBangs_ExplosionApplyer, CallFunc_ApplyGameplayEffectContainer_ReturnValue) == 0x000170, "Member 'GA_BadgerBangs_ExplosionApplyer_C_ExecuteUbergraph_GA_BadgerBangs_ExplosionApplyer::CallFunc_ApplyGameplayEffectContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BadgerBangs_ExplosionApplyer_C_ExecuteUbergraph_GA_BadgerBangs_ExplosionApplyer, CallFunc_WaitTargetSelection_ReturnValue) == 0x000180, "Member 'GA_BadgerBangs_ExplosionApplyer_C_ExecuteUbergraph_GA_BadgerBangs_ExplosionApplyer::CallFunc_WaitTargetSelection_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BadgerBangs_ExplosionApplyer_C_ExecuteUbergraph_GA_BadgerBangs_ExplosionApplyer, CallFunc_IsValid_ReturnValue) == 0x000188, "Member 'GA_BadgerBangs_ExplosionApplyer_C_ExecuteUbergraph_GA_BadgerBangs_ExplosionApplyer::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function GA_BadgerBangs_ExplosionApplyer.GA_BadgerBangs_ExplosionApplyer_C.Cancelled_A6A636A84828C649400F86A6B9C9B7A5
// 0x0030 (0x0030 - 0x0000)
struct GA_BadgerBangs_ExplosionApplyer_C_Cancelled_A6A636A84828C649400F86A6B9C9B7A5 final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_BadgerBangs_ExplosionApplyer_C_Cancelled_A6A636A84828C649400F86A6B9C9B7A5) == 0x000008, "Wrong alignment on GA_BadgerBangs_ExplosionApplyer_C_Cancelled_A6A636A84828C649400F86A6B9C9B7A5");
static_assert(sizeof(GA_BadgerBangs_ExplosionApplyer_C_Cancelled_A6A636A84828C649400F86A6B9C9B7A5) == 0x000030, "Wrong size on GA_BadgerBangs_ExplosionApplyer_C_Cancelled_A6A636A84828C649400F86A6B9C9B7A5");
static_assert(offsetof(GA_BadgerBangs_ExplosionApplyer_C_Cancelled_A6A636A84828C649400F86A6B9C9B7A5, TargetData) == 0x000000, "Member 'GA_BadgerBangs_ExplosionApplyer_C_Cancelled_A6A636A84828C649400F86A6B9C9B7A5::TargetData' has a wrong offset!");
static_assert(offsetof(GA_BadgerBangs_ExplosionApplyer_C_Cancelled_A6A636A84828C649400F86A6B9C9B7A5, ApplicationTag) == 0x000028, "Member 'GA_BadgerBangs_ExplosionApplyer_C_Cancelled_A6A636A84828C649400F86A6B9C9B7A5::ApplicationTag' has a wrong offset!");

// Function GA_BadgerBangs_ExplosionApplyer.GA_BadgerBangs_ExplosionApplyer_C.Targeted_A6A636A84828C649400F86A6B9C9B7A5
// 0x0030 (0x0030 - 0x0000)
struct GA_BadgerBangs_ExplosionApplyer_C_Targeted_A6A636A84828C649400F86A6B9C9B7A5 final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_BadgerBangs_ExplosionApplyer_C_Targeted_A6A636A84828C649400F86A6B9C9B7A5) == 0x000008, "Wrong alignment on GA_BadgerBangs_ExplosionApplyer_C_Targeted_A6A636A84828C649400F86A6B9C9B7A5");
static_assert(sizeof(GA_BadgerBangs_ExplosionApplyer_C_Targeted_A6A636A84828C649400F86A6B9C9B7A5) == 0x000030, "Wrong size on GA_BadgerBangs_ExplosionApplyer_C_Targeted_A6A636A84828C649400F86A6B9C9B7A5");
static_assert(offsetof(GA_BadgerBangs_ExplosionApplyer_C_Targeted_A6A636A84828C649400F86A6B9C9B7A5, TargetData) == 0x000000, "Member 'GA_BadgerBangs_ExplosionApplyer_C_Targeted_A6A636A84828C649400F86A6B9C9B7A5::TargetData' has a wrong offset!");
static_assert(offsetof(GA_BadgerBangs_ExplosionApplyer_C_Targeted_A6A636A84828C649400F86A6B9C9B7A5, ApplicationTag) == 0x000028, "Member 'GA_BadgerBangs_ExplosionApplyer_C_Targeted_A6A636A84828C649400F86A6B9C9B7A5::ApplicationTag' has a wrong offset!");

// Function GA_BadgerBangs_ExplosionApplyer.GA_BadgerBangs_ExplosionApplyer_C.GetCustomAbilitySourceTransform
// 0x0030 (0x0030 - 0x0000)
struct GA_BadgerBangs_ExplosionApplyer_C_GetCustomAbilitySourceTransform final
{
public:
	struct FTransform                             ReturnValue;                                       // 0x0000(0x0030)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_BadgerBangs_ExplosionApplyer_C_GetCustomAbilitySourceTransform) == 0x000010, "Wrong alignment on GA_BadgerBangs_ExplosionApplyer_C_GetCustomAbilitySourceTransform");
static_assert(sizeof(GA_BadgerBangs_ExplosionApplyer_C_GetCustomAbilitySourceTransform) == 0x000030, "Wrong size on GA_BadgerBangs_ExplosionApplyer_C_GetCustomAbilitySourceTransform");
static_assert(offsetof(GA_BadgerBangs_ExplosionApplyer_C_GetCustomAbilitySourceTransform, ReturnValue) == 0x000000, "Member 'GA_BadgerBangs_ExplosionApplyer_C_GetCustomAbilitySourceTransform::ReturnValue' has a wrong offset!");

}

