#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Creative_Ranged_Flashlight

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "GAT_Creative_CreativeRangedWeapon_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Creative_Ranged_Flashlight.GA_Creative_Ranged_Flashlight_C
// 0x0018 (0x09B0 - 0x0998)
class UGA_Creative_Ranged_Flashlight_C final : public UGAT_Creative_CreativeRangedWeapon_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_Creative_Ranged_Flashlight_C;    // 0x0998(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          bToggleOn;                                         // 0x09A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A1[0x3];                                      // 0x09A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CUETAG_FlashLightToggled;                          // 0x09A4(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Creative_Ranged_Flashlight(int32 EntryPoint);
	void K2_ActivateAbility();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Creative_Ranged_Flashlight_C">();
	}
	static class UGA_Creative_Ranged_Flashlight_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Creative_Ranged_Flashlight_C>();
	}
};
static_assert(alignof(UGA_Creative_Ranged_Flashlight_C) == 0x000008, "Wrong alignment on UGA_Creative_Ranged_Flashlight_C");
static_assert(sizeof(UGA_Creative_Ranged_Flashlight_C) == 0x0009B0, "Wrong size on UGA_Creative_Ranged_Flashlight_C");
static_assert(offsetof(UGA_Creative_Ranged_Flashlight_C, UberGraphFrame_GA_Creative_Ranged_Flashlight_C) == 0x000998, "Member 'UGA_Creative_Ranged_Flashlight_C::UberGraphFrame_GA_Creative_Ranged_Flashlight_C' has a wrong offset!");
static_assert(offsetof(UGA_Creative_Ranged_Flashlight_C, bToggleOn) == 0x0009A0, "Member 'UGA_Creative_Ranged_Flashlight_C::bToggleOn' has a wrong offset!");
static_assert(offsetof(UGA_Creative_Ranged_Flashlight_C, CUETAG_FlashLightToggled) == 0x0009A4, "Member 'UGA_Creative_Ranged_Flashlight_C::CUETAG_FlashLightToggled' has a wrong offset!");

}

