#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Creative_Ranged_Flashlight

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Creative_Ranged_Flashlight.GA_Creative_Ranged_Flashlight_C.ExecuteUbergraph_GA_Creative_Ranged_Flashlight
// 0x00E0 (0x00E0 - 0x0000)
struct GA_Creative_Ranged_Flashlight_C_ExecuteUbergraph_GA_Creative_Ranged_Flashlight final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortWeapon*                            CallFunc_GetCurrentSourceWeapon_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue;    // 0x0020(0x00B8)(ContainsInstancedReference)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Creative_Ranged_Flashlight_C_ExecuteUbergraph_GA_Creative_Ranged_Flashlight) == 0x000008, "Wrong alignment on GA_Creative_Ranged_Flashlight_C_ExecuteUbergraph_GA_Creative_Ranged_Flashlight");
static_assert(sizeof(GA_Creative_Ranged_Flashlight_C_ExecuteUbergraph_GA_Creative_Ranged_Flashlight) == 0x0000E0, "Wrong size on GA_Creative_Ranged_Flashlight_C_ExecuteUbergraph_GA_Creative_Ranged_Flashlight");
static_assert(offsetof(GA_Creative_Ranged_Flashlight_C_ExecuteUbergraph_GA_Creative_Ranged_Flashlight, EntryPoint) == 0x000000, "Member 'GA_Creative_Ranged_Flashlight_C_ExecuteUbergraph_GA_Creative_Ranged_Flashlight::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Creative_Ranged_Flashlight_C_ExecuteUbergraph_GA_Creative_Ranged_Flashlight, CallFunc_GetCurrentSourceWeapon_ReturnValue) == 0x000008, "Member 'GA_Creative_Ranged_Flashlight_C_ExecuteUbergraph_GA_Creative_Ranged_Flashlight::CallFunc_GetCurrentSourceWeapon_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Creative_Ranged_Flashlight_C_ExecuteUbergraph_GA_Creative_Ranged_Flashlight, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000010, "Member 'GA_Creative_Ranged_Flashlight_C_ExecuteUbergraph_GA_Creative_Ranged_Flashlight::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Creative_Ranged_Flashlight_C_ExecuteUbergraph_GA_Creative_Ranged_Flashlight, CallFunc_SelectFloat_ReturnValue) == 0x000018, "Member 'GA_Creative_Ranged_Flashlight_C_ExecuteUbergraph_GA_Creative_Ranged_Flashlight::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Creative_Ranged_Flashlight_C_ExecuteUbergraph_GA_Creative_Ranged_Flashlight, CallFunc_MakeGameplayCueParameters_ReturnValue) == 0x000020, "Member 'GA_Creative_Ranged_Flashlight_C_ExecuteUbergraph_GA_Creative_Ranged_Flashlight::CallFunc_MakeGameplayCueParameters_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Creative_Ranged_Flashlight_C_ExecuteUbergraph_GA_Creative_Ranged_Flashlight, CallFunc_Not_PreBool_ReturnValue) == 0x0000D8, "Member 'GA_Creative_Ranged_Flashlight_C_ExecuteUbergraph_GA_Creative_Ranged_Flashlight::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

}

