#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Dudebro_Vortex

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GA_Dudebro_Vortex.GA_DudeBro_Vortex_C.ExecuteUbergraph_GA_DudeBro_Vortex
// 0x0650 (0x0650 - 0x0000)
struct GA_DudeBro_Vortex_C_ExecuteUbergraph_GA_DudeBro_Vortex final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_CustomEvent_Payload_2;                      // 0x0008(0x00B0)()
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate;              // 0x00B8(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayEventData                     Temp_struct_Variable;                              // 0x00C8(0x00B0)()
	class UAbilityTask_WaitGameplayEvent*         CallFunc_WaitGameplayEvent_ReturnValue;            // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_181[0x3];                                      // 0x0181(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0184(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_194[0x4];                                      // 0x0194(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_CustomEvent_Payload_1;                      // 0x0198(0x00B0)()
	struct FGameplayEventData                     Temp_struct_Variable_1;                            // 0x0248(0x00B0)()
	class UAbilityTask_WaitGameplayEvent*         CallFunc_WaitGameplayEvent_ReturnValue_1;          // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_301[0x3];                                      // 0x0301(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0304(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_314[0x4];                                      // 0x0314(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_CustomEvent_Payload;                        // 0x0318(0x00B0)()
	struct FGameplayEventData                     Temp_struct_Variable_2;                            // 0x03C8(0x00B0)()
	class UAbilityTask_WaitGameplayEvent*         CallFunc_WaitGameplayEvent_ReturnValue_2;          // 0x0478(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0480(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_481[0x7];                                      // 0x0481(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityActorInfo              CallFunc_GetActorInfo_ReturnValue;                 // 0x0488(0x0040)(ContainsInstancedReference)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x04C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C9[0x7];                                      // 0x04C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x04D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x04D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x04D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DA[0x6];                                      // 0x04DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityActorInfo              CallFunc_GetActorInfo_ReturnValue_1;               // 0x04E0(0x0040)(ContainsInstancedReference)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn_1;           // 0x0520(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0528(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_529[0x7];                                      // 0x0529(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_CustomEvent_HitComponent;                   // 0x0530(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_OtherActor;                     // 0x0538(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_CustomEvent_OtherComp;                      // 0x0540(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_NormalImpulse;                  // 0x0548(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_CustomEvent_Hit;                            // 0x0554(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x05DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5DD[0x3];                                      // 0x05DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABuildingActor*                         K2Node_DynamicCast_AsBuilding_Actor;               // 0x05E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x05E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E9[0x7];                                      // 0x05E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x05F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, struct FHitResult& Hit)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x05F8(0x0010)(ZeroConstructor, NoDestructor)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_1;  // 0x0608(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, struct FHitResult& Hit)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x0610(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayEffectContextHandle           CallFunc_MakeEffectContext_ReturnValue;            // 0x0620(0x0018)()
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x0638(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, struct FHitResult& Hit)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x0640(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(GA_DudeBro_Vortex_C_ExecuteUbergraph_GA_DudeBro_Vortex) == 0x000008, "Wrong alignment on GA_DudeBro_Vortex_C_ExecuteUbergraph_GA_DudeBro_Vortex");
static_assert(sizeof(GA_DudeBro_Vortex_C_ExecuteUbergraph_GA_DudeBro_Vortex) == 0x000650, "Wrong size on GA_DudeBro_Vortex_C_ExecuteUbergraph_GA_DudeBro_Vortex");
static_assert(offsetof(GA_DudeBro_Vortex_C_ExecuteUbergraph_GA_DudeBro_Vortex, EntryPoint) == 0x000000, "Member 'GA_DudeBro_Vortex_C_ExecuteUbergraph_GA_DudeBro_Vortex::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_DudeBro_Vortex_C_ExecuteUbergraph_GA_DudeBro_Vortex, K2Node_CustomEvent_Payload_2) == 0x000008, "Member 'GA_DudeBro_Vortex_C_ExecuteUbergraph_GA_DudeBro_Vortex::K2Node_CustomEvent_Payload_2' has a wrong offset!");
static_assert(offsetof(GA_DudeBro_Vortex_C_ExecuteUbergraph_GA_DudeBro_Vortex, K2Node_CreateDelegate_OutputDelegate) == 0x0000B8, "Member 'GA_DudeBro_Vortex_C_ExecuteUbergraph_GA_DudeBro_Vortex::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_DudeBro_Vortex_C_ExecuteUbergraph_GA_DudeBro_Vortex, Temp_struct_Variable) == 0x0000C8, "Member 'GA_DudeBro_Vortex_C_ExecuteUbergraph_GA_DudeBro_Vortex::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_DudeBro_Vortex_C_ExecuteUbergraph_GA_DudeBro_Vortex, CallFunc_WaitGameplayEvent_ReturnValue) == 0x000178, "Member 'GA_DudeBro_Vortex_C_ExecuteUbergraph_GA_DudeBro_Vortex::CallFunc_WaitGameplayEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_DudeBro_Vortex_C_ExecuteUbergraph_GA_DudeBro_Vortex, CallFunc_IsValid_ReturnValue) == 0x000180, "Member 'GA_DudeBro_Vortex_C_ExecuteUbergraph_GA_DudeBro_Vortex::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_DudeBro_Vortex_C_ExecuteUbergraph_GA_DudeBro_Vortex, K2Node_CreateDelegate_OutputDelegate_1) == 0x000184, "Member 'GA_DudeBro_Vortex_C_ExecuteUbergraph_GA_DudeBro_Vortex::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_DudeBro_Vortex_C_ExecuteUbergraph_GA_DudeBro_Vortex, K2Node_CustomEvent_Payload_1) == 0x000198, "Member 'GA_DudeBro_Vortex_C_ExecuteUbergraph_GA_DudeBro_Vortex::K2Node_CustomEvent_Payload_1' has a wrong offset!");
static_assert(offsetof(GA_DudeBro_Vortex_C_ExecuteUbergraph_GA_DudeBro_Vortex, Temp_struct_Variable_1) == 0x000248, "Member 'GA_DudeBro_Vortex_C_ExecuteUbergraph_GA_DudeBro_Vortex::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_DudeBro_Vortex_C_ExecuteUbergraph_GA_DudeBro_Vortex, CallFunc_WaitGameplayEvent_ReturnValue_1) == 0x0002F8, "Member 'GA_DudeBro_Vortex_C_ExecuteUbergraph_GA_DudeBro_Vortex::CallFunc_WaitGameplayEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_DudeBro_Vortex_C_ExecuteUbergraph_GA_DudeBro_Vortex, CallFunc_IsValid_ReturnValue_1) == 0x000300, "Member 'GA_DudeBro_Vortex_C_ExecuteUbergraph_GA_DudeBro_Vortex::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_DudeBro_Vortex_C_ExecuteUbergraph_GA_DudeBro_Vortex, K2Node_CreateDelegate_OutputDelegate_2) == 0x000304, "Member 'GA_DudeBro_Vortex_C_ExecuteUbergraph_GA_DudeBro_Vortex::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_DudeBro_Vortex_C_ExecuteUbergraph_GA_DudeBro_Vortex, K2Node_CustomEvent_Payload) == 0x000318, "Member 'GA_DudeBro_Vortex_C_ExecuteUbergraph_GA_DudeBro_Vortex::K2Node_CustomEvent_Payload' has a wrong offset!");
static_assert(offsetof(GA_DudeBro_Vortex_C_ExecuteUbergraph_GA_DudeBro_Vortex, Temp_struct_Variable_2) == 0x0003C8, "Member 'GA_DudeBro_Vortex_C_ExecuteUbergraph_GA_DudeBro_Vortex::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(GA_DudeBro_Vortex_C_ExecuteUbergraph_GA_DudeBro_Vortex, CallFunc_WaitGameplayEvent_ReturnValue_2) == 0x000478, "Member 'GA_DudeBro_Vortex_C_ExecuteUbergraph_GA_DudeBro_Vortex::CallFunc_WaitGameplayEvent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_DudeBro_Vortex_C_ExecuteUbergraph_GA_DudeBro_Vortex, CallFunc_IsValid_ReturnValue_2) == 0x000480, "Member 'GA_DudeBro_Vortex_C_ExecuteUbergraph_GA_DudeBro_Vortex::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_DudeBro_Vortex_C_ExecuteUbergraph_GA_DudeBro_Vortex, CallFunc_GetActorInfo_ReturnValue) == 0x000488, "Member 'GA_DudeBro_Vortex_C_ExecuteUbergraph_GA_DudeBro_Vortex::CallFunc_GetActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_DudeBro_Vortex_C_ExecuteUbergraph_GA_DudeBro_Vortex, K2Node_Event_bWasCancelled) == 0x0004C8, "Member 'GA_DudeBro_Vortex_C_ExecuteUbergraph_GA_DudeBro_Vortex::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_DudeBro_Vortex_C_ExecuteUbergraph_GA_DudeBro_Vortex, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x0004D0, "Member 'GA_DudeBro_Vortex_C_ExecuteUbergraph_GA_DudeBro_Vortex::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(GA_DudeBro_Vortex_C_ExecuteUbergraph_GA_DudeBro_Vortex, K2Node_DynamicCast_bSuccess) == 0x0004D8, "Member 'GA_DudeBro_Vortex_C_ExecuteUbergraph_GA_DudeBro_Vortex::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_DudeBro_Vortex_C_ExecuteUbergraph_GA_DudeBro_Vortex, CallFunc_IsValid_ReturnValue_3) == 0x0004D9, "Member 'GA_DudeBro_Vortex_C_ExecuteUbergraph_GA_DudeBro_Vortex::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_DudeBro_Vortex_C_ExecuteUbergraph_GA_DudeBro_Vortex, CallFunc_GetActorInfo_ReturnValue_1) == 0x0004E0, "Member 'GA_DudeBro_Vortex_C_ExecuteUbergraph_GA_DudeBro_Vortex::CallFunc_GetActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_DudeBro_Vortex_C_ExecuteUbergraph_GA_DudeBro_Vortex, K2Node_DynamicCast_AsFort_Player_Pawn_1) == 0x000520, "Member 'GA_DudeBro_Vortex_C_ExecuteUbergraph_GA_DudeBro_Vortex::K2Node_DynamicCast_AsFort_Player_Pawn_1' has a wrong offset!");
static_assert(offsetof(GA_DudeBro_Vortex_C_ExecuteUbergraph_GA_DudeBro_Vortex, K2Node_DynamicCast_bSuccess_1) == 0x000528, "Member 'GA_DudeBro_Vortex_C_ExecuteUbergraph_GA_DudeBro_Vortex::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_DudeBro_Vortex_C_ExecuteUbergraph_GA_DudeBro_Vortex, K2Node_CustomEvent_HitComponent) == 0x000530, "Member 'GA_DudeBro_Vortex_C_ExecuteUbergraph_GA_DudeBro_Vortex::K2Node_CustomEvent_HitComponent' has a wrong offset!");
static_assert(offsetof(GA_DudeBro_Vortex_C_ExecuteUbergraph_GA_DudeBro_Vortex, K2Node_CustomEvent_OtherActor) == 0x000538, "Member 'GA_DudeBro_Vortex_C_ExecuteUbergraph_GA_DudeBro_Vortex::K2Node_CustomEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(GA_DudeBro_Vortex_C_ExecuteUbergraph_GA_DudeBro_Vortex, K2Node_CustomEvent_OtherComp) == 0x000540, "Member 'GA_DudeBro_Vortex_C_ExecuteUbergraph_GA_DudeBro_Vortex::K2Node_CustomEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(GA_DudeBro_Vortex_C_ExecuteUbergraph_GA_DudeBro_Vortex, K2Node_CustomEvent_NormalImpulse) == 0x000548, "Member 'GA_DudeBro_Vortex_C_ExecuteUbergraph_GA_DudeBro_Vortex::K2Node_CustomEvent_NormalImpulse' has a wrong offset!");
static_assert(offsetof(GA_DudeBro_Vortex_C_ExecuteUbergraph_GA_DudeBro_Vortex, K2Node_CustomEvent_Hit) == 0x000554, "Member 'GA_DudeBro_Vortex_C_ExecuteUbergraph_GA_DudeBro_Vortex::K2Node_CustomEvent_Hit' has a wrong offset!");
static_assert(offsetof(GA_DudeBro_Vortex_C_ExecuteUbergraph_GA_DudeBro_Vortex, CallFunc_HasAuthority_ReturnValue) == 0x0005DC, "Member 'GA_DudeBro_Vortex_C_ExecuteUbergraph_GA_DudeBro_Vortex::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_DudeBro_Vortex_C_ExecuteUbergraph_GA_DudeBro_Vortex, K2Node_DynamicCast_AsBuilding_Actor) == 0x0005E0, "Member 'GA_DudeBro_Vortex_C_ExecuteUbergraph_GA_DudeBro_Vortex::K2Node_DynamicCast_AsBuilding_Actor' has a wrong offset!");
static_assert(offsetof(GA_DudeBro_Vortex_C_ExecuteUbergraph_GA_DudeBro_Vortex, K2Node_DynamicCast_bSuccess_2) == 0x0005E8, "Member 'GA_DudeBro_Vortex_C_ExecuteUbergraph_GA_DudeBro_Vortex::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(GA_DudeBro_Vortex_C_ExecuteUbergraph_GA_DudeBro_Vortex, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x0005F0, "Member 'GA_DudeBro_Vortex_C_ExecuteUbergraph_GA_DudeBro_Vortex::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_DudeBro_Vortex_C_ExecuteUbergraph_GA_DudeBro_Vortex, K2Node_CreateDelegate_OutputDelegate_3) == 0x0005F8, "Member 'GA_DudeBro_Vortex_C_ExecuteUbergraph_GA_DudeBro_Vortex::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GA_DudeBro_Vortex_C_ExecuteUbergraph_GA_DudeBro_Vortex, CallFunc_GetAbilitySystemComponent_ReturnValue_1) == 0x000608, "Member 'GA_DudeBro_Vortex_C_ExecuteUbergraph_GA_DudeBro_Vortex::CallFunc_GetAbilitySystemComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_DudeBro_Vortex_C_ExecuteUbergraph_GA_DudeBro_Vortex, K2Node_CreateDelegate_OutputDelegate_4) == 0x000610, "Member 'GA_DudeBro_Vortex_C_ExecuteUbergraph_GA_DudeBro_Vortex::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(GA_DudeBro_Vortex_C_ExecuteUbergraph_GA_DudeBro_Vortex, CallFunc_MakeEffectContext_ReturnValue) == 0x000620, "Member 'GA_DudeBro_Vortex_C_ExecuteUbergraph_GA_DudeBro_Vortex::CallFunc_MakeEffectContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_DudeBro_Vortex_C_ExecuteUbergraph_GA_DudeBro_Vortex, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x000638, "Member 'GA_DudeBro_Vortex_C_ExecuteUbergraph_GA_DudeBro_Vortex::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_DudeBro_Vortex_C_ExecuteUbergraph_GA_DudeBro_Vortex, K2Node_CreateDelegate_OutputDelegate_5) == 0x000640, "Member 'GA_DudeBro_Vortex_C_ExecuteUbergraph_GA_DudeBro_Vortex::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");

// Function GA_Dudebro_Vortex.GA_DudeBro_Vortex_C.PlayerCapsuleHit
// 0x00B0 (0x00B0 - 0x0000)
struct GA_DudeBro_Vortex_C_PlayerCapsuleHit final
{
public:
	class UPrimitiveComponent*                    HitComponent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NormalImpulse;                                     // 0x0018(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0024(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(GA_DudeBro_Vortex_C_PlayerCapsuleHit) == 0x000008, "Wrong alignment on GA_DudeBro_Vortex_C_PlayerCapsuleHit");
static_assert(sizeof(GA_DudeBro_Vortex_C_PlayerCapsuleHit) == 0x0000B0, "Wrong size on GA_DudeBro_Vortex_C_PlayerCapsuleHit");
static_assert(offsetof(GA_DudeBro_Vortex_C_PlayerCapsuleHit, HitComponent) == 0x000000, "Member 'GA_DudeBro_Vortex_C_PlayerCapsuleHit::HitComponent' has a wrong offset!");
static_assert(offsetof(GA_DudeBro_Vortex_C_PlayerCapsuleHit, OtherActor) == 0x000008, "Member 'GA_DudeBro_Vortex_C_PlayerCapsuleHit::OtherActor' has a wrong offset!");
static_assert(offsetof(GA_DudeBro_Vortex_C_PlayerCapsuleHit, OtherComp) == 0x000010, "Member 'GA_DudeBro_Vortex_C_PlayerCapsuleHit::OtherComp' has a wrong offset!");
static_assert(offsetof(GA_DudeBro_Vortex_C_PlayerCapsuleHit, NormalImpulse) == 0x000018, "Member 'GA_DudeBro_Vortex_C_PlayerCapsuleHit::NormalImpulse' has a wrong offset!");
static_assert(offsetof(GA_DudeBro_Vortex_C_PlayerCapsuleHit, Hit) == 0x000024, "Member 'GA_DudeBro_Vortex_C_PlayerCapsuleHit::Hit' has a wrong offset!");

// Function GA_Dudebro_Vortex.GA_DudeBro_Vortex_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_DudeBro_Vortex_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_DudeBro_Vortex_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_DudeBro_Vortex_C_K2_OnEndAbility");
static_assert(sizeof(GA_DudeBro_Vortex_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_DudeBro_Vortex_C_K2_OnEndAbility");
static_assert(offsetof(GA_DudeBro_Vortex_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_DudeBro_Vortex_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GA_Dudebro_Vortex.GA_DudeBro_Vortex_C.EventReceived_0A7014874570D996FD13889185F02E0A
// 0x00B0 (0x00B0 - 0x0000)
struct GA_DudeBro_Vortex_C_EventReceived_0A7014874570D996FD13889185F02E0A final
{
public:
	struct FGameplayEventData                     Payload;                                           // 0x0000(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_DudeBro_Vortex_C_EventReceived_0A7014874570D996FD13889185F02E0A) == 0x000008, "Wrong alignment on GA_DudeBro_Vortex_C_EventReceived_0A7014874570D996FD13889185F02E0A");
static_assert(sizeof(GA_DudeBro_Vortex_C_EventReceived_0A7014874570D996FD13889185F02E0A) == 0x0000B0, "Wrong size on GA_DudeBro_Vortex_C_EventReceived_0A7014874570D996FD13889185F02E0A");
static_assert(offsetof(GA_DudeBro_Vortex_C_EventReceived_0A7014874570D996FD13889185F02E0A, Payload) == 0x000000, "Member 'GA_DudeBro_Vortex_C_EventReceived_0A7014874570D996FD13889185F02E0A::Payload' has a wrong offset!");

// Function GA_Dudebro_Vortex.GA_DudeBro_Vortex_C.EventReceived_600270C649671D219DB85584BE0265BC
// 0x00B0 (0x00B0 - 0x0000)
struct GA_DudeBro_Vortex_C_EventReceived_600270C649671D219DB85584BE0265BC final
{
public:
	struct FGameplayEventData                     Payload;                                           // 0x0000(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_DudeBro_Vortex_C_EventReceived_600270C649671D219DB85584BE0265BC) == 0x000008, "Wrong alignment on GA_DudeBro_Vortex_C_EventReceived_600270C649671D219DB85584BE0265BC");
static_assert(sizeof(GA_DudeBro_Vortex_C_EventReceived_600270C649671D219DB85584BE0265BC) == 0x0000B0, "Wrong size on GA_DudeBro_Vortex_C_EventReceived_600270C649671D219DB85584BE0265BC");
static_assert(offsetof(GA_DudeBro_Vortex_C_EventReceived_600270C649671D219DB85584BE0265BC, Payload) == 0x000000, "Member 'GA_DudeBro_Vortex_C_EventReceived_600270C649671D219DB85584BE0265BC::Payload' has a wrong offset!");

// Function GA_Dudebro_Vortex.GA_DudeBro_Vortex_C.EventReceived_C064A1B545D792D62509919D8FFE8FBD
// 0x00B0 (0x00B0 - 0x0000)
struct GA_DudeBro_Vortex_C_EventReceived_C064A1B545D792D62509919D8FFE8FBD final
{
public:
	struct FGameplayEventData                     Payload;                                           // 0x0000(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_DudeBro_Vortex_C_EventReceived_C064A1B545D792D62509919D8FFE8FBD) == 0x000008, "Wrong alignment on GA_DudeBro_Vortex_C_EventReceived_C064A1B545D792D62509919D8FFE8FBD");
static_assert(sizeof(GA_DudeBro_Vortex_C_EventReceived_C064A1B545D792D62509919D8FFE8FBD) == 0x0000B0, "Wrong size on GA_DudeBro_Vortex_C_EventReceived_C064A1B545D792D62509919D8FFE8FBD");
static_assert(offsetof(GA_DudeBro_Vortex_C_EventReceived_C064A1B545D792D62509919D8FFE8FBD, Payload) == 0x000000, "Member 'GA_DudeBro_Vortex_C_EventReceived_C064A1B545D792D62509919D8FFE8FBD::Payload' has a wrong offset!");

}

