#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_DefaultPlayer_Death

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "GAB_GenericDeath_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_DefaultPlayer_Death.GA_DefaultPlayer_Death_C
// 0x0018 (0x0B10 - 0x0AF8)
class UGA_DefaultPlayer_Death_C final : public UGAB_GenericDeath_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_DefaultPlayer_Death_C;           // 0x0AF8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FGameplayTag                           FadeCapsuleStWCue;                                 // 0x0B00(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           FadeCapsuleAthenaCue;                              // 0x0B08(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_DefaultPlayer_Death(int32 EntryPoint);
	void PickDeathMontageSection();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_DefaultPlayer_Death_C">();
	}
	static class UGA_DefaultPlayer_Death_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_DefaultPlayer_Death_C>();
	}
};
static_assert(alignof(UGA_DefaultPlayer_Death_C) == 0x000008, "Wrong alignment on UGA_DefaultPlayer_Death_C");
static_assert(sizeof(UGA_DefaultPlayer_Death_C) == 0x000B10, "Wrong size on UGA_DefaultPlayer_Death_C");
static_assert(offsetof(UGA_DefaultPlayer_Death_C, UberGraphFrame_GA_DefaultPlayer_Death_C) == 0x000AF8, "Member 'UGA_DefaultPlayer_Death_C::UberGraphFrame_GA_DefaultPlayer_Death_C' has a wrong offset!");
static_assert(offsetof(UGA_DefaultPlayer_Death_C, FadeCapsuleStWCue) == 0x000B00, "Member 'UGA_DefaultPlayer_Death_C::FadeCapsuleStWCue' has a wrong offset!");
static_assert(offsetof(UGA_DefaultPlayer_Death_C, FadeCapsuleAthenaCue) == 0x000B08, "Member 'UGA_DefaultPlayer_Death_C::FadeCapsuleAthenaCue' has a wrong offset!");

}

