#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_SpookyMist_Travel

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GA_SpookyMist_Travel.GA_SpookyMist_Travel_C.ExecuteUbergraph_GA_SpookyMist_Travel
// 0x08F0 (0x08F0 - 0x0000)
struct GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData;                     // 0x0008(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag;                 // 0x0030(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate;              // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x0048(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable_1;                            // 0x0050(0x0028)()
	struct FGameplayEventData                     K2Node_CustomEvent_Payload;                        // 0x0078(0x00B0)()
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0128(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayEventData                     Temp_struct_Variable_2;                            // 0x0138(0x00B0)()
	class UAbilityTask_WaitGameplayEvent*         CallFunc_WaitGameplayEvent_ReturnValue;            // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F1[0x3];                                      // 0x01F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x01F4(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_204[0x4];                                      // 0x0204(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0208(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	TArray<class AActor*>                         Temp_object_Variable_1;                            // 0x0218(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x0238(0x00B0)(ConstParm)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawnAthena*                  K2Node_DynamicCast_AsFort_Player_Pawn_Athena;      // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x02F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2FA[0x2];                                      // 0x02FA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x02FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0300(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_314[0x4];                                      // 0x0314(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData_1;                   // 0x0318(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag_1;               // 0x0340(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0348(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34C[0x4];                                      // 0x034C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAbilityTask_PlayMontageWaitTarget* CallFunc_PlayMontageWaitTarget_ReturnValue;        // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_359[0x3];                                      // 0x0359(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x035C(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0364(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_1;            // 0x0368(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x036C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0378(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0384(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0390(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x039C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_3AC[0x4];                                      // 0x03AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FHitResult>                     CallFunc_CapsuleTraceMultiForObjects_OutHits;      // 0x03B0(0x0010)(ZeroConstructor, ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_CapsuleTraceMultiForObjects_ReturnValue;  // 0x03C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C1[0x7];                                      // 0x03C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x03C8(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_Array_Get_Item;                           // 0x03D0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0458(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x045C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x045D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45E[0x2];                                      // 0x045E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0460(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0464(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0468(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0474(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0480(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x048C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0498(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x04A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x04A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x04B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x04B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x04BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x04C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x04CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x04D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D9[0x7];                                      // 0x04D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABuildingActor*                         K2Node_DynamicCast_AsBuilding_Actor;               // 0x04E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x04E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E9[0x7];                                      // 0x04E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_DeimosRift_C*                       K2Node_DynamicCast_AsBP_Deimos_Rift;               // 0x04F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x04F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F9[0x7];                                      // 0x04F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AB_Athena_VendingMachine_C*             K2Node_DynamicCast_AsB_Athena_Vending_Machine;     // 0x0500(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0508(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_509[0x7];                                      // 0x0509(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACornField_Rectangle_C*                 K2Node_DynamicCast_AsCorn_Field_Rectangle;         // 0x0510(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0518(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_519[0x3];                                      // 0x0519(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorEyesViewPoint_OutLocation;        // 0x051C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetActorEyesViewPoint_OutRotation;        // 0x0528(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_2;            // 0x0534(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_RotatorToVector_ReturnValue;         // 0x0538(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0544(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0548(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x054C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0550(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0554(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_555[0x3];                                      // 0x0555(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x0558(0x0010)(ZeroConstructor, NoDestructor)
	struct FVector                                CallFunc_SetDashStartEndAndDirection_StartPoint;   // 0x0568(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SetDashStartEndAndDirection_EndPoint;     // 0x0574(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SetDashStartEndAndDirection_Direction;    // 0x0580(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58C[0x4];                                      // 0x058C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_ApplyRootMotionConstantForce* CallFunc_ApplyRootMotionConstantForce_ReturnValue; // 0x0590(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PlayerCapsuleSizes_Radius;                // 0x0598(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PlayerCapsuleSizes_HalfHeight;            // 0x059C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x05A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A1[0x7];                                      // 0x05A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData_2;                   // 0x05A8(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag_2;               // 0x05D0(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x05D8(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x05E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x05EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x05F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F1[0x3];                                      // 0x05F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_1; // 0x05F4(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue_1;      // 0x05FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0608(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0614(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0620(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62C[0x4];                                      // 0x062C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FHitResult>                     CallFunc_CapsuleTraceMultiForObjects_OutHits_1;    // 0x0630(0x0010)(ZeroConstructor, ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_CapsuleTraceMultiForObjects_ReturnValue_1; // 0x0640(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_641[0x3];                                      // 0x0641(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_Array_Get_Item_1;                         // 0x0644(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x06CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_1;            // 0x06D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_1;         // 0x06D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D2[0x2];                                      // 0x06D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_1;                    // 0x06D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_1;                // 0x06D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location_1;                // 0x06DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_1;             // 0x06E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_1;                  // 0x06F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_1;            // 0x0700(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_70C[0x4];                                      // 0x070C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_1;                 // 0x0710(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_1;                // 0x0718(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_1;            // 0x0720(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_1;             // 0x0728(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_1;                 // 0x0730(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_1;               // 0x0734(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart_1;              // 0x0738(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_1;                // 0x0744(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0750(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_751[0x7];                                      // 0x0751(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABuildingActor*                         K2Node_DynamicCast_AsBuilding_Actor_1;             // 0x0758(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0760(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_761[0x7];                                      // 0x0761(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_DeimosRift_C*                       K2Node_DynamicCast_AsBP_Deimos_Rift_1;             // 0x0768(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0770(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_771[0x7];                                      // 0x0771(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACornField_Rectangle_C*                 K2Node_DynamicCast_AsCorn_Field_Rectangle_1;       // 0x0778(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0780(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_781[0x7];                                      // 0x0781(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable_2;                            // 0x0788(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	TArray<struct FHitResult>                     CallFunc_CapsuleTraceMultiForObjects_OutHits_2;    // 0x0798(0x0010)(ZeroConstructor, ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_CapsuleTraceMultiForObjects_ReturnValue_2; // 0x07A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7A9[0x3];                                      // 0x07A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_Array_Get_Item_2;                         // 0x07AC(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0834(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_2;            // 0x0838(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_2;         // 0x0839(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_83A[0x2];                                      // 0x083A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_2;                    // 0x083C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_2;                // 0x0840(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location_2;                // 0x0844(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_2;             // 0x0850(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_2;                  // 0x085C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_2;            // 0x0868(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_874[0x4];                                      // 0x0874(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_2;                 // 0x0878(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_2;                // 0x0880(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_2;            // 0x0888(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_2;             // 0x0890(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_2;                 // 0x0898(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_2;               // 0x089C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart_2;              // 0x08A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_2;                // 0x08AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x08B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8B9[0x7];                                      // 0x08B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABuildingActor*                         K2Node_DynamicCast_AsBuilding_Actor_2;             // 0x08C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x08C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8C9[0x7];                                      // 0x08C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_DeimosRift_C*                       K2Node_DynamicCast_AsBP_Deimos_Rift_2;             // 0x08D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x08D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D9[0x7];                                      // 0x08D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AB_Athena_VendingMachine_C*             K2Node_DynamicCast_AsB_Athena_Vending_Machine_1;   // 0x08E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_10;                    // 0x08E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel) == 0x000008, "Wrong alignment on GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel");
static_assert(sizeof(GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel) == 0x0008F0, "Wrong size on GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel");
static_assert(offsetof(GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel, EntryPoint) == 0x000000, "Member 'GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel, K2Node_CustomEvent_TargetData) == 0x000008, "Member 'GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel::K2Node_CustomEvent_TargetData' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel, K2Node_CustomEvent_ApplicationTag) == 0x000030, "Member 'GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel::K2Node_CustomEvent_ApplicationTag' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel, K2Node_CreateDelegate_OutputDelegate) == 0x000038, "Member 'GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel, Temp_struct_Variable) == 0x000048, "Member 'GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel, Temp_struct_Variable_1) == 0x000050, "Member 'GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel, K2Node_CustomEvent_Payload) == 0x000078, "Member 'GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel::K2Node_CustomEvent_Payload' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel, K2Node_CreateDelegate_OutputDelegate_1) == 0x000128, "Member 'GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel, Temp_struct_Variable_2) == 0x000138, "Member 'GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel, CallFunc_WaitGameplayEvent_ReturnValue) == 0x0001E8, "Member 'GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel::CallFunc_WaitGameplayEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel, CallFunc_IsValid_ReturnValue) == 0x0001F0, "Member 'GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel, K2Node_CreateDelegate_OutputDelegate_2) == 0x0001F4, "Member 'GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel, Temp_object_Variable) == 0x000208, "Member 'GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel, Temp_object_Variable_1) == 0x000218, "Member 'GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel, Temp_int_Array_Index_Variable) == 0x000228, "Member 'GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel, Temp_int_Loop_Counter_Variable) == 0x00022C, "Member 'GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel, CallFunc_Add_IntInt_ReturnValue) == 0x000230, "Member 'GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel, Temp_int_Array_Index_Variable_1) == 0x000234, "Member 'GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel, K2Node_Event_EventData) == 0x000238, "Member 'GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel::K2Node_Event_EventData' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x0002E8, "Member 'GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel, K2Node_DynamicCast_AsFort_Player_Pawn_Athena) == 0x0002F0, "Member 'GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel::K2Node_DynamicCast_AsFort_Player_Pawn_Athena' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel, K2Node_DynamicCast_bSuccess) == 0x0002F8, "Member 'GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel, K2Node_Event_bWasCancelled) == 0x0002F9, "Member 'GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel, Temp_int_Loop_Counter_Variable_1) == 0x0002FC, "Member 'GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel, K2Node_CreateDelegate_OutputDelegate_3) == 0x000300, "Member 'GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel, CallFunc_Add_IntInt_ReturnValue_1) == 0x000310, "Member 'GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel, K2Node_CustomEvent_TargetData_1) == 0x000318, "Member 'GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel::K2Node_CustomEvent_TargetData_1' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel, K2Node_CustomEvent_ApplicationTag_1) == 0x000340, "Member 'GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel::K2Node_CustomEvent_ApplicationTag_1' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel, Temp_int_Array_Index_Variable_2) == 0x000348, "Member 'GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel, CallFunc_PlayMontageWaitTarget_ReturnValue) == 0x000350, "Member 'GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel::CallFunc_PlayMontageWaitTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel, CallFunc_IsValid_ReturnValue_1) == 0x000358, "Member 'GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x00035C, "Member 'GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel, CallFunc_GetValueAtLevel_ReturnValue) == 0x000364, "Member 'GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel, CallFunc_GetValueAtLevel_ReturnValue_1) == 0x000368, "Member 'GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel::CallFunc_GetValueAtLevel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel, CallFunc_GetActorForwardVector_ReturnValue) == 0x00036C, "Member 'GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000378, "Member 'GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000384, "Member 'GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel, CallFunc_Add_VectorVector_ReturnValue) == 0x000390, "Member 'GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel, K2Node_CreateDelegate_OutputDelegate_4) == 0x00039C, "Member 'GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel, CallFunc_CapsuleTraceMultiForObjects_OutHits) == 0x0003B0, "Member 'GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel::CallFunc_CapsuleTraceMultiForObjects_OutHits' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel, CallFunc_CapsuleTraceMultiForObjects_ReturnValue) == 0x0003C0, "Member 'GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel::CallFunc_CapsuleTraceMultiForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0003C8, "Member 'GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel, CallFunc_Array_Get_Item) == 0x0003D0, "Member 'GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel, CallFunc_Array_Length_ReturnValue) == 0x000458, "Member 'GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel, CallFunc_BreakHitResult_bBlockingHit) == 0x00045C, "Member 'GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel, CallFunc_BreakHitResult_bInitialOverlap) == 0x00045D, "Member 'GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel, CallFunc_BreakHitResult_Time) == 0x000460, "Member 'GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel, CallFunc_BreakHitResult_Distance) == 0x000464, "Member 'GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel, CallFunc_BreakHitResult_Location) == 0x000468, "Member 'GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel, CallFunc_BreakHitResult_ImpactPoint) == 0x000474, "Member 'GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel, CallFunc_BreakHitResult_Normal) == 0x000480, "Member 'GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel, CallFunc_BreakHitResult_ImpactNormal) == 0x00048C, "Member 'GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel, CallFunc_BreakHitResult_PhysMat) == 0x000498, "Member 'GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel, CallFunc_BreakHitResult_HitActor) == 0x0004A0, "Member 'GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel, CallFunc_BreakHitResult_HitComponent) == 0x0004A8, "Member 'GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel, CallFunc_BreakHitResult_HitBoneName) == 0x0004B0, "Member 'GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel, CallFunc_BreakHitResult_HitItem) == 0x0004B8, "Member 'GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel, CallFunc_BreakHitResult_FaceIndex) == 0x0004BC, "Member 'GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel, CallFunc_BreakHitResult_TraceStart) == 0x0004C0, "Member 'GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel, CallFunc_BreakHitResult_TraceEnd) == 0x0004CC, "Member 'GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel, CallFunc_Less_IntInt_ReturnValue) == 0x0004D8, "Member 'GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel, K2Node_DynamicCast_AsBuilding_Actor) == 0x0004E0, "Member 'GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel::K2Node_DynamicCast_AsBuilding_Actor' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel, K2Node_DynamicCast_bSuccess_1) == 0x0004E8, "Member 'GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel, K2Node_DynamicCast_AsBP_Deimos_Rift) == 0x0004F0, "Member 'GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel::K2Node_DynamicCast_AsBP_Deimos_Rift' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel, K2Node_DynamicCast_bSuccess_2) == 0x0004F8, "Member 'GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel, K2Node_DynamicCast_AsB_Athena_Vending_Machine) == 0x000500, "Member 'GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel::K2Node_DynamicCast_AsB_Athena_Vending_Machine' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel, K2Node_DynamicCast_bSuccess_3) == 0x000508, "Member 'GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel, K2Node_DynamicCast_AsCorn_Field_Rectangle) == 0x000510, "Member 'GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel::K2Node_DynamicCast_AsCorn_Field_Rectangle' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel, K2Node_DynamicCast_bSuccess_4) == 0x000518, "Member 'GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel, CallFunc_GetActorEyesViewPoint_OutLocation) == 0x00051C, "Member 'GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel::CallFunc_GetActorEyesViewPoint_OutLocation' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel, CallFunc_GetActorEyesViewPoint_OutRotation) == 0x000528, "Member 'GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel::CallFunc_GetActorEyesViewPoint_OutRotation' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel, CallFunc_GetValueAtLevel_ReturnValue_2) == 0x000534, "Member 'GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel::CallFunc_GetValueAtLevel_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel, CallFunc_Conv_RotatorToVector_ReturnValue) == 0x000538, "Member 'GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel::CallFunc_Conv_RotatorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel, CallFunc_BreakVector_X) == 0x000544, "Member 'GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel, CallFunc_BreakVector_Y) == 0x000548, "Member 'GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel, CallFunc_BreakVector_Z) == 0x00054C, "Member 'GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000550, "Member 'GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000554, "Member 'GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel, K2Node_CreateDelegate_OutputDelegate_5) == 0x000558, "Member 'GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel, CallFunc_SetDashStartEndAndDirection_StartPoint) == 0x000568, "Member 'GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel::CallFunc_SetDashStartEndAndDirection_StartPoint' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel, CallFunc_SetDashStartEndAndDirection_EndPoint) == 0x000574, "Member 'GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel::CallFunc_SetDashStartEndAndDirection_EndPoint' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel, CallFunc_SetDashStartEndAndDirection_Direction) == 0x000580, "Member 'GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel::CallFunc_SetDashStartEndAndDirection_Direction' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel, CallFunc_ApplyRootMotionConstantForce_ReturnValue) == 0x000590, "Member 'GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel::CallFunc_ApplyRootMotionConstantForce_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel, CallFunc_PlayerCapsuleSizes_Radius) == 0x000598, "Member 'GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel::CallFunc_PlayerCapsuleSizes_Radius' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel, CallFunc_PlayerCapsuleSizes_HalfHeight) == 0x00059C, "Member 'GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel::CallFunc_PlayerCapsuleSizes_HalfHeight' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel, CallFunc_IsValid_ReturnValue_2) == 0x0005A0, "Member 'GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel, K2Node_CustomEvent_TargetData_2) == 0x0005A8, "Member 'GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel::K2Node_CustomEvent_TargetData_2' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel, K2Node_CustomEvent_ApplicationTag_2) == 0x0005D0, "Member 'GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel::K2Node_CustomEvent_ApplicationTag_2' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel, K2Node_CreateDelegate_OutputDelegate_6) == 0x0005D8, "Member 'GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel, Temp_int_Loop_Counter_Variable_2) == 0x0005E8, "Member 'GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel, CallFunc_Add_IntInt_ReturnValue_2) == 0x0005EC, "Member 'GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel, CallFunc_Greater_IntInt_ReturnValue) == 0x0005F0, "Member 'GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_1) == 0x0005F4, "Member 'GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel, CallFunc_GetActorForwardVector_ReturnValue_1) == 0x0005FC, "Member 'GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel::CallFunc_GetActorForwardVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x000608, "Member 'GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000614, "Member 'GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000620, "Member 'GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel, CallFunc_CapsuleTraceMultiForObjects_OutHits_1) == 0x000630, "Member 'GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel::CallFunc_CapsuleTraceMultiForObjects_OutHits_1' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel, CallFunc_CapsuleTraceMultiForObjects_ReturnValue_1) == 0x000640, "Member 'GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel::CallFunc_CapsuleTraceMultiForObjects_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel, CallFunc_Array_Get_Item_1) == 0x000644, "Member 'GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel, CallFunc_Array_Length_ReturnValue_1) == 0x0006CC, "Member 'GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel, CallFunc_BreakHitResult_bBlockingHit_1) == 0x0006D0, "Member 'GA_SpookyMist_Travel_C_ExecuteUbergraph_GA_SpookyMist_Travel::CallFunc_BreakHitResult_bBlockingHit_1' has a wrong offset!");
