#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_SiphonEffect_OnKillGrant

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GA_GM_OnDmgDealt_LifeSteal_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_SiphonEffect_OnKillGrant.GA_SiphonEffect_OnKillGrant_C
// 0x00D8 (0x0A78 - 0x09A0)
class UGA_SiphonEffect_OnKillGrant_C final : public UGA_GM_OnDmgDealt_LifeSteal_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_SiphonEffect_OnKillGrant_C;      // 0x09A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UClass*                                 HealGE;                                            // 0x09A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 ShieldGE;                                          // 0x09B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       Target;                                            // 0x09B8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	class AFortPlayerPawn*                        Eliminator;                                        // 0x09E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Increment;                                         // 0x09E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxTicks;                                          // 0x09EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           TimerHandle;                                       // 0x09F0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 TickHealGE;                                        // 0x09F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 TickShieldGE;                                      // 0x0A00(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HealthToHeal;                                      // 0x0A08(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HealthToShield;                                    // 0x0A0C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InitialAmountToHeal;                               // 0x0A10(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         WoodToGive;                                        // 0x0A14(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         StoneToGive;                                       // 0x0A18(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MetalToGive;                                       // 0x0A1C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldGrantMatsOnKill;                             // 0x0A20(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A21[0x7];                                      // 0x0A21(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  Blade_Wielder_Tag;                                 // 0x0A28(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class AAthena_GameState_C*                    AthenaGameState;                                   // 0x0A48(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsCreativeOrPlayground;                            // 0x0A50(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A51[0x3];                                      // 0x0A51(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         HealthToHealOverTime;                              // 0x0A54(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HealthPerTick;                                     // 0x0A58(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TotalHotTime;                                      // 0x0A5C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HotTickRate;                                       // 0x0A60(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AmountHotHealed;                                   // 0x0A64(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HealthToTickHelper;                                // 0x0A68(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ConsumedCue;                                       // 0x0A6C(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_SiphonEffect_OnKillGrant(int32 EntryPoint);
	void HandleHOT();
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);

	bool K2_ShouldAbilityRespondToEvent(const struct FGameplayAbilityActorInfo& ActorInfo, const struct FGameplayEventData& Payload) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_SiphonEffect_OnKillGrant_C">();
	}
	static class UGA_SiphonEffect_OnKillGrant_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_SiphonEffect_OnKillGrant_C>();
	}
};
static_assert(alignof(UGA_SiphonEffect_OnKillGrant_C) == 0x000008, "Wrong alignment on UGA_SiphonEffect_OnKillGrant_C");
static_assert(sizeof(UGA_SiphonEffect_OnKillGrant_C) == 0x000A78, "Wrong size on UGA_SiphonEffect_OnKillGrant_C");
static_assert(offsetof(UGA_SiphonEffect_OnKillGrant_C, UberGraphFrame_GA_SiphonEffect_OnKillGrant_C) == 0x0009A0, "Member 'UGA_SiphonEffect_OnKillGrant_C::UberGraphFrame_GA_SiphonEffect_OnKillGrant_C' has a wrong offset!");
static_assert(offsetof(UGA_SiphonEffect_OnKillGrant_C, HealGE) == 0x0009A8, "Member 'UGA_SiphonEffect_OnKillGrant_C::HealGE' has a wrong offset!");
static_assert(offsetof(UGA_SiphonEffect_OnKillGrant_C, ShieldGE) == 0x0009B0, "Member 'UGA_SiphonEffect_OnKillGrant_C::ShieldGE' has a wrong offset!");
static_assert(offsetof(UGA_SiphonEffect_OnKillGrant_C, Target) == 0x0009B8, "Member 'UGA_SiphonEffect_OnKillGrant_C::Target' has a wrong offset!");
static_assert(offsetof(UGA_SiphonEffect_OnKillGrant_C, Eliminator) == 0x0009E0, "Member 'UGA_SiphonEffect_OnKillGrant_C::Eliminator' has a wrong offset!");
static_assert(offsetof(UGA_SiphonEffect_OnKillGrant_C, Increment) == 0x0009E8, "Member 'UGA_SiphonEffect_OnKillGrant_C::Increment' has a wrong offset!");
static_assert(offsetof(UGA_SiphonEffect_OnKillGrant_C, MaxTicks) == 0x0009EC, "Member 'UGA_SiphonEffect_OnKillGrant_C::MaxTicks' has a wrong offset!");
static_assert(offsetof(UGA_SiphonEffect_OnKillGrant_C, TimerHandle) == 0x0009F0, "Member 'UGA_SiphonEffect_OnKillGrant_C::TimerHandle' has a wrong offset!");
static_assert(offsetof(UGA_SiphonEffect_OnKillGrant_C, TickHealGE) == 0x0009F8, "Member 'UGA_SiphonEffect_OnKillGrant_C::TickHealGE' has a wrong offset!");
static_assert(offsetof(UGA_SiphonEffect_OnKillGrant_C, TickShieldGE) == 0x000A00, "Member 'UGA_SiphonEffect_OnKillGrant_C::TickShieldGE' has a wrong offset!");
static_assert(offsetof(UGA_SiphonEffect_OnKillGrant_C, HealthToHeal) == 0x000A08, "Member 'UGA_SiphonEffect_OnKillGrant_C::HealthToHeal' has a wrong offset!");
static_assert(offsetof(UGA_SiphonEffect_OnKillGrant_C, HealthToShield) == 0x000A0C, "Member 'UGA_SiphonEffect_OnKillGrant_C::HealthToShield' has a wrong offset!");
static_assert(offsetof(UGA_SiphonEffect_OnKillGrant_C, InitialAmountToHeal) == 0x000A10, "Member 'UGA_SiphonEffect_OnKillGrant_C::InitialAmountToHeal' has a wrong offset!");
static_assert(offsetof(UGA_SiphonEffect_OnKillGrant_C, WoodToGive) == 0x000A14, "Member 'UGA_SiphonEffect_OnKillGrant_C::WoodToGive' has a wrong offset!");
static_assert(offsetof(UGA_SiphonEffect_OnKillGrant_C, StoneToGive) == 0x000A18, "Member 'UGA_SiphonEffect_OnKillGrant_C::StoneToGive' has a wrong offset!");
static_assert(offsetof(UGA_SiphonEffect_OnKillGrant_C, MetalToGive) == 0x000A1C, "Member 'UGA_SiphonEffect_OnKillGrant_C::MetalToGive' has a wrong offset!");
static_assert(offsetof(UGA_SiphonEffect_OnKillGrant_C, ShouldGrantMatsOnKill) == 0x000A20, "Member 'UGA_SiphonEffect_OnKillGrant_C::ShouldGrantMatsOnKill' has a wrong offset!");
static_assert(offsetof(UGA_SiphonEffect_OnKillGrant_C, Blade_Wielder_Tag) == 0x000A28, "Member 'UGA_SiphonEffect_OnKillGrant_C::Blade_Wielder_Tag' has a wrong offset!");
static_assert(offsetof(UGA_SiphonEffect_OnKillGrant_C, AthenaGameState) == 0x000A48, "Member 'UGA_SiphonEffect_OnKillGrant_C::AthenaGameState' has a wrong offset!");
static_assert(offsetof(UGA_SiphonEffect_OnKillGrant_C, IsCreativeOrPlayground) == 0x000A50, "Member 'UGA_SiphonEffect_OnKillGrant_C::IsCreativeOrPlayground' has a wrong offset!");
static_assert(offsetof(UGA_SiphonEffect_OnKillGrant_C, HealthToHealOverTime) == 0x000A54, "Member 'UGA_SiphonEffect_OnKillGrant_C::HealthToHealOverTime' has a wrong offset!");
static_assert(offsetof(UGA_SiphonEffect_OnKillGrant_C, HealthPerTick) == 0x000A58, "Member 'UGA_SiphonEffect_OnKillGrant_C::HealthPerTick' has a wrong offset!");
static_assert(offsetof(UGA_SiphonEffect_OnKillGrant_C, TotalHotTime) == 0x000A5C, "Member 'UGA_SiphonEffect_OnKillGrant_C::TotalHotTime' has a wrong offset!");
static_assert(offsetof(UGA_SiphonEffect_OnKillGrant_C, HotTickRate) == 0x000A60, "Member 'UGA_SiphonEffect_OnKillGrant_C::HotTickRate' has a wrong offset!");
static_assert(offsetof(UGA_SiphonEffect_OnKillGrant_C, AmountHotHealed) == 0x000A64, "Member 'UGA_SiphonEffect_OnKillGrant_C::AmountHotHealed' has a wrong offset!");
static_assert(offsetof(UGA_SiphonEffect_OnKillGrant_C, HealthToTickHelper) == 0x000A68, "Member 'UGA_SiphonEffect_OnKillGrant_C::HealthToTickHelper' has a wrong offset!");
static_assert(offsetof(UGA_SiphonEffect_OnKillGrant_C, ConsumedCue) == 0x000A6C, "Member 'UGA_SiphonEffect_OnKillGrant_C::ConsumedCue' has a wrong offset!");

}

