#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GamepadCustomActionSelectorPanel_v3

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "InputCore_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass GamepadCustomActionSelectorPanel_v3.GamepadCustomActionSelectorPanel_v3_C
// 0x00B8 (0x03F8 - 0x0340)
class UGamepadCustomActionSelectorPanel_v3_C final : public UFortGamePadCustomActionSelectorPanel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0340(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button_Clear;                                      // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          CommonBorder_Clear;                                // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonListView*                        CommonListView_GamepadActions;                     // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortRichTextBlock*                     FortRichTextBlock_Clear1;                          // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortRichTextBlock*                     FortRichTextBlock_Clear2;                          // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UKeybindWidget_C*                       KeybindWidget_Clear;                               // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOptionsMenuHeader_C*                   OptionsMenuHeader;                                 // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FDataTableRowHandle                    Back;                                              // 0x0380(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	TMulticastInlineDelegate<void(int32 SelectedIndex, class FName ActionName)> CustomActionSelected;                              // 0x0390(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<class UFortOptionsMenuInputData*>      CurrentInputData;                                  // 0x03A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TMulticastInlineDelegate<void()>              CustomClosedUsingBack;                             // 0x03B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              CustomClearButton;                                 // 0x03C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FKey                                   KeyNone;                                           // 0x03D0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FDataTableRowHandle                    Clear;                                             // 0x03E8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void HandleClear(bool* PassThrough);
	void CreateCustomListItem(class FName ActionName, EFortInputActionGroup InputActionGroup, class UGamepadKeyTextButton_C** ReturnItem);
	void HandleBack(bool* PassThrough);
	void Construct();
	void UpdatePanel(const TArray<class UFortOptionsMenuInputData*>& InputData);
	void BP_OnItemClicked_Bind(class UObject* Item);
	void OnActivated();
	void OnDeactivated();
	void BndEvt__Button_Clear_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void ExecuteUbergraph_GamepadCustomActionSelectorPanel_v3(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GamepadCustomActionSelectorPanel_v3_C">();
	}
	static class UGamepadCustomActionSelectorPanel_v3_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGamepadCustomActionSelectorPanel_v3_C>();
	}
};
static_assert(alignof(UGamepadCustomActionSelectorPanel_v3_C) == 0x000008, "Wrong alignment on UGamepadCustomActionSelectorPanel_v3_C");
static_assert(sizeof(UGamepadCustomActionSelectorPanel_v3_C) == 0x0003F8, "Wrong size on UGamepadCustomActionSelectorPanel_v3_C");
static_assert(offsetof(UGamepadCustomActionSelectorPanel_v3_C, UberGraphFrame) == 0x000340, "Member 'UGamepadCustomActionSelectorPanel_v3_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGamepadCustomActionSelectorPanel_v3_C, Button_Clear) == 0x000348, "Member 'UGamepadCustomActionSelectorPanel_v3_C::Button_Clear' has a wrong offset!");
static_assert(offsetof(UGamepadCustomActionSelectorPanel_v3_C, CommonBorder_Clear) == 0x000350, "Member 'UGamepadCustomActionSelectorPanel_v3_C::CommonBorder_Clear' has a wrong offset!");
static_assert(offsetof(UGamepadCustomActionSelectorPanel_v3_C, CommonListView_GamepadActions) == 0x000358, "Member 'UGamepadCustomActionSelectorPanel_v3_C::CommonListView_GamepadActions' has a wrong offset!");
static_assert(offsetof(UGamepadCustomActionSelectorPanel_v3_C, FortRichTextBlock_Clear1) == 0x000360, "Member 'UGamepadCustomActionSelectorPanel_v3_C::FortRichTextBlock_Clear1' has a wrong offset!");
static_assert(offsetof(UGamepadCustomActionSelectorPanel_v3_C, FortRichTextBlock_Clear2) == 0x000368, "Member 'UGamepadCustomActionSelectorPanel_v3_C::FortRichTextBlock_Clear2' has a wrong offset!");
static_assert(offsetof(UGamepadCustomActionSelectorPanel_v3_C, KeybindWidget_Clear) == 0x000370, "Member 'UGamepadCustomActionSelectorPanel_v3_C::KeybindWidget_Clear' has a wrong offset!");
static_assert(offsetof(UGamepadCustomActionSelectorPanel_v3_C, OptionsMenuHeader) == 0x000378, "Member 'UGamepadCustomActionSelectorPanel_v3_C::OptionsMenuHeader' has a wrong offset!");
static_assert(offsetof(UGamepadCustomActionSelectorPanel_v3_C, Back) == 0x000380, "Member 'UGamepadCustomActionSelectorPanel_v3_C::Back' has a wrong offset!");
static_assert(offsetof(UGamepadCustomActionSelectorPanel_v3_C, CustomActionSelected) == 0x000390, "Member 'UGamepadCustomActionSelectorPanel_v3_C::CustomActionSelected' has a wrong offset!");
static_assert(offsetof(UGamepadCustomActionSelectorPanel_v3_C, CurrentInputData) == 0x0003A0, "Member 'UGamepadCustomActionSelectorPanel_v3_C::CurrentInputData' has a wrong offset!");
static_assert(offsetof(UGamepadCustomActionSelectorPanel_v3_C, CustomClosedUsingBack) == 0x0003B0, "Member 'UGamepadCustomActionSelectorPanel_v3_C::CustomClosedUsingBack' has a wrong offset!");
static_assert(offsetof(UGamepadCustomActionSelectorPanel_v3_C, CustomClearButton) == 0x0003C0, "Member 'UGamepadCustomActionSelectorPanel_v3_C::CustomClearButton' has a wrong offset!");
static_assert(offsetof(UGamepadCustomActionSelectorPanel_v3_C, KeyNone) == 0x0003D0, "Member 'UGamepadCustomActionSelectorPanel_v3_C::KeyNone' has a wrong offset!");
static_assert(offsetof(UGamepadCustomActionSelectorPanel_v3_C, Clear) == 0x0003E8, "Member 'UGamepadCustomActionSelectorPanel_v3_C::Clear' has a wrong offset!");

}

