#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GAT_Athena_Bush

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GAT_TriggeredAbility_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GAT_Athena_Bush.GAT_Athena_Bush_C
// 0x0018 (0x0990 - 0x0978)
class UGAT_Athena_Bush_C final : public UGAT_TriggeredAbility_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GAT_Athena_Bush_C;                  // 0x0978(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AFortPlayerPawn*                        PlayerPawn;                                        // 0x0980(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortWorldItemDefinition*               BushItemDef;                                       // 0x0988(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GAT_Athena_Bush(int32 EntryPoint);
	void K2_ActivateAbility();
	void RemoveBush(class AFortPlayerPawn* PlayerPawn_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GAT_Athena_Bush_C">();
	}
	static class UGAT_Athena_Bush_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGAT_Athena_Bush_C>();
	}
};
static_assert(alignof(UGAT_Athena_Bush_C) == 0x000008, "Wrong alignment on UGAT_Athena_Bush_C");
static_assert(sizeof(UGAT_Athena_Bush_C) == 0x000990, "Wrong size on UGAT_Athena_Bush_C");
static_assert(offsetof(UGAT_Athena_Bush_C, UberGraphFrame_GAT_Athena_Bush_C) == 0x000978, "Member 'UGAT_Athena_Bush_C::UberGraphFrame_GAT_Athena_Bush_C' has a wrong offset!");
static_assert(offsetof(UGAT_Athena_Bush_C, PlayerPawn) == 0x000980, "Member 'UGAT_Athena_Bush_C::PlayerPawn' has a wrong offset!");
static_assert(offsetof(UGAT_Athena_Bush_C, BushItemDef) == 0x000988, "Member 'UGAT_Athena_Bush_C::BushItemDef' has a wrong offset!");

}

