#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Athena_OutsideSafeZone

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GC_Athena_OutsideSafeZone.GC_Athena_OutsideSafeZone_C
// 0x0038 (0x07A0 - 0x0768)
class AGC_Athena_OutsideSafeZone_C final : public AFortGameplayCueNotify_Loop
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0768(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   SM_Storm_ScreenEffect;                             // 0x0770(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_1_Opacity_419E3F054F04FE8C47898AAA333435BB; // 0x0778(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_1__Direction_419E3F054F04FE8C47898AAA333435BB; // 0x077C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_77D[0x3];                                      // 0x077D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_1;                                        // 0x0780(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_Opacity_68FE7C004665314915FA88BB9DD7BE88; // 0x0788(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_68FE7C004665314915FA88BB9DD7BE88; // 0x078C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_78D[0x3];                                      // 0x078D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0790(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         StormOpacity;                                      // 0x0798(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GC_Athena_OutsideSafeZone(int32 EntryPoint);
	void OnApplication(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, const TArray<class UParticleSystemComponent*>& ParticleComponents, const TArray<class UAudioComponent*>& AudioComponents, class UCameraShake* BurstCameraShakeInstance, class ADecalActor* BurstDecalInstance);
	void OnRemoval(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, const TArray<class UParticleSystemComponent*>& ParticleComponents, const TArray<class UAudioComponent*>& AudioComponents, class UCameraShake* BurstCameraShakeInstance, class ADecalActor* BurstDecalInstance);
	void OnLoopingStart(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, const TArray<class UParticleSystemComponent*>& ParticleComponents, const TArray<class UAudioComponent*>& AudioComponents);
	void Timeline_1__UpdateFunc();
	void Timeline_1__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void Timeline_0__FinishedFunc();
	void AddStormAudio(class APlayerPawn_Athena_C* PlayerPawnAthena);
	void RemoveStormAudio(class APlayerPawn_Athena_C* PlayerPawnAthena);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GC_Athena_OutsideSafeZone_C">();
	}
	static class AGC_Athena_OutsideSafeZone_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGC_Athena_OutsideSafeZone_C>();
	}
};
static_assert(alignof(AGC_Athena_OutsideSafeZone_C) == 0x000008, "Wrong alignment on AGC_Athena_OutsideSafeZone_C");
static_assert(sizeof(AGC_Athena_OutsideSafeZone_C) == 0x0007A0, "Wrong size on AGC_Athena_OutsideSafeZone_C");
static_assert(offsetof(AGC_Athena_OutsideSafeZone_C, UberGraphFrame) == 0x000768, "Member 'AGC_Athena_OutsideSafeZone_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGC_Athena_OutsideSafeZone_C, SM_Storm_ScreenEffect) == 0x000770, "Member 'AGC_Athena_OutsideSafeZone_C::SM_Storm_ScreenEffect' has a wrong offset!");
static_assert(offsetof(AGC_Athena_OutsideSafeZone_C, Timeline_1_Opacity_419E3F054F04FE8C47898AAA333435BB) == 0x000778, "Member 'AGC_Athena_OutsideSafeZone_C::Timeline_1_Opacity_419E3F054F04FE8C47898AAA333435BB' has a wrong offset!");
static_assert(offsetof(AGC_Athena_OutsideSafeZone_C, Timeline_1__Direction_419E3F054F04FE8C47898AAA333435BB) == 0x00077C, "Member 'AGC_Athena_OutsideSafeZone_C::Timeline_1__Direction_419E3F054F04FE8C47898AAA333435BB' has a wrong offset!");
static_assert(offsetof(AGC_Athena_OutsideSafeZone_C, Timeline_1) == 0x000780, "Member 'AGC_Athena_OutsideSafeZone_C::Timeline_1' has a wrong offset!");
static_assert(offsetof(AGC_Athena_OutsideSafeZone_C, Timeline_0_Opacity_68FE7C004665314915FA88BB9DD7BE88) == 0x000788, "Member 'AGC_Athena_OutsideSafeZone_C::Timeline_0_Opacity_68FE7C004665314915FA88BB9DD7BE88' has a wrong offset!");
static_assert(offsetof(AGC_Athena_OutsideSafeZone_C, Timeline_0__Direction_68FE7C004665314915FA88BB9DD7BE88) == 0x00078C, "Member 'AGC_Athena_OutsideSafeZone_C::Timeline_0__Direction_68FE7C004665314915FA88BB9DD7BE88' has a wrong offset!");
static_assert(offsetof(AGC_Athena_OutsideSafeZone_C, Timeline_0) == 0x000790, "Member 'AGC_Athena_OutsideSafeZone_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(AGC_Athena_OutsideSafeZone_C, StormOpacity) == 0x000798, "Member 'AGC_Athena_OutsideSafeZone_C::StormOpacity' has a wrong offset!");

}

