#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCL_BoostJumpPack_Hovering

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCL_BoostJumpPack_Hovering.GCL_BoostJumpPack_Hovering_C
// 0x0120 (0x0430 - 0x0310)
class AGCL_BoostJumpPack_Hovering_C final : public AFortGameplayCueNotify_Looping
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0310(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         Jetpack_Audio_Modulation_Fuel_4B6C9E744D4A38FAEE9F0F9F2E1AE53F; // 0x0318(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Jetpack_Audio_Modulation__Direction_4B6C9E744D4A38FAEE9F0F9F2E1AE53F; // 0x031C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31D[0x3];                                      // 0x031D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Jetpack_Audio_Modulation;                          // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               SpawnedParticleEmitter;                            // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bJetpackAudioEnabled;                              // 0x0330(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_331[0x7];                                      // 0x0331(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             SoundOnStart;                                      // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SoundOnStop;                                       // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SoundLoopOnIdle;                                   // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SoundLoopOnAccel;                                  // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        OnIdleAudio_Comp;                                  // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        OnAccelAudio_Comp;                                 // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerPawn_Athena_C*                   PlayerPawn;                                        // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentUpwardVelocity;                             // 0x0370(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_374[0x4];                                      // 0x0374(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             SoundLoopOnOutOfFuel;                              // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        OnOutOfFuelAudio_Comp;                             // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TargetFuelVolumeMultiplier;                        // 0x0388(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentFuelVolumeMultiplier;                       // 0x038C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SoundOnFuelWarning;                                // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SoundOnOutOfFuel;                                  // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SoundOnThrust;                                     // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bPlayedFuelWarning;                                // 0x03A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bIsFirstJump;                                      // 0x03A9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3AA[0x2];                                      // 0x03AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         JetpackActivatedTime;                              // 0x03AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               GroundInteract;                                    // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CachedFuelPercent;                                 // 0x03B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CachedRenderingDetailMode;                         // 0x03BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NewVar_0;                                          // 0x03C0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CC[0x4];                                      // 0x03CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class USkeletalMeshComponent>  Milo_Check;                                        // 0x03D0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, InstancedReference, HasGetValueTypeHash)
	TSoftObjectPtr<class UObject>                 Milo_Backpack;                                     // 0x03F8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FVector                                Milo_LightScale;                                   // 0x0420(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GCL_BoostJumpPack_Hovering(int32 EntryPoint);
	void ReceiveDestroyed();
	void K2_HandleGameplayCue(class AActor* MyTarget, EGameplayCueEvent EventType, const struct FGameplayCueParameters& Parameters);
	void ResetFX();
	void On_Pawn_Landed(const struct FHitResult& Hit);
	void Audio_Tick();
	void ReceiveTick(float DeltaSeconds);
	void Jetpack_Audio_Modulation__FuelWarning__EventFunc();
	void Jetpack_Audio_Modulation__UpdateFunc();
	void Jetpack_Audio_Modulation__FinishedFunc();
	bool OnActive(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);
	bool OnRemove(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);
	void SetJetpackAudioEnabled(bool Enabled);
	void CacheAttributes();
	void GetFuelPercent(float* FuelPercent);
	float GetFuel();
	float GetMaxFuel();
	float GetUpwardThrust();
	float GetLateralThrust();
	void CalculateUpwardVelocity();
	void CalculateFuelPercentage();
	void CacheRenderingDetailMode();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCL_BoostJumpPack_Hovering_C">();
	}
	static class AGCL_BoostJumpPack_Hovering_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGCL_BoostJumpPack_Hovering_C>();
	}
};
static_assert(alignof(AGCL_BoostJumpPack_Hovering_C) == 0x000008, "Wrong alignment on AGCL_BoostJumpPack_Hovering_C");
static_assert(sizeof(AGCL_BoostJumpPack_Hovering_C) == 0x000430, "Wrong size on AGCL_BoostJumpPack_Hovering_C");
static_assert(offsetof(AGCL_BoostJumpPack_Hovering_C, UberGraphFrame) == 0x000310, "Member 'AGCL_BoostJumpPack_Hovering_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGCL_BoostJumpPack_Hovering_C, Jetpack_Audio_Modulation_Fuel_4B6C9E744D4A38FAEE9F0F9F2E1AE53F) == 0x000318, "Member 'AGCL_BoostJumpPack_Hovering_C::Jetpack_Audio_Modulation_Fuel_4B6C9E744D4A38FAEE9F0F9F2E1AE53F' has a wrong offset!");
static_assert(offsetof(AGCL_BoostJumpPack_Hovering_C, Jetpack_Audio_Modulation__Direction_4B6C9E744D4A38FAEE9F0F9F2E1AE53F) == 0x00031C, "Member 'AGCL_BoostJumpPack_Hovering_C::Jetpack_Audio_Modulation__Direction_4B6C9E744D4A38FAEE9F0F9F2E1AE53F' has a wrong offset!");
static_assert(offsetof(AGCL_BoostJumpPack_Hovering_C, Jetpack_Audio_Modulation) == 0x000320, "Member 'AGCL_BoostJumpPack_Hovering_C::Jetpack_Audio_Modulation' has a wrong offset!");
static_assert(offsetof(AGCL_BoostJumpPack_Hovering_C, SpawnedParticleEmitter) == 0x000328, "Member 'AGCL_BoostJumpPack_Hovering_C::SpawnedParticleEmitter' has a wrong offset!");
static_assert(offsetof(AGCL_BoostJumpPack_Hovering_C, bJetpackAudioEnabled) == 0x000330, "Member 'AGCL_BoostJumpPack_Hovering_C::bJetpackAudioEnabled' has a wrong offset!");
static_assert(offsetof(AGCL_BoostJumpPack_Hovering_C, SoundOnStart) == 0x000338, "Member 'AGCL_BoostJumpPack_Hovering_C::SoundOnStart' has a wrong offset!");
static_assert(offsetof(AGCL_BoostJumpPack_Hovering_C, SoundOnStop) == 0x000340, "Member 'AGCL_BoostJumpPack_Hovering_C::SoundOnStop' has a wrong offset!");
static_assert(offsetof(AGCL_BoostJumpPack_Hovering_C, SoundLoopOnIdle) == 0x000348, "Member 'AGCL_BoostJumpPack_Hovering_C::SoundLoopOnIdle' has a wrong offset!");
static_assert(offsetof(AGCL_BoostJumpPack_Hovering_C, SoundLoopOnAccel) == 0x000350, "Member 'AGCL_BoostJumpPack_Hovering_C::SoundLoopOnAccel' has a wrong offset!");
static_assert(offsetof(AGCL_BoostJumpPack_Hovering_C, OnIdleAudio_Comp) == 0x000358, "Member 'AGCL_BoostJumpPack_Hovering_C::OnIdleAudio_Comp' has a wrong offset!");
static_assert(offsetof(AGCL_BoostJumpPack_Hovering_C, OnAccelAudio_Comp) == 0x000360, "Member 'AGCL_BoostJumpPack_Hovering_C::OnAccelAudio_Comp' has a wrong offset!");
static_assert(offsetof(AGCL_BoostJumpPack_Hovering_C, PlayerPawn) == 0x000368, "Member 'AGCL_BoostJumpPack_Hovering_C::PlayerPawn' has a wrong offset!");
static_assert(offsetof(AGCL_BoostJumpPack_Hovering_C, CurrentUpwardVelocity) == 0x000370, "Member 'AGCL_BoostJumpPack_Hovering_C::CurrentUpwardVelocity' has a wrong offset!");
static_assert(offsetof(AGCL_BoostJumpPack_Hovering_C, SoundLoopOnOutOfFuel) == 0x000378, "Member 'AGCL_BoostJumpPack_Hovering_C::SoundLoopOnOutOfFuel' has a wrong offset!");
static_assert(offsetof(AGCL_BoostJumpPack_Hovering_C, OnOutOfFuelAudio_Comp) == 0x000380, "Member 'AGCL_BoostJumpPack_Hovering_C::OnOutOfFuelAudio_Comp' has a wrong offset!");
static_assert(offsetof(AGCL_BoostJumpPack_Hovering_C, TargetFuelVolumeMultiplier) == 0x000388, "Member 'AGCL_BoostJumpPack_Hovering_C::TargetFuelVolumeMultiplier' has a wrong offset!");
static_assert(offsetof(AGCL_BoostJumpPack_Hovering_C, CurrentFuelVolumeMultiplier) == 0x00038C, "Member 'AGCL_BoostJumpPack_Hovering_C::CurrentFuelVolumeMultiplier' has a wrong offset!");
static_assert(offsetof(AGCL_BoostJumpPack_Hovering_C, SoundOnFuelWarning) == 0x000390, "Member 'AGCL_BoostJumpPack_Hovering_C::SoundOnFuelWarning' has a wrong offset!");
static_assert(offsetof(AGCL_BoostJumpPack_Hovering_C, SoundOnOutOfFuel) == 0x000398, "Member 'AGCL_BoostJumpPack_Hovering_C::SoundOnOutOfFuel' has a wrong offset!");
static_assert(offsetof(AGCL_BoostJumpPack_Hovering_C, SoundOnThrust) == 0x0003A0, "Member 'AGCL_BoostJumpPack_Hovering_C::SoundOnThrust' has a wrong offset!");
static_assert(offsetof(AGCL_BoostJumpPack_Hovering_C, bPlayedFuelWarning) == 0x0003A8, "Member 'AGCL_BoostJumpPack_Hovering_C::bPlayedFuelWarning' has a wrong offset!");
static_assert(offsetof(AGCL_BoostJumpPack_Hovering_C, bIsFirstJump) == 0x0003A9, "Member 'AGCL_BoostJumpPack_Hovering_C::bIsFirstJump' has a wrong offset!");
static_assert(offsetof(AGCL_BoostJumpPack_Hovering_C, JetpackActivatedTime) == 0x0003AC, "Member 'AGCL_BoostJumpPack_Hovering_C::JetpackActivatedTime' has a wrong offset!");
static_assert(offsetof(AGCL_BoostJumpPack_Hovering_C, GroundInteract) == 0x0003B0, "Member 'AGCL_BoostJumpPack_Hovering_C::GroundInteract' has a wrong offset!");
static_assert(offsetof(AGCL_BoostJumpPack_Hovering_C, CachedFuelPercent) == 0x0003B8, "Member 'AGCL_BoostJumpPack_Hovering_C::CachedFuelPercent' has a wrong offset!");
static_assert(offsetof(AGCL_BoostJumpPack_Hovering_C, CachedRenderingDetailMode) == 0x0003BC, "Member 'AGCL_BoostJumpPack_Hovering_C::CachedRenderingDetailMode' has a wrong offset!");
static_assert(offsetof(AGCL_BoostJumpPack_Hovering_C, NewVar_0) == 0x0003C0, "Member 'AGCL_BoostJumpPack_Hovering_C::NewVar_0' has a wrong offset!");
static_assert(offsetof(AGCL_BoostJumpPack_Hovering_C, Milo_Check) == 0x0003D0, "Member 'AGCL_BoostJumpPack_Hovering_C::Milo_Check' has a wrong offset!");
static_assert(offsetof(AGCL_BoostJumpPack_Hovering_C, Milo_Backpack) == 0x0003F8, "Member 'AGCL_BoostJumpPack_Hovering_C::Milo_Backpack' has a wrong offset!");
static_assert(offsetof(AGCL_BoostJumpPack_Hovering_C, Milo_LightScale) == 0x000420, "Member 'AGCL_BoostJumpPack_Hovering_C::Milo_LightScale' has a wrong offset!");

}

