#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_Athena_Item_WaterBuffalo_Hit_Latent

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GCN_Athena_Item_WaterBuffalo_Hit_Latent.GCN_Athena_Item_WaterBuffalo_Hit_Latent_C.ExecuteUbergraph_GCN_Athena_Item_WaterBuffalo_Hit_Latent
// 0x0140 (0x0140 - 0x0000)
struct GCN_Athena_Item_WaterBuffalo_Hit_Latent_C_ExecuteUbergraph_GCN_Athena_Item_WaterBuffalo_Hit_Latent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_1;             // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_GetEnumeratorValueFromIndex_ReturnValue;  // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_2;             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue_1;              // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_3;             // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_GetEnumeratorValueFromIndex_ReturnValue_1; // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_MyTarget;                             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameplayCueEvent                             K2Node_Event_EventType;                            // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x0050(0x00B8)(ConstParm, ContainsInstancedReference)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerPawn_Athena_C*                   K2Node_DynamicCast_AsPlayer_Pawn_Athena;           // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x3];                                      // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_MakeLiteralInt_ReturnValue_1;             // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetSkeletalMeshForPartType_ReturnValue;   // 0x0128(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetSkeletalMeshForPartType_ReturnValue_1; // 0x0130(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GCN_Athena_Item_WaterBuffalo_Hit_Latent_C_ExecuteUbergraph_GCN_Athena_Item_WaterBuffalo_Hit_Latent) == 0x000008, "Wrong alignment on GCN_Athena_Item_WaterBuffalo_Hit_Latent_C_ExecuteUbergraph_GCN_Athena_Item_WaterBuffalo_Hit_Latent");
static_assert(sizeof(GCN_Athena_Item_WaterBuffalo_Hit_Latent_C_ExecuteUbergraph_GCN_Athena_Item_WaterBuffalo_Hit_Latent) == 0x000140, "Wrong size on GCN_Athena_Item_WaterBuffalo_Hit_Latent_C_ExecuteUbergraph_GCN_Athena_Item_WaterBuffalo_Hit_Latent");
static_assert(offsetof(GCN_Athena_Item_WaterBuffalo_Hit_Latent_C_ExecuteUbergraph_GCN_Athena_Item_WaterBuffalo_Hit_Latent, EntryPoint) == 0x000000, "Member 'GCN_Athena_Item_WaterBuffalo_Hit_Latent_C_ExecuteUbergraph_GCN_Athena_Item_WaterBuffalo_Hit_Latent::EntryPoint' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Item_WaterBuffalo_Hit_Latent_C_ExecuteUbergraph_GCN_Athena_Item_WaterBuffalo_Hit_Latent, CallFunc_MakeLiteralInt_ReturnValue) == 0x000004, "Member 'GCN_Athena_Item_WaterBuffalo_Hit_Latent_C_ExecuteUbergraph_GCN_Athena_Item_WaterBuffalo_Hit_Latent::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Item_WaterBuffalo_Hit_Latent_C_ExecuteUbergraph_GCN_Athena_Item_WaterBuffalo_Hit_Latent, Temp_int_Variable) == 0x000008, "Member 'GCN_Athena_Item_WaterBuffalo_Hit_Latent_C_ExecuteUbergraph_GCN_Athena_Item_WaterBuffalo_Hit_Latent::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Item_WaterBuffalo_Hit_Latent_C_ExecuteUbergraph_GCN_Athena_Item_WaterBuffalo_Hit_Latent, Temp_int_Variable_1) == 0x00000C, "Member 'GCN_Athena_Item_WaterBuffalo_Hit_Latent_C_ExecuteUbergraph_GCN_Athena_Item_WaterBuffalo_Hit_Latent::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Item_WaterBuffalo_Hit_Latent_C_ExecuteUbergraph_GCN_Athena_Item_WaterBuffalo_Hit_Latent, CallFunc_Conv_IntToByte_ReturnValue) == 0x000010, "Member 'GCN_Athena_Item_WaterBuffalo_Hit_Latent_C_ExecuteUbergraph_GCN_Athena_Item_WaterBuffalo_Hit_Latent::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Item_WaterBuffalo_Hit_Latent_C_ExecuteUbergraph_GCN_Athena_Item_WaterBuffalo_Hit_Latent, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'GCN_Athena_Item_WaterBuffalo_Hit_Latent_C_ExecuteUbergraph_GCN_Athena_Item_WaterBuffalo_Hit_Latent::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Item_WaterBuffalo_Hit_Latent_C_ExecuteUbergraph_GCN_Athena_Item_WaterBuffalo_Hit_Latent, CallFunc_GetValidValue_ReturnValue) == 0x000018, "Member 'GCN_Athena_Item_WaterBuffalo_Hit_Latent_C_ExecuteUbergraph_GCN_Athena_Item_WaterBuffalo_Hit_Latent::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Item_WaterBuffalo_Hit_Latent_C_ExecuteUbergraph_GCN_Athena_Item_WaterBuffalo_Hit_Latent, CallFunc_Conv_IntToByte_ReturnValue_1) == 0x000019, "Member 'GCN_Athena_Item_WaterBuffalo_Hit_Latent_C_ExecuteUbergraph_GCN_Athena_Item_WaterBuffalo_Hit_Latent::CallFunc_Conv_IntToByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Item_WaterBuffalo_Hit_Latent_C_ExecuteUbergraph_GCN_Athena_Item_WaterBuffalo_Hit_Latent, CallFunc_Less_IntInt_ReturnValue) == 0x00001A, "Member 'GCN_Athena_Item_WaterBuffalo_Hit_Latent_C_ExecuteUbergraph_GCN_Athena_Item_WaterBuffalo_Hit_Latent::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Item_WaterBuffalo_Hit_Latent_C_ExecuteUbergraph_GCN_Athena_Item_WaterBuffalo_Hit_Latent, CallFunc_GetEnumeratorValueFromIndex_ReturnValue) == 0x00001B, "Member 'GCN_Athena_Item_WaterBuffalo_Hit_Latent_C_ExecuteUbergraph_GCN_Athena_Item_WaterBuffalo_Hit_Latent::CallFunc_GetEnumeratorValueFromIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Item_WaterBuffalo_Hit_Latent_C_ExecuteUbergraph_GCN_Athena_Item_WaterBuffalo_Hit_Latent, CallFunc_Conv_ByteToInt_ReturnValue) == 0x00001C, "Member 'GCN_Athena_Item_WaterBuffalo_Hit_Latent_C_ExecuteUbergraph_GCN_Athena_Item_WaterBuffalo_Hit_Latent::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Item_WaterBuffalo_Hit_Latent_C_ExecuteUbergraph_GCN_Athena_Item_WaterBuffalo_Hit_Latent, Temp_int_Variable_2) == 0x000020, "Member 'GCN_Athena_Item_WaterBuffalo_Hit_Latent_C_ExecuteUbergraph_GCN_Athena_Item_WaterBuffalo_Hit_Latent::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Item_WaterBuffalo_Hit_Latent_C_ExecuteUbergraph_GCN_Athena_Item_WaterBuffalo_Hit_Latent, Temp_int_Variable_3) == 0x000024, "Member 'GCN_Athena_Item_WaterBuffalo_Hit_Latent_C_ExecuteUbergraph_GCN_Athena_Item_WaterBuffalo_Hit_Latent::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Item_WaterBuffalo_Hit_Latent_C_ExecuteUbergraph_GCN_Athena_Item_WaterBuffalo_Hit_Latent, CallFunc_Conv_IntToByte_ReturnValue_2) == 0x000028, "Member 'GCN_Athena_Item_WaterBuffalo_Hit_Latent_C_ExecuteUbergraph_GCN_Athena_Item_WaterBuffalo_Hit_Latent::CallFunc_Conv_IntToByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Item_WaterBuffalo_Hit_Latent_C_ExecuteUbergraph_GCN_Athena_Item_WaterBuffalo_Hit_Latent, CallFunc_Add_IntInt_ReturnValue_1) == 0x00002C, "Member 'GCN_Athena_Item_WaterBuffalo_Hit_Latent_C_ExecuteUbergraph_GCN_Athena_Item_WaterBuffalo_Hit_Latent::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Item_WaterBuffalo_Hit_Latent_C_ExecuteUbergraph_GCN_Athena_Item_WaterBuffalo_Hit_Latent, CallFunc_GetValidValue_ReturnValue_1) == 0x000030, "Member 'GCN_Athena_Item_WaterBuffalo_Hit_Latent_C_ExecuteUbergraph_GCN_Athena_Item_WaterBuffalo_Hit_Latent::CallFunc_GetValidValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Item_WaterBuffalo_Hit_Latent_C_ExecuteUbergraph_GCN_Athena_Item_WaterBuffalo_Hit_Latent, CallFunc_Conv_IntToByte_ReturnValue_3) == 0x000031, "Member 'GCN_Athena_Item_WaterBuffalo_Hit_Latent_C_ExecuteUbergraph_GCN_Athena_Item_WaterBuffalo_Hit_Latent::CallFunc_Conv_IntToByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Item_WaterBuffalo_Hit_Latent_C_ExecuteUbergraph_GCN_Athena_Item_WaterBuffalo_Hit_Latent, K2Node_SwitchEnum_CmpSuccess) == 0x000032, "Member 'GCN_Athena_Item_WaterBuffalo_Hit_Latent_C_ExecuteUbergraph_GCN_Athena_Item_WaterBuffalo_Hit_Latent::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Item_WaterBuffalo_Hit_Latent_C_ExecuteUbergraph_GCN_Athena_Item_WaterBuffalo_Hit_Latent, CallFunc_GetEnumeratorValueFromIndex_ReturnValue_1) == 0x000033, "Member 'GCN_Athena_Item_WaterBuffalo_Hit_Latent_C_ExecuteUbergraph_GCN_Athena_Item_WaterBuffalo_Hit_Latent::CallFunc_GetEnumeratorValueFromIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Item_WaterBuffalo_Hit_Latent_C_ExecuteUbergraph_GCN_Athena_Item_WaterBuffalo_Hit_Latent, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x000034, "Member 'GCN_Athena_Item_WaterBuffalo_Hit_Latent_C_ExecuteUbergraph_GCN_Athena_Item_WaterBuffalo_Hit_Latent::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Item_WaterBuffalo_Hit_Latent_C_ExecuteUbergraph_GCN_Athena_Item_WaterBuffalo_Hit_Latent, CallFunc_Lerp_ReturnValue) == 0x000038, "Member 'GCN_Athena_Item_WaterBuffalo_Hit_Latent_C_ExecuteUbergraph_GCN_Athena_Item_WaterBuffalo_Hit_Latent::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Item_WaterBuffalo_Hit_Latent_C_ExecuteUbergraph_GCN_Athena_Item_WaterBuffalo_Hit_Latent, K2Node_Event_MyTarget) == 0x000040, "Member 'GCN_Athena_Item_WaterBuffalo_Hit_Latent_C_ExecuteUbergraph_GCN_Athena_Item_WaterBuffalo_Hit_Latent::K2Node_Event_MyTarget' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Item_WaterBuffalo_Hit_Latent_C_ExecuteUbergraph_GCN_Athena_Item_WaterBuffalo_Hit_Latent, K2Node_Event_EventType) == 0x000048, "Member 'GCN_Athena_Item_WaterBuffalo_Hit_Latent_C_ExecuteUbergraph_GCN_Athena_Item_WaterBuffalo_Hit_Latent::K2Node_Event_EventType' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Item_WaterBuffalo_Hit_Latent_C_ExecuteUbergraph_GCN_Athena_Item_WaterBuffalo_Hit_Latent, K2Node_Event_Parameters) == 0x000050, "Member 'GCN_Athena_Item_WaterBuffalo_Hit_Latent_C_ExecuteUbergraph_GCN_Athena_Item_WaterBuffalo_Hit_Latent::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Item_WaterBuffalo_Hit_Latent_C_ExecuteUbergraph_GCN_Athena_Item_WaterBuffalo_Hit_Latent, K2Node_SwitchEnum_CmpSuccess_1) == 0x000108, "Member 'GCN_Athena_Item_WaterBuffalo_Hit_Latent_C_ExecuteUbergraph_GCN_Athena_Item_WaterBuffalo_Hit_Latent::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Item_WaterBuffalo_Hit_Latent_C_ExecuteUbergraph_GCN_Athena_Item_WaterBuffalo_Hit_Latent, K2Node_DynamicCast_AsPlayer_Pawn_Athena) == 0x000110, "Member 'GCN_Athena_Item_WaterBuffalo_Hit_Latent_C_ExecuteUbergraph_GCN_Athena_Item_WaterBuffalo_Hit_Latent::K2Node_DynamicCast_AsPlayer_Pawn_Athena' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Item_WaterBuffalo_Hit_Latent_C_ExecuteUbergraph_GCN_Athena_Item_WaterBuffalo_Hit_Latent, K2Node_DynamicCast_bSuccess) == 0x000118, "Member 'GCN_Athena_Item_WaterBuffalo_Hit_Latent_C_ExecuteUbergraph_GCN_Athena_Item_WaterBuffalo_Hit_Latent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Item_WaterBuffalo_Hit_Latent_C_ExecuteUbergraph_GCN_Athena_Item_WaterBuffalo_Hit_Latent, CallFunc_MakeLiteralInt_ReturnValue_1) == 0x00011C, "Member 'GCN_Athena_Item_WaterBuffalo_Hit_Latent_C_ExecuteUbergraph_GCN_Athena_Item_WaterBuffalo_Hit_Latent::CallFunc_MakeLiteralInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Item_WaterBuffalo_Hit_Latent_C_ExecuteUbergraph_GCN_Athena_Item_WaterBuffalo_Hit_Latent, CallFunc_Less_IntInt_ReturnValue_1) == 0x000120, "Member 'GCN_Athena_Item_WaterBuffalo_Hit_Latent_C_ExecuteUbergraph_GCN_Athena_Item_WaterBuffalo_Hit_Latent::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Item_WaterBuffalo_Hit_Latent_C_ExecuteUbergraph_GCN_Athena_Item_WaterBuffalo_Hit_Latent, CallFunc_GetSkeletalMeshForPartType_ReturnValue) == 0x000128, "Member 'GCN_Athena_Item_WaterBuffalo_Hit_Latent_C_ExecuteUbergraph_GCN_Athena_Item_WaterBuffalo_Hit_Latent::CallFunc_GetSkeletalMeshForPartType_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Item_WaterBuffalo_Hit_Latent_C_ExecuteUbergraph_GCN_Athena_Item_WaterBuffalo_Hit_Latent, CallFunc_GetSkeletalMeshForPartType_ReturnValue_1) == 0x000130, "Member 'GCN_Athena_Item_WaterBuffalo_Hit_Latent_C_ExecuteUbergraph_GCN_Athena_Item_WaterBuffalo_Hit_Latent::CallFunc_GetSkeletalMeshForPartType_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Item_WaterBuffalo_Hit_Latent_C_ExecuteUbergraph_GCN_Athena_Item_WaterBuffalo_Hit_Latent, CallFunc_IsValid_ReturnValue) == 0x000138, "Member 'GCN_Athena_Item_WaterBuffalo_Hit_Latent_C_ExecuteUbergraph_GCN_Athena_Item_WaterBuffalo_Hit_Latent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Item_WaterBuffalo_Hit_Latent_C_ExecuteUbergraph_GCN_Athena_Item_WaterBuffalo_Hit_Latent, CallFunc_IsValid_ReturnValue_1) == 0x000139, "Member 'GCN_Athena_Item_WaterBuffalo_Hit_Latent_C_ExecuteUbergraph_GCN_Athena_Item_WaterBuffalo_Hit_Latent::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function GCN_Athena_Item_WaterBuffalo_Hit_Latent.GCN_Athena_Item_WaterBuffalo_Hit_Latent_C.K2_HandleGameplayCue
// 0x00C8 (0x00C8 - 0x0000)
struct GCN_Athena_Item_WaterBuffalo_Hit_Latent_C_K2_HandleGameplayCue final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameplayCueEvent                             EventType;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 Parameters;                                        // 0x0010(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GCN_Athena_Item_WaterBuffalo_Hit_Latent_C_K2_HandleGameplayCue) == 0x000008, "Wrong alignment on GCN_Athena_Item_WaterBuffalo_Hit_Latent_C_K2_HandleGameplayCue");
static_assert(sizeof(GCN_Athena_Item_WaterBuffalo_Hit_Latent_C_K2_HandleGameplayCue) == 0x0000C8, "Wrong size on GCN_Athena_Item_WaterBuffalo_Hit_Latent_C_K2_HandleGameplayCue");
static_assert(offsetof(GCN_Athena_Item_WaterBuffalo_Hit_Latent_C_K2_HandleGameplayCue, MyTarget) == 0x000000, "Member 'GCN_Athena_Item_WaterBuffalo_Hit_Latent_C_K2_HandleGameplayCue::MyTarget' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Item_WaterBuffalo_Hit_Latent_C_K2_HandleGameplayCue, EventType) == 0x000008, "Member 'GCN_Athena_Item_WaterBuffalo_Hit_Latent_C_K2_HandleGameplayCue::EventType' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Item_WaterBuffalo_Hit_Latent_C_K2_HandleGameplayCue, Parameters) == 0x000010, "Member 'GCN_Athena_Item_WaterBuffalo_Hit_Latent_C_K2_HandleGameplayCue::Parameters' has a wrong offset!");

}

