#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCNL_Athena_Ostrich_Jump_InAir

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GCNL_Athena_Ostrich_Jump_InAir.GCNL_Athena_Ostrich_Jump_InAir_C.ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_InAir
// 0x0120 (0x0120 - 0x0000)
struct GCNL_Athena_Ostrich_Jump_InAir_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_InAir final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_MyTarget;                             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x0010(0x00B8)(ConstParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       K2Node_Event_ParticleComponents;                   // 0x00C8(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	TArray<class UAudioComponent*>                K2Node_Event_AudioComponents;                      // 0x00D8(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	class UCameraShake*                           K2Node_Event_BurstCameraShakeInstance;             // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            K2Node_Event_BurstDecalInstance;                   // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_Array_Get_Item;                           // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATestMechVehicle_C*                     K2Node_DynamicCast_AsTest_Mech_Vehicle;            // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetMechMesh_ReturnValue;                  // 0x0110(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GCNL_Athena_Ostrich_Jump_InAir_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_InAir) == 0x000008, "Wrong alignment on GCNL_Athena_Ostrich_Jump_InAir_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_InAir");
static_assert(sizeof(GCNL_Athena_Ostrich_Jump_InAir_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_InAir) == 0x000120, "Wrong size on GCNL_Athena_Ostrich_Jump_InAir_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_InAir");
static_assert(offsetof(GCNL_Athena_Ostrich_Jump_InAir_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_InAir, EntryPoint) == 0x000000, "Member 'GCNL_Athena_Ostrich_Jump_InAir_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_InAir::EntryPoint' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Ostrich_Jump_InAir_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_InAir, K2Node_Event_MyTarget) == 0x000008, "Member 'GCNL_Athena_Ostrich_Jump_InAir_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_InAir::K2Node_Event_MyTarget' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Ostrich_Jump_InAir_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_InAir, K2Node_Event_Parameters) == 0x000010, "Member 'GCNL_Athena_Ostrich_Jump_InAir_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_InAir::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Ostrich_Jump_InAir_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_InAir, K2Node_Event_ParticleComponents) == 0x0000C8, "Member 'GCNL_Athena_Ostrich_Jump_InAir_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_InAir::K2Node_Event_ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Ostrich_Jump_InAir_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_InAir, K2Node_Event_AudioComponents) == 0x0000D8, "Member 'GCNL_Athena_Ostrich_Jump_InAir_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_InAir::K2Node_Event_AudioComponents' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Ostrich_Jump_InAir_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_InAir, K2Node_Event_BurstCameraShakeInstance) == 0x0000E8, "Member 'GCNL_Athena_Ostrich_Jump_InAir_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_InAir::K2Node_Event_BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Ostrich_Jump_InAir_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_InAir, K2Node_Event_BurstDecalInstance) == 0x0000F0, "Member 'GCNL_Athena_Ostrich_Jump_InAir_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_InAir::K2Node_Event_BurstDecalInstance' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Ostrich_Jump_InAir_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_InAir, CallFunc_Array_Get_Item) == 0x0000F8, "Member 'GCNL_Athena_Ostrich_Jump_InAir_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_InAir::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Ostrich_Jump_InAir_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_InAir, K2Node_DynamicCast_AsTest_Mech_Vehicle) == 0x000100, "Member 'GCNL_Athena_Ostrich_Jump_InAir_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_InAir::K2Node_DynamicCast_AsTest_Mech_Vehicle' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Ostrich_Jump_InAir_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_InAir, K2Node_DynamicCast_bSuccess) == 0x000108, "Member 'GCNL_Athena_Ostrich_Jump_InAir_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_InAir::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Ostrich_Jump_InAir_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_InAir, CallFunc_GetMechMesh_ReturnValue) == 0x000110, "Member 'GCNL_Athena_Ostrich_Jump_InAir_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_InAir::CallFunc_GetMechMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Ostrich_Jump_InAir_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_InAir, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000118, "Member 'GCNL_Athena_Ostrich_Jump_InAir_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_InAir::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");

// Function GCNL_Athena_Ostrich_Jump_InAir.GCNL_Athena_Ostrich_Jump_InAir_C.OnApplication
// 0x00F0 (0x00F0 - 0x0000)
struct GCNL_Athena_Ostrich_Jump_InAir_C_OnApplication final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       ParticleComponents;                                // 0x00C0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x00D0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	class UCameraShake*                           BurstCameraShakeInstance;                          // 0x00E0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            BurstDecalInstance;                                // 0x00E8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCNL_Athena_Ostrich_Jump_InAir_C_OnApplication) == 0x000008, "Wrong alignment on GCNL_Athena_Ostrich_Jump_InAir_C_OnApplication");
static_assert(sizeof(GCNL_Athena_Ostrich_Jump_InAir_C_OnApplication) == 0x0000F0, "Wrong size on GCNL_Athena_Ostrich_Jump_InAir_C_OnApplication");
static_assert(offsetof(GCNL_Athena_Ostrich_Jump_InAir_C_OnApplication, MyTarget) == 0x000000, "Member 'GCNL_Athena_Ostrich_Jump_InAir_C_OnApplication::MyTarget' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Ostrich_Jump_InAir_C_OnApplication, Parameters) == 0x000008, "Member 'GCNL_Athena_Ostrich_Jump_InAir_C_OnApplication::Parameters' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Ostrich_Jump_InAir_C_OnApplication, ParticleComponents) == 0x0000C0, "Member 'GCNL_Athena_Ostrich_Jump_InAir_C_OnApplication::ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Ostrich_Jump_InAir_C_OnApplication, AudioComponents) == 0x0000D0, "Member 'GCNL_Athena_Ostrich_Jump_InAir_C_OnApplication::AudioComponents' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Ostrich_Jump_InAir_C_OnApplication, BurstCameraShakeInstance) == 0x0000E0, "Member 'GCNL_Athena_Ostrich_Jump_InAir_C_OnApplication::BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Ostrich_Jump_InAir_C_OnApplication, BurstDecalInstance) == 0x0000E8, "Member 'GCNL_Athena_Ostrich_Jump_InAir_C_OnApplication::BurstDecalInstance' has a wrong offset!");

}

