#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCNL_Athena_Ostrich_Jump_Charging

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function GCNL_Athena_Ostrich_Jump_Charging.GCNL_Athena_Ostrich_Jump_Charging_C.ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_Charging
// 0x03D8 (0x03D8 - 0x0000)
struct GCNL_Athena_Ostrich_Jump_Charging_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_Charging final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_MyTarget_2;                           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters_2;                         // 0x0010(0x00B8)(ConstParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       K2Node_Event_ParticleComponents_2;                 // 0x00C8(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	TArray<class UAudioComponent*>                K2Node_Event_AudioComponents_2;                    // 0x00D8(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	class AActor*                                 K2Node_Event_MyTarget_1;                           // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters_1;                         // 0x00F0(0x00B8)(ConstParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       K2Node_Event_ParticleComponents_1;                 // 0x01A8(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	TArray<class UAudioComponent*>                K2Node_Event_AudioComponents_1;                    // 0x01B8(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	class UCameraShake*                           K2Node_Event_BurstCameraShakeInstance_1;           // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            K2Node_Event_BurstDecalInstance_1;                 // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_Array_Get_Item;                           // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATestMechVehicle_C*                     K2Node_DynamicCast_AsTest_Mech_Vehicle;            // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E9[0x7];                                      // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATestMechVehicle_C*                     K2Node_DynamicCast_AsTest_Mech_Vehicle_1;          // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetMechMesh_ReturnValue;                  // 0x0200(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetMechMesh_ReturnValue_1;                // 0x0208(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x0210(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_MyTarget;                             // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x0228(0x00B8)(ConstParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       K2Node_Event_ParticleComponents;                   // 0x02E0(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	TArray<class UAudioComponent*>                K2Node_Event_AudioComponents;                      // 0x02F0(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	class UCameraShake*                           K2Node_Event_BurstCameraShakeInstance;             // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            K2Node_Event_BurstDecalInstance;                   // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_NormalizedMagnitude; // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_RawMagnitude;  // 0x0314(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           CallFunc_BreakGameplayCueParameters_EffectContext; // 0x0318(0x0018)()
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_MatchedTagName; // 0x0330(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_OriginalTag;   // 0x0338(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedSourceTags; // 0x0340(0x0020)()
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedTargetTags; // 0x0360(0x0020)()
	struct FVector                                CallFunc_BreakGameplayCueParameters_Location;      // 0x0380(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakGameplayCueParameters_Normal;        // 0x038C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_Instigator;    // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_EffectCauser;  // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_BreakGameplayCueParameters_SourceObject;  // 0x03A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakGameplayCueParameters_PhysicalMaterial; // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_GameplayEffectLevel; // 0x03B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_AbilityLevel;  // 0x03BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_BreakGameplayCueParameters_TargetAttachComponent; // 0x03C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_Array_Get_Item_1;                         // 0x03C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x03D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x03D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D2[0x2];                                      // 0x03D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x03D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCNL_Athena_Ostrich_Jump_Charging_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_Charging) == 0x000008, "Wrong alignment on GCNL_Athena_Ostrich_Jump_Charging_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_Charging");
static_assert(sizeof(GCNL_Athena_Ostrich_Jump_Charging_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_Charging) == 0x0003D8, "Wrong size on GCNL_Athena_Ostrich_Jump_Charging_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_Charging");
static_assert(offsetof(GCNL_Athena_Ostrich_Jump_Charging_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_Charging, EntryPoint) == 0x000000, "Member 'GCNL_Athena_Ostrich_Jump_Charging_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_Charging::EntryPoint' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Ostrich_Jump_Charging_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_Charging, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'GCNL_Athena_Ostrich_Jump_Charging_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_Charging::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Ostrich_Jump_Charging_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_Charging, CallFunc_IsValid_ReturnValue_1) == 0x000005, "Member 'GCNL_Athena_Ostrich_Jump_Charging_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_Charging::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Ostrich_Jump_Charging_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_Charging, K2Node_Event_MyTarget_2) == 0x000008, "Member 'GCNL_Athena_Ostrich_Jump_Charging_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_Charging::K2Node_Event_MyTarget_2' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Ostrich_Jump_Charging_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_Charging, K2Node_Event_Parameters_2) == 0x000010, "Member 'GCNL_Athena_Ostrich_Jump_Charging_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_Charging::K2Node_Event_Parameters_2' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Ostrich_Jump_Charging_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_Charging, K2Node_Event_ParticleComponents_2) == 0x0000C8, "Member 'GCNL_Athena_Ostrich_Jump_Charging_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_Charging::K2Node_Event_ParticleComponents_2' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Ostrich_Jump_Charging_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_Charging, K2Node_Event_AudioComponents_2) == 0x0000D8, "Member 'GCNL_Athena_Ostrich_Jump_Charging_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_Charging::K2Node_Event_AudioComponents_2' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Ostrich_Jump_Charging_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_Charging, K2Node_Event_MyTarget_1) == 0x0000E8, "Member 'GCNL_Athena_Ostrich_Jump_Charging_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_Charging::K2Node_Event_MyTarget_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Ostrich_Jump_Charging_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_Charging, K2Node_Event_Parameters_1) == 0x0000F0, "Member 'GCNL_Athena_Ostrich_Jump_Charging_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_Charging::K2Node_Event_Parameters_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Ostrich_Jump_Charging_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_Charging, K2Node_Event_ParticleComponents_1) == 0x0001A8, "Member 'GCNL_Athena_Ostrich_Jump_Charging_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_Charging::K2Node_Event_ParticleComponents_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Ostrich_Jump_Charging_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_Charging, K2Node_Event_AudioComponents_1) == 0x0001B8, "Member 'GCNL_Athena_Ostrich_Jump_Charging_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_Charging::K2Node_Event_AudioComponents_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Ostrich_Jump_Charging_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_Charging, K2Node_Event_BurstCameraShakeInstance_1) == 0x0001C8, "Member 'GCNL_Athena_Ostrich_Jump_Charging_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_Charging::K2Node_Event_BurstCameraShakeInstance_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Ostrich_Jump_Charging_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_Charging, K2Node_Event_BurstDecalInstance_1) == 0x0001D0, "Member 'GCNL_Athena_Ostrich_Jump_Charging_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_Charging::K2Node_Event_BurstDecalInstance_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Ostrich_Jump_Charging_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_Charging, CallFunc_Array_Get_Item) == 0x0001D8, "Member 'GCNL_Athena_Ostrich_Jump_Charging_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_Charging::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Ostrich_Jump_Charging_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_Charging, K2Node_DynamicCast_AsTest_Mech_Vehicle) == 0x0001E0, "Member 'GCNL_Athena_Ostrich_Jump_Charging_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_Charging::K2Node_DynamicCast_AsTest_Mech_Vehicle' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Ostrich_Jump_Charging_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_Charging, K2Node_DynamicCast_bSuccess) == 0x0001E8, "Member 'GCNL_Athena_Ostrich_Jump_Charging_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_Charging::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Ostrich_Jump_Charging_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_Charging, K2Node_DynamicCast_AsTest_Mech_Vehicle_1) == 0x0001F0, "Member 'GCNL_Athena_Ostrich_Jump_Charging_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_Charging::K2Node_DynamicCast_AsTest_Mech_Vehicle_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Ostrich_Jump_Charging_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_Charging, K2Node_DynamicCast_bSuccess_1) == 0x0001F8, "Member 'GCNL_Athena_Ostrich_Jump_Charging_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_Charging::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Ostrich_Jump_Charging_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_Charging, CallFunc_GetMechMesh_ReturnValue) == 0x000200, "Member 'GCNL_Athena_Ostrich_Jump_Charging_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_Charging::CallFunc_GetMechMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Ostrich_Jump_Charging_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_Charging, CallFunc_GetMechMesh_ReturnValue_1) == 0x000208, "Member 'GCNL_Athena_Ostrich_Jump_Charging_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_Charging::CallFunc_GetMechMesh_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Ostrich_Jump_Charging_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_Charging, CallFunc_SpawnSoundAttached_ReturnValue) == 0x000210, "Member 'GCNL_Athena_Ostrich_Jump_Charging_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_Charging::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Ostrich_Jump_Charging_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_Charging, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000218, "Member 'GCNL_Athena_Ostrich_Jump_Charging_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_Charging::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Ostrich_Jump_Charging_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_Charging, K2Node_Event_MyTarget) == 0x000220, "Member 'GCNL_Athena_Ostrich_Jump_Charging_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_Charging::K2Node_Event_MyTarget' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Ostrich_Jump_Charging_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_Charging, K2Node_Event_Parameters) == 0x000228, "Member 'GCNL_Athena_Ostrich_Jump_Charging_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_Charging::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Ostrich_Jump_Charging_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_Charging, K2Node_Event_ParticleComponents) == 0x0002E0, "Member 'GCNL_Athena_Ostrich_Jump_Charging_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_Charging::K2Node_Event_ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Ostrich_Jump_Charging_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_Charging, K2Node_Event_AudioComponents) == 0x0002F0, "Member 'GCNL_Athena_Ostrich_Jump_Charging_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_Charging::K2Node_Event_AudioComponents' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Ostrich_Jump_Charging_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_Charging, K2Node_Event_BurstCameraShakeInstance) == 0x000300, "Member 'GCNL_Athena_Ostrich_Jump_Charging_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_Charging::K2Node_Event_BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Ostrich_Jump_Charging_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_Charging, K2Node_Event_BurstDecalInstance) == 0x000308, "Member 'GCNL_Athena_Ostrich_Jump_Charging_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_Charging::K2Node_Event_BurstDecalInstance' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Ostrich_Jump_Charging_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_Charging, CallFunc_BreakGameplayCueParameters_NormalizedMagnitude) == 0x000310, "Member 'GCNL_Athena_Ostrich_Jump_Charging_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_Charging::CallFunc_BreakGameplayCueParameters_NormalizedMagnitude' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Ostrich_Jump_Charging_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_Charging, CallFunc_BreakGameplayCueParameters_RawMagnitude) == 0x000314, "Member 'GCNL_Athena_Ostrich_Jump_Charging_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_Charging::CallFunc_BreakGameplayCueParameters_RawMagnitude' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Ostrich_Jump_Charging_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_Charging, CallFunc_BreakGameplayCueParameters_EffectContext) == 0x000318, "Member 'GCNL_Athena_Ostrich_Jump_Charging_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_Charging::CallFunc_BreakGameplayCueParameters_EffectContext' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Ostrich_Jump_Charging_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_Charging, CallFunc_BreakGameplayCueParameters_MatchedTagName) == 0x000330, "Member 'GCNL_Athena_Ostrich_Jump_Charging_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_Charging::CallFunc_BreakGameplayCueParameters_MatchedTagName' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Ostrich_Jump_Charging_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_Charging, CallFunc_BreakGameplayCueParameters_OriginalTag) == 0x000338, "Member 'GCNL_Athena_Ostrich_Jump_Charging_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_Charging::CallFunc_BreakGameplayCueParameters_OriginalTag' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Ostrich_Jump_Charging_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_Charging, CallFunc_BreakGameplayCueParameters_AggregatedSourceTags) == 0x000340, "Member 'GCNL_Athena_Ostrich_Jump_Charging_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_Charging::CallFunc_BreakGameplayCueParameters_AggregatedSourceTags' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Ostrich_Jump_Charging_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_Charging, CallFunc_BreakGameplayCueParameters_AggregatedTargetTags) == 0x000360, "Member 'GCNL_Athena_Ostrich_Jump_Charging_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_Charging::CallFunc_BreakGameplayCueParameters_AggregatedTargetTags' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Ostrich_Jump_Charging_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_Charging, CallFunc_BreakGameplayCueParameters_Location) == 0x000380, "Member 'GCNL_Athena_Ostrich_Jump_Charging_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_Charging::CallFunc_BreakGameplayCueParameters_Location' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Ostrich_Jump_Charging_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_Charging, CallFunc_BreakGameplayCueParameters_Normal) == 0x00038C, "Member 'GCNL_Athena_Ostrich_Jump_Charging_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_Charging::CallFunc_BreakGameplayCueParameters_Normal' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Ostrich_Jump_Charging_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_Charging, CallFunc_BreakGameplayCueParameters_Instigator) == 0x000398, "Member 'GCNL_Athena_Ostrich_Jump_Charging_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_Charging::CallFunc_BreakGameplayCueParameters_Instigator' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Ostrich_Jump_Charging_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_Charging, CallFunc_BreakGameplayCueParameters_EffectCauser) == 0x0003A0, "Member 'GCNL_Athena_Ostrich_Jump_Charging_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_Charging::CallFunc_BreakGameplayCueParameters_EffectCauser' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Ostrich_Jump_Charging_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_Charging, CallFunc_BreakGameplayCueParameters_SourceObject) == 0x0003A8, "Member 'GCNL_Athena_Ostrich_Jump_Charging_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_Charging::CallFunc_BreakGameplayCueParameters_SourceObject' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Ostrich_Jump_Charging_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_Charging, CallFunc_BreakGameplayCueParameters_PhysicalMaterial) == 0x0003B0, "Member 'GCNL_Athena_Ostrich_Jump_Charging_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_Charging::CallFunc_BreakGameplayCueParameters_PhysicalMaterial' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Ostrich_Jump_Charging_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_Charging, CallFunc_BreakGameplayCueParameters_GameplayEffectLevel) == 0x0003B8, "Member 'GCNL_Athena_Ostrich_Jump_Charging_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_Charging::CallFunc_BreakGameplayCueParameters_GameplayEffectLevel' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Ostrich_Jump_Charging_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_Charging, CallFunc_BreakGameplayCueParameters_AbilityLevel) == 0x0003BC, "Member 'GCNL_Athena_Ostrich_Jump_Charging_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_Charging::CallFunc_BreakGameplayCueParameters_AbilityLevel' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Ostrich_Jump_Charging_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_Charging, CallFunc_BreakGameplayCueParameters_TargetAttachComponent) == 0x0003C0, "Member 'GCNL_Athena_Ostrich_Jump_Charging_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_Charging::CallFunc_BreakGameplayCueParameters_TargetAttachComponent' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Ostrich_Jump_Charging_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_Charging, CallFunc_Array_Get_Item_1) == 0x0003C8, "Member 'GCNL_Athena_Ostrich_Jump_Charging_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_Charging::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Ostrich_Jump_Charging_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_Charging, CallFunc_Greater_FloatFloat_ReturnValue) == 0x0003D0, "Member 'GCNL_Athena_Ostrich_Jump_Charging_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_Charging::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Ostrich_Jump_Charging_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_Charging, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x0003D1, "Member 'GCNL_Athena_Ostrich_Jump_Charging_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_Charging::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Ostrich_Jump_Charging_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_Charging, CallFunc_SelectInt_ReturnValue) == 0x0003D4, "Member 'GCNL_Athena_Ostrich_Jump_Charging_C_ExecuteUbergraph_GCNL_Athena_Ostrich_Jump_Charging::CallFunc_SelectInt_ReturnValue' has a wrong offset!");

// Function GCNL_Athena_Ostrich_Jump_Charging.GCNL_Athena_Ostrich_Jump_Charging_C.OnRemoval
// 0x00F0 (0x00F0 - 0x0000)
struct GCNL_Athena_Ostrich_Jump_Charging_C_OnRemoval final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       ParticleComponents;                                // 0x00C0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x00D0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	class UCameraShake*                           BurstCameraShakeInstance;                          // 0x00E0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            BurstDecalInstance;                                // 0x00E8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCNL_Athena_Ostrich_Jump_Charging_C_OnRemoval) == 0x000008, "Wrong alignment on GCNL_Athena_Ostrich_Jump_Charging_C_OnRemoval");
static_assert(sizeof(GCNL_Athena_Ostrich_Jump_Charging_C_OnRemoval) == 0x0000F0, "Wrong size on GCNL_Athena_Ostrich_Jump_Charging_C_OnRemoval");
static_assert(offsetof(GCNL_Athena_Ostrich_Jump_Charging_C_OnRemoval, MyTarget) == 0x000000, "Member 'GCNL_Athena_Ostrich_Jump_Charging_C_OnRemoval::MyTarget' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Ostrich_Jump_Charging_C_OnRemoval, Parameters) == 0x000008, "Member 'GCNL_Athena_Ostrich_Jump_Charging_C_OnRemoval::Parameters' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Ostrich_Jump_Charging_C_OnRemoval, ParticleComponents) == 0x0000C0, "Member 'GCNL_Athena_Ostrich_Jump_Charging_C_OnRemoval::ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Ostrich_Jump_Charging_C_OnRemoval, AudioComponents) == 0x0000D0, "Member 'GCNL_Athena_Ostrich_Jump_Charging_C_OnRemoval::AudioComponents' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Ostrich_Jump_Charging_C_OnRemoval, BurstCameraShakeInstance) == 0x0000E0, "Member 'GCNL_Athena_Ostrich_Jump_Charging_C_OnRemoval::BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Ostrich_Jump_Charging_C_OnRemoval, BurstDecalInstance) == 0x0000E8, "Member 'GCNL_Athena_Ostrich_Jump_Charging_C_OnRemoval::BurstDecalInstance' has a wrong offset!");

// Function GCNL_Athena_Ostrich_Jump_Charging.GCNL_Athena_Ostrich_Jump_Charging_C.OnApplication
// 0x00F0 (0x00F0 - 0x0000)
struct GCNL_Athena_Ostrich_Jump_Charging_C_OnApplication final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       ParticleComponents;                                // 0x00C0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x00D0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	class UCameraShake*                           BurstCameraShakeInstance;                          // 0x00E0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            BurstDecalInstance;                                // 0x00E8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCNL_Athena_Ostrich_Jump_Charging_C_OnApplication) == 0x000008, "Wrong alignment on GCNL_Athena_Ostrich_Jump_Charging_C_OnApplication");
static_assert(sizeof(GCNL_Athena_Ostrich_Jump_Charging_C_OnApplication) == 0x0000F0, "Wrong size on GCNL_Athena_Ostrich_Jump_Charging_C_OnApplication");
static_assert(offsetof(GCNL_Athena_Ostrich_Jump_Charging_C_OnApplication, MyTarget) == 0x000000, "Member 'GCNL_Athena_Ostrich_Jump_Charging_C_OnApplication::MyTarget' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Ostrich_Jump_Charging_C_OnApplication, Parameters) == 0x000008, "Member 'GCNL_Athena_Ostrich_Jump_Charging_C_OnApplication::Parameters' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Ostrich_Jump_Charging_C_OnApplication, ParticleComponents) == 0x0000C0, "Member 'GCNL_Athena_Ostrich_Jump_Charging_C_OnApplication::ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Ostrich_Jump_Charging_C_OnApplication, AudioComponents) == 0x0000D0, "Member 'GCNL_Athena_Ostrich_Jump_Charging_C_OnApplication::AudioComponents' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Ostrich_Jump_Charging_C_OnApplication, BurstCameraShakeInstance) == 0x0000E0, "Member 'GCNL_Athena_Ostrich_Jump_Charging_C_OnApplication::BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Ostrich_Jump_Charging_C_OnApplication, BurstDecalInstance) == 0x0000E8, "Member 'GCNL_Athena_Ostrich_Jump_Charging_C_OnApplication::BurstDecalInstance' has a wrong offset!");

// Function GCNL_Athena_Ostrich_Jump_Charging.GCNL_Athena_Ostrich_Jump_Charging_C.OnLoopingStart
// 0x00E0 (0x00E0 - 0x0000)
struct GCNL_Athena_Ostrich_Jump_Charging_C_OnLoopingStart final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       ParticleComponents;                                // 0x00C0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x00D0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
};
static_assert(alignof(GCNL_Athena_Ostrich_Jump_Charging_C_OnLoopingStart) == 0x000008, "Wrong alignment on GCNL_Athena_Ostrich_Jump_Charging_C_OnLoopingStart");
static_assert(sizeof(GCNL_Athena_Ostrich_Jump_Charging_C_OnLoopingStart) == 0x0000E0, "Wrong size on GCNL_Athena_Ostrich_Jump_Charging_C_OnLoopingStart");
static_assert(offsetof(GCNL_Athena_Ostrich_Jump_Charging_C_OnLoopingStart, MyTarget) == 0x000000, "Member 'GCNL_Athena_Ostrich_Jump_Charging_C_OnLoopingStart::MyTarget' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_Ostrich_Jump_Charging_C_OnLoopingStart, Parameters) == 0x000008, "Member 'GCNL_Athena_Ostrich_Jump_Charging_C_OnLoopingStart::Parameters' has a wrong offset!");
