#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCNL_RangedFlashlight

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCNL_RangedFlashlight.GCNL_RangedFlashlight_C
// 0x0050 (0x07B8 - 0x0768)
class AGCNL_RangedFlashlight_C final : public AFortGameplayCueNotify_Loop
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0768(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        SwitchAudio;                                       // 0x0770(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Flashlight_Loop_Cue;                               // 0x0778(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           BulbMaterialEmissiveColorActive;                   // 0x0780(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bToggled;                                          // 0x0790(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_791[0x7];                                      // 0x0791(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           PulseFlashTimerHandle;                             // 0x0798(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AFortWeapon*                            FortWeapon;                                        // 0x07A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ActivationTime;                                    // 0x07A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LastActivationTime;                                // 0x07AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LowRetriggerTime;                                  // 0x07B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GCNL_RangedFlashlight(int32 EntryPoint);
	void ToggleFlashLight();
	void PulseFlash();
	void OnRecurring(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, const TArray<class UParticleSystemComponent*>& ParticleComponents, const TArray<class UAudioComponent*>& AudioComponents, class UCameraShake* BurstCameraShakeInstance, class ADecalActor* BurstDecalInstance);
	void GetToggledAndWeaponFromParams(const struct FGameplayCueParameters& Params_0);
	void HandleAttachmentsAndSound(class AB_Ranged_Flashlight_C** Flashlight);
	void SetWeaponMeshEmissive(class AFortWeapon* Flashlight);
	bool ToggleFlash();
	void CheckToPulseFlash(TDelegate<void()> Delegate);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCNL_RangedFlashlight_C">();
	}
	static class AGCNL_RangedFlashlight_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGCNL_RangedFlashlight_C>();
	}
};
static_assert(alignof(AGCNL_RangedFlashlight_C) == 0x000008, "Wrong alignment on AGCNL_RangedFlashlight_C");
static_assert(sizeof(AGCNL_RangedFlashlight_C) == 0x0007B8, "Wrong size on AGCNL_RangedFlashlight_C");
static_assert(offsetof(AGCNL_RangedFlashlight_C, UberGraphFrame) == 0x000768, "Member 'AGCNL_RangedFlashlight_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGCNL_RangedFlashlight_C, SwitchAudio) == 0x000770, "Member 'AGCNL_RangedFlashlight_C::SwitchAudio' has a wrong offset!");
static_assert(offsetof(AGCNL_RangedFlashlight_C, Flashlight_Loop_Cue) == 0x000778, "Member 'AGCNL_RangedFlashlight_C::Flashlight_Loop_Cue' has a wrong offset!");
static_assert(offsetof(AGCNL_RangedFlashlight_C, BulbMaterialEmissiveColorActive) == 0x000780, "Member 'AGCNL_RangedFlashlight_C::BulbMaterialEmissiveColorActive' has a wrong offset!");
static_assert(offsetof(AGCNL_RangedFlashlight_C, bToggled) == 0x000790, "Member 'AGCNL_RangedFlashlight_C::bToggled' has a wrong offset!");
static_assert(offsetof(AGCNL_RangedFlashlight_C, PulseFlashTimerHandle) == 0x000798, "Member 'AGCNL_RangedFlashlight_C::PulseFlashTimerHandle' has a wrong offset!");
static_assert(offsetof(AGCNL_RangedFlashlight_C, FortWeapon) == 0x0007A0, "Member 'AGCNL_RangedFlashlight_C::FortWeapon' has a wrong offset!");
static_assert(offsetof(AGCNL_RangedFlashlight_C, ActivationTime) == 0x0007A8, "Member 'AGCNL_RangedFlashlight_C::ActivationTime' has a wrong offset!");
static_assert(offsetof(AGCNL_RangedFlashlight_C, LastActivationTime) == 0x0007AC, "Member 'AGCNL_RangedFlashlight_C::LastActivationTime' has a wrong offset!");
static_assert(offsetof(AGCNL_RangedFlashlight_C, LowRetriggerTime) == 0x0007B0, "Member 'AGCNL_RangedFlashlight_C::LowRetriggerTime' has a wrong offset!");

}

