#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HalfShieldPotion_Prop_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass HalfShieldPotion_Prop_AnimBP.HalfShieldPotion_Prop_AnimBP_C
// 0x0100 (0x0368 - 0x0268)
class UHalfShieldPotion_Prop_AnimBP_C final : public UAnimInstance
{
public:
	uint8                                         Pad_268[0x8];                                      // 0x0268(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_D18361C34D981BDD1A63009152AAF787; // 0x0278(0x0030)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_4E170F124EACAF56EFA1518CC3C8608F; // 0x02A8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1388951E4BA0BDBA8187FB9DC79ADE82; // 0x02F0(0x0078)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_HalfShieldPotion_Prop_AnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"HalfShieldPotion_Prop_AnimBP_C">();
	}
	static class UHalfShieldPotion_Prop_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHalfShieldPotion_Prop_AnimBP_C>();
	}
};
static_assert(alignof(UHalfShieldPotion_Prop_AnimBP_C) == 0x000008, "Wrong alignment on UHalfShieldPotion_Prop_AnimBP_C");
static_assert(sizeof(UHalfShieldPotion_Prop_AnimBP_C) == 0x000368, "Wrong size on UHalfShieldPotion_Prop_AnimBP_C");
static_assert(offsetof(UHalfShieldPotion_Prop_AnimBP_C, UberGraphFrame) == 0x000270, "Member 'UHalfShieldPotion_Prop_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UHalfShieldPotion_Prop_AnimBP_C, AnimGraphNode_Root_D18361C34D981BDD1A63009152AAF787) == 0x000278, "Member 'UHalfShieldPotion_Prop_AnimBP_C::AnimGraphNode_Root_D18361C34D981BDD1A63009152AAF787' has a wrong offset!");
static_assert(offsetof(UHalfShieldPotion_Prop_AnimBP_C, AnimGraphNode_Slot_4E170F124EACAF56EFA1518CC3C8608F) == 0x0002A8, "Member 'UHalfShieldPotion_Prop_AnimBP_C::AnimGraphNode_Slot_4E170F124EACAF56EFA1518CC3C8608F' has a wrong offset!");
static_assert(offsetof(UHalfShieldPotion_Prop_AnimBP_C, AnimGraphNode_SequencePlayer_1388951E4BA0BDBA8187FB9DC79ADE82) == 0x0002F0, "Member 'UHalfShieldPotion_Prop_AnimBP_C::AnimGraphNode_SequencePlayer_1388951E4BA0BDBA8187FB9DC79ADE82' has a wrong offset!");

}

