#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemReceivedMissionCompleteHeaderLarge

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ItemReceivedHeaderSubWidgetBase_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ItemReceivedMissionCompleteHeaderLarge.ItemReceivedMissionCompleteHeaderLarge_C
// 0x0068 (0x02C8 - 0x0260)
class UItemReceivedMissionCompleteHeaderLarge_C final : public UItemReceivedHeaderSubWidgetBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_ItemReceivedMissionCompleteHeaderLarge_C; // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonTextBlock*                       BattlepassUpgraded;                                // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_2;                                 // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HeaderBase;                                        // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_BattlePass;                                   // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_LimitedTime;                                  // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_Prestige;                                     // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UItemReceivedAccountWidget_C*           ItemReceivedAccountWidget;                         // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortLazyImage*                         LazyImage_Background;                              // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        Switcher_MissionIcon;                              // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_ChallengeContext;                             // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_ChallengeSetName;                             // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Is_BattlePass;                                     // 0x02C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void UpdateText2();
	void UpdateText();
	void InitFromGiftBoxItem_BP();
	void ExecuteUbergraph_ItemReceivedMissionCompleteHeaderLarge(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ItemReceivedMissionCompleteHeaderLarge_C">();
	}
	static class UItemReceivedMissionCompleteHeaderLarge_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemReceivedMissionCompleteHeaderLarge_C>();
	}
};
static_assert(alignof(UItemReceivedMissionCompleteHeaderLarge_C) == 0x000008, "Wrong alignment on UItemReceivedMissionCompleteHeaderLarge_C");
static_assert(sizeof(UItemReceivedMissionCompleteHeaderLarge_C) == 0x0002C8, "Wrong size on UItemReceivedMissionCompleteHeaderLarge_C");
static_assert(offsetof(UItemReceivedMissionCompleteHeaderLarge_C, UberGraphFrame_ItemReceivedMissionCompleteHeaderLarge_C) == 0x000260, "Member 'UItemReceivedMissionCompleteHeaderLarge_C::UberGraphFrame_ItemReceivedMissionCompleteHeaderLarge_C' has a wrong offset!");
static_assert(offsetof(UItemReceivedMissionCompleteHeaderLarge_C, BattlepassUpgraded) == 0x000268, "Member 'UItemReceivedMissionCompleteHeaderLarge_C::BattlepassUpgraded' has a wrong offset!");
static_assert(offsetof(UItemReceivedMissionCompleteHeaderLarge_C, CommonTextBlock_2) == 0x000270, "Member 'UItemReceivedMissionCompleteHeaderLarge_C::CommonTextBlock_2' has a wrong offset!");
static_assert(offsetof(UItemReceivedMissionCompleteHeaderLarge_C, HeaderBase) == 0x000278, "Member 'UItemReceivedMissionCompleteHeaderLarge_C::HeaderBase' has a wrong offset!");
static_assert(offsetof(UItemReceivedMissionCompleteHeaderLarge_C, Icon_BattlePass) == 0x000280, "Member 'UItemReceivedMissionCompleteHeaderLarge_C::Icon_BattlePass' has a wrong offset!");
static_assert(offsetof(UItemReceivedMissionCompleteHeaderLarge_C, Icon_LimitedTime) == 0x000288, "Member 'UItemReceivedMissionCompleteHeaderLarge_C::Icon_LimitedTime' has a wrong offset!");
static_assert(offsetof(UItemReceivedMissionCompleteHeaderLarge_C, Icon_Prestige) == 0x000290, "Member 'UItemReceivedMissionCompleteHeaderLarge_C::Icon_Prestige' has a wrong offset!");
static_assert(offsetof(UItemReceivedMissionCompleteHeaderLarge_C, ItemReceivedAccountWidget) == 0x000298, "Member 'UItemReceivedMissionCompleteHeaderLarge_C::ItemReceivedAccountWidget' has a wrong offset!");
static_assert(offsetof(UItemReceivedMissionCompleteHeaderLarge_C, LazyImage_Background) == 0x0002A0, "Member 'UItemReceivedMissionCompleteHeaderLarge_C::LazyImage_Background' has a wrong offset!");
static_assert(offsetof(UItemReceivedMissionCompleteHeaderLarge_C, Switcher_MissionIcon) == 0x0002A8, "Member 'UItemReceivedMissionCompleteHeaderLarge_C::Switcher_MissionIcon' has a wrong offset!");
static_assert(offsetof(UItemReceivedMissionCompleteHeaderLarge_C, Text_ChallengeContext) == 0x0002B0, "Member 'UItemReceivedMissionCompleteHeaderLarge_C::Text_ChallengeContext' has a wrong offset!");
static_assert(offsetof(UItemReceivedMissionCompleteHeaderLarge_C, Text_ChallengeSetName) == 0x0002B8, "Member 'UItemReceivedMissionCompleteHeaderLarge_C::Text_ChallengeSetName' has a wrong offset!");
static_assert(offsetof(UItemReceivedMissionCompleteHeaderLarge_C, Is_BattlePass) == 0x0002C0, "Member 'UItemReceivedMissionCompleteHeaderLarge_C::Is_BattlePass' has a wrong offset!");

}

