#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemReceivedMissionCompleteHeaderLarge

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function ItemReceivedMissionCompleteHeaderLarge.ItemReceivedMissionCompleteHeaderLarge_C.UpdateText2
// 0x0188 (0x0188 - 0x0000)
struct ItemReceivedMissionCompleteHeaderLarge_C_UpdateText2 final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicFontMaterial_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicFontMaterial_ReturnValue_1;     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicFontMaterial_ReturnValue_2;     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItemDefinition*                    CallFunc_RetrieveItemDefintionFromParam_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItemDefinition*                    CallFunc_RetrieveItemDefintionFromParam_ReturnValue_1; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortChallengeBundleItemDefinition*     K2Node_DynamicCast_AsFort_Challenge_Bundle_Item_Definition; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortQuestItemDefinition*               K2Node_DynamicCast_AsFort_Quest_Item_Definition;   // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetBundleLevelForQuest_ReturnValue;       // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue_1;                     // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_53[0x5];                                       // 0x0053(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0058(0x0040)(HasGetValueTypeHash)
	struct FFortChallengeSetStyle                 CallFunc_GetDisplayStyle_ReturnValue;              // 0x0098(0x00A0)(ConstParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0138(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0148(0x0018)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0160(0x0028)()
};
static_assert(alignof(ItemReceivedMissionCompleteHeaderLarge_C_UpdateText2) == 0x000008, "Wrong alignment on ItemReceivedMissionCompleteHeaderLarge_C_UpdateText2");
static_assert(sizeof(ItemReceivedMissionCompleteHeaderLarge_C_UpdateText2) == 0x000188, "Wrong size on ItemReceivedMissionCompleteHeaderLarge_C_UpdateText2");
static_assert(offsetof(ItemReceivedMissionCompleteHeaderLarge_C_UpdateText2, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000000, "Member 'ItemReceivedMissionCompleteHeaderLarge_C_UpdateText2::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemReceivedMissionCompleteHeaderLarge_C_UpdateText2, CallFunc_GetDynamicFontMaterial_ReturnValue) == 0x000008, "Member 'ItemReceivedMissionCompleteHeaderLarge_C_UpdateText2::CallFunc_GetDynamicFontMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemReceivedMissionCompleteHeaderLarge_C_UpdateText2, CallFunc_GetDynamicFontMaterial_ReturnValue_1) == 0x000010, "Member 'ItemReceivedMissionCompleteHeaderLarge_C_UpdateText2::CallFunc_GetDynamicFontMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ItemReceivedMissionCompleteHeaderLarge_C_UpdateText2, CallFunc_GetDynamicFontMaterial_ReturnValue_2) == 0x000018, "Member 'ItemReceivedMissionCompleteHeaderLarge_C_UpdateText2::CallFunc_GetDynamicFontMaterial_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ItemReceivedMissionCompleteHeaderLarge_C_UpdateText2, CallFunc_RetrieveItemDefintionFromParam_ReturnValue) == 0x000020, "Member 'ItemReceivedMissionCompleteHeaderLarge_C_UpdateText2::CallFunc_RetrieveItemDefintionFromParam_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemReceivedMissionCompleteHeaderLarge_C_UpdateText2, CallFunc_RetrieveItemDefintionFromParam_ReturnValue_1) == 0x000028, "Member 'ItemReceivedMissionCompleteHeaderLarge_C_UpdateText2::CallFunc_RetrieveItemDefintionFromParam_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ItemReceivedMissionCompleteHeaderLarge_C_UpdateText2, K2Node_DynamicCast_AsFort_Challenge_Bundle_Item_Definition) == 0x000030, "Member 'ItemReceivedMissionCompleteHeaderLarge_C_UpdateText2::K2Node_DynamicCast_AsFort_Challenge_Bundle_Item_Definition' has a wrong offset!");
static_assert(offsetof(ItemReceivedMissionCompleteHeaderLarge_C_UpdateText2, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'ItemReceivedMissionCompleteHeaderLarge_C_UpdateText2::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ItemReceivedMissionCompleteHeaderLarge_C_UpdateText2, K2Node_DynamicCast_AsFort_Quest_Item_Definition) == 0x000040, "Member 'ItemReceivedMissionCompleteHeaderLarge_C_UpdateText2::K2Node_DynamicCast_AsFort_Quest_Item_Definition' has a wrong offset!");
static_assert(offsetof(ItemReceivedMissionCompleteHeaderLarge_C_UpdateText2, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'ItemReceivedMissionCompleteHeaderLarge_C_UpdateText2::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(ItemReceivedMissionCompleteHeaderLarge_C_UpdateText2, CallFunc_GetBundleLevelForQuest_ReturnValue) == 0x00004C, "Member 'ItemReceivedMissionCompleteHeaderLarge_C_UpdateText2::CallFunc_GetBundleLevelForQuest_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemReceivedMissionCompleteHeaderLarge_C_UpdateText2, CallFunc_HasTag_ReturnValue) == 0x000050, "Member 'ItemReceivedMissionCompleteHeaderLarge_C_UpdateText2::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemReceivedMissionCompleteHeaderLarge_C_UpdateText2, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000051, "Member 'ItemReceivedMissionCompleteHeaderLarge_C_UpdateText2::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemReceivedMissionCompleteHeaderLarge_C_UpdateText2, CallFunc_HasTag_ReturnValue_1) == 0x000052, "Member 'ItemReceivedMissionCompleteHeaderLarge_C_UpdateText2::CallFunc_HasTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ItemReceivedMissionCompleteHeaderLarge_C_UpdateText2, K2Node_MakeStruct_FormatArgumentData) == 0x000058, "Member 'ItemReceivedMissionCompleteHeaderLarge_C_UpdateText2::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(ItemReceivedMissionCompleteHeaderLarge_C_UpdateText2, CallFunc_GetDisplayStyle_ReturnValue) == 0x000098, "Member 'ItemReceivedMissionCompleteHeaderLarge_C_UpdateText2::CallFunc_GetDisplayStyle_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemReceivedMissionCompleteHeaderLarge_C_UpdateText2, K2Node_MakeArray_Array) == 0x000138, "Member 'ItemReceivedMissionCompleteHeaderLarge_C_UpdateText2::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(ItemReceivedMissionCompleteHeaderLarge_C_UpdateText2, CallFunc_Format_ReturnValue) == 0x000148, "Member 'ItemReceivedMissionCompleteHeaderLarge_C_UpdateText2::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemReceivedMissionCompleteHeaderLarge_C_UpdateText2, K2Node_MakeStruct_SlateColor) == 0x000160, "Member 'ItemReceivedMissionCompleteHeaderLarge_C_UpdateText2::K2Node_MakeStruct_SlateColor' has a wrong offset!");

// Function ItemReceivedMissionCompleteHeaderLarge.ItemReceivedMissionCompleteHeaderLarge_C.UpdateText
// 0x01C8 (0x01C8 - 0x0000)
struct ItemReceivedMissionCompleteHeaderLarge_C_UpdateText final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicFontMaterial_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicFontMaterial_ReturnValue_1;     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicFontMaterial_ReturnValue_2;     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItemDefinition*                    CallFunc_RetrieveItemDefintionFromParam_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItemDefinition*                    CallFunc_RetrieveItemDefintionFromParam_ReturnValue_1; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortChallengeBundleItemDefinition*     K2Node_DynamicCast_AsFort_Challenge_Bundle_Item_Definition; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortQuestItemDefinition*               K2Node_DynamicCast_AsFort_Quest_Item_Definition;   // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetBundleLevelForQuest_ReturnValue;       // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue_1;                     // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_53[0x5];                                       // 0x0053(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0058(0x0040)(HasGetValueTypeHash)
	struct FFortChallengeSetStyle                 CallFunc_GetDisplayStyle_ReturnValue;              // 0x0098(0x00A0)(ConstParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0138(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0178(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0188(0x0018)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x01A0(0x0028)()
};
static_assert(alignof(ItemReceivedMissionCompleteHeaderLarge_C_UpdateText) == 0x000008, "Wrong alignment on ItemReceivedMissionCompleteHeaderLarge_C_UpdateText");
static_assert(sizeof(ItemReceivedMissionCompleteHeaderLarge_C_UpdateText) == 0x0001C8, "Wrong size on ItemReceivedMissionCompleteHeaderLarge_C_UpdateText");
static_assert(offsetof(ItemReceivedMissionCompleteHeaderLarge_C_UpdateText, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000000, "Member 'ItemReceivedMissionCompleteHeaderLarge_C_UpdateText::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemReceivedMissionCompleteHeaderLarge_C_UpdateText, CallFunc_GetDynamicFontMaterial_ReturnValue) == 0x000008, "Member 'ItemReceivedMissionCompleteHeaderLarge_C_UpdateText::CallFunc_GetDynamicFontMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemReceivedMissionCompleteHeaderLarge_C_UpdateText, CallFunc_GetDynamicFontMaterial_ReturnValue_1) == 0x000010, "Member 'ItemReceivedMissionCompleteHeaderLarge_C_UpdateText::CallFunc_GetDynamicFontMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ItemReceivedMissionCompleteHeaderLarge_C_UpdateText, CallFunc_GetDynamicFontMaterial_ReturnValue_2) == 0x000018, "Member 'ItemReceivedMissionCompleteHeaderLarge_C_UpdateText::CallFunc_GetDynamicFontMaterial_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ItemReceivedMissionCompleteHeaderLarge_C_UpdateText, CallFunc_RetrieveItemDefintionFromParam_ReturnValue) == 0x000020, "Member 'ItemReceivedMissionCompleteHeaderLarge_C_UpdateText::CallFunc_RetrieveItemDefintionFromParam_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemReceivedMissionCompleteHeaderLarge_C_UpdateText, CallFunc_RetrieveItemDefintionFromParam_ReturnValue_1) == 0x000028, "Member 'ItemReceivedMissionCompleteHeaderLarge_C_UpdateText::CallFunc_RetrieveItemDefintionFromParam_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ItemReceivedMissionCompleteHeaderLarge_C_UpdateText, K2Node_DynamicCast_AsFort_Challenge_Bundle_Item_Definition) == 0x000030, "Member 'ItemReceivedMissionCompleteHeaderLarge_C_UpdateText::K2Node_DynamicCast_AsFort_Challenge_Bundle_Item_Definition' has a wrong offset!");
static_assert(offsetof(ItemReceivedMissionCompleteHeaderLarge_C_UpdateText, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'ItemReceivedMissionCompleteHeaderLarge_C_UpdateText::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ItemReceivedMissionCompleteHeaderLarge_C_UpdateText, K2Node_DynamicCast_AsFort_Quest_Item_Definition) == 0x000040, "Member 'ItemReceivedMissionCompleteHeaderLarge_C_UpdateText::K2Node_DynamicCast_AsFort_Quest_Item_Definition' has a wrong offset!");
static_assert(offsetof(ItemReceivedMissionCompleteHeaderLarge_C_UpdateText, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'ItemReceivedMissionCompleteHeaderLarge_C_UpdateText::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(ItemReceivedMissionCompleteHeaderLarge_C_UpdateText, CallFunc_GetBundleLevelForQuest_ReturnValue) == 0x00004C, "Member 'ItemReceivedMissionCompleteHeaderLarge_C_UpdateText::CallFunc_GetBundleLevelForQuest_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemReceivedMissionCompleteHeaderLarge_C_UpdateText, CallFunc_HasTag_ReturnValue) == 0x000050, "Member 'ItemReceivedMissionCompleteHeaderLarge_C_UpdateText::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemReceivedMissionCompleteHeaderLarge_C_UpdateText, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000051, "Member 'ItemReceivedMissionCompleteHeaderLarge_C_UpdateText::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemReceivedMissionCompleteHeaderLarge_C_UpdateText, CallFunc_HasTag_ReturnValue_1) == 0x000052, "Member 'ItemReceivedMissionCompleteHeaderLarge_C_UpdateText::CallFunc_HasTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ItemReceivedMissionCompleteHeaderLarge_C_UpdateText, K2Node_MakeStruct_FormatArgumentData) == 0x000058, "Member 'ItemReceivedMissionCompleteHeaderLarge_C_UpdateText::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(ItemReceivedMissionCompleteHeaderLarge_C_UpdateText, CallFunc_GetDisplayStyle_ReturnValue) == 0x000098, "Member 'ItemReceivedMissionCompleteHeaderLarge_C_UpdateText::CallFunc_GetDisplayStyle_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemReceivedMissionCompleteHeaderLarge_C_UpdateText, K2Node_MakeStruct_FormatArgumentData_1) == 0x000138, "Member 'ItemReceivedMissionCompleteHeaderLarge_C_UpdateText::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(ItemReceivedMissionCompleteHeaderLarge_C_UpdateText, K2Node_MakeArray_Array) == 0x000178, "Member 'ItemReceivedMissionCompleteHeaderLarge_C_UpdateText::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(ItemReceivedMissionCompleteHeaderLarge_C_UpdateText, CallFunc_Format_ReturnValue) == 0x000188, "Member 'ItemReceivedMissionCompleteHeaderLarge_C_UpdateText::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemReceivedMissionCompleteHeaderLarge_C_UpdateText, K2Node_MakeStruct_SlateColor) == 0x0001A0, "Member 'ItemReceivedMissionCompleteHeaderLarge_C_UpdateText::K2Node_MakeStruct_SlateColor' has a wrong offset!");

// Function ItemReceivedMissionCompleteHeaderLarge.ItemReceivedMissionCompleteHeaderLarge_C.ExecuteUbergraph_ItemReceivedMissionCompleteHeaderLarge
// 0x0004 (0x0004 - 0x0000)
struct ItemReceivedMissionCompleteHeaderLarge_C_ExecuteUbergraph_ItemReceivedMissionCompleteHeaderLarge final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemReceivedMissionCompleteHeaderLarge_C_ExecuteUbergraph_ItemReceivedMissionCompleteHeaderLarge) == 0x000004, "Wrong alignment on ItemReceivedMissionCompleteHeaderLarge_C_ExecuteUbergraph_ItemReceivedMissionCompleteHeaderLarge");
static_assert(sizeof(ItemReceivedMissionCompleteHeaderLarge_C_ExecuteUbergraph_ItemReceivedMissionCompleteHeaderLarge) == 0x000004, "Wrong size on ItemReceivedMissionCompleteHeaderLarge_C_ExecuteUbergraph_ItemReceivedMissionCompleteHeaderLarge");
static_assert(offsetof(ItemReceivedMissionCompleteHeaderLarge_C_ExecuteUbergraph_ItemReceivedMissionCompleteHeaderLarge, EntryPoint) == 0x000000, "Member 'ItemReceivedMissionCompleteHeaderLarge_C_ExecuteUbergraph_ItemReceivedMissionCompleteHeaderLarge::EntryPoint' has a wrong offset!");

}

