#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemReceived_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ItemReceived_Base.ItemReceived_Base_C
// 0x00A0 (0x0570 - 0x04D0)
class UItemReceived_Base_C final : public UFortItemReceivedScreen
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Fade;                                              // 0x04D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Collected;                                         // 0x04E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x04E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UAthenaGiftboxUnownedMessage_C*         AthenaGiftboxUnownedMessage;                       // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      CloseButton;                                       // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      EquipButton;                                       // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               FramingWidget;                                     // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_DarkBackground;                              // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageRarityFlare;                                  // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UItemInfoWidget_C*                      ItemInfoWidget;                                    // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   RichText_UnownedBaseItemMessage;                   // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      ShowNextButton;                                    // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Contents;                                  // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_ItemCount;                                    // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_0;                                       // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         ItemSelectionIndex;                                // 0x0550(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimationIndex;                                    // 0x0554(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RolloutTime;                                       // 0x0558(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimationIndexCached;                              // 0x055C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SoundOnItemReceived;                               // 0x0560(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentIndex;                                      // 0x0568(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseClickRollout;                                   // 0x056C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          FromSelf;                                          // 0x056D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	class UWidget* GetWidgetForFramingViewedItem();
	void HandleSelectionIncrement(bool Increment, int32* Index_0);
	void HandleRight(EUINavigation Nav_Enum, class UWidget** NewParam);
	void HandleLeft(EUINavigation Navigation_Enum, class UWidget** NewParam);
	void UpdateFromHoverState(const struct FFortReceivedItemLootInfo& Loot);
	class UItemCardWidget_C* AddItemCard(const struct FFortReceivedItemLootInfo& NewParam);
	void UpdateFromItemReceivedInfo(const struct FFortReceivedItemLootInfo& Loot, bool Select);
	void HandleBack(bool* PassThrough);
	void Construct();
	void BndEvt__PurchaseButton_K2Node_ComponentBoundEvent_66_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void OnGiftBoxItemSet(bool bFromSelf);
	void SelectItem(int32 Index_0, bool CenterWidget);
	void AnimateRollout();
	void UpdateRarityFlare(bool NewParam, int32 Who);
	void BndEvt__EquipButton_K2Node_ComponentBoundEvent_193_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void OnInputModeChanged(bool bUsingGamepad);
	void Rollout_Items_Received();
	void BndEvt__IconTextButton_C_0_K2Node_ComponentBoundEvent_58_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void ShowNextItem();
	void OnActivated();
	void ExecuteUbergraph_ItemReceived_Base(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ItemReceived_Base_C">();
	}
	static class UItemReceived_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemReceived_Base_C>();
	}
};
static_assert(alignof(UItemReceived_Base_C) == 0x000008, "Wrong alignment on UItemReceived_Base_C");
static_assert(sizeof(UItemReceived_Base_C) == 0x000570, "Wrong size on UItemReceived_Base_C");
static_assert(offsetof(UItemReceived_Base_C, UberGraphFrame) == 0x0004D0, "Member 'UItemReceived_Base_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UItemReceived_Base_C, Fade) == 0x0004D8, "Member 'UItemReceived_Base_C::Fade' has a wrong offset!");
static_assert(offsetof(UItemReceived_Base_C, Collected) == 0x0004E0, "Member 'UItemReceived_Base_C::Collected' has a wrong offset!");
static_assert(offsetof(UItemReceived_Base_C, Intro) == 0x0004E8, "Member 'UItemReceived_Base_C::Intro' has a wrong offset!");
static_assert(offsetof(UItemReceived_Base_C, AthenaGiftboxUnownedMessage) == 0x0004F0, "Member 'UItemReceived_Base_C::AthenaGiftboxUnownedMessage' has a wrong offset!");
static_assert(offsetof(UItemReceived_Base_C, CloseButton) == 0x0004F8, "Member 'UItemReceived_Base_C::CloseButton' has a wrong offset!");
static_assert(offsetof(UItemReceived_Base_C, EquipButton) == 0x000500, "Member 'UItemReceived_Base_C::EquipButton' has a wrong offset!");
static_assert(offsetof(UItemReceived_Base_C, FramingWidget) == 0x000508, "Member 'UItemReceived_Base_C::FramingWidget' has a wrong offset!");
static_assert(offsetof(UItemReceived_Base_C, Image_DarkBackground) == 0x000510, "Member 'UItemReceived_Base_C::Image_DarkBackground' has a wrong offset!");
static_assert(offsetof(UItemReceived_Base_C, ImageRarityFlare) == 0x000518, "Member 'UItemReceived_Base_C::ImageRarityFlare' has a wrong offset!");
static_assert(offsetof(UItemReceived_Base_C, ItemInfoWidget) == 0x000520, "Member 'UItemReceived_Base_C::ItemInfoWidget' has a wrong offset!");
static_assert(offsetof(UItemReceived_Base_C, RichText_UnownedBaseItemMessage) == 0x000528, "Member 'UItemReceived_Base_C::RichText_UnownedBaseItemMessage' has a wrong offset!");
static_assert(offsetof(UItemReceived_Base_C, ShowNextButton) == 0x000530, "Member 'UItemReceived_Base_C::ShowNextButton' has a wrong offset!");
static_assert(offsetof(UItemReceived_Base_C, SizeBox_Contents) == 0x000538, "Member 'UItemReceived_Base_C::SizeBox_Contents' has a wrong offset!");
static_assert(offsetof(UItemReceived_Base_C, Text_ItemCount) == 0x000540, "Member 'UItemReceived_Base_C::Text_ItemCount' has a wrong offset!");
static_assert(offsetof(UItemReceived_Base_C, TextBlock_0) == 0x000548, "Member 'UItemReceived_Base_C::TextBlock_0' has a wrong offset!");
static_assert(offsetof(UItemReceived_Base_C, ItemSelectionIndex) == 0x000550, "Member 'UItemReceived_Base_C::ItemSelectionIndex' has a wrong offset!");
static_assert(offsetof(UItemReceived_Base_C, AnimationIndex) == 0x000554, "Member 'UItemReceived_Base_C::AnimationIndex' has a wrong offset!");
static_assert(offsetof(UItemReceived_Base_C, RolloutTime) == 0x000558, "Member 'UItemReceived_Base_C::RolloutTime' has a wrong offset!");
static_assert(offsetof(UItemReceived_Base_C, AnimationIndexCached) == 0x00055C, "Member 'UItemReceived_Base_C::AnimationIndexCached' has a wrong offset!");
static_assert(offsetof(UItemReceived_Base_C, SoundOnItemReceived) == 0x000560, "Member 'UItemReceived_Base_C::SoundOnItemReceived' has a wrong offset!");
static_assert(offsetof(UItemReceived_Base_C, CurrentIndex) == 0x000568, "Member 'UItemReceived_Base_C::CurrentIndex' has a wrong offset!");
static_assert(offsetof(UItemReceived_Base_C, UseClickRollout) == 0x00056C, "Member 'UItemReceived_Base_C::UseClickRollout' has a wrong offset!");
static_assert(offsetof(UItemReceived_Base_C, FromSelf) == 0x00056D, "Member 'UItemReceived_Base_C::FromSelf' has a wrong offset!");

}

