#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JoinServer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass JoinServer.JoinServer_C
// 0x0080 (0x03D8 - 0x0358)
class UJoinServer_C final : public UFortUIStateWidget_NUI
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0358(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBuildWatermark_C*                      BuildWatermark;                                    // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetStack*                     MainContentStack;                                  // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          ManualStart;                                       // 0x0370(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_371[0x7];                                      // 0x0371(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FConfirmationDialogAction>      TutorialCanceledConfirmActions;                    // 0x0378(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class FName                                   NoneAction;                                        // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SoundPromptTutorial;                               // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MatchmakingAttempts;                               // 0x0398(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TutorialMatchmakingStarted;                        // 0x039C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39D[0x3];                                      // 0x039D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UProgressWidget_C*                      ProgressWidget;                                    // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTutorialWindow_C*                      TutorialWindow;                                    // 0x03A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AbandonSession;                                    // 0x03B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B1[0x7];                                      // 0x03B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                MenuWidget;                                        // 0x03B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxMatchmakingAttempts;                            // 0x03C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C4[0x4];                                      // 0x03C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URejoinWindow_C*                        RejoinWindow;                                      // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RejoinAttemptCount;                                // 0x03D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void IsCampaignSubGame(bool* Value);
	void HandleLobbyConnectingToGame();
	void ShowAbandoningProgress();
	void ShowRetryRejoinWindow(const class FText& Failure, bool AllowRetry);
	void ShowRetryRejoinSession();
	void RemoveRejoinWindowDuringRejoin();
	void HideRejoinWindow(bool AbandonSession_0);
	void ShowRejoinWindow();
	class UWidget* HandleGetMainMenuContent();
	void ShowTutorialCanceled();
	void GetMatchmakingError(EMatchmakingCompleteResult MatchMakingError, class FText* ErrorText);
	void HandleLobbyTimeUpdated(int32 TimeRemaining);
	void SkipTutorial();
	void StartTutorialMatchmakingFlow();
	void HandleEnterState(EFortUIState PreviousState);
	void HandleLobbyDisconnected();
	void HandleMatchmakingStateChange(EMatchmakingState OldState, EMatchmakingState NewState);
	void HandleMatchmakingComplete(EMatchmakingCompleteResult Result);
	void Initialize();
	void DialogResult_B65B7C6342A70AAA7E4C689EE8A624BF(EFortDialogResult Result, class FName ResultName);
	void OnFailure_B419884742513722D11D8AB4D90DE5E2();
	void OnSuccess_B419884742513722D11D8AB4D90DE5E2();
	void OnFailure_C91A02504569664A4B1E259E5F57A79D();
	void OnSuccess_C91A02504569664A4B1E259E5F57A79D();
	void RequestTutorialRetry();
	void ShowSkipTutorial();
	void HandleClientEvent_RejoinStart(class UObject* EventSource, class UObject* EventFocus, const struct FFortClientEvent& ClientEvent);
	void HandleRequestRejoinRetry();
	void HandleRequestAbandon();
	void HandleClientEvent_OnboardingStartMatchmaking(class UObject* EventSource, class UObject* EventFocus, const struct FFortClientEvent& ClientEvent);
	void Construct();
	void OnEnterState(EFortUIState PreviousUIState);
	void ExecuteUbergraph_JoinServer(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"JoinServer_C">();
	}
	static class UJoinServer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJoinServer_C>();
	}
};
static_assert(alignof(UJoinServer_C) == 0x000008, "Wrong alignment on UJoinServer_C");
static_assert(sizeof(UJoinServer_C) == 0x0003D8, "Wrong size on UJoinServer_C");
static_assert(offsetof(UJoinServer_C, UberGraphFrame) == 0x000358, "Member 'UJoinServer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UJoinServer_C, BuildWatermark) == 0x000360, "Member 'UJoinServer_C::BuildWatermark' has a wrong offset!");
static_assert(offsetof(UJoinServer_C, MainContentStack) == 0x000368, "Member 'UJoinServer_C::MainContentStack' has a wrong offset!");
static_assert(offsetof(UJoinServer_C, ManualStart) == 0x000370, "Member 'UJoinServer_C::ManualStart' has a wrong offset!");
static_assert(offsetof(UJoinServer_C, TutorialCanceledConfirmActions) == 0x000378, "Member 'UJoinServer_C::TutorialCanceledConfirmActions' has a wrong offset!");
static_assert(offsetof(UJoinServer_C, NoneAction) == 0x000388, "Member 'UJoinServer_C::NoneAction' has a wrong offset!");
static_assert(offsetof(UJoinServer_C, SoundPromptTutorial) == 0x000390, "Member 'UJoinServer_C::SoundPromptTutorial' has a wrong offset!");
static_assert(offsetof(UJoinServer_C, MatchmakingAttempts) == 0x000398, "Member 'UJoinServer_C::MatchmakingAttempts' has a wrong offset!");
static_assert(offsetof(UJoinServer_C, TutorialMatchmakingStarted) == 0x00039C, "Member 'UJoinServer_C::TutorialMatchmakingStarted' has a wrong offset!");
static_assert(offsetof(UJoinServer_C, ProgressWidget) == 0x0003A0, "Member 'UJoinServer_C::ProgressWidget' has a wrong offset!");
static_assert(offsetof(UJoinServer_C, TutorialWindow) == 0x0003A8, "Member 'UJoinServer_C::TutorialWindow' has a wrong offset!");
static_assert(offsetof(UJoinServer_C, AbandonSession) == 0x0003B0, "Member 'UJoinServer_C::AbandonSession' has a wrong offset!");
static_assert(offsetof(UJoinServer_C, MenuWidget) == 0x0003B8, "Member 'UJoinServer_C::MenuWidget' has a wrong offset!");
static_assert(offsetof(UJoinServer_C, MaxMatchmakingAttempts) == 0x0003C0, "Member 'UJoinServer_C::MaxMatchmakingAttempts' has a wrong offset!");
static_assert(offsetof(UJoinServer_C, RejoinWindow) == 0x0003C8, "Member 'UJoinServer_C::RejoinWindow' has a wrong offset!");
static_assert(offsetof(UJoinServer_C, RejoinAttemptCount) == 0x0003D0, "Member 'UJoinServer_C::RejoinAttemptCount' has a wrong offset!");

}

