#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JoinablePartyActionMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass JoinablePartyActionMenu.JoinablePartyActionMenu_C
// 0x0040 (0x02F8 - 0x02B8)
class UJoinablePartyActionMenu_C final : public UFortJoinablePartyActionMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ConfirmationOpened;                                // 0x02C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Opened;                                            // 0x02C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Arrow;                                             // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_OnlineStatusIndicator;                      // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                EntryBorder;                                       // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               HoverBubble;                                       // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUserActionMenuInputButton_C*           UserActionMenuInputButton;                         // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_JoinablePartyActionMenu(int32 EntryPoint);
	void OnOpened();
	void OnToggleConfirmation(bool bIsVisible);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"JoinablePartyActionMenu_C">();
	}
	static class UJoinablePartyActionMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJoinablePartyActionMenu_C>();
	}
};
static_assert(alignof(UJoinablePartyActionMenu_C) == 0x000008, "Wrong alignment on UJoinablePartyActionMenu_C");
static_assert(sizeof(UJoinablePartyActionMenu_C) == 0x0002F8, "Wrong size on UJoinablePartyActionMenu_C");
static_assert(offsetof(UJoinablePartyActionMenu_C, UberGraphFrame) == 0x0002B8, "Member 'UJoinablePartyActionMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UJoinablePartyActionMenu_C, ConfirmationOpened) == 0x0002C0, "Member 'UJoinablePartyActionMenu_C::ConfirmationOpened' has a wrong offset!");
static_assert(offsetof(UJoinablePartyActionMenu_C, Opened) == 0x0002C8, "Member 'UJoinablePartyActionMenu_C::Opened' has a wrong offset!");
static_assert(offsetof(UJoinablePartyActionMenu_C, Arrow) == 0x0002D0, "Member 'UJoinablePartyActionMenu_C::Arrow' has a wrong offset!");
static_assert(offsetof(UJoinablePartyActionMenu_C, Border_OnlineStatusIndicator) == 0x0002D8, "Member 'UJoinablePartyActionMenu_C::Border_OnlineStatusIndicator' has a wrong offset!");
static_assert(offsetof(UJoinablePartyActionMenu_C, EntryBorder) == 0x0002E0, "Member 'UJoinablePartyActionMenu_C::EntryBorder' has a wrong offset!");
static_assert(offsetof(UJoinablePartyActionMenu_C, HoverBubble) == 0x0002E8, "Member 'UJoinablePartyActionMenu_C::HoverBubble' has a wrong offset!");
static_assert(offsetof(UJoinablePartyActionMenu_C, UserActionMenuInputButton) == 0x0002F0, "Member 'UJoinablePartyActionMenu_C::UserActionMenuInputButton' has a wrong offset!");

}

