#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JoinablePartyActionMenu

#include "Basic.hpp"


namespace SDK::Params
{

// Function JoinablePartyActionMenu.JoinablePartyActionMenu_C.ExecuteUbergraph_JoinablePartyActionMenu
// 0x0050 (0x0050 - 0x0000)
struct JoinablePartyActionMenu_C_ExecuteUbergraph_JoinablePartyActionMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetFirstEntryToCenter_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsVisible;                           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortUINavigationManager*               CallFunc_GetUINavigationManager_ReturnValue;       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_Select_Default;                             // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortUINavigationManager*               CallFunc_GetUINavigationManager_ReturnValue_1;     // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(JoinablePartyActionMenu_C_ExecuteUbergraph_JoinablePartyActionMenu) == 0x000008, "Wrong alignment on JoinablePartyActionMenu_C_ExecuteUbergraph_JoinablePartyActionMenu");
static_assert(sizeof(JoinablePartyActionMenu_C_ExecuteUbergraph_JoinablePartyActionMenu) == 0x000050, "Wrong size on JoinablePartyActionMenu_C_ExecuteUbergraph_JoinablePartyActionMenu");
static_assert(offsetof(JoinablePartyActionMenu_C_ExecuteUbergraph_JoinablePartyActionMenu, EntryPoint) == 0x000000, "Member 'JoinablePartyActionMenu_C_ExecuteUbergraph_JoinablePartyActionMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(JoinablePartyActionMenu_C_ExecuteUbergraph_JoinablePartyActionMenu, CallFunc_GetFirstEntryToCenter_ReturnValue) == 0x000008, "Member 'JoinablePartyActionMenu_C_ExecuteUbergraph_JoinablePartyActionMenu::CallFunc_GetFirstEntryToCenter_ReturnValue' has a wrong offset!");
static_assert(offsetof(JoinablePartyActionMenu_C_ExecuteUbergraph_JoinablePartyActionMenu, K2Node_Event_bIsVisible) == 0x000010, "Member 'JoinablePartyActionMenu_C_ExecuteUbergraph_JoinablePartyActionMenu::K2Node_Event_bIsVisible' has a wrong offset!");
static_assert(offsetof(JoinablePartyActionMenu_C_ExecuteUbergraph_JoinablePartyActionMenu, CallFunc_PlayAnimation_ReturnValue) == 0x000018, "Member 'JoinablePartyActionMenu_C_ExecuteUbergraph_JoinablePartyActionMenu::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(JoinablePartyActionMenu_C_ExecuteUbergraph_JoinablePartyActionMenu, CallFunc_GetUINavigationManager_ReturnValue) == 0x000020, "Member 'JoinablePartyActionMenu_C_ExecuteUbergraph_JoinablePartyActionMenu::CallFunc_GetUINavigationManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(JoinablePartyActionMenu_C_ExecuteUbergraph_JoinablePartyActionMenu, Temp_bool_Variable) == 0x000028, "Member 'JoinablePartyActionMenu_C_ExecuteUbergraph_JoinablePartyActionMenu::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(JoinablePartyActionMenu_C_ExecuteUbergraph_JoinablePartyActionMenu, CallFunc_PlayAnimation_ReturnValue_1) == 0x000030, "Member 'JoinablePartyActionMenu_C_ExecuteUbergraph_JoinablePartyActionMenu::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(JoinablePartyActionMenu_C_ExecuteUbergraph_JoinablePartyActionMenu, K2Node_Select_Default) == 0x000038, "Member 'JoinablePartyActionMenu_C_ExecuteUbergraph_JoinablePartyActionMenu::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(JoinablePartyActionMenu_C_ExecuteUbergraph_JoinablePartyActionMenu, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'JoinablePartyActionMenu_C_ExecuteUbergraph_JoinablePartyActionMenu::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(JoinablePartyActionMenu_C_ExecuteUbergraph_JoinablePartyActionMenu, CallFunc_GetUINavigationManager_ReturnValue_1) == 0x000048, "Member 'JoinablePartyActionMenu_C_ExecuteUbergraph_JoinablePartyActionMenu::CallFunc_GetUINavigationManager_ReturnValue_1' has a wrong offset!");

// Function JoinablePartyActionMenu.JoinablePartyActionMenu_C.OnToggleConfirmation
// 0x0001 (0x0001 - 0x0000)
struct JoinablePartyActionMenu_C_OnToggleConfirmation final
{
public:
	bool                                          bIsVisible;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(JoinablePartyActionMenu_C_OnToggleConfirmation) == 0x000001, "Wrong alignment on JoinablePartyActionMenu_C_OnToggleConfirmation");
static_assert(sizeof(JoinablePartyActionMenu_C_OnToggleConfirmation) == 0x000001, "Wrong size on JoinablePartyActionMenu_C_OnToggleConfirmation");
static_assert(offsetof(JoinablePartyActionMenu_C_OnToggleConfirmation, bIsVisible) == 0x000000, "Member 'JoinablePartyActionMenu_C_OnToggleConfirmation::bIsVisible' has a wrong offset!");

}

