#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LiveStreamLobbyAd

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass LiveStreamLobbyAd.LiveStreamLobbyAd_C
// 0x0060 (0x02A8 - 0x0248)
class ULiveStreamLobbyAd_C final : public ULiveStreamLobbyAd
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0248(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hover;                                             // 0x0250(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Art;                                               // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BackgroundImage;                                   // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULiveViolator_C*                        LiveViolator;                                      // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActionWidget*                    PreviousTabAction;                                 // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USimpleCommonButton_C*                  SimpleCommonButton;                                // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   LiveStreamWidgetClass;                             // 0x0280(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnComplete_959CE8C04C72E63ECFA2FAA9D39E9DFC(class UUserWidget* UserWidget);
	void BndEvt__SimpleCommonButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void ExecuteUbergraph_LiveStreamLobbyAd(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LiveStreamLobbyAd_C">();
	}
	static class ULiveStreamLobbyAd_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULiveStreamLobbyAd_C>();
	}
};
static_assert(alignof(ULiveStreamLobbyAd_C) == 0x000008, "Wrong alignment on ULiveStreamLobbyAd_C");
static_assert(sizeof(ULiveStreamLobbyAd_C) == 0x0002A8, "Wrong size on ULiveStreamLobbyAd_C");
static_assert(offsetof(ULiveStreamLobbyAd_C, UberGraphFrame) == 0x000248, "Member 'ULiveStreamLobbyAd_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ULiveStreamLobbyAd_C, Hover) == 0x000250, "Member 'ULiveStreamLobbyAd_C::Hover' has a wrong offset!");
static_assert(offsetof(ULiveStreamLobbyAd_C, Art) == 0x000258, "Member 'ULiveStreamLobbyAd_C::Art' has a wrong offset!");
static_assert(offsetof(ULiveStreamLobbyAd_C, BackgroundImage) == 0x000260, "Member 'ULiveStreamLobbyAd_C::BackgroundImage' has a wrong offset!");
static_assert(offsetof(ULiveStreamLobbyAd_C, LiveViolator) == 0x000268, "Member 'ULiveStreamLobbyAd_C::LiveViolator' has a wrong offset!");
static_assert(offsetof(ULiveStreamLobbyAd_C, PreviousTabAction) == 0x000270, "Member 'ULiveStreamLobbyAd_C::PreviousTabAction' has a wrong offset!");
static_assert(offsetof(ULiveStreamLobbyAd_C, SimpleCommonButton) == 0x000278, "Member 'ULiveStreamLobbyAd_C::SimpleCommonButton' has a wrong offset!");
static_assert(offsetof(ULiveStreamLobbyAd_C, LiveStreamWidgetClass) == 0x000280, "Member 'ULiveStreamLobbyAd_C::LiveStreamWidgetClass' has a wrong offset!");

}

