#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LiveStreamLobbyAd

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function LiveStreamLobbyAd.LiveStreamLobbyAd_C.OnMouseLeave
// 0x0070 (0x0070 - 0x0000)
struct LiveStreamLobbyAd_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(LiveStreamLobbyAd_C_OnMouseLeave) == 0x000008, "Wrong alignment on LiveStreamLobbyAd_C_OnMouseLeave");
static_assert(sizeof(LiveStreamLobbyAd_C_OnMouseLeave) == 0x000070, "Wrong size on LiveStreamLobbyAd_C_OnMouseLeave");
static_assert(offsetof(LiveStreamLobbyAd_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'LiveStreamLobbyAd_C_OnMouseLeave::MouseEvent' has a wrong offset!");

// Function LiveStreamLobbyAd.LiveStreamLobbyAd_C.OnMouseEnter
// 0x00A8 (0x00A8 - 0x0000)
struct LiveStreamLobbyAd_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(LiveStreamLobbyAd_C_OnMouseEnter) == 0x000008, "Wrong alignment on LiveStreamLobbyAd_C_OnMouseEnter");
static_assert(sizeof(LiveStreamLobbyAd_C_OnMouseEnter) == 0x0000A8, "Wrong size on LiveStreamLobbyAd_C_OnMouseEnter");
static_assert(offsetof(LiveStreamLobbyAd_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'LiveStreamLobbyAd_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(LiveStreamLobbyAd_C_OnMouseEnter, MouseEvent) == 0x000038, "Member 'LiveStreamLobbyAd_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function LiveStreamLobbyAd.LiveStreamLobbyAd_C.OnComplete_959CE8C04C72E63ECFA2FAA9D39E9DFC
// 0x0008 (0x0008 - 0x0000)
struct LiveStreamLobbyAd_C_OnComplete_959CE8C04C72E63ECFA2FAA9D39E9DFC final
{
public:
	class UUserWidget*                            UserWidget;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LiveStreamLobbyAd_C_OnComplete_959CE8C04C72E63ECFA2FAA9D39E9DFC) == 0x000008, "Wrong alignment on LiveStreamLobbyAd_C_OnComplete_959CE8C04C72E63ECFA2FAA9D39E9DFC");
static_assert(sizeof(LiveStreamLobbyAd_C_OnComplete_959CE8C04C72E63ECFA2FAA9D39E9DFC) == 0x000008, "Wrong size on LiveStreamLobbyAd_C_OnComplete_959CE8C04C72E63ECFA2FAA9D39E9DFC");
static_assert(offsetof(LiveStreamLobbyAd_C_OnComplete_959CE8C04C72E63ECFA2FAA9D39E9DFC, UserWidget) == 0x000000, "Member 'LiveStreamLobbyAd_C_OnComplete_959CE8C04C72E63ECFA2FAA9D39E9DFC::UserWidget' has a wrong offset!");

// Function LiveStreamLobbyAd.LiveStreamLobbyAd_C.BndEvt__SimpleCommonButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct LiveStreamLobbyAd_C_BndEvt__SimpleCommonButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LiveStreamLobbyAd_C_BndEvt__SimpleCommonButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on LiveStreamLobbyAd_C_BndEvt__SimpleCommonButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(LiveStreamLobbyAd_C_BndEvt__SimpleCommonButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on LiveStreamLobbyAd_C_BndEvt__SimpleCommonButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(LiveStreamLobbyAd_C_BndEvt__SimpleCommonButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'LiveStreamLobbyAd_C_BndEvt__SimpleCommonButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function LiveStreamLobbyAd.LiveStreamLobbyAd_C.ExecuteUbergraph_LiveStreamLobbyAd
// 0x0170 (0x0170 - 0x0000)
struct LiveStreamLobbyAd_C_ExecuteUbergraph_LiveStreamLobbyAd final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUserWidget* UserWidget)> K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            K2Node_CustomEvent_UserWidget;                     // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            Temp_object_Variable;                              // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0048(0x0038)(IsPlainOldData, NoDestructor)
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x0080(0x0070)(ConstParm)
	class UFortAsyncAction_CreateWidgetAsync*     CallFunc_CreateWidgetAsync_ReturnValue;            // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x00F8(0x0070)(ConstParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LiveStreamLobbyAd_C_ExecuteUbergraph_LiveStreamLobbyAd) == 0x000008, "Wrong alignment on LiveStreamLobbyAd_C_ExecuteUbergraph_LiveStreamLobbyAd");
static_assert(sizeof(LiveStreamLobbyAd_C_ExecuteUbergraph_LiveStreamLobbyAd) == 0x000170, "Wrong size on LiveStreamLobbyAd_C_ExecuteUbergraph_LiveStreamLobbyAd");
static_assert(offsetof(LiveStreamLobbyAd_C_ExecuteUbergraph_LiveStreamLobbyAd, EntryPoint) == 0x000000, "Member 'LiveStreamLobbyAd_C_ExecuteUbergraph_LiveStreamLobbyAd::EntryPoint' has a wrong offset!");
static_assert(offsetof(LiveStreamLobbyAd_C_ExecuteUbergraph_LiveStreamLobbyAd, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000008, "Member 'LiveStreamLobbyAd_C_ExecuteUbergraph_LiveStreamLobbyAd::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(LiveStreamLobbyAd_C_ExecuteUbergraph_LiveStreamLobbyAd, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'LiveStreamLobbyAd_C_ExecuteUbergraph_LiveStreamLobbyAd::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(LiveStreamLobbyAd_C_ExecuteUbergraph_LiveStreamLobbyAd, CallFunc_PlayAnimationForward_ReturnValue) == 0x000020, "Member 'LiveStreamLobbyAd_C_ExecuteUbergraph_LiveStreamLobbyAd::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(LiveStreamLobbyAd_C_ExecuteUbergraph_LiveStreamLobbyAd, K2Node_CustomEvent_UserWidget) == 0x000028, "Member 'LiveStreamLobbyAd_C_ExecuteUbergraph_LiveStreamLobbyAd::K2Node_CustomEvent_UserWidget' has a wrong offset!");
static_assert(offsetof(LiveStreamLobbyAd_C_ExecuteUbergraph_LiveStreamLobbyAd, Temp_object_Variable) == 0x000030, "Member 'LiveStreamLobbyAd_C_ExecuteUbergraph_LiveStreamLobbyAd::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(LiveStreamLobbyAd_C_ExecuteUbergraph_LiveStreamLobbyAd, K2Node_ComponentBoundEvent_Button) == 0x000038, "Member 'LiveStreamLobbyAd_C_ExecuteUbergraph_LiveStreamLobbyAd::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(LiveStreamLobbyAd_C_ExecuteUbergraph_LiveStreamLobbyAd, CallFunc_GetOwningPlayer_ReturnValue) == 0x000040, "Member 'LiveStreamLobbyAd_C_ExecuteUbergraph_LiveStreamLobbyAd::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(LiveStreamLobbyAd_C_ExecuteUbergraph_LiveStreamLobbyAd, K2Node_Event_MyGeometry) == 0x000048, "Member 'LiveStreamLobbyAd_C_ExecuteUbergraph_LiveStreamLobbyAd::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(LiveStreamLobbyAd_C_ExecuteUbergraph_LiveStreamLobbyAd, K2Node_Event_MouseEvent_1) == 0x000080, "Member 'LiveStreamLobbyAd_C_ExecuteUbergraph_LiveStreamLobbyAd::K2Node_Event_MouseEvent_1' has a wrong offset!");
static_assert(offsetof(LiveStreamLobbyAd_C_ExecuteUbergraph_LiveStreamLobbyAd, CallFunc_CreateWidgetAsync_ReturnValue) == 0x0000F0, "Member 'LiveStreamLobbyAd_C_ExecuteUbergraph_LiveStreamLobbyAd::CallFunc_CreateWidgetAsync_ReturnValue' has a wrong offset!");
static_assert(offsetof(LiveStreamLobbyAd_C_ExecuteUbergraph_LiveStreamLobbyAd, K2Node_Event_MouseEvent) == 0x0000F8, "Member 'LiveStreamLobbyAd_C_ExecuteUbergraph_LiveStreamLobbyAd::K2Node_Event_MouseEvent' has a wrong offset!");
static_assert(offsetof(LiveStreamLobbyAd_C_ExecuteUbergraph_LiveStreamLobbyAd, CallFunc_IsValid_ReturnValue) == 0x000168, "Member 'LiveStreamLobbyAd_C_ExecuteUbergraph_LiveStreamLobbyAd::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

