#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LoginScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass LoginScreen.LoginScreen_C
// 0x0050 (0x0440 - 0x03F0)
class ULoginScreen_C final : public UFortUIStateWidget_Login
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonBorder*                          BottomBorder;                                      // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      ConsoleBack;                                       // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UConsoleProfileWidget_C*                ConsoleProfileWidget;                              // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageSplashArt;                                    // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone;                                          // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Version;                                      // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBuildWatermark_C*                      Widget_BuildWatermark;                             // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class AFort_Entry_Music_Controller_BP_C*      FrontEnd_Music_Controller;                         // 0x0430(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                PlatformSpecificBackBorder;                        // 0x0438(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void OnEnterState(EFortUIState PreviousUIState);
	void BndEvt__Switcher_ScreenContents_K2Node_ComponentBoundEvent_0_OnActiveWidgetChanged__DelegateSignature(class UWidget* ActiveWidget, int32 ActiveWidgetIndex);
	void ExecuteUbergraph_LoginScreen(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LoginScreen_C">();
	}
	static class ULoginScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULoginScreen_C>();
	}
};
static_assert(alignof(ULoginScreen_C) == 0x000008, "Wrong alignment on ULoginScreen_C");
static_assert(sizeof(ULoginScreen_C) == 0x000440, "Wrong size on ULoginScreen_C");
static_assert(offsetof(ULoginScreen_C, UberGraphFrame) == 0x0003F0, "Member 'ULoginScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ULoginScreen_C, BottomBorder) == 0x0003F8, "Member 'ULoginScreen_C::BottomBorder' has a wrong offset!");
static_assert(offsetof(ULoginScreen_C, ConsoleBack) == 0x000400, "Member 'ULoginScreen_C::ConsoleBack' has a wrong offset!");
static_assert(offsetof(ULoginScreen_C, ConsoleProfileWidget) == 0x000408, "Member 'ULoginScreen_C::ConsoleProfileWidget' has a wrong offset!");
static_assert(offsetof(ULoginScreen_C, ImageSplashArt) == 0x000410, "Member 'ULoginScreen_C::ImageSplashArt' has a wrong offset!");
static_assert(offsetof(ULoginScreen_C, SafeZone) == 0x000418, "Member 'ULoginScreen_C::SafeZone' has a wrong offset!");
static_assert(offsetof(ULoginScreen_C, Text_Version) == 0x000420, "Member 'ULoginScreen_C::Text_Version' has a wrong offset!");
static_assert(offsetof(ULoginScreen_C, Widget_BuildWatermark) == 0x000428, "Member 'ULoginScreen_C::Widget_BuildWatermark' has a wrong offset!");
static_assert(offsetof(ULoginScreen_C, FrontEnd_Music_Controller) == 0x000430, "Member 'ULoginScreen_C::FrontEnd_Music_Controller' has a wrong offset!");
static_assert(offsetof(ULoginScreen_C, PlatformSpecificBackBorder) == 0x000438, "Member 'ULoginScreen_C::PlatformSpecificBackBorder' has a wrong offset!");

}

