#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_HamburgerButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_HamburgerButton.MainMenu_HamburgerButton_C
// 0x0038 (0x0B78 - 0x0B40)
class UMainMenu_HamburgerButton_C final : public UCommonButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B40(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hover_Grow;                                        // 0x0B48(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover_Bounce;                                      // 0x0B50(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover;                                             // 0x0B58(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 ButtonBacking;                                     // 0x0B60(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon;                                              // 0x0B68(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               VariableSize;                                      // 0x0B70(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void BP_OnUnhovered();
	void BP_OnHovered();
	void ExecuteUbergraph_MainMenu_HamburgerButton(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_HamburgerButton_C">();
	}
	static class UMainMenu_HamburgerButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_HamburgerButton_C>();
	}
};
static_assert(alignof(UMainMenu_HamburgerButton_C) == 0x000008, "Wrong alignment on UMainMenu_HamburgerButton_C");
static_assert(sizeof(UMainMenu_HamburgerButton_C) == 0x000B78, "Wrong size on UMainMenu_HamburgerButton_C");
static_assert(offsetof(UMainMenu_HamburgerButton_C, UberGraphFrame) == 0x000B40, "Member 'UMainMenu_HamburgerButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMainMenu_HamburgerButton_C, Hover_Grow) == 0x000B48, "Member 'UMainMenu_HamburgerButton_C::Hover_Grow' has a wrong offset!");
static_assert(offsetof(UMainMenu_HamburgerButton_C, Hover_Bounce) == 0x000B50, "Member 'UMainMenu_HamburgerButton_C::Hover_Bounce' has a wrong offset!");
static_assert(offsetof(UMainMenu_HamburgerButton_C, Hover) == 0x000B58, "Member 'UMainMenu_HamburgerButton_C::Hover' has a wrong offset!");
static_assert(offsetof(UMainMenu_HamburgerButton_C, ButtonBacking) == 0x000B60, "Member 'UMainMenu_HamburgerButton_C::ButtonBacking' has a wrong offset!");
static_assert(offsetof(UMainMenu_HamburgerButton_C, Icon) == 0x000B68, "Member 'UMainMenu_HamburgerButton_C::Icon' has a wrong offset!");
static_assert(offsetof(UMainMenu_HamburgerButton_C, VariableSize) == 0x000B70, "Member 'UMainMenu_HamburgerButton_C::VariableSize' has a wrong offset!");

}

