#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Mech_Veh_ConrolRig

#include "Basic.hpp"

#include "ControlRig_structs.hpp"
#include "ControlRig_classes.hpp"


namespace SDK
{

// ControlRigBlueprintGeneratedClass Mech_Veh_ConrolRig.Mech_Veh_ConrolRig_C
// 0x17C8 (0x1A40 - 0x0278)
class UMech_Veh_ConrolRig_C final : public UControlRig
{
public:
	struct FRigUnit_BeginExecution                BeginExecution_0;                                  // 0x0278(0x0040)(Edit, BlueprintVisible, DisableEditOnInstance)
	uint8                                         Pad_2B8[0x8];                                      // 0x02B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigUnit_Control                       Leg_IK_L;                                          // 0x02C0(0x00F0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_SpringIK                      SpringIK_0;                                        // 0x03B0(0x01A0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_SetBoneTransform              SetBoneTransform_0;                                // 0x0550(0x0090)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_Control                       Knee_Pole_Vector_L;                                // 0x05E0(0x00F0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_MathTransformMul              MathTransformMul_0;                                // 0x06D0(0x00B0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_GetBoneTransform              GetBoneTransform_0;                                // 0x0780(0x0070)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_GetBoneTransform              GetBoneTransform_1;                                // 0x07F0(0x0070)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_Control                       Leg_IK_R;                                          // 0x0860(0x00F0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_SpringIK                      SpringIK_1;                                        // 0x0950(0x01A0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_SetBoneTransform              SetBoneTransform_1;                                // 0x0AF0(0x0090)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_Control                       Knee_Pole_Vector_R;                                // 0x0B80(0x00F0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_MathTransformMul              MathTransformMul_1;                                // 0x0C70(0x00B0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_GetBoneTransform              GetBoneTransform_2;                                // 0x0D20(0x0070)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_GetBoneTransform              GetBoneTransform_3;                                // 0x0D90(0x0070)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_GetInitialBoneTransform       GetInitialBoneTransform_0;                         // 0x0E00(0x0070)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_GetInitialBoneTransform       GetInitialBoneTransform_1;                         // 0x0E70(0x0070)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_MathTransformMakeRelative     MathTransformMakeRelative_0;                       // 0x0EE0(0x00B0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_MathTransformMul              MathTransformMul_2;                                // 0x0F90(0x00B0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_GetInitialBoneTransform       GetInitialBoneTransform_2;                         // 0x1040(0x0070)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_GetInitialBoneTransform       GetInitialBoneTransform_3;                         // 0x10B0(0x0070)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_MathTransformMakeRelative     MathTransformMakeRelative_1;                       // 0x1120(0x00B0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_MathTransformMul              MathTransformMul_3;                                // 0x11D0(0x00B0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_FABRIK                        FABRIK_0;                                          // 0x1280(0x00C0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_FABRIK                        FABRIK_1;                                          // 0x1340(0x00C0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_SetBoneRotation               SetBoneRotation_3;                                 // 0x1400(0x0070)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_GetBoneTransform              GetBoneTransform_1_0;                              // 0x1470(0x0070)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_GetInitialBoneTransform       GetInitialBoneTransform_3_0;                       // 0x14E0(0x0070)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_GetInitialBoneTransform       GetInitialBoneTransform_4;                         // 0x1550(0x0070)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_MathTransformMakeRelative     MathTransformMakeRelative_0_0;                     // 0x15C0(0x00B0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_MathTransformMul              MathTransformMul_0_0;                              // 0x1670(0x00B0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_SetBoneRotation               SetBoneRotation_5;                                 // 0x1720(0x0070)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_GetBoneTransform              GetBoneTransform_0_0;                              // 0x1790(0x0070)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_GetInitialBoneTransform       GetInitialBoneTransform_6;                         // 0x1800(0x0070)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_GetInitialBoneTransform       GetInitialBoneTransform_7;                         // 0x1870(0x0070)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_MathTransformMakeRelative     MathTransformMakeRelative_1_0;                     // 0x18E0(0x00B0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_MathTransformMul              MathTransformMul_1_0;                              // 0x1990(0x00B0)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Mech_Veh_ConrolRig_C">();
	}
	static class UMech_Veh_ConrolRig_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMech_Veh_ConrolRig_C>();
	}
};
static_assert(alignof(UMech_Veh_ConrolRig_C) == 0x000010, "Wrong alignment on UMech_Veh_ConrolRig_C");
static_assert(sizeof(UMech_Veh_ConrolRig_C) == 0x001A40, "Wrong size on UMech_Veh_ConrolRig_C");
static_assert(offsetof(UMech_Veh_ConrolRig_C, BeginExecution_0) == 0x000278, "Member 'UMech_Veh_ConrolRig_C::BeginExecution_0' has a wrong offset!");
static_assert(offsetof(UMech_Veh_ConrolRig_C, Leg_IK_L) == 0x0002C0, "Member 'UMech_Veh_ConrolRig_C::Leg_IK_L' has a wrong offset!");
static_assert(offsetof(UMech_Veh_ConrolRig_C, SpringIK_0) == 0x0003B0, "Member 'UMech_Veh_ConrolRig_C::SpringIK_0' has a wrong offset!");
static_assert(offsetof(UMech_Veh_ConrolRig_C, SetBoneTransform_0) == 0x000550, "Member 'UMech_Veh_ConrolRig_C::SetBoneTransform_0' has a wrong offset!");
static_assert(offsetof(UMech_Veh_ConrolRig_C, Knee_Pole_Vector_L) == 0x0005E0, "Member 'UMech_Veh_ConrolRig_C::Knee_Pole_Vector_L' has a wrong offset!");
static_assert(offsetof(UMech_Veh_ConrolRig_C, MathTransformMul_0) == 0x0006D0, "Member 'UMech_Veh_ConrolRig_C::MathTransformMul_0' has a wrong offset!");
static_assert(offsetof(UMech_Veh_ConrolRig_C, GetBoneTransform_0) == 0x000780, "Member 'UMech_Veh_ConrolRig_C::GetBoneTransform_0' has a wrong offset!");
static_assert(offsetof(UMech_Veh_ConrolRig_C, GetBoneTransform_1) == 0x0007F0, "Member 'UMech_Veh_ConrolRig_C::GetBoneTransform_1' has a wrong offset!");
static_assert(offsetof(UMech_Veh_ConrolRig_C, Leg_IK_R) == 0x000860, "Member 'UMech_Veh_ConrolRig_C::Leg_IK_R' has a wrong offset!");
static_assert(offsetof(UMech_Veh_ConrolRig_C, SpringIK_1) == 0x000950, "Member 'UMech_Veh_ConrolRig_C::SpringIK_1' has a wrong offset!");
static_assert(offsetof(UMech_Veh_ConrolRig_C, SetBoneTransform_1) == 0x000AF0, "Member 'UMech_Veh_ConrolRig_C::SetBoneTransform_1' has a wrong offset!");
static_assert(offsetof(UMech_Veh_ConrolRig_C, Knee_Pole_Vector_R) == 0x000B80, "Member 'UMech_Veh_ConrolRig_C::Knee_Pole_Vector_R' has a wrong offset!");
static_assert(offsetof(UMech_Veh_ConrolRig_C, MathTransformMul_1) == 0x000C70, "Member 'UMech_Veh_ConrolRig_C::MathTransformMul_1' has a wrong offset!");
static_assert(offsetof(UMech_Veh_ConrolRig_C, GetBoneTransform_2) == 0x000D20, "Member 'UMech_Veh_ConrolRig_C::GetBoneTransform_2' has a wrong offset!");
static_assert(offsetof(UMech_Veh_ConrolRig_C, GetBoneTransform_3) == 0x000D90, "Member 'UMech_Veh_ConrolRig_C::GetBoneTransform_3' has a wrong offset!");
static_assert(offsetof(UMech_Veh_ConrolRig_C, GetInitialBoneTransform_0) == 0x000E00, "Member 'UMech_Veh_ConrolRig_C::GetInitialBoneTransform_0' has a wrong offset!");
static_assert(offsetof(UMech_Veh_ConrolRig_C, GetInitialBoneTransform_1) == 0x000E70, "Member 'UMech_Veh_ConrolRig_C::GetInitialBoneTransform_1' has a wrong offset!");
static_assert(offsetof(UMech_Veh_ConrolRig_C, MathTransformMakeRelative_0) == 0x000EE0, "Member 'UMech_Veh_ConrolRig_C::MathTransformMakeRelative_0' has a wrong offset!");
static_assert(offsetof(UMech_Veh_ConrolRig_C, MathTransformMul_2) == 0x000F90, "Member 'UMech_Veh_ConrolRig_C::MathTransformMul_2' has a wrong offset!");
static_assert(offsetof(UMech_Veh_ConrolRig_C, GetInitialBoneTransform_2) == 0x001040, "Member 'UMech_Veh_ConrolRig_C::GetInitialBoneTransform_2' has a wrong offset!");
static_assert(offsetof(UMech_Veh_ConrolRig_C, GetInitialBoneTransform_3) == 0x0010B0, "Member 'UMech_Veh_ConrolRig_C::GetInitialBoneTransform_3' has a wrong offset!");
static_assert(offsetof(UMech_Veh_ConrolRig_C, MathTransformMakeRelative_1) == 0x001120, "Member 'UMech_Veh_ConrolRig_C::MathTransformMakeRelative_1' has a wrong offset!");
static_assert(offsetof(UMech_Veh_ConrolRig_C, MathTransformMul_3) == 0x0011D0, "Member 'UMech_Veh_ConrolRig_C::MathTransformMul_3' has a wrong offset!");
static_assert(offsetof(UMech_Veh_ConrolRig_C, FABRIK_0) == 0x001280, "Member 'UMech_Veh_ConrolRig_C::FABRIK_0' has a wrong offset!");
static_assert(offsetof(UMech_Veh_ConrolRig_C, FABRIK_1) == 0x001340, "Member 'UMech_Veh_ConrolRig_C::FABRIK_1' has a wrong offset!");
static_assert(offsetof(UMech_Veh_ConrolRig_C, SetBoneRotation_3) == 0x001400, "Member 'UMech_Veh_ConrolRig_C::SetBoneRotation_3' has a wrong offset!");
static_assert(offsetof(UMech_Veh_ConrolRig_C, GetBoneTransform_1_0) == 0x001470, "Member 'UMech_Veh_ConrolRig_C::GetBoneTransform_1_0' has a wrong offset!");
static_assert(offsetof(UMech_Veh_ConrolRig_C, GetInitialBoneTransform_3_0) == 0x0014E0, "Member 'UMech_Veh_ConrolRig_C::GetInitialBoneTransform_3_0' has a wrong offset!");
static_assert(offsetof(UMech_Veh_ConrolRig_C, GetInitialBoneTransform_4) == 0x001550, "Member 'UMech_Veh_ConrolRig_C::GetInitialBoneTransform_4' has a wrong offset!");
static_assert(offsetof(UMech_Veh_ConrolRig_C, MathTransformMakeRelative_0_0) == 0x0015C0, "Member 'UMech_Veh_ConrolRig_C::MathTransformMakeRelative_0_0' has a wrong offset!");
static_assert(offsetof(UMech_Veh_ConrolRig_C, MathTransformMul_0_0) == 0x001670, "Member 'UMech_Veh_ConrolRig_C::MathTransformMul_0_0' has a wrong offset!");
static_assert(offsetof(UMech_Veh_ConrolRig_C, SetBoneRotation_5) == 0x001720, "Member 'UMech_Veh_ConrolRig_C::SetBoneRotation_5' has a wrong offset!");
static_assert(offsetof(UMech_Veh_ConrolRig_C, GetBoneTransform_0_0) == 0x001790, "Member 'UMech_Veh_ConrolRig_C::GetBoneTransform_0_0' has a wrong offset!");
static_assert(offsetof(UMech_Veh_ConrolRig_C, GetInitialBoneTransform_6) == 0x001800, "Member 'UMech_Veh_ConrolRig_C::GetInitialBoneTransform_6' has a wrong offset!");
static_assert(offsetof(UMech_Veh_ConrolRig_C, GetInitialBoneTransform_7) == 0x001870, "Member 'UMech_Veh_ConrolRig_C::GetInitialBoneTransform_7' has a wrong offset!");
static_assert(offsetof(UMech_Veh_ConrolRig_C, MathTransformMakeRelative_1_0) == 0x0018E0, "Member 'UMech_Veh_ConrolRig_C::MathTransformMakeRelative_1_0' has a wrong offset!");
static_assert(offsetof(UMech_Veh_ConrolRig_C, MathTransformMul_1_0) == 0x001990, "Member 'UMech_Veh_ConrolRig_C::MathTransformMul_1_0' has a wrong offset!");

}

