#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MiniShieldPotion_Prop_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass MiniShieldPotion_Prop_AnimBP.MiniShieldPotion_Prop_AnimBP_C
// 0x0100 (0x0368 - 0x0268)
class UMiniShieldPotion_Prop_AnimBP_C final : public UAnimInstance
{
public:
	uint8                                         Pad_268[0x8];                                      // 0x0268(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_ADBF5B5247A0D734AE3EC09836B87FFF; // 0x0278(0x0030)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_78F97BF7428BE467D018D1901FBFBB3A; // 0x02A8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_643128CD4E51CB7A8C42BF87DED7A3A0; // 0x02F0(0x0078)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_MiniShieldPotion_Prop_AnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MiniShieldPotion_Prop_AnimBP_C">();
	}
	static class UMiniShieldPotion_Prop_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMiniShieldPotion_Prop_AnimBP_C>();
	}
};
static_assert(alignof(UMiniShieldPotion_Prop_AnimBP_C) == 0x000008, "Wrong alignment on UMiniShieldPotion_Prop_AnimBP_C");
static_assert(sizeof(UMiniShieldPotion_Prop_AnimBP_C) == 0x000368, "Wrong size on UMiniShieldPotion_Prop_AnimBP_C");
static_assert(offsetof(UMiniShieldPotion_Prop_AnimBP_C, UberGraphFrame) == 0x000270, "Member 'UMiniShieldPotion_Prop_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMiniShieldPotion_Prop_AnimBP_C, AnimGraphNode_Root_ADBF5B5247A0D734AE3EC09836B87FFF) == 0x000278, "Member 'UMiniShieldPotion_Prop_AnimBP_C::AnimGraphNode_Root_ADBF5B5247A0D734AE3EC09836B87FFF' has a wrong offset!");
static_assert(offsetof(UMiniShieldPotion_Prop_AnimBP_C, AnimGraphNode_Slot_78F97BF7428BE467D018D1901FBFBB3A) == 0x0002A8, "Member 'UMiniShieldPotion_Prop_AnimBP_C::AnimGraphNode_Slot_78F97BF7428BE467D018D1901FBFBB3A' has a wrong offset!");
static_assert(offsetof(UMiniShieldPotion_Prop_AnimBP_C, AnimGraphNode_SequencePlayer_643128CD4E51CB7A8C42BF87DED7A3A0) == 0x0002F0, "Member 'UMiniShieldPotion_Prop_AnimBP_C::AnimGraphNode_SequencePlayer_643128CD4E51CB7A8C42BF87DED7A3A0' has a wrong offset!");

}

