#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MinigameButtons

#include "Basic.hpp"

#include "MinigameButtonsState_structs.hpp"
#include "Engine_structs.hpp"
#include "MinigameButtonsStateConfiguration_structs.hpp"
#include "UMG_classes.hpp"
#include "MinigameButtonsWidgetSwitcherConfiguration_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MinigameButtons.MinigameButtons_C
// 0x0140 (0x0368 - 0x0228)
class UMinigameButtons_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0228(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetSwitcher*                        ButtonSwitcher;                                    // 0x0230(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      EndGameButton;                                     // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      EndGameButton2;                                    // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      StartGameButton;                                   // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      StartGameButton2;                                  // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              StartButtonClicked;                                // 0x0258(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              EndButtonClicked;                                  // 0x0268(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(class UCommonButton* Button)> StartButtonHovered;                                // 0x0278(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(class UCommonButton* Button)> EndButtonHovered;                                  // 0x0288(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UIconTextButton_C*                      CurrentButton;                                     // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMinigameButtonsState                         ButtonState;                                       // 0x02A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A1[0x7];                                      // 0x02A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EMinigameButtonsState, struct FMinigameButtonsStateConfiguration> ButtonConfigurations;                              // 0x02A8(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance)
	TMulticastInlineDelegate<void(class UCommonButton* Button)> StartButtonUnhovered;                              // 0x02F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(class UCommonButton* Button)> EndButtonUnhovered;                                // 0x0308(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FMinigameButtonsWidgetSwitcherConfiguration CurrentWidgetSwitcherConfiguration;                // 0x0318(0x0040)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<struct FMinigameButtonsWidgetSwitcherConfiguration> WidgetSwitcherConfigurations;                      // 0x0358(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference)

public:
	void UpdateButtonsFromButtonState();
	void SetButtonState(EMinigameButtonsState Value);
	void CenterOnCurrentButton();
	void UpdateButtons();
	void BndEvt__StartGameButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__EndGameButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void SetWidgetSwitcherIndex(int32 Index_0);
	void BndEvt__EndGameButton2_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__StartGameButton2_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__StartGameButton2_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__EndGameButton2_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__StartGameButton2_K2Node_ComponentBoundEvent_6_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__EndGameButton2_K2Node_ComponentBoundEvent_7_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void OnInitialized();
	void ExecuteUbergraph_MinigameButtons(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MinigameButtons_C">();
	}
	static class UMinigameButtons_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMinigameButtons_C>();
	}
};
static_assert(alignof(UMinigameButtons_C) == 0x000008, "Wrong alignment on UMinigameButtons_C");
static_assert(sizeof(UMinigameButtons_C) == 0x000368, "Wrong size on UMinigameButtons_C");
static_assert(offsetof(UMinigameButtons_C, UberGraphFrame) == 0x000228, "Member 'UMinigameButtons_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMinigameButtons_C, ButtonSwitcher) == 0x000230, "Member 'UMinigameButtons_C::ButtonSwitcher' has a wrong offset!");
static_assert(offsetof(UMinigameButtons_C, EndGameButton) == 0x000238, "Member 'UMinigameButtons_C::EndGameButton' has a wrong offset!");
static_assert(offsetof(UMinigameButtons_C, EndGameButton2) == 0x000240, "Member 'UMinigameButtons_C::EndGameButton2' has a wrong offset!");
static_assert(offsetof(UMinigameButtons_C, StartGameButton) == 0x000248, "Member 'UMinigameButtons_C::StartGameButton' has a wrong offset!");
static_assert(offsetof(UMinigameButtons_C, StartGameButton2) == 0x000250, "Member 'UMinigameButtons_C::StartGameButton2' has a wrong offset!");
static_assert(offsetof(UMinigameButtons_C, StartButtonClicked) == 0x000258, "Member 'UMinigameButtons_C::StartButtonClicked' has a wrong offset!");
static_assert(offsetof(UMinigameButtons_C, EndButtonClicked) == 0x000268, "Member 'UMinigameButtons_C::EndButtonClicked' has a wrong offset!");
static_assert(offsetof(UMinigameButtons_C, StartButtonHovered) == 0x000278, "Member 'UMinigameButtons_C::StartButtonHovered' has a wrong offset!");
static_assert(offsetof(UMinigameButtons_C, EndButtonHovered) == 0x000288, "Member 'UMinigameButtons_C::EndButtonHovered' has a wrong offset!");
static_assert(offsetof(UMinigameButtons_C, CurrentButton) == 0x000298, "Member 'UMinigameButtons_C::CurrentButton' has a wrong offset!");
static_assert(offsetof(UMinigameButtons_C, ButtonState) == 0x0002A0, "Member 'UMinigameButtons_C::ButtonState' has a wrong offset!");
static_assert(offsetof(UMinigameButtons_C, ButtonConfigurations) == 0x0002A8, "Member 'UMinigameButtons_C::ButtonConfigurations' has a wrong offset!");
static_assert(offsetof(UMinigameButtons_C, StartButtonUnhovered) == 0x0002F8, "Member 'UMinigameButtons_C::StartButtonUnhovered' has a wrong offset!");
static_assert(offsetof(UMinigameButtons_C, EndButtonUnhovered) == 0x000308, "Member 'UMinigameButtons_C::EndButtonUnhovered' has a wrong offset!");
static_assert(offsetof(UMinigameButtons_C, CurrentWidgetSwitcherConfiguration) == 0x000318, "Member 'UMinigameButtons_C::CurrentWidgetSwitcherConfiguration' has a wrong offset!");
static_assert(offsetof(UMinigameButtons_C, WidgetSwitcherConfigurations) == 0x000358, "Member 'UMinigameButtons_C::WidgetSwitcherConfigurations' has a wrong offset!");

}

