#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MissionInfoPanel

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function MissionInfoPanel.MissionInfoPanel_C.SetMissionStyle
// 0x00A0 (0x00A0 - 0x0000)
struct MissionInfoPanel_C_SetMissionStyle final
{
public:
	struct FFortChallengeSetStyle                 Style;                                             // 0x0000(0x00A0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(MissionInfoPanel_C_SetMissionStyle) == 0x000008, "Wrong alignment on MissionInfoPanel_C_SetMissionStyle");
static_assert(sizeof(MissionInfoPanel_C_SetMissionStyle) == 0x0000A0, "Wrong size on MissionInfoPanel_C_SetMissionStyle");
static_assert(offsetof(MissionInfoPanel_C_SetMissionStyle, Style) == 0x000000, "Member 'MissionInfoPanel_C_SetMissionStyle::Style' has a wrong offset!");

// Function MissionInfoPanel.MissionInfoPanel_C.ExecuteUbergraph_MissionInfoPanel
// 0x00E8 (0x00E8 - 0x0000)
struct MissionInfoPanel_C_ExecuteUbergraph_MissionInfoPanel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicFontMaterial_ReturnValue;       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortChallengeSetStyle                 K2Node_Event_Style;                                // 0x0020(0x00A0)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x00C0(0x0028)()
};
static_assert(alignof(MissionInfoPanel_C_ExecuteUbergraph_MissionInfoPanel) == 0x000008, "Wrong alignment on MissionInfoPanel_C_ExecuteUbergraph_MissionInfoPanel");
static_assert(sizeof(MissionInfoPanel_C_ExecuteUbergraph_MissionInfoPanel) == 0x0000E8, "Wrong size on MissionInfoPanel_C_ExecuteUbergraph_MissionInfoPanel");
static_assert(offsetof(MissionInfoPanel_C_ExecuteUbergraph_MissionInfoPanel, EntryPoint) == 0x000000, "Member 'MissionInfoPanel_C_ExecuteUbergraph_MissionInfoPanel::EntryPoint' has a wrong offset!");
static_assert(offsetof(MissionInfoPanel_C_ExecuteUbergraph_MissionInfoPanel, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'MissionInfoPanel_C_ExecuteUbergraph_MissionInfoPanel::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionInfoPanel_C_ExecuteUbergraph_MissionInfoPanel, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000010, "Member 'MissionInfoPanel_C_ExecuteUbergraph_MissionInfoPanel::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MissionInfoPanel_C_ExecuteUbergraph_MissionInfoPanel, CallFunc_GetDynamicFontMaterial_ReturnValue) == 0x000018, "Member 'MissionInfoPanel_C_ExecuteUbergraph_MissionInfoPanel::CallFunc_GetDynamicFontMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionInfoPanel_C_ExecuteUbergraph_MissionInfoPanel, K2Node_Event_Style) == 0x000020, "Member 'MissionInfoPanel_C_ExecuteUbergraph_MissionInfoPanel::K2Node_Event_Style' has a wrong offset!");
static_assert(offsetof(MissionInfoPanel_C_ExecuteUbergraph_MissionInfoPanel, K2Node_MakeStruct_SlateColor) == 0x0000C0, "Member 'MissionInfoPanel_C_ExecuteUbergraph_MissionInfoPanel::K2Node_MakeStruct_SlateColor' has a wrong offset!");

}

