#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MissionSetDetails

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MissionSetDetails.MissionSetDetails_C
// 0x0138 (0x06A0 - 0x0568)
class UMissionSetDetails_C final : public UAthenaChallengeSetDetails_Missions
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0568(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       BacktoNormalTimeline;                              // 0x0570(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       NewPrestigeTimeline;                               // 0x0578(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PrestigeFX_Off;                                    // 0x0580(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PrestigeFX;                                        // 0x0588(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ItemInfoIntroOutro;                                // 0x0590(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x0598(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class USizeBox*                               CameraFramingWidget;                               // 0x05A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CloseIcon;                                         // 0x05A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   CommonRichTextBlock;                               // 0x05B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   CommonRichTextBlock_95;                            // 0x05B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CompletionCheck;                                   // 0x05C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CompletionCheck_1;                                 // 0x05C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HeaderBase;                                        // 0x05D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_BattlePass;                                   // 0x05D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_LimitedTime;                                  // 0x05E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_Prestige;                                     // 0x05E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           ItemInfo;                                          // 0x05F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortLazyImage*                         LazyImage_Background;                              // 0x05F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortLazyImage*                         LazyImage_MaterChase;                              // 0x0600(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPanelButton_C*                         MobileCloseButton;                                 // 0x0608(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               OverlayCloseButton;                                // 0x0610(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Prestige_Shimmer;                                  // 0x0618(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Prestige_Shine_Header;                             // 0x0620(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PrestigeBorder;                                    // 0x0628(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PrestigeIcon_1;                                    // 0x0630(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_0;                                        // 0x0638(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              ScaleBoxTextScale;                                 // 0x0640(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           TextDisplay;                                       // 0x0648(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   PrestigeBundleText;                                // 0x0650(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   ViewPrestigeMissions;                              // 0x0668(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   ViewNormalMissions;                                // 0x0680(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         FXRenderOpacity;                                   // 0x0698(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimateInPrestigeTimeline();
	void AnimateInNormalTimeline();
	void SetPrestigeFXStatePrestige();
	void AnimatePrestigeFX_Off();
	void AnimatePrestigeFX();
	void SetPrestigeFXStateNormal();
	void SetupPrestigeFXColors(const struct FLinearColor& PrimaryColor, const struct FLinearColor& SecondaryColor, const struct FLinearColor& AccentColor);
	class UWidget* GetWidgetForFramingViewedItem();
	void SetDynamicColors(class UImage* DetailsDynamicMaterialTarget, const struct FFortChallengeSetStyle& FortChallengeSetStyle);
	void HandleBack(bool* PassThrough);
	void Construct();
	void BndEvt__MobileCloseButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void UpdateLevelUpBundleButtonText();
	void StylePageForPrestige();
	void StylePageForNormal(bool FirstRun);
	void HidePriestigeInfo(bool bHidePriestigeUpsell);
	void VeiwingBundleLevelChanged();
	void OnChallengeSetEstablished(const struct FFortChallengeSetStyle& DisplayStyle, bool bIsComplete);
	void ExecuteUbergraph_MissionSetDetails(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MissionSetDetails_C">();
	}
	static class UMissionSetDetails_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMissionSetDetails_C>();
	}
};
static_assert(alignof(UMissionSetDetails_C) == 0x000008, "Wrong alignment on UMissionSetDetails_C");
static_assert(sizeof(UMissionSetDetails_C) == 0x0006A0, "Wrong size on UMissionSetDetails_C");
static_assert(offsetof(UMissionSetDetails_C, UberGraphFrame) == 0x000568, "Member 'UMissionSetDetails_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMissionSetDetails_C, BacktoNormalTimeline) == 0x000570, "Member 'UMissionSetDetails_C::BacktoNormalTimeline' has a wrong offset!");
static_assert(offsetof(UMissionSetDetails_C, NewPrestigeTimeline) == 0x000578, "Member 'UMissionSetDetails_C::NewPrestigeTimeline' has a wrong offset!");
static_assert(offsetof(UMissionSetDetails_C, PrestigeFX_Off) == 0x000580, "Member 'UMissionSetDetails_C::PrestigeFX_Off' has a wrong offset!");
static_assert(offsetof(UMissionSetDetails_C, PrestigeFX) == 0x000588, "Member 'UMissionSetDetails_C::PrestigeFX' has a wrong offset!");
static_assert(offsetof(UMissionSetDetails_C, ItemInfoIntroOutro) == 0x000590, "Member 'UMissionSetDetails_C::ItemInfoIntroOutro' has a wrong offset!");
static_assert(offsetof(UMissionSetDetails_C, Intro) == 0x000598, "Member 'UMissionSetDetails_C::Intro' has a wrong offset!");
static_assert(offsetof(UMissionSetDetails_C, CameraFramingWidget) == 0x0005A0, "Member 'UMissionSetDetails_C::CameraFramingWidget' has a wrong offset!");
static_assert(offsetof(UMissionSetDetails_C, CloseIcon) == 0x0005A8, "Member 'UMissionSetDetails_C::CloseIcon' has a wrong offset!");
static_assert(offsetof(UMissionSetDetails_C, CommonRichTextBlock) == 0x0005B0, "Member 'UMissionSetDetails_C::CommonRichTextBlock' has a wrong offset!");
static_assert(offsetof(UMissionSetDetails_C, CommonRichTextBlock_95) == 0x0005B8, "Member 'UMissionSetDetails_C::CommonRichTextBlock_95' has a wrong offset!");
static_assert(offsetof(UMissionSetDetails_C, CompletionCheck) == 0x0005C0, "Member 'UMissionSetDetails_C::CompletionCheck' has a wrong offset!");
static_assert(offsetof(UMissionSetDetails_C, CompletionCheck_1) == 0x0005C8, "Member 'UMissionSetDetails_C::CompletionCheck_1' has a wrong offset!");
static_assert(offsetof(UMissionSetDetails_C, HeaderBase) == 0x0005D0, "Member 'UMissionSetDetails_C::HeaderBase' has a wrong offset!");
static_assert(offsetof(UMissionSetDetails_C, Icon_BattlePass) == 0x0005D8, "Member 'UMissionSetDetails_C::Icon_BattlePass' has a wrong offset!");
static_assert(offsetof(UMissionSetDetails_C, Icon_LimitedTime) == 0x0005E0, "Member 'UMissionSetDetails_C::Icon_LimitedTime' has a wrong offset!");
static_assert(offsetof(UMissionSetDetails_C, Icon_Prestige) == 0x0005E8, "Member 'UMissionSetDetails_C::Icon_Prestige' has a wrong offset!");
static_assert(offsetof(UMissionSetDetails_C, ItemInfo) == 0x0005F0, "Member 'UMissionSetDetails_C::ItemInfo' has a wrong offset!");
static_assert(offsetof(UMissionSetDetails_C, LazyImage_Background) == 0x0005F8, "Member 'UMissionSetDetails_C::LazyImage_Background' has a wrong offset!");
static_assert(offsetof(UMissionSetDetails_C, LazyImage_MaterChase) == 0x000600, "Member 'UMissionSetDetails_C::LazyImage_MaterChase' has a wrong offset!");
static_assert(offsetof(UMissionSetDetails_C, MobileCloseButton) == 0x000608, "Member 'UMissionSetDetails_C::MobileCloseButton' has a wrong offset!");
static_assert(offsetof(UMissionSetDetails_C, OverlayCloseButton) == 0x000610, "Member 'UMissionSetDetails_C::OverlayCloseButton' has a wrong offset!");
static_assert(offsetof(UMissionSetDetails_C, Prestige_Shimmer) == 0x000618, "Member 'UMissionSetDetails_C::Prestige_Shimmer' has a wrong offset!");
static_assert(offsetof(UMissionSetDetails_C, Prestige_Shine_Header) == 0x000620, "Member 'UMissionSetDetails_C::Prestige_Shine_Header' has a wrong offset!");
static_assert(offsetof(UMissionSetDetails_C, PrestigeBorder) == 0x000628, "Member 'UMissionSetDetails_C::PrestigeBorder' has a wrong offset!");
static_assert(offsetof(UMissionSetDetails_C, PrestigeIcon_1) == 0x000630, "Member 'UMissionSetDetails_C::PrestigeIcon_1' has a wrong offset!");
static_assert(offsetof(UMissionSetDetails_C, SafeZone_0) == 0x000638, "Member 'UMissionSetDetails_C::SafeZone_0' has a wrong offset!");
static_assert(offsetof(UMissionSetDetails_C, ScaleBoxTextScale) == 0x000640, "Member 'UMissionSetDetails_C::ScaleBoxTextScale' has a wrong offset!");
static_assert(offsetof(UMissionSetDetails_C, TextDisplay) == 0x000648, "Member 'UMissionSetDetails_C::TextDisplay' has a wrong offset!");
static_assert(offsetof(UMissionSetDetails_C, PrestigeBundleText) == 0x000650, "Member 'UMissionSetDetails_C::PrestigeBundleText' has a wrong offset!");
static_assert(offsetof(UMissionSetDetails_C, ViewPrestigeMissions) == 0x000668, "Member 'UMissionSetDetails_C::ViewPrestigeMissions' has a wrong offset!");
static_assert(offsetof(UMissionSetDetails_C, ViewNormalMissions) == 0x000680, "Member 'UMissionSetDetails_C::ViewNormalMissions' has a wrong offset!");
static_assert(offsetof(UMissionSetDetails_C, FXRenderOpacity) == 0x000698, "Member 'UMissionSetDetails_C::FXRenderOpacity' has a wrong offset!");

}

