#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OptionsMenu

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "CommonUI_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "SlateCore_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "Engine_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function OptionsMenu.OptionsMenu_C.CreateMobileBackButton
// 0x0005 (0x0005 - 0x0000)
struct OptionsMenu_C_CreateMobileBackButton final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OptionsMenu_C_CreateMobileBackButton) == 0x000001, "Wrong alignment on OptionsMenu_C_CreateMobileBackButton");
static_assert(sizeof(OptionsMenu_C_CreateMobileBackButton) == 0x000005, "Wrong size on OptionsMenu_C_CreateMobileBackButton");
static_assert(offsetof(OptionsMenu_C_CreateMobileBackButton, Temp_bool_Variable) == 0x000000, "Member 'OptionsMenu_C_CreateMobileBackButton::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_CreateMobileBackButton, Temp_byte_Variable) == 0x000001, "Member 'OptionsMenu_C_CreateMobileBackButton::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_CreateMobileBackButton, Temp_byte_Variable_1) == 0x000002, "Member 'OptionsMenu_C_CreateMobileBackButton::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_CreateMobileBackButton, CallFunc_IsMobileGame_ReturnValue) == 0x000003, "Member 'OptionsMenu_C_CreateMobileBackButton::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_CreateMobileBackButton, K2Node_Select_Default) == 0x000004, "Member 'OptionsMenu_C_CreateMobileBackButton::K2Node_Select_Default' has a wrong offset!");

// Function OptionsMenu.OptionsMenu_C.NotifyTabsOfActivationState
// 0x0028 (0x0028 - 0x0000)
struct OptionsMenu_C_NotifyTabsOfActivationState final
{
public:
	class UFortOptionsTab*                        ActivatedTab;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortOptionsTab*                        CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OptionsMenu_C_NotifyTabsOfActivationState) == 0x000008, "Wrong alignment on OptionsMenu_C_NotifyTabsOfActivationState");
static_assert(sizeof(OptionsMenu_C_NotifyTabsOfActivationState) == 0x000028, "Wrong size on OptionsMenu_C_NotifyTabsOfActivationState");
static_assert(offsetof(OptionsMenu_C_NotifyTabsOfActivationState, ActivatedTab) == 0x000000, "Member 'OptionsMenu_C_NotifyTabsOfActivationState::ActivatedTab' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_NotifyTabsOfActivationState, Temp_int_Array_Index_Variable) == 0x000008, "Member 'OptionsMenu_C_NotifyTabsOfActivationState::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_NotifyTabsOfActivationState, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'OptionsMenu_C_NotifyTabsOfActivationState::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_NotifyTabsOfActivationState, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'OptionsMenu_C_NotifyTabsOfActivationState::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_NotifyTabsOfActivationState, CallFunc_Array_Length_ReturnValue) == 0x000014, "Member 'OptionsMenu_C_NotifyTabsOfActivationState::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_NotifyTabsOfActivationState, CallFunc_Array_Get_Item) == 0x000018, "Member 'OptionsMenu_C_NotifyTabsOfActivationState::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_NotifyTabsOfActivationState, CallFunc_Less_IntInt_ReturnValue) == 0x000020, "Member 'OptionsMenu_C_NotifyTabsOfActivationState::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_NotifyTabsOfActivationState, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000021, "Member 'OptionsMenu_C_NotifyTabsOfActivationState::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function OptionsMenu.OptionsMenu_C.HandleInputResetToDefault
// 0x0001 (0x0001 - 0x0000)
struct OptionsMenu_C_HandleInputResetToDefault final
{
public:
	bool                                          PassThrough;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OptionsMenu_C_HandleInputResetToDefault) == 0x000001, "Wrong alignment on OptionsMenu_C_HandleInputResetToDefault");
static_assert(sizeof(OptionsMenu_C_HandleInputResetToDefault) == 0x000001, "Wrong size on OptionsMenu_C_HandleInputResetToDefault");
static_assert(offsetof(OptionsMenu_C_HandleInputResetToDefault, PassThrough) == 0x000000, "Member 'OptionsMenu_C_HandleInputResetToDefault::PassThrough' has a wrong offset!");

// Function OptionsMenu.OptionsMenu_C.HandleResetAvailableActionHandlerStates
// 0x0004 (0x0004 - 0x0000)
struct OptionsMenu_C_HandleResetAvailableActionHandlerStates final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EInputActionState                             Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInputActionState                             Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInputActionState                             K2Node_Select_Default;                             // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OptionsMenu_C_HandleResetAvailableActionHandlerStates) == 0x000001, "Wrong alignment on OptionsMenu_C_HandleResetAvailableActionHandlerStates");
static_assert(sizeof(OptionsMenu_C_HandleResetAvailableActionHandlerStates) == 0x000004, "Wrong size on OptionsMenu_C_HandleResetAvailableActionHandlerStates");
static_assert(offsetof(OptionsMenu_C_HandleResetAvailableActionHandlerStates, Temp_bool_Variable) == 0x000000, "Member 'OptionsMenu_C_HandleResetAvailableActionHandlerStates::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_HandleResetAvailableActionHandlerStates, Temp_byte_Variable) == 0x000001, "Member 'OptionsMenu_C_HandleResetAvailableActionHandlerStates::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_HandleResetAvailableActionHandlerStates, Temp_byte_Variable_1) == 0x000002, "Member 'OptionsMenu_C_HandleResetAvailableActionHandlerStates::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_HandleResetAvailableActionHandlerStates, K2Node_Select_Default) == 0x000003, "Member 'OptionsMenu_C_HandleResetAvailableActionHandlerStates::K2Node_Select_Default' has a wrong offset!");

// Function OptionsMenu.OptionsMenu_C.Update Header Text by Tab ID
// 0x0010 (0x0010 - 0x0000)
struct OptionsMenu_C_Update_Header_Text_by_Tab_ID final
{
public:
	class FName                                   TabId;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OptionsMenu_C_Update_Header_Text_by_Tab_ID) == 0x000004, "Wrong alignment on OptionsMenu_C_Update_Header_Text_by_Tab_ID");
static_assert(sizeof(OptionsMenu_C_Update_Header_Text_by_Tab_ID) == 0x000010, "Wrong size on OptionsMenu_C_Update_Header_Text_by_Tab_ID");
static_assert(offsetof(OptionsMenu_C_Update_Header_Text_by_Tab_ID, TabId) == 0x000000, "Member 'OptionsMenu_C_Update_Header_Text_by_Tab_ID::TabId' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_Update_Header_Text_by_Tab_ID, CallFunc_Array_Find_ReturnValue) == 0x000008, "Member 'OptionsMenu_C_Update_Header_Text_by_Tab_ID::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_Update_Header_Text_by_Tab_ID, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00000C, "Member 'OptionsMenu_C_Update_Header_Text_by_Tab_ID::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");

// Function OptionsMenu.OptionsMenu_C.DoResetKBMToDefault
// 0x0004 (0x0004 - 0x0000)
struct OptionsMenu_C_DoResetKBMToDefault final
{
public:
	int32                                         Preset_To_Set;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OptionsMenu_C_DoResetKBMToDefault) == 0x000004, "Wrong alignment on OptionsMenu_C_DoResetKBMToDefault");
static_assert(sizeof(OptionsMenu_C_DoResetKBMToDefault) == 0x000004, "Wrong size on OptionsMenu_C_DoResetKBMToDefault");
static_assert(offsetof(OptionsMenu_C_DoResetKBMToDefault, Preset_To_Set) == 0x000000, "Member 'OptionsMenu_C_DoResetKBMToDefault::Preset_To_Set' has a wrong offset!");

// Function OptionsMenu.OptionsMenu_C.UpdateAllOptionsTabs
// 0x0020 (0x0020 - 0x0000)
struct OptionsMenu_C_UpdateAllOptionsTabs final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortOptionsTab*                        CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OptionsMenu_C_UpdateAllOptionsTabs) == 0x000008, "Wrong alignment on OptionsMenu_C_UpdateAllOptionsTabs");
static_assert(sizeof(OptionsMenu_C_UpdateAllOptionsTabs) == 0x000020, "Wrong size on OptionsMenu_C_UpdateAllOptionsTabs");
static_assert(offsetof(OptionsMenu_C_UpdateAllOptionsTabs, Temp_int_Array_Index_Variable) == 0x000000, "Member 'OptionsMenu_C_UpdateAllOptionsTabs::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_UpdateAllOptionsTabs, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'OptionsMenu_C_UpdateAllOptionsTabs::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_UpdateAllOptionsTabs, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'OptionsMenu_C_UpdateAllOptionsTabs::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_UpdateAllOptionsTabs, CallFunc_Array_Length_ReturnValue) == 0x00000C, "Member 'OptionsMenu_C_UpdateAllOptionsTabs::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_UpdateAllOptionsTabs, CallFunc_Array_Get_Item) == 0x000010, "Member 'OptionsMenu_C_UpdateAllOptionsTabs::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_UpdateAllOptionsTabs, CallFunc_Less_IntInt_ReturnValue) == 0x000018, "Member 'OptionsMenu_C_UpdateAllOptionsTabs::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function OptionsMenu.OptionsMenu_C.ResetActionHandlerStates
// 0x0005 (0x0005 - 0x0000)
struct OptionsMenu_C_ResetActionHandlerStates final
{
public:
	bool                                          DisableBack;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EInputActionState                             Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInputActionState                             Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInputActionState                             K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OptionsMenu_C_ResetActionHandlerStates) == 0x000001, "Wrong alignment on OptionsMenu_C_ResetActionHandlerStates");
static_assert(sizeof(OptionsMenu_C_ResetActionHandlerStates) == 0x000005, "Wrong size on OptionsMenu_C_ResetActionHandlerStates");
static_assert(offsetof(OptionsMenu_C_ResetActionHandlerStates, DisableBack) == 0x000000, "Member 'OptionsMenu_C_ResetActionHandlerStates::DisableBack' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ResetActionHandlerStates, Temp_bool_Variable) == 0x000001, "Member 'OptionsMenu_C_ResetActionHandlerStates::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ResetActionHandlerStates, Temp_byte_Variable) == 0x000002, "Member 'OptionsMenu_C_ResetActionHandlerStates::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ResetActionHandlerStates, Temp_byte_Variable_1) == 0x000003, "Member 'OptionsMenu_C_ResetActionHandlerStates::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ResetActionHandlerStates, K2Node_Select_Default) == 0x000004, "Member 'OptionsMenu_C_ResetActionHandlerStates::K2Node_Select_Default' has a wrong offset!");

// Function OptionsMenu.OptionsMenu_C.UpdateBasedOnActiveWidget
// 0x0080 (0x0080 - 0x0000)
struct OptionsMenu_C_UpdateBasedOnActiveWidget final
{
public:
	class UObject*                                ActiveWidget;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldCenterOnTab;                                 // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTabAccount_C*                          K2Node_DynamicCast_AsTab_Account;                  // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortOptionsTab*                        K2Node_DynamicCast_AsFort_Options_Tab;             // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x002C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTabInputOptions_C*                     K2Node_DynamicCast_AsTab_Input_Options;            // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTabGameOptions_C*                      K2Node_DynamicCast_AsTab_Game_Options;             // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue_1;             // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue_2;             // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ClassIsChildOf_ReturnValue;               // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ClassIsChildOf_ReturnValue_1;             // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ClassIsChildOf_ReturnValue_2;             // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OptionsMenu_C_UpdateBasedOnActiveWidget) == 0x000008, "Wrong alignment on OptionsMenu_C_UpdateBasedOnActiveWidget");
static_assert(sizeof(OptionsMenu_C_UpdateBasedOnActiveWidget) == 0x000080, "Wrong size on OptionsMenu_C_UpdateBasedOnActiveWidget");
static_assert(offsetof(OptionsMenu_C_UpdateBasedOnActiveWidget, ActiveWidget) == 0x000000, "Member 'OptionsMenu_C_UpdateBasedOnActiveWidget::ActiveWidget' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_UpdateBasedOnActiveWidget, ShouldCenterOnTab) == 0x000008, "Member 'OptionsMenu_C_UpdateBasedOnActiveWidget::ShouldCenterOnTab' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_UpdateBasedOnActiveWidget, K2Node_DynamicCast_AsTab_Account) == 0x000010, "Member 'OptionsMenu_C_UpdateBasedOnActiveWidget::K2Node_DynamicCast_AsTab_Account' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_UpdateBasedOnActiveWidget, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'OptionsMenu_C_UpdateBasedOnActiveWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_UpdateBasedOnActiveWidget, K2Node_DynamicCast_AsFort_Options_Tab) == 0x000020, "Member 'OptionsMenu_C_UpdateBasedOnActiveWidget::K2Node_DynamicCast_AsFort_Options_Tab' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_UpdateBasedOnActiveWidget, K2Node_DynamicCast_bSuccess_1) == 0x000028, "Member 'OptionsMenu_C_UpdateBasedOnActiveWidget::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_UpdateBasedOnActiveWidget, K2Node_CreateDelegate_OutputDelegate) == 0x00002C, "Member 'OptionsMenu_C_UpdateBasedOnActiveWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_UpdateBasedOnActiveWidget, K2Node_DynamicCast_AsTab_Input_Options) == 0x000040, "Member 'OptionsMenu_C_UpdateBasedOnActiveWidget::K2Node_DynamicCast_AsTab_Input_Options' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_UpdateBasedOnActiveWidget, K2Node_DynamicCast_bSuccess_2) == 0x000048, "Member 'OptionsMenu_C_UpdateBasedOnActiveWidget::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_UpdateBasedOnActiveWidget, K2Node_DynamicCast_AsTab_Game_Options) == 0x000050, "Member 'OptionsMenu_C_UpdateBasedOnActiveWidget::K2Node_DynamicCast_AsTab_Game_Options' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_UpdateBasedOnActiveWidget, K2Node_DynamicCast_bSuccess_3) == 0x000058, "Member 'OptionsMenu_C_UpdateBasedOnActiveWidget::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_UpdateBasedOnActiveWidget, CallFunc_GetObjectClass_ReturnValue) == 0x000060, "Member 'OptionsMenu_C_UpdateBasedOnActiveWidget::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_UpdateBasedOnActiveWidget, CallFunc_GetObjectClass_ReturnValue_1) == 0x000068, "Member 'OptionsMenu_C_UpdateBasedOnActiveWidget::CallFunc_GetObjectClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_UpdateBasedOnActiveWidget, CallFunc_GetObjectClass_ReturnValue_2) == 0x000070, "Member 'OptionsMenu_C_UpdateBasedOnActiveWidget::CallFunc_GetObjectClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_UpdateBasedOnActiveWidget, CallFunc_ClassIsChildOf_ReturnValue) == 0x000078, "Member 'OptionsMenu_C_UpdateBasedOnActiveWidget::CallFunc_ClassIsChildOf_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_UpdateBasedOnActiveWidget, CallFunc_ClassIsChildOf_ReturnValue_1) == 0x000079, "Member 'OptionsMenu_C_UpdateBasedOnActiveWidget::CallFunc_ClassIsChildOf_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_UpdateBasedOnActiveWidget, CallFunc_ClassIsChildOf_ReturnValue_2) == 0x00007A, "Member 'OptionsMenu_C_UpdateBasedOnActiveWidget::CallFunc_ClassIsChildOf_ReturnValue_2' has a wrong offset!");

// Function OptionsMenu.OptionsMenu_C.ApplySettings
// 0x0018 (0x0018 - 0x0000)
struct OptionsMenu_C_ApplySettings final
{
public:
	class UCommonUISubsystem*                     CallFunc_GetContext_ReturnValue;                   // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonInputManager*                    CallFunc_GetInputManager_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OptionsMenu_C_ApplySettings) == 0x000008, "Wrong alignment on OptionsMenu_C_ApplySettings");
static_assert(sizeof(OptionsMenu_C_ApplySettings) == 0x000018, "Wrong size on OptionsMenu_C_ApplySettings");
static_assert(offsetof(OptionsMenu_C_ApplySettings, CallFunc_GetContext_ReturnValue) == 0x000000, "Member 'OptionsMenu_C_ApplySettings::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ApplySettings, CallFunc_AddChild_ReturnValue) == 0x000008, "Member 'OptionsMenu_C_ApplySettings::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_ApplySettings, CallFunc_GetInputManager_ReturnValue) == 0x000010, "Member 'OptionsMenu_C_ApplySettings::CallFunc_GetInputManager_ReturnValue' has a wrong offset!");

// Function OptionsMenu.OptionsMenu_C.DoResetGameOptionsToDefault
// 0x0008 (0x0008 - 0x0000)
struct OptionsMenu_C_DoResetGameOptionsToDefault final
{
public:
	class UFortOptionsTab*                        Tab_To_Reset;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OptionsMenu_C_DoResetGameOptionsToDefault) == 0x000008, "Wrong alignment on OptionsMenu_C_DoResetGameOptionsToDefault");
static_assert(sizeof(OptionsMenu_C_DoResetGameOptionsToDefault) == 0x000008, "Wrong size on OptionsMenu_C_DoResetGameOptionsToDefault");
static_assert(offsetof(OptionsMenu_C_DoResetGameOptionsToDefault, Tab_To_Reset) == 0x000000, "Member 'OptionsMenu_C_DoResetGameOptionsToDefault::Tab_To_Reset' has a wrong offset!");

// Function OptionsMenu.OptionsMenu_C.HandleTabGamepadConfigActionHandlerStates
// 0x0028 (0x0028 - 0x0000)
struct OptionsMenu_C_HandleTabGamepadConfigActionHandlerStates final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EInputActionState                             Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInputActionState                             Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue;         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInputActionState                             K2Node_Select_Default;                             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetWidgetAtIndex_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTabGamePadConfig_v3_C*                 K2Node_DynamicCast_AsTab_Game_Pad_Config_V_3;      // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OptionsMenu_C_HandleTabGamepadConfigActionHandlerStates) == 0x000008, "Wrong alignment on OptionsMenu_C_HandleTabGamepadConfigActionHandlerStates");
static_assert(sizeof(OptionsMenu_C_HandleTabGamepadConfigActionHandlerStates) == 0x000028, "Wrong size on OptionsMenu_C_HandleTabGamepadConfigActionHandlerStates");
static_assert(offsetof(OptionsMenu_C_HandleTabGamepadConfigActionHandlerStates, Temp_bool_Variable) == 0x000000, "Member 'OptionsMenu_C_HandleTabGamepadConfigActionHandlerStates::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_HandleTabGamepadConfigActionHandlerStates, Temp_byte_Variable) == 0x000001, "Member 'OptionsMenu_C_HandleTabGamepadConfigActionHandlerStates::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_HandleTabGamepadConfigActionHandlerStates, Temp_byte_Variable_1) == 0x000002, "Member 'OptionsMenu_C_HandleTabGamepadConfigActionHandlerStates::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_HandleTabGamepadConfigActionHandlerStates, CallFunc_GetActiveWidgetIndex_ReturnValue) == 0x000004, "Member 'OptionsMenu_C_HandleTabGamepadConfigActionHandlerStates::CallFunc_GetActiveWidgetIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_HandleTabGamepadConfigActionHandlerStates, K2Node_Select_Default) == 0x000008, "Member 'OptionsMenu_C_HandleTabGamepadConfigActionHandlerStates::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_HandleTabGamepadConfigActionHandlerStates, CallFunc_GetWidgetAtIndex_ReturnValue) == 0x000010, "Member 'OptionsMenu_C_HandleTabGamepadConfigActionHandlerStates::CallFunc_GetWidgetAtIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_HandleTabGamepadConfigActionHandlerStates, K2Node_DynamicCast_AsTab_Game_Pad_Config_V_3) == 0x000018, "Member 'OptionsMenu_C_HandleTabGamepadConfigActionHandlerStates::K2Node_DynamicCast_AsTab_Game_Pad_Config_V_3' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_HandleTabGamepadConfigActionHandlerStates, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'OptionsMenu_C_HandleTabGamepadConfigActionHandlerStates::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function OptionsMenu.OptionsMenu_C.HandleResetUnavailableActionHandlerStates
// 0x0006 (0x0006 - 0x0000)
struct OptionsMenu_C_HandleResetUnavailableActionHandlerStates final
{
public:
	bool                                          ShouldShowApply;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EInputActionState                             Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInputActionState                             Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EInputActionState                             K2Node_Select_Default;                             // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OptionsMenu_C_HandleResetUnavailableActionHandlerStates) == 0x000001, "Wrong alignment on OptionsMenu_C_HandleResetUnavailableActionHandlerStates");
static_assert(sizeof(OptionsMenu_C_HandleResetUnavailableActionHandlerStates) == 0x000006, "Wrong size on OptionsMenu_C_HandleResetUnavailableActionHandlerStates");
static_assert(offsetof(OptionsMenu_C_HandleResetUnavailableActionHandlerStates, ShouldShowApply) == 0x000000, "Member 'OptionsMenu_C_HandleResetUnavailableActionHandlerStates::ShouldShowApply' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_HandleResetUnavailableActionHandlerStates, Temp_bool_Variable) == 0x000001, "Member 'OptionsMenu_C_HandleResetUnavailableActionHandlerStates::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_HandleResetUnavailableActionHandlerStates, Temp_byte_Variable) == 0x000002, "Member 'OptionsMenu_C_HandleResetUnavailableActionHandlerStates::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_HandleResetUnavailableActionHandlerStates, Temp_byte_Variable_1) == 0x000003, "Member 'OptionsMenu_C_HandleResetUnavailableActionHandlerStates::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_HandleResetUnavailableActionHandlerStates, CallFunc_BooleanAND_ReturnValue) == 0x000004, "Member 'OptionsMenu_C_HandleResetUnavailableActionHandlerStates::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_HandleResetUnavailableActionHandlerStates, K2Node_Select_Default) == 0x000005, "Member 'OptionsMenu_C_HandleResetUnavailableActionHandlerStates::K2Node_Select_Default' has a wrong offset!");

// Function OptionsMenu.OptionsMenu_C.HandleTabInputOptionsActionHandlerStates
// 0x0008 (0x0008 - 0x0000)
struct OptionsMenu_C_HandleTabInputOptionsActionHandlerStates final
{
public:
	class UTabInputOptions_C*                     TabInputOptionsActor;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OptionsMenu_C_HandleTabInputOptionsActionHandlerStates) == 0x000008, "Wrong alignment on OptionsMenu_C_HandleTabInputOptionsActionHandlerStates");
static_assert(sizeof(OptionsMenu_C_HandleTabInputOptionsActionHandlerStates) == 0x000008, "Wrong size on OptionsMenu_C_HandleTabInputOptionsActionHandlerStates");
static_assert(offsetof(OptionsMenu_C_HandleTabInputOptionsActionHandlerStates, TabInputOptionsActor) == 0x000000, "Member 'OptionsMenu_C_HandleTabInputOptionsActionHandlerStates::TabInputOptionsActor' has a wrong offset!");

// Function OptionsMenu.OptionsMenu_C.HandleTabGameOptionsActionHandlerStates
// 0x0018 (0x0018 - 0x0000)
struct OptionsMenu_C_HandleTabGameOptionsActionHandlerStates final
{
public:
	int32                                         Active_Widget_Index;                               // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EInputActionState                             Temp_byte_Variable;                                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInputActionState                             Temp_byte_Variable_1;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInZone_ReturnValue;                     // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EInputActionState                             K2Node_Select_Default;                             // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OptionsMenu_C_HandleTabGameOptionsActionHandlerStates) == 0x000008, "Wrong alignment on OptionsMenu_C_HandleTabGameOptionsActionHandlerStates");
static_assert(sizeof(OptionsMenu_C_HandleTabGameOptionsActionHandlerStates) == 0x000018, "Wrong size on OptionsMenu_C_HandleTabGameOptionsActionHandlerStates");
static_assert(offsetof(OptionsMenu_C_HandleTabGameOptionsActionHandlerStates, Active_Widget_Index) == 0x000000, "Member 'OptionsMenu_C_HandleTabGameOptionsActionHandlerStates::Active_Widget_Index' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_HandleTabGameOptionsActionHandlerStates, Temp_bool_Variable) == 0x000004, "Member 'OptionsMenu_C_HandleTabGameOptionsActionHandlerStates::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_HandleTabGameOptionsActionHandlerStates, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000005, "Member 'OptionsMenu_C_HandleTabGameOptionsActionHandlerStates::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_HandleTabGameOptionsActionHandlerStates, Temp_byte_Variable) == 0x000006, "Member 'OptionsMenu_C_HandleTabGameOptionsActionHandlerStates::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_HandleTabGameOptionsActionHandlerStates, Temp_byte_Variable_1) == 0x000007, "Member 'OptionsMenu_C_HandleTabGameOptionsActionHandlerStates::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_HandleTabGameOptionsActionHandlerStates, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'OptionsMenu_C_HandleTabGameOptionsActionHandlerStates::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_HandleTabGameOptionsActionHandlerStates, CallFunc_IsInZone_ReturnValue) == 0x000010, "Member 'OptionsMenu_C_HandleTabGameOptionsActionHandlerStates::CallFunc_IsInZone_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_HandleTabGameOptionsActionHandlerStates, CallFunc_BooleanOR_ReturnValue) == 0x000011, "Member 'OptionsMenu_C_HandleTabGameOptionsActionHandlerStates::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_HandleTabGameOptionsActionHandlerStates, K2Node_Select_Default) == 0x000012, "Member 'OptionsMenu_C_HandleTabGameOptionsActionHandlerStates::K2Node_Select_Default' has a wrong offset!");

// Function OptionsMenu.OptionsMenu_C.CenterOnActiveTab
// 0x0020 (0x0020 - 0x0000)
struct OptionsMenu_C_CenterOnActiveTab final
{
public:
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue;         // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetWidgetAtIndex_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortOptionsTab*                        K2Node_DynamicCast_AsFort_Options_Tab;             // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OptionsMenu_C_CenterOnActiveTab) == 0x000008, "Wrong alignment on OptionsMenu_C_CenterOnActiveTab");
static_assert(sizeof(OptionsMenu_C_CenterOnActiveTab) == 0x000020, "Wrong size on OptionsMenu_C_CenterOnActiveTab");
static_assert(offsetof(OptionsMenu_C_CenterOnActiveTab, CallFunc_GetActiveWidgetIndex_ReturnValue) == 0x000000, "Member 'OptionsMenu_C_CenterOnActiveTab::CallFunc_GetActiveWidgetIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_CenterOnActiveTab, CallFunc_GetWidgetAtIndex_ReturnValue) == 0x000008, "Member 'OptionsMenu_C_CenterOnActiveTab::CallFunc_GetWidgetAtIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_CenterOnActiveTab, K2Node_DynamicCast_AsFort_Options_Tab) == 0x000010, "Member 'OptionsMenu_C_CenterOnActiveTab::K2Node_DynamicCast_AsFort_Options_Tab' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_CenterOnActiveTab, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'OptionsMenu_C_CenterOnActiveTab::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function OptionsMenu.OptionsMenu_C.SetBackground
// 0x0020 (0x0020 - 0x0000)
struct OptionsMenu_C_SetBackground final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue_1;                 // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInZone_ReturnValue;                     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESubGame                                      CallFunc_GetSubGame_ReturnValue;                   // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OptionsMenu_C_SetBackground) == 0x000008, "Wrong alignment on OptionsMenu_C_SetBackground");
static_assert(sizeof(OptionsMenu_C_SetBackground) == 0x000020, "Wrong size on OptionsMenu_C_SetBackground");
static_assert(offsetof(OptionsMenu_C_SetBackground, Temp_bool_Variable) == 0x000000, "Member 'OptionsMenu_C_SetBackground::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_SetBackground, Temp_byte_Variable) == 0x000001, "Member 'OptionsMenu_C_SetBackground::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_SetBackground, Temp_byte_Variable_1) == 0x000002, "Member 'OptionsMenu_C_SetBackground::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_SetBackground, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'OptionsMenu_C_SetBackground::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_SetBackground, CallFunc_GetContext_ReturnValue_1) == 0x000010, "Member 'OptionsMenu_C_SetBackground::CallFunc_GetContext_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_SetBackground, CallFunc_IsInZone_ReturnValue) == 0x000018, "Member 'OptionsMenu_C_SetBackground::CallFunc_IsInZone_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_SetBackground, CallFunc_GetSubGame_ReturnValue) == 0x000019, "Member 'OptionsMenu_C_SetBackground::CallFunc_GetSubGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_SetBackground, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00001A, "Member 'OptionsMenu_C_SetBackground::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_SetBackground, CallFunc_IsMobileGame_ReturnValue) == 0x00001B, "Member 'OptionsMenu_C_SetBackground::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_SetBackground, K2Node_Select_Default) == 0x00001C, "Member 'OptionsMenu_C_SetBackground::K2Node_Select_Default' has a wrong offset!");

// Function OptionsMenu.OptionsMenu_C.AddTabs
// 0x0180 (0x0180 - 0x0000)
struct OptionsMenu_C_AddTabs final
{
public:
	class UClass*                                 WidgetClass;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   DisplayName;                                       // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FName                                   NameId;                                            // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            Icon;                                              // 0x0028(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm)
	ESettingTab                                   Tab_Type;                                          // 0x00B0(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortTabButtonLabelInfo                K2Node_MakeStruct_FortTabButtonLabelInfo;          // 0x00B8(0x00A0)()
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortOptionsTab*                        CallFunc_Create_ReturnValue;                       // 0x0168(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0170(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RegisterFortTab_ReturnValue;              // 0x017C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OptionsMenu_C_AddTabs) == 0x000008, "Wrong alignment on OptionsMenu_C_AddTabs");
static_assert(sizeof(OptionsMenu_C_AddTabs) == 0x000180, "Wrong size on OptionsMenu_C_AddTabs");
static_assert(offsetof(OptionsMenu_C_AddTabs, WidgetClass) == 0x000000, "Member 'OptionsMenu_C_AddTabs::WidgetClass' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_AddTabs, DisplayName) == 0x000008, "Member 'OptionsMenu_C_AddTabs::DisplayName' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_AddTabs, NameId) == 0x000020, "Member 'OptionsMenu_C_AddTabs::NameId' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_AddTabs, Icon) == 0x000028, "Member 'OptionsMenu_C_AddTabs::Icon' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_AddTabs, Tab_Type) == 0x0000B0, "Member 'OptionsMenu_C_AddTabs::Tab_Type' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_AddTabs, K2Node_MakeStruct_FortTabButtonLabelInfo) == 0x0000B8, "Member 'OptionsMenu_C_AddTabs::K2Node_MakeStruct_FortTabButtonLabelInfo' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_AddTabs, CallFunc_Array_Add_ReturnValue) == 0x000158, "Member 'OptionsMenu_C_AddTabs::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_AddTabs, CallFunc_Array_Add_ReturnValue_1) == 0x00015C, "Member 'OptionsMenu_C_AddTabs::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_AddTabs, CallFunc_GetPlayerController_ReturnValue) == 0x000160, "Member 'OptionsMenu_C_AddTabs::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_AddTabs, CallFunc_Create_ReturnValue) == 0x000168, "Member 'OptionsMenu_C_AddTabs::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_AddTabs, CallFunc_AddChild_ReturnValue) == 0x000170, "Member 'OptionsMenu_C_AddTabs::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_AddTabs, CallFunc_Array_Add_ReturnValue_2) == 0x000178, "Member 'OptionsMenu_C_AddTabs::CallFunc_Array_Add_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_AddTabs, CallFunc_RegisterFortTab_ReturnValue) == 0x00017C, "Member 'OptionsMenu_C_AddTabs::CallFunc_RegisterFortTab_ReturnValue' has a wrong offset!");

// Function OptionsMenu.OptionsMenu_C.HandleCursorModeChanging
// 0x0001 (0x0001 - 0x0000)
struct OptionsMenu_C_HandleCursorModeChanging final
{
public:
	bool                                          IsEnabled;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OptionsMenu_C_HandleCursorModeChanging) == 0x000001, "Wrong alignment on OptionsMenu_C_HandleCursorModeChanging");
static_assert(sizeof(OptionsMenu_C_HandleCursorModeChanging) == 0x000001, "Wrong size on OptionsMenu_C_HandleCursorModeChanging");
static_assert(offsetof(OptionsMenu_C_HandleCursorModeChanging, IsEnabled) == 0x000000, "Member 'OptionsMenu_C_HandleCursorModeChanging::IsEnabled' has a wrong offset!");

// Function OptionsMenu.OptionsMenu_C.Handle Toggle Mode
// 0x0020 (0x0020 - 0x0000)
struct OptionsMenu_C_Handle_Toggle_Mode final
{
public:
	bool                                          PassThrough;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue;         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetWidgetAtIndex_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGamepadInputOptions*               K2Node_DynamicCast_AsFort_Gamepad_Input_Options;   // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OptionsMenu_C_Handle_Toggle_Mode) == 0x000008, "Wrong alignment on OptionsMenu_C_Handle_Toggle_Mode");
static_assert(sizeof(OptionsMenu_C_Handle_Toggle_Mode) == 0x000020, "Wrong size on OptionsMenu_C_Handle_Toggle_Mode");
static_assert(offsetof(OptionsMenu_C_Handle_Toggle_Mode, PassThrough) == 0x000000, "Member 'OptionsMenu_C_Handle_Toggle_Mode::PassThrough' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_Handle_Toggle_Mode, CallFunc_GetActiveWidgetIndex_ReturnValue) == 0x000004, "Member 'OptionsMenu_C_Handle_Toggle_Mode::CallFunc_GetActiveWidgetIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_Handle_Toggle_Mode, CallFunc_GetWidgetAtIndex_ReturnValue) == 0x000008, "Member 'OptionsMenu_C_Handle_Toggle_Mode::CallFunc_GetWidgetAtIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_Handle_Toggle_Mode, K2Node_DynamicCast_AsFort_Gamepad_Input_Options) == 0x000010, "Member 'OptionsMenu_C_Handle_Toggle_Mode::K2Node_DynamicCast_AsFort_Gamepad_Input_Options' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_Handle_Toggle_Mode, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'OptionsMenu_C_Handle_Toggle_Mode::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function OptionsMenu.OptionsMenu_C.Set Input Action Handlers
// 0x0050 (0x0050 - 0x0000)
struct OptionsMenu_C_Set_Input_Action_Handlers final
{
public:
	TDelegate<void(bool* bPassThrough)>           K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(bool* bPassThrough)>           K2Node_CreateDelegate_OutputDelegate_1;            // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(bool* bPassThrough)>           K2Node_CreateDelegate_OutputDelegate_2;            // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(bool* bPassThrough)>           K2Node_CreateDelegate_OutputDelegate_3;            // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(bool* bPassThrough)>           K2Node_CreateDelegate_OutputDelegate_4;            // 0x0040(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(OptionsMenu_C_Set_Input_Action_Handlers) == 0x000004, "Wrong alignment on OptionsMenu_C_Set_Input_Action_Handlers");
static_assert(sizeof(OptionsMenu_C_Set_Input_Action_Handlers) == 0x000050, "Wrong size on OptionsMenu_C_Set_Input_Action_Handlers");
static_assert(offsetof(OptionsMenu_C_Set_Input_Action_Handlers, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'OptionsMenu_C_Set_Input_Action_Handlers::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_Set_Input_Action_Handlers, K2Node_CreateDelegate_OutputDelegate_1) == 0x000010, "Member 'OptionsMenu_C_Set_Input_Action_Handlers::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_Set_Input_Action_Handlers, K2Node_CreateDelegate_OutputDelegate_2) == 0x000020, "Member 'OptionsMenu_C_Set_Input_Action_Handlers::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_Set_Input_Action_Handlers, K2Node_CreateDelegate_OutputDelegate_3) == 0x000030, "Member 'OptionsMenu_C_Set_Input_Action_Handlers::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(OptionsMenu_C_Set_Input_Action_Handlers, K2Node_CreateDelegate_OutputDelegate_4) == 0x000040, "Member 'OptionsMenu_C_Set_Input_Action_Handlers::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");

// Function OptionsMenu.OptionsMenu_C.HandleBack
// 0x0001 (0x0001 - 0x0000)
struct OptionsMenu_C_HandleBack final
{
public:
	bool                                          PassThrough;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OptionsMenu_C_HandleBack) == 0x000001, "Wrong alignment on OptionsMenu_C_HandleBack");
static_assert(sizeof(OptionsMenu_C_HandleBack) == 0x000001, "Wrong size on OptionsMenu_C_HandleBack");
static_assert(offsetof(OptionsMenu_C_HandleBack, PassThrough) == 0x000000, "Member 'OptionsMenu_C_HandleBack::PassThrough' has a wrong offset!");

// Function OptionsMenu.OptionsMenu_C.Handle Reset
// 0x0001 (0x0001 - 0x0000)
struct OptionsMenu_C_Handle_Reset final
{
public:
	bool                                          PassThrough;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OptionsMenu_C_Handle_Reset) == 0x000001, "Wrong alignment on OptionsMenu_C_Handle_Reset");
static_assert(sizeof(OptionsMenu_C_Handle_Reset) == 0x000001, "Wrong size on OptionsMenu_C_Handle_Reset");
static_assert(offsetof(OptionsMenu_C_Handle_Reset, PassThrough) == 0x000000, "Member 'OptionsMenu_C_Handle_Reset::PassThrough' has a wrong offset!");

// Function OptionsMenu.OptionsMenu_C.HandleResetToDefault
// 0x0001 (0x0001 - 0x0000)
struct OptionsMenu_C_HandleResetToDefault final
{
public:
	bool                                          PassThrough;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OptionsMenu_C_HandleResetToDefault) == 0x000001, "Wrong alignment on OptionsMenu_C_HandleResetToDefault");
static_assert(sizeof(OptionsMenu_C_HandleResetToDefault) == 0x000001, "Wrong size on OptionsMenu_C_HandleResetToDefault");
static_assert(offsetof(OptionsMenu_C_HandleResetToDefault, PassThrough) == 0x000000, "Member 'OptionsMenu_C_HandleResetToDefault::PassThrough' has a wrong offset!");

// Function OptionsMenu.OptionsMenu_C.Handle Apply
// 0x0060 (0x0060 - 0x0000)
struct OptionsMenu_C_Handle_Apply final
{
public:
	bool                                          PassThrough;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NeedsLanguageChangeConfirmation_ReturnValue; // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
