#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OptionsMenuInput

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass OptionsMenuInput.OptionsMenuInput_C
// 0x0070 (0x02A0 - 0x0230)
class UOptionsMenuInput_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UIconTextButton_C*                      ClearButton;                                       // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       InputText;                                         // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollingTextButton_C*                 PrimaryInput;                                      // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollingTextButton_C*                 SecondaryInput;                                    // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         Number_In_List;                                    // 0x0258(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25C[0x4];                                      // 0x025C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(int32 Number_In_List, bool Is_Primary_Button)> Input_Clicked;                                     // 0x0260(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UCommonTextBlock*                       Tab_Tooltip_Text;                                  // 0x0270(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Hover_Text;                                        // 0x0278(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMulticastInlineDelegate<void(int32 Number_In_List, class UOptionsMenuInput_C* Widget)> UnbindClicked;                                     // 0x0290(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void SetClearButtonVisibility();
	void Change_Key(bool Primary_Key, const class FText& Key_To_Sets);
	void Center_On_Widget();
	void OnListItemObjectSet(class UObject* ListItemObject);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void BndEvt__IconTextButton_K2Node_ComponentBoundEvent_226_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__SecondaryInput_K2Node_ComponentBoundEvent_55_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__PrimaryInput_K2Node_ComponentBoundEvent_33_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnEntryReleased();
	void ExecuteUbergraph_OptionsMenuInput(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"OptionsMenuInput_C">();
	}
	static class UOptionsMenuInput_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptionsMenuInput_C>();
	}
};
static_assert(alignof(UOptionsMenuInput_C) == 0x000008, "Wrong alignment on UOptionsMenuInput_C");
static_assert(sizeof(UOptionsMenuInput_C) == 0x0002A0, "Wrong size on UOptionsMenuInput_C");
static_assert(offsetof(UOptionsMenuInput_C, UberGraphFrame) == 0x000230, "Member 'UOptionsMenuInput_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UOptionsMenuInput_C, ClearButton) == 0x000238, "Member 'UOptionsMenuInput_C::ClearButton' has a wrong offset!");
static_assert(offsetof(UOptionsMenuInput_C, InputText) == 0x000240, "Member 'UOptionsMenuInput_C::InputText' has a wrong offset!");
static_assert(offsetof(UOptionsMenuInput_C, PrimaryInput) == 0x000248, "Member 'UOptionsMenuInput_C::PrimaryInput' has a wrong offset!");
static_assert(offsetof(UOptionsMenuInput_C, SecondaryInput) == 0x000250, "Member 'UOptionsMenuInput_C::SecondaryInput' has a wrong offset!");
static_assert(offsetof(UOptionsMenuInput_C, Number_In_List) == 0x000258, "Member 'UOptionsMenuInput_C::Number_In_List' has a wrong offset!");
static_assert(offsetof(UOptionsMenuInput_C, Input_Clicked) == 0x000260, "Member 'UOptionsMenuInput_C::Input_Clicked' has a wrong offset!");
static_assert(offsetof(UOptionsMenuInput_C, Tab_Tooltip_Text) == 0x000270, "Member 'UOptionsMenuInput_C::Tab_Tooltip_Text' has a wrong offset!");
static_assert(offsetof(UOptionsMenuInput_C, Hover_Text) == 0x000278, "Member 'UOptionsMenuInput_C::Hover_Text' has a wrong offset!");
static_assert(offsetof(UOptionsMenuInput_C, UnbindClicked) == 0x000290, "Member 'UOptionsMenuInput_C::UnbindClicked' has a wrong offset!");

}

