#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OstrichFinale

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass OstrichFinale.OstrichFinale_C
// 0x0050 (0x02B0 - 0x0260)
class UOstrichFinale_C final : public UOstrichFinaleWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Prime;                                             // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_WarningText;                       // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_GlowPulse;                                   // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_WarningStripes;                              // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Timer;                                     // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_TopContainer;                              // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           RetainerBox_AdditiveContainer;                     // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortNumericTextBlock*                  TimeRemainingText;                                 // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonNumericTextBlock*                TimeRemainingText_remainder;                       // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_OstrichFinale(int32 EntryPoint);
	void OnCancelSelfDestructPrime();
	void OnStartSelfDestructPrime(float Duration);
	void OnSetupComplete();
	void OnSelfDestructFinish();
	void OnUpdateSelfDestruct(float RemainingTime);
	void OnSelfDestructStart(float WarningDuration);
	void Construct();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"OstrichFinale_C">();
	}
	static class UOstrichFinale_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOstrichFinale_C>();
	}
};
static_assert(alignof(UOstrichFinale_C) == 0x000008, "Wrong alignment on UOstrichFinale_C");
static_assert(sizeof(UOstrichFinale_C) == 0x0002B0, "Wrong size on UOstrichFinale_C");
static_assert(offsetof(UOstrichFinale_C, UberGraphFrame) == 0x000260, "Member 'UOstrichFinale_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UOstrichFinale_C, Prime) == 0x000268, "Member 'UOstrichFinale_C::Prime' has a wrong offset!");
static_assert(offsetof(UOstrichFinale_C, CommonTextBlock_WarningText) == 0x000270, "Member 'UOstrichFinale_C::CommonTextBlock_WarningText' has a wrong offset!");
static_assert(offsetof(UOstrichFinale_C, Image_GlowPulse) == 0x000278, "Member 'UOstrichFinale_C::Image_GlowPulse' has a wrong offset!");
static_assert(offsetof(UOstrichFinale_C, Image_WarningStripes) == 0x000280, "Member 'UOstrichFinale_C::Image_WarningStripes' has a wrong offset!");
static_assert(offsetof(UOstrichFinale_C, Overlay_Timer) == 0x000288, "Member 'UOstrichFinale_C::Overlay_Timer' has a wrong offset!");
static_assert(offsetof(UOstrichFinale_C, Overlay_TopContainer) == 0x000290, "Member 'UOstrichFinale_C::Overlay_TopContainer' has a wrong offset!");
static_assert(offsetof(UOstrichFinale_C, RetainerBox_AdditiveContainer) == 0x000298, "Member 'UOstrichFinale_C::RetainerBox_AdditiveContainer' has a wrong offset!");
static_assert(offsetof(UOstrichFinale_C, TimeRemainingText) == 0x0002A0, "Member 'UOstrichFinale_C::TimeRemainingText' has a wrong offset!");
static_assert(offsetof(UOstrichFinale_C, TimeRemainingText_remainder) == 0x0002A8, "Member 'UOstrichFinale_C::TimeRemainingText_remainder' has a wrong offset!");

}

