#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OstrichReticle

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass OstrichReticle.OstrichReticle_C
// 0x0020 (0x02B8 - 0x0298)
class UOstrichReticle_C final : public UOstrichReticleDecorator
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_MissleReticle;                               // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         Default_Number_Rockets;                            // 0x02A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AC[0x4];                                      // 0x02AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               ReticleMID;                                        // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_OstrichReticle(int32 EntryPoint);
	void OnSetupComplete();
	void Construct();
	void RocketCooldown(float Percent);
	void RocketLoaded(float Percent, int32 Total);
	void RocketsFired();
	void ShotgunReload(float Duration);

	float GetGunnerRocketMax() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"OstrichReticle_C">();
	}
	static class UOstrichReticle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOstrichReticle_C>();
	}
};
static_assert(alignof(UOstrichReticle_C) == 0x000008, "Wrong alignment on UOstrichReticle_C");
static_assert(sizeof(UOstrichReticle_C) == 0x0002B8, "Wrong size on UOstrichReticle_C");
static_assert(offsetof(UOstrichReticle_C, UberGraphFrame) == 0x000298, "Member 'UOstrichReticle_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UOstrichReticle_C, Image_MissleReticle) == 0x0002A0, "Member 'UOstrichReticle_C::Image_MissleReticle' has a wrong offset!");
static_assert(offsetof(UOstrichReticle_C, Default_Number_Rockets) == 0x0002A8, "Member 'UOstrichReticle_C::Default_Number_Rockets' has a wrong offset!");
static_assert(offsetof(UOstrichReticle_C, ReticleMID) == 0x0002B0, "Member 'UOstrichReticle_C::ReticleMID' has a wrong offset!");

}

