#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PirateMap_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass PirateMap_AnimBP.PirateMap_AnimBP_C
// 0x00A0 (0x0308 - 0x0268)
class UPirateMap_AnimBP_C final : public UAnimInstance
{
public:
	uint8                                         Pad_268[0x8];                                      // 0x0268(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_C558A1E6443A631BD99890BE66F17199; // 0x0278(0x0030)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_DB629CDD46FE06085060519A2C3FDC9F; // 0x02A8(0x0018)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_BD7EF89C478A36A3A875DEBF385F5C3B; // 0x02C0(0x0048)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_PirateMap_AnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PirateMap_AnimBP_C">();
	}
	static class UPirateMap_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPirateMap_AnimBP_C>();
	}
};
static_assert(alignof(UPirateMap_AnimBP_C) == 0x000008, "Wrong alignment on UPirateMap_AnimBP_C");
static_assert(sizeof(UPirateMap_AnimBP_C) == 0x000308, "Wrong size on UPirateMap_AnimBP_C");
static_assert(offsetof(UPirateMap_AnimBP_C, UberGraphFrame) == 0x000270, "Member 'UPirateMap_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPirateMap_AnimBP_C, AnimGraphNode_Root_C558A1E6443A631BD99890BE66F17199) == 0x000278, "Member 'UPirateMap_AnimBP_C::AnimGraphNode_Root_C558A1E6443A631BD99890BE66F17199' has a wrong offset!");
static_assert(offsetof(UPirateMap_AnimBP_C, AnimGraphNode_LocalRefPose_DB629CDD46FE06085060519A2C3FDC9F) == 0x0002A8, "Member 'UPirateMap_AnimBP_C::AnimGraphNode_LocalRefPose_DB629CDD46FE06085060519A2C3FDC9F' has a wrong offset!");
static_assert(offsetof(UPirateMap_AnimBP_C, AnimGraphNode_Slot_BD7EF89C478A36A3A875DEBF385F5C3B) == 0x0002C0, "Member 'UPirateMap_AnimBP_C::AnimGraphNode_Slot_BD7EF89C478A36A3A875DEBF385F5C3B' has a wrong offset!");

}

