#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerSurveyMultipleChoiceStandardListItem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PlayerSurveyMultipleChoiceStandardListItem.PlayerSurveyMultipleChoiceStandardListItem_C
// 0x0040 (0x0B80 - 0x0B40)
class UPlayerSurveyMultipleChoiceStandardListItem_C final : public UCommonButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B40(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFortCheckbox_C*                        CheckBox;                                          // 0x0B48(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Choice;                                       // 0x0B50(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Number;                                       // 0x0B58(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         ChoiceIndex;                                       // 0x0B60(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B64[0x4];                                      // 0x0B64(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortPlayerSurveyQuestionChoice        ChoiceData;                                        // 0x0B68(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_PlayerSurveyMultipleChoiceStandardListItem(int32 EntryPoint);
	void OnCurrentTextStyleChanged();
	void SetIndex(int32 Value);
	void SetChoiceData(const struct FFortPlayerSurveyQuestionChoice& Value);
	void BP_OnDeselected();
	void BP_OnSelected();
	void Construct();
	void UpdateChoiceText();
	void UpdateChoiceIndexText();
	void UpdateCheckBox();
	void UpdateTextStyle();

	void MakeChoiceIndexText(int32 Index_0, class FText* Text) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PlayerSurveyMultipleChoiceStandardListItem_C">();
	}
	static class UPlayerSurveyMultipleChoiceStandardListItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayerSurveyMultipleChoiceStandardListItem_C>();
	}
};
static_assert(alignof(UPlayerSurveyMultipleChoiceStandardListItem_C) == 0x000008, "Wrong alignment on UPlayerSurveyMultipleChoiceStandardListItem_C");
static_assert(sizeof(UPlayerSurveyMultipleChoiceStandardListItem_C) == 0x000B80, "Wrong size on UPlayerSurveyMultipleChoiceStandardListItem_C");
static_assert(offsetof(UPlayerSurveyMultipleChoiceStandardListItem_C, UberGraphFrame) == 0x000B40, "Member 'UPlayerSurveyMultipleChoiceStandardListItem_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPlayerSurveyMultipleChoiceStandardListItem_C, CheckBox) == 0x000B48, "Member 'UPlayerSurveyMultipleChoiceStandardListItem_C::CheckBox' has a wrong offset!");
static_assert(offsetof(UPlayerSurveyMultipleChoiceStandardListItem_C, Text_Choice) == 0x000B50, "Member 'UPlayerSurveyMultipleChoiceStandardListItem_C::Text_Choice' has a wrong offset!");
static_assert(offsetof(UPlayerSurveyMultipleChoiceStandardListItem_C, Text_Number) == 0x000B58, "Member 'UPlayerSurveyMultipleChoiceStandardListItem_C::Text_Number' has a wrong offset!");
static_assert(offsetof(UPlayerSurveyMultipleChoiceStandardListItem_C, ChoiceIndex) == 0x000B60, "Member 'UPlayerSurveyMultipleChoiceStandardListItem_C::ChoiceIndex' has a wrong offset!");
static_assert(offsetof(UPlayerSurveyMultipleChoiceStandardListItem_C, ChoiceData) == 0x000B68, "Member 'UPlayerSurveyMultipleChoiceStandardListItem_C::ChoiceData' has a wrong offset!");

}

