#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerSurveyPanelContents

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PlayerSurveyPanelContents.PlayerSurveyPanelContents_C
// 0x0080 (0x02B8 - 0x0238)
class UPlayerSurveyPanelContents_C final : public UFortPlayerSurveyWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0238(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UIconTextButton_C*                      CancelButton;                                      // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      FinishButton;                                      // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        NextButtonSwitcher;                                // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      NextQuestionButton;                                // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPlayerSurveyPanelAnswerSelectorWidget_C* PlayerSurveyPanelAnswerSelectorWidget;             // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       QuestionNumberTextBlock;                           // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         QuestionTextBlock;                                 // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SubtitleTextBlock;                                 // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         SurveyTitleTextBlock;                              // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortPlayerSurveyQuestionSelector*      QuestionSelectorObj;                               // 0x0288(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Text_QuestionLabel;                                // 0x0290(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMulticastInlineDelegate<void()>              OnSurveyEnded;                                     // 0x02A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_PlayerSurveyPanelContents(int32 EntryPoint);
	void HandleDescriptionChanged();
	void BndEvt__CancelButton_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__FinishButton_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__NextQuestionButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void OnInitialized();
	void HandleQuestionsChanged(int32 Index_0);
	void HandleSurveyChanged();
	void Construct();
	void DialogResult_1F2955434D7A098B1B9CC2A074F61086(EFortDialogResult Result, class FName ResultName);
	void UpdateQuestionNumberLabel();
	void UpdateSurveyDescription();
	void FinishSurvey(EFortPlayerSurveyFinishReason Reason);
	void HandleIndexChanged(class UObject* Source);
	void HandleNavigationStateChanged(class UObject* Source);
	void HandleNumQuestionsChanged(class UObject* Source);
	void UpdateNextButtonState();
	void HandleAnswerChanged(class UObject* Source, struct FFortPlayerSurveyAnswerContainerChangeEventInfo& EventInfo);
	void UpdateQuestionText();
	void HandleQuestionChanged(class UObject* Source);
	void GetDefaultFocusedWidget(class UWidget** Result);
	void ResetSurvey();
	void ShouldShowConfirmCancelDialog(bool* Result);
	void FocusDefaultWidgetForCurrentQuestion();
	void UpdateSubtitleText();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PlayerSurveyPanelContents_C">();
	}
	static class UPlayerSurveyPanelContents_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayerSurveyPanelContents_C>();
	}
};
static_assert(alignof(UPlayerSurveyPanelContents_C) == 0x000008, "Wrong alignment on UPlayerSurveyPanelContents_C");
static_assert(sizeof(UPlayerSurveyPanelContents_C) == 0x0002B8, "Wrong size on UPlayerSurveyPanelContents_C");
static_assert(offsetof(UPlayerSurveyPanelContents_C, UberGraphFrame) == 0x000238, "Member 'UPlayerSurveyPanelContents_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPlayerSurveyPanelContents_C, CancelButton) == 0x000240, "Member 'UPlayerSurveyPanelContents_C::CancelButton' has a wrong offset!");
static_assert(offsetof(UPlayerSurveyPanelContents_C, FinishButton) == 0x000248, "Member 'UPlayerSurveyPanelContents_C::FinishButton' has a wrong offset!");
static_assert(offsetof(UPlayerSurveyPanelContents_C, NextButtonSwitcher) == 0x000250, "Member 'UPlayerSurveyPanelContents_C::NextButtonSwitcher' has a wrong offset!");
static_assert(offsetof(UPlayerSurveyPanelContents_C, NextQuestionButton) == 0x000258, "Member 'UPlayerSurveyPanelContents_C::NextQuestionButton' has a wrong offset!");
static_assert(offsetof(UPlayerSurveyPanelContents_C, PlayerSurveyPanelAnswerSelectorWidget) == 0x000260, "Member 'UPlayerSurveyPanelContents_C::PlayerSurveyPanelAnswerSelectorWidget' has a wrong offset!");
static_assert(offsetof(UPlayerSurveyPanelContents_C, QuestionNumberTextBlock) == 0x000268, "Member 'UPlayerSurveyPanelContents_C::QuestionNumberTextBlock' has a wrong offset!");
static_assert(offsetof(UPlayerSurveyPanelContents_C, QuestionTextBlock) == 0x000270, "Member 'UPlayerSurveyPanelContents_C::QuestionTextBlock' has a wrong offset!");
static_assert(offsetof(UPlayerSurveyPanelContents_C, SubtitleTextBlock) == 0x000278, "Member 'UPlayerSurveyPanelContents_C::SubtitleTextBlock' has a wrong offset!");
static_assert(offsetof(UPlayerSurveyPanelContents_C, SurveyTitleTextBlock) == 0x000280, "Member 'UPlayerSurveyPanelContents_C::SurveyTitleTextBlock' has a wrong offset!");
static_assert(offsetof(UPlayerSurveyPanelContents_C, QuestionSelectorObj) == 0x000288, "Member 'UPlayerSurveyPanelContents_C::QuestionSelectorObj' has a wrong offset!");
static_assert(offsetof(UPlayerSurveyPanelContents_C, Text_QuestionLabel) == 0x000290, "Member 'UPlayerSurveyPanelContents_C::Text_QuestionLabel' has a wrong offset!");
static_assert(offsetof(UPlayerSurveyPanelContents_C, OnSurveyEnded) == 0x0002A8, "Member 'UPlayerSurveyPanelContents_C::OnSurveyEnded' has a wrong offset!");

}

