#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerSurveyDispatcher

#include "Basic.hpp"


namespace SDK::Params
{

// Function PlayerSurveyDispatcher.PlayerSurveyDispatcher_C.ExecuteUbergraph_PlayerSurveyDispatcher
// 0x0058 (0x0058 - 0x0000)
struct PlayerSurveyDispatcher_C_ExecuteUbergraph_PlayerSurveyDispatcher final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonActivatablePanel*                K2Node_CustomEvent_Panel;                          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  K2Node_DynamicCast_AsFort_Player_Controller;       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPlayerSurveyPanelBase*             K2Node_DynamicCast_AsFort_Player_Survey_Panel_Base; // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPlayerSurveyPanelBase*             K2Node_Event_Widget;                               // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortPlayerSurveyPanelBase*             K2Node_Event_Widget_1;                             // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActivated_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UCommonActivatablePanel* Panel)> K2Node_CreateDelegate_OutputDelegate;              // 0x0044(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(PlayerSurveyDispatcher_C_ExecuteUbergraph_PlayerSurveyDispatcher) == 0x000008, "Wrong alignment on PlayerSurveyDispatcher_C_ExecuteUbergraph_PlayerSurveyDispatcher");
static_assert(sizeof(PlayerSurveyDispatcher_C_ExecuteUbergraph_PlayerSurveyDispatcher) == 0x000058, "Wrong size on PlayerSurveyDispatcher_C_ExecuteUbergraph_PlayerSurveyDispatcher");
static_assert(offsetof(PlayerSurveyDispatcher_C_ExecuteUbergraph_PlayerSurveyDispatcher, EntryPoint) == 0x000000, "Member 'PlayerSurveyDispatcher_C_ExecuteUbergraph_PlayerSurveyDispatcher::EntryPoint' has a wrong offset!");
static_assert(offsetof(PlayerSurveyDispatcher_C_ExecuteUbergraph_PlayerSurveyDispatcher, K2Node_CustomEvent_Panel) == 0x000008, "Member 'PlayerSurveyDispatcher_C_ExecuteUbergraph_PlayerSurveyDispatcher::K2Node_CustomEvent_Panel' has a wrong offset!");
static_assert(offsetof(PlayerSurveyDispatcher_C_ExecuteUbergraph_PlayerSurveyDispatcher, K2Node_DynamicCast_AsFort_Player_Controller) == 0x000010, "Member 'PlayerSurveyDispatcher_C_ExecuteUbergraph_PlayerSurveyDispatcher::K2Node_DynamicCast_AsFort_Player_Controller' has a wrong offset!");
static_assert(offsetof(PlayerSurveyDispatcher_C_ExecuteUbergraph_PlayerSurveyDispatcher, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'PlayerSurveyDispatcher_C_ExecuteUbergraph_PlayerSurveyDispatcher::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PlayerSurveyDispatcher_C_ExecuteUbergraph_PlayerSurveyDispatcher, K2Node_DynamicCast_AsFort_Player_Survey_Panel_Base) == 0x000020, "Member 'PlayerSurveyDispatcher_C_ExecuteUbergraph_PlayerSurveyDispatcher::K2Node_DynamicCast_AsFort_Player_Survey_Panel_Base' has a wrong offset!");
static_assert(offsetof(PlayerSurveyDispatcher_C_ExecuteUbergraph_PlayerSurveyDispatcher, K2Node_DynamicCast_bSuccess_1) == 0x000028, "Member 'PlayerSurveyDispatcher_C_ExecuteUbergraph_PlayerSurveyDispatcher::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(PlayerSurveyDispatcher_C_ExecuteUbergraph_PlayerSurveyDispatcher, K2Node_Event_Widget) == 0x000030, "Member 'PlayerSurveyDispatcher_C_ExecuteUbergraph_PlayerSurveyDispatcher::K2Node_Event_Widget' has a wrong offset!");
static_assert(offsetof(PlayerSurveyDispatcher_C_ExecuteUbergraph_PlayerSurveyDispatcher, K2Node_Event_Widget_1) == 0x000038, "Member 'PlayerSurveyDispatcher_C_ExecuteUbergraph_PlayerSurveyDispatcher::K2Node_Event_Widget_1' has a wrong offset!");
static_assert(offsetof(PlayerSurveyDispatcher_C_ExecuteUbergraph_PlayerSurveyDispatcher, CallFunc_IsActivated_ReturnValue) == 0x000040, "Member 'PlayerSurveyDispatcher_C_ExecuteUbergraph_PlayerSurveyDispatcher::CallFunc_IsActivated_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerSurveyDispatcher_C_ExecuteUbergraph_PlayerSurveyDispatcher, K2Node_CreateDelegate_OutputDelegate) == 0x000044, "Member 'PlayerSurveyDispatcher_C_ExecuteUbergraph_PlayerSurveyDispatcher::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function PlayerSurveyDispatcher.PlayerSurveyDispatcher_C.HandleFirstActivation
// 0x0008 (0x0008 - 0x0000)
struct PlayerSurveyDispatcher_C_HandleFirstActivation final
{
public:
	class UCommonActivatablePanel*                Panel;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerSurveyDispatcher_C_HandleFirstActivation) == 0x000008, "Wrong alignment on PlayerSurveyDispatcher_C_HandleFirstActivation");
static_assert(sizeof(PlayerSurveyDispatcher_C_HandleFirstActivation) == 0x000008, "Wrong size on PlayerSurveyDispatcher_C_HandleFirstActivation");
static_assert(offsetof(PlayerSurveyDispatcher_C_HandleFirstActivation, Panel) == 0x000000, "Member 'PlayerSurveyDispatcher_C_HandleFirstActivation::Panel' has a wrong offset!");

// Function PlayerSurveyDispatcher.PlayerSurveyDispatcher_C.StartSurveyIntro
// 0x0008 (0x0008 - 0x0000)
struct PlayerSurveyDispatcher_C_StartSurveyIntro final
{
public:
	class UFortPlayerSurveyPanelBase*             Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerSurveyDispatcher_C_StartSurveyIntro) == 0x000008, "Wrong alignment on PlayerSurveyDispatcher_C_StartSurveyIntro");
static_assert(sizeof(PlayerSurveyDispatcher_C_StartSurveyIntro) == 0x000008, "Wrong size on PlayerSurveyDispatcher_C_StartSurveyIntro");
static_assert(offsetof(PlayerSurveyDispatcher_C_StartSurveyIntro, Widget) == 0x000000, "Member 'PlayerSurveyDispatcher_C_StartSurveyIntro::Widget' has a wrong offset!");

// Function PlayerSurveyDispatcher.PlayerSurveyDispatcher_C.DisplaySurveyWidget
// 0x0008 (0x0008 - 0x0000)
struct PlayerSurveyDispatcher_C_DisplaySurveyWidget final
{
public:
	class UFortPlayerSurveyPanelBase*             Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerSurveyDispatcher_C_DisplaySurveyWidget) == 0x000008, "Wrong alignment on PlayerSurveyDispatcher_C_DisplaySurveyWidget");
static_assert(sizeof(PlayerSurveyDispatcher_C_DisplaySurveyWidget) == 0x000008, "Wrong size on PlayerSurveyDispatcher_C_DisplaySurveyWidget");
static_assert(offsetof(PlayerSurveyDispatcher_C_DisplaySurveyWidget, Widget) == 0x000000, "Member 'PlayerSurveyDispatcher_C_DisplaySurveyWidget::Widget' has a wrong offset!");

// Function PlayerSurveyDispatcher.PlayerSurveyDispatcher_C.DoStartSurveyIntro
// 0x0028 (0x0028 - 0x0000)
struct PlayerSurveyDispatcher_C_DoStartSurveyIntro final
{
public:
	class UFortPlayerSurveyPanelBase*             Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCommonActivatablePanel* Panel)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	class UPlayerSurveyPanel_C*                   K2Node_DynamicCast_AsPlayer_Survey_Panel;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PlayerSurveyDispatcher_C_DoStartSurveyIntro) == 0x000008, "Wrong alignment on PlayerSurveyDispatcher_C_DoStartSurveyIntro");
static_assert(sizeof(PlayerSurveyDispatcher_C_DoStartSurveyIntro) == 0x000028, "Wrong size on PlayerSurveyDispatcher_C_DoStartSurveyIntro");
static_assert(offsetof(PlayerSurveyDispatcher_C_DoStartSurveyIntro, Widget) == 0x000000, "Member 'PlayerSurveyDispatcher_C_DoStartSurveyIntro::Widget' has a wrong offset!");
static_assert(offsetof(PlayerSurveyDispatcher_C_DoStartSurveyIntro, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'PlayerSurveyDispatcher_C_DoStartSurveyIntro::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(PlayerSurveyDispatcher_C_DoStartSurveyIntro, K2Node_DynamicCast_AsPlayer_Survey_Panel) == 0x000018, "Member 'PlayerSurveyDispatcher_C_DoStartSurveyIntro::K2Node_DynamicCast_AsPlayer_Survey_Panel' has a wrong offset!");
static_assert(offsetof(PlayerSurveyDispatcher_C_DoStartSurveyIntro, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'PlayerSurveyDispatcher_C_DoStartSurveyIntro::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

