#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerSurveyPanelContentsAnswerRatingWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PlayerSurveyPanelContentsAnswerRatingWidget.PlayerSurveyPanelContentsAnswerRatingWidget_C
// 0x0088 (0x0300 - 0x0278)
class UPlayerSurveyPanelContentsAnswerRatingWidget_C final : public UFortPlayerSurveyButtonGroupMultipleChoiceAnswerWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonActionWidget*                    CommonActionWidget_0;                              // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                DummyButton;                                       // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       MaxRatingTextBlock;                                // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       MinRatingTextBlock;                                // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      RatingButton_1;                                    // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      RatingButton_2;                                    // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      RatingButton_3;                                    // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      RatingButton_4;                                    // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      RatingButton_5;                                    // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UCommonButton*>                  RatingButtons;                                     // 0x02D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class FText                                   Text_Subtitle;                                     // 0x02E8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_PlayerSurveyPanelContentsAnswerRatingWidget(int32 EntryPoint);
	void HandleQuestionChanged();
	void HandleCommitCurrentAnswer();
	void HandleButtonFocused(int32 ButtonIndex);
	void Construct();
	void HandleButtonClicked(int32 ButtonIndex);
	void OnInitialized();
	void UpdateText();
	void UpdateRatingButtons();
	class UWidget* GetDefaultFocusedWidgetPostDummy(EUINavigation Navigation_0);
	void HandlePlayerRequestAnswer(int32 AnswerIndex);

	class UWidget* GetDefaultFocusedWidget() const;
	class FText GetSubtitleText() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PlayerSurveyPanelContentsAnswerRatingWidget_C">();
	}
	static class UPlayerSurveyPanelContentsAnswerRatingWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayerSurveyPanelContentsAnswerRatingWidget_C>();
	}
};
static_assert(alignof(UPlayerSurveyPanelContentsAnswerRatingWidget_C) == 0x000008, "Wrong alignment on UPlayerSurveyPanelContentsAnswerRatingWidget_C");
static_assert(sizeof(UPlayerSurveyPanelContentsAnswerRatingWidget_C) == 0x000300, "Wrong size on UPlayerSurveyPanelContentsAnswerRatingWidget_C");
static_assert(offsetof(UPlayerSurveyPanelContentsAnswerRatingWidget_C, UberGraphFrame) == 0x000278, "Member 'UPlayerSurveyPanelContentsAnswerRatingWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPlayerSurveyPanelContentsAnswerRatingWidget_C, CommonActionWidget_0) == 0x000280, "Member 'UPlayerSurveyPanelContentsAnswerRatingWidget_C::CommonActionWidget_0' has a wrong offset!");
static_assert(offsetof(UPlayerSurveyPanelContentsAnswerRatingWidget_C, DummyButton) == 0x000288, "Member 'UPlayerSurveyPanelContentsAnswerRatingWidget_C::DummyButton' has a wrong offset!");
static_assert(offsetof(UPlayerSurveyPanelContentsAnswerRatingWidget_C, Image_0) == 0x000290, "Member 'UPlayerSurveyPanelContentsAnswerRatingWidget_C::Image_0' has a wrong offset!");
static_assert(offsetof(UPlayerSurveyPanelContentsAnswerRatingWidget_C, Image_1) == 0x000298, "Member 'UPlayerSurveyPanelContentsAnswerRatingWidget_C::Image_1' has a wrong offset!");
static_assert(offsetof(UPlayerSurveyPanelContentsAnswerRatingWidget_C, MaxRatingTextBlock) == 0x0002A0, "Member 'UPlayerSurveyPanelContentsAnswerRatingWidget_C::MaxRatingTextBlock' has a wrong offset!");
static_assert(offsetof(UPlayerSurveyPanelContentsAnswerRatingWidget_C, MinRatingTextBlock) == 0x0002A8, "Member 'UPlayerSurveyPanelContentsAnswerRatingWidget_C::MinRatingTextBlock' has a wrong offset!");
static_assert(offsetof(UPlayerSurveyPanelContentsAnswerRatingWidget_C, RatingButton_1) == 0x0002B0, "Member 'UPlayerSurveyPanelContentsAnswerRatingWidget_C::RatingButton_1' has a wrong offset!");
static_assert(offsetof(UPlayerSurveyPanelContentsAnswerRatingWidget_C, RatingButton_2) == 0x0002B8, "Member 'UPlayerSurveyPanelContentsAnswerRatingWidget_C::RatingButton_2' has a wrong offset!");
static_assert(offsetof(UPlayerSurveyPanelContentsAnswerRatingWidget_C, RatingButton_3) == 0x0002C0, "Member 'UPlayerSurveyPanelContentsAnswerRatingWidget_C::RatingButton_3' has a wrong offset!");
static_assert(offsetof(UPlayerSurveyPanelContentsAnswerRatingWidget_C, RatingButton_4) == 0x0002C8, "Member 'UPlayerSurveyPanelContentsAnswerRatingWidget_C::RatingButton_4' has a wrong offset!");
static_assert(offsetof(UPlayerSurveyPanelContentsAnswerRatingWidget_C, RatingButton_5) == 0x0002D0, "Member 'UPlayerSurveyPanelContentsAnswerRatingWidget_C::RatingButton_5' has a wrong offset!");
static_assert(offsetof(UPlayerSurveyPanelContentsAnswerRatingWidget_C, RatingButtons) == 0x0002D8, "Member 'UPlayerSurveyPanelContentsAnswerRatingWidget_C::RatingButtons' has a wrong offset!");
static_assert(offsetof(UPlayerSurveyPanelContentsAnswerRatingWidget_C, Text_Subtitle) == 0x0002E8, "Member 'UPlayerSurveyPanelContentsAnswerRatingWidget_C::Text_Subtitle' has a wrong offset!");

}

