#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_TirePile_Tower

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Prop_TirePile_Tower.Prop_TirePile_Tower_C.ExecuteUbergraph_Prop_TirePile_Tower
// 0x0230 (0x0230 - 0x0000)
struct Prop_TirePile_Tower_C_ExecuteUbergraph_Prop_TirePile_Tower final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  K2Node_DynamicCast_AsFort_Player_Controller;       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput;    // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X;                            // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0080(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0108(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x3];                                      // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x011C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x013C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0148(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_1;  // 0x0158(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0168(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	struct FHitResult                             CallFunc_CapsuleTraceSingle_OutHit;                // 0x0178(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_CapsuleTraceSingle_ReturnValue;           // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0201(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_202[0x2];                                      // 0x0202(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x0204(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x020C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_20D[0x3];                                      // 0x020D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue_2;             // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x0214(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0220(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Prop_TirePile_Tower_C_ExecuteUbergraph_Prop_TirePile_Tower) == 0x000008, "Wrong alignment on Prop_TirePile_Tower_C_ExecuteUbergraph_Prop_TirePile_Tower");
static_assert(sizeof(Prop_TirePile_Tower_C_ExecuteUbergraph_Prop_TirePile_Tower) == 0x000230, "Wrong size on Prop_TirePile_Tower_C_ExecuteUbergraph_Prop_TirePile_Tower");
static_assert(offsetof(Prop_TirePile_Tower_C_ExecuteUbergraph_Prop_TirePile_Tower, EntryPoint) == 0x000000, "Member 'Prop_TirePile_Tower_C_ExecuteUbergraph_Prop_TirePile_Tower::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_TirePile_Tower_C_ExecuteUbergraph_Prop_TirePile_Tower, CallFunc_GetController_ReturnValue) == 0x000008, "Member 'Prop_TirePile_Tower_C_ExecuteUbergraph_Prop_TirePile_Tower::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_TirePile_Tower_C_ExecuteUbergraph_Prop_TirePile_Tower, K2Node_DynamicCast_AsFort_Player_Controller) == 0x000010, "Member 'Prop_TirePile_Tower_C_ExecuteUbergraph_Prop_TirePile_Tower::K2Node_DynamicCast_AsFort_Player_Controller' has a wrong offset!");
static_assert(offsetof(Prop_TirePile_Tower_C_ExecuteUbergraph_Prop_TirePile_Tower, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'Prop_TirePile_Tower_C_ExecuteUbergraph_Prop_TirePile_Tower::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Prop_TirePile_Tower_C_ExecuteUbergraph_Prop_TirePile_Tower, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000020, "Member 'Prop_TirePile_Tower_C_ExecuteUbergraph_Prop_TirePile_Tower::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_TirePile_Tower_C_ExecuteUbergraph_Prop_TirePile_Tower, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x000028, "Member 'Prop_TirePile_Tower_C_ExecuteUbergraph_Prop_TirePile_Tower::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(Prop_TirePile_Tower_C_ExecuteUbergraph_Prop_TirePile_Tower, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000038, "Member 'Prop_TirePile_Tower_C_ExecuteUbergraph_Prop_TirePile_Tower::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_TirePile_Tower_C_ExecuteUbergraph_Prop_TirePile_Tower, CallFunc_GetVelocity_ReturnValue) == 0x00003C, "Member 'Prop_TirePile_Tower_C_ExecuteUbergraph_Prop_TirePile_Tower::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_TirePile_Tower_C_ExecuteUbergraph_Prop_TirePile_Tower, CallFunc_BooleanOR_ReturnValue) == 0x000048, "Member 'Prop_TirePile_Tower_C_ExecuteUbergraph_Prop_TirePile_Tower::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_TirePile_Tower_C_ExecuteUbergraph_Prop_TirePile_Tower, CallFunc_BreakVector_X) == 0x00004C, "Member 'Prop_TirePile_Tower_C_ExecuteUbergraph_Prop_TirePile_Tower::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Prop_TirePile_Tower_C_ExecuteUbergraph_Prop_TirePile_Tower, CallFunc_BreakVector_Y) == 0x000050, "Member 'Prop_TirePile_Tower_C_ExecuteUbergraph_Prop_TirePile_Tower::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Prop_TirePile_Tower_C_ExecuteUbergraph_Prop_TirePile_Tower, CallFunc_BreakVector_Z) == 0x000054, "Member 'Prop_TirePile_Tower_C_ExecuteUbergraph_Prop_TirePile_Tower::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Prop_TirePile_Tower_C_ExecuteUbergraph_Prop_TirePile_Tower, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000058, "Member 'Prop_TirePile_Tower_C_ExecuteUbergraph_Prop_TirePile_Tower::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_TirePile_Tower_C_ExecuteUbergraph_Prop_TirePile_Tower, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000060, "Member 'Prop_TirePile_Tower_C_ExecuteUbergraph_Prop_TirePile_Tower::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Prop_TirePile_Tower_C_ExecuteUbergraph_Prop_TirePile_Tower, K2Node_ComponentBoundEvent_OtherActor) == 0x000068, "Member 'Prop_TirePile_Tower_C_ExecuteUbergraph_Prop_TirePile_Tower::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(Prop_TirePile_Tower_C_ExecuteUbergraph_Prop_TirePile_Tower, K2Node_ComponentBoundEvent_OtherComp) == 0x000070, "Member 'Prop_TirePile_Tower_C_ExecuteUbergraph_Prop_TirePile_Tower::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(Prop_TirePile_Tower_C_ExecuteUbergraph_Prop_TirePile_Tower, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000078, "Member 'Prop_TirePile_Tower_C_ExecuteUbergraph_Prop_TirePile_Tower::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(Prop_TirePile_Tower_C_ExecuteUbergraph_Prop_TirePile_Tower, K2Node_ComponentBoundEvent_bFromSweep) == 0x00007C, "Member 'Prop_TirePile_Tower_C_ExecuteUbergraph_Prop_TirePile_Tower::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(Prop_TirePile_Tower_C_ExecuteUbergraph_Prop_TirePile_Tower, K2Node_ComponentBoundEvent_SweepResult) == 0x000080, "Member 'Prop_TirePile_Tower_C_ExecuteUbergraph_Prop_TirePile_Tower::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(Prop_TirePile_Tower_C_ExecuteUbergraph_Prop_TirePile_Tower, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000108, "Member 'Prop_TirePile_Tower_C_ExecuteUbergraph_Prop_TirePile_Tower::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_TirePile_Tower_C_ExecuteUbergraph_Prop_TirePile_Tower, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000110, "Member 'Prop_TirePile_Tower_C_ExecuteUbergraph_Prop_TirePile_Tower::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(Prop_TirePile_Tower_C_ExecuteUbergraph_Prop_TirePile_Tower, K2Node_DynamicCast_bSuccess_1) == 0x000118, "Member 'Prop_TirePile_Tower_C_ExecuteUbergraph_Prop_TirePile_Tower::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Prop_TirePile_Tower_C_ExecuteUbergraph_Prop_TirePile_Tower, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x00011C, "Member 'Prop_TirePile_Tower_C_ExecuteUbergraph_Prop_TirePile_Tower::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_TirePile_Tower_C_ExecuteUbergraph_Prop_TirePile_Tower, CallFunc_BreakVector_X_1) == 0x000128, "Member 'Prop_TirePile_Tower_C_ExecuteUbergraph_Prop_TirePile_Tower::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(Prop_TirePile_Tower_C_ExecuteUbergraph_Prop_TirePile_Tower, CallFunc_BreakVector_Y_1) == 0x00012C, "Member 'Prop_TirePile_Tower_C_ExecuteUbergraph_Prop_TirePile_Tower::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(Prop_TirePile_Tower_C_ExecuteUbergraph_Prop_TirePile_Tower, CallFunc_BreakVector_Z_1) == 0x000130, "Member 'Prop_TirePile_Tower_C_ExecuteUbergraph_Prop_TirePile_Tower::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(Prop_TirePile_Tower_C_ExecuteUbergraph_Prop_TirePile_Tower, CallFunc_Add_FloatFloat_ReturnValue) == 0x000134, "Member 'Prop_TirePile_Tower_C_ExecuteUbergraph_Prop_TirePile_Tower::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_TirePile_Tower_C_ExecuteUbergraph_Prop_TirePile_Tower, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000138, "Member 'Prop_TirePile_Tower_C_ExecuteUbergraph_Prop_TirePile_Tower::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_TirePile_Tower_C_ExecuteUbergraph_Prop_TirePile_Tower, CallFunc_MakeVector_ReturnValue) == 0x00013C, "Member 'Prop_TirePile_Tower_C_ExecuteUbergraph_Prop_TirePile_Tower::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_TirePile_Tower_C_ExecuteUbergraph_Prop_TirePile_Tower, CallFunc_MakeVector_ReturnValue_1) == 0x000148, "Member 'Prop_TirePile_Tower_C_ExecuteUbergraph_Prop_TirePile_Tower::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_TirePile_Tower_C_ExecuteUbergraph_Prop_TirePile_Tower, CallFunc_GetAbilitySystemComponent_ReturnValue_1) == 0x000158, "Member 'Prop_TirePile_Tower_C_ExecuteUbergraph_Prop_TirePile_Tower::CallFunc_GetAbilitySystemComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Prop_TirePile_Tower_C_ExecuteUbergraph_Prop_TirePile_Tower, CallFunc_IsValid_ReturnValue) == 0x000160, "Member 'Prop_TirePile_Tower_C_ExecuteUbergraph_Prop_TirePile_Tower::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_TirePile_Tower_C_ExecuteUbergraph_Prop_TirePile_Tower, K2Node_MakeArray_Array) == 0x000168, "Member 'Prop_TirePile_Tower_C_ExecuteUbergraph_Prop_TirePile_Tower::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Prop_TirePile_Tower_C_ExecuteUbergraph_Prop_TirePile_Tower, CallFunc_CapsuleTraceSingle_OutHit) == 0x000178, "Member 'Prop_TirePile_Tower_C_ExecuteUbergraph_Prop_TirePile_Tower::CallFunc_CapsuleTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(Prop_TirePile_Tower_C_ExecuteUbergraph_Prop_TirePile_Tower, CallFunc_CapsuleTraceSingle_ReturnValue) == 0x000200, "Member 'Prop_TirePile_Tower_C_ExecuteUbergraph_Prop_TirePile_Tower::CallFunc_CapsuleTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_TirePile_Tower_C_ExecuteUbergraph_Prop_TirePile_Tower, Temp_bool_IsClosed_Variable) == 0x000201, "Member 'Prop_TirePile_Tower_C_ExecuteUbergraph_Prop_TirePile_Tower::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(Prop_TirePile_Tower_C_ExecuteUbergraph_Prop_TirePile_Tower, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue) == 0x000204, "Member 'Prop_TirePile_Tower_C_ExecuteUbergraph_Prop_TirePile_Tower::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_TirePile_Tower_C_ExecuteUbergraph_Prop_TirePile_Tower, Temp_bool_Has_Been_Initd_Variable) == 0x00020C, "Member 'Prop_TirePile_Tower_C_ExecuteUbergraph_Prop_TirePile_Tower::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(Prop_TirePile_Tower_C_ExecuteUbergraph_Prop_TirePile_Tower, CallFunc_Add_FloatFloat_ReturnValue_2) == 0x000210, "Member 'Prop_TirePile_Tower_C_ExecuteUbergraph_Prop_TirePile_Tower::CallFunc_Add_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_TirePile_Tower_C_ExecuteUbergraph_Prop_TirePile_Tower, CallFunc_MakeVector_ReturnValue_2) == 0x000214, "Member 'Prop_TirePile_Tower_C_ExecuteUbergraph_Prop_TirePile_Tower::CallFunc_MakeVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Prop_TirePile_Tower_C_ExecuteUbergraph_Prop_TirePile_Tower, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000220, "Member 'Prop_TirePile_Tower_C_ExecuteUbergraph_Prop_TirePile_Tower::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");

// Function Prop_TirePile_Tower.Prop_TirePile_Tower_C.BndEvt__Jump_Collision_K2Node_ComponentBoundEvent_252_ComponentBeginOverlapSignature__DelegateSignature
// 0x00A8 (0x00A8 - 0x0000)
struct Prop_TirePile_Tower_C_BndEvt__Jump_Collision_K2Node_ComponentBoundEvent_252_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Prop_TirePile_Tower_C_BndEvt__Jump_Collision_K2Node_ComponentBoundEvent_252_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on Prop_TirePile_Tower_C_BndEvt__Jump_Collision_K2Node_ComponentBoundEvent_252_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(Prop_TirePile_Tower_C_BndEvt__Jump_Collision_K2Node_ComponentBoundEvent_252_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000A8, "Wrong size on Prop_TirePile_Tower_C_BndEvt__Jump_Collision_K2Node_ComponentBoundEvent_252_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(Prop_TirePile_Tower_C_BndEvt__Jump_Collision_K2Node_ComponentBoundEvent_252_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'Prop_TirePile_Tower_C_BndEvt__Jump_Collision_K2Node_ComponentBoundEvent_252_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Prop_TirePile_Tower_C_BndEvt__Jump_Collision_K2Node_ComponentBoundEvent_252_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'Prop_TirePile_Tower_C_BndEvt__Jump_Collision_K2Node_ComponentBoundEvent_252_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(Prop_TirePile_Tower_C_BndEvt__Jump_Collision_K2Node_ComponentBoundEvent_252_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'Prop_TirePile_Tower_C_BndEvt__Jump_Collision_K2Node_ComponentBoundEvent_252_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(Prop_TirePile_Tower_C_BndEvt__Jump_Collision_K2Node_ComponentBoundEvent_252_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'Prop_TirePile_Tower_C_BndEvt__Jump_Collision_K2Node_ComponentBoundEvent_252_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(Prop_TirePile_Tower_C_BndEvt__Jump_Collision_K2Node_ComponentBoundEvent_252_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'Prop_TirePile_Tower_C_BndEvt__Jump_Collision_K2Node_ComponentBoundEvent_252_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(Prop_TirePile_Tower_C_BndEvt__Jump_Collision_K2Node_ComponentBoundEvent_252_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'Prop_TirePile_Tower_C_BndEvt__Jump_Collision_K2Node_ComponentBoundEvent_252_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

}

