#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RefundConfirmationModal

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass RefundConfirmationModal.RefundConfirmationModal_C
// 0x0048 (0x0388 - 0x0340)
class URefundConfirmationModal_C final : public UFortRefundConfirmation
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0340(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonTextBlock*                       CommonTextBlock_6;                                 // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Name;                                         // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_RefundCount;                                  // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_RefundsRemaining;                             // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_YesDetails;                                   // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTicketCounter_C*                       TicketCounter;                                     // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UUserWidget*>                    TicketArray;                                       // 0x0378(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)

public:
	void SetRefundsRemainingText(int32 RefundsRemaining, int32 TotalRefunds);
	void ExecuteUbergraph_RefundConfirmationModal(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"RefundConfirmationModal_C">();
	}
	static class URefundConfirmationModal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<URefundConfirmationModal_C>();
	}
};
static_assert(alignof(URefundConfirmationModal_C) == 0x000008, "Wrong alignment on URefundConfirmationModal_C");
static_assert(sizeof(URefundConfirmationModal_C) == 0x000388, "Wrong size on URefundConfirmationModal_C");
static_assert(offsetof(URefundConfirmationModal_C, UberGraphFrame) == 0x000340, "Member 'URefundConfirmationModal_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(URefundConfirmationModal_C, CommonTextBlock_6) == 0x000348, "Member 'URefundConfirmationModal_C::CommonTextBlock_6' has a wrong offset!");
static_assert(offsetof(URefundConfirmationModal_C, Text_Name) == 0x000350, "Member 'URefundConfirmationModal_C::Text_Name' has a wrong offset!");
static_assert(offsetof(URefundConfirmationModal_C, Text_RefundCount) == 0x000358, "Member 'URefundConfirmationModal_C::Text_RefundCount' has a wrong offset!");
static_assert(offsetof(URefundConfirmationModal_C, Text_RefundsRemaining) == 0x000360, "Member 'URefundConfirmationModal_C::Text_RefundsRemaining' has a wrong offset!");
static_assert(offsetof(URefundConfirmationModal_C, Text_YesDetails) == 0x000368, "Member 'URefundConfirmationModal_C::Text_YesDetails' has a wrong offset!");
static_assert(offsetof(URefundConfirmationModal_C, TicketCounter) == 0x000370, "Member 'URefundConfirmationModal_C::TicketCounter' has a wrong offset!");
static_assert(offsetof(URefundConfirmationModal_C, TicketArray) == 0x000378, "Member 'URefundConfirmationModal_C::TicketArray' has a wrong offset!");

}

