#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SettingsListEntry_KeyboardInput

#include "Basic.hpp"


namespace SDK::Params
{

// Function SettingsListEntry_KeyboardInput.SettingsListEntry_KeyboardInput_C.OnUpdateKeyText
// 0x0030 (0x0030 - 0x0000)
struct SettingsListEntry_KeyboardInput_C_OnUpdateKeyText final
{
public:
	class FText                                   PrimaryKeyText;                                    // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FText                                   SecondaryKeyText;                                  // 0x0018(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(SettingsListEntry_KeyboardInput_C_OnUpdateKeyText) == 0x000008, "Wrong alignment on SettingsListEntry_KeyboardInput_C_OnUpdateKeyText");
static_assert(sizeof(SettingsListEntry_KeyboardInput_C_OnUpdateKeyText) == 0x000030, "Wrong size on SettingsListEntry_KeyboardInput_C_OnUpdateKeyText");
static_assert(offsetof(SettingsListEntry_KeyboardInput_C_OnUpdateKeyText, PrimaryKeyText) == 0x000000, "Member 'SettingsListEntry_KeyboardInput_C_OnUpdateKeyText::PrimaryKeyText' has a wrong offset!");
static_assert(offsetof(SettingsListEntry_KeyboardInput_C_OnUpdateKeyText, SecondaryKeyText) == 0x000018, "Member 'SettingsListEntry_KeyboardInput_C_OnUpdateKeyText::SecondaryKeyText' has a wrong offset!");

// Function SettingsListEntry_KeyboardInput.SettingsListEntry_KeyboardInput_C.ExecuteUbergraph_SettingsListEntry_KeyboardInput
// 0x0058 (0x0058 - 0x0000)
struct SettingsListEntry_KeyboardInput_C_ExecuteUbergraph_SettingsListEntry_KeyboardInput final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UScrollingTextButton_C*                 K2Node_DynamicCast_AsScrolling_Text_Button;        // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_PrimaryKeyText;                       // 0x0018(0x0018)(ConstParm)
	class FText                                   K2Node_Event_SecondaryKeyText;                     // 0x0030(0x0018)(ConstParm)
	class UScrollingTextButton_C*                 K2Node_DynamicCast_AsScrolling_Text_Button_1;      // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SettingsListEntry_KeyboardInput_C_ExecuteUbergraph_SettingsListEntry_KeyboardInput) == 0x000008, "Wrong alignment on SettingsListEntry_KeyboardInput_C_ExecuteUbergraph_SettingsListEntry_KeyboardInput");
static_assert(sizeof(SettingsListEntry_KeyboardInput_C_ExecuteUbergraph_SettingsListEntry_KeyboardInput) == 0x000058, "Wrong size on SettingsListEntry_KeyboardInput_C_ExecuteUbergraph_SettingsListEntry_KeyboardInput");
static_assert(offsetof(SettingsListEntry_KeyboardInput_C_ExecuteUbergraph_SettingsListEntry_KeyboardInput, EntryPoint) == 0x000000, "Member 'SettingsListEntry_KeyboardInput_C_ExecuteUbergraph_SettingsListEntry_KeyboardInput::EntryPoint' has a wrong offset!");
static_assert(offsetof(SettingsListEntry_KeyboardInput_C_ExecuteUbergraph_SettingsListEntry_KeyboardInput, K2Node_DynamicCast_AsScrolling_Text_Button) == 0x000008, "Member 'SettingsListEntry_KeyboardInput_C_ExecuteUbergraph_SettingsListEntry_KeyboardInput::K2Node_DynamicCast_AsScrolling_Text_Button' has a wrong offset!");
static_assert(offsetof(SettingsListEntry_KeyboardInput_C_ExecuteUbergraph_SettingsListEntry_KeyboardInput, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'SettingsListEntry_KeyboardInput_C_ExecuteUbergraph_SettingsListEntry_KeyboardInput::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SettingsListEntry_KeyboardInput_C_ExecuteUbergraph_SettingsListEntry_KeyboardInput, K2Node_Event_PrimaryKeyText) == 0x000018, "Member 'SettingsListEntry_KeyboardInput_C_ExecuteUbergraph_SettingsListEntry_KeyboardInput::K2Node_Event_PrimaryKeyText' has a wrong offset!");
static_assert(offsetof(SettingsListEntry_KeyboardInput_C_ExecuteUbergraph_SettingsListEntry_KeyboardInput, K2Node_Event_SecondaryKeyText) == 0x000030, "Member 'SettingsListEntry_KeyboardInput_C_ExecuteUbergraph_SettingsListEntry_KeyboardInput::K2Node_Event_SecondaryKeyText' has a wrong offset!");
static_assert(offsetof(SettingsListEntry_KeyboardInput_C_ExecuteUbergraph_SettingsListEntry_KeyboardInput, K2Node_DynamicCast_AsScrolling_Text_Button_1) == 0x000048, "Member 'SettingsListEntry_KeyboardInput_C_ExecuteUbergraph_SettingsListEntry_KeyboardInput::K2Node_DynamicCast_AsScrolling_Text_Button_1' has a wrong offset!");
static_assert(offsetof(SettingsListEntry_KeyboardInput_C_ExecuteUbergraph_SettingsListEntry_KeyboardInput, K2Node_DynamicCast_bSuccess_1) == 0x000050, "Member 'SettingsListEntry_KeyboardInput_C_ExecuteUbergraph_SettingsListEntry_KeyboardInput::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

}

