#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SettingsListEntry_Discrete

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SettingsListEntry_Discrete.SettingsListEntry_Discrete_C
// 0x0038 (0x02B0 - 0x0278)
class USettingsListEntry_Discrete_C final : public UFortSettingsListEntrySetting_Discrete
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnHover;                                           // 0x0280(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class USettingEntryBackground_C*              Background;                                        // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      Button_FirstOption;                                // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      Button_SecondOption;                               // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        OptionsSets;                                       // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Several_Options;                                   // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	class UWidget* GetPrimaryGamepadFocusWidget();
	void Construct();
	void OnMouseEnteredChanged(bool IsEnterEvent);
	void ExecuteUbergraph_SettingsListEntry_Discrete(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SettingsListEntry_Discrete_C">();
	}
	static class USettingsListEntry_Discrete_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USettingsListEntry_Discrete_C>();
	}
};
static_assert(alignof(USettingsListEntry_Discrete_C) == 0x000008, "Wrong alignment on USettingsListEntry_Discrete_C");
static_assert(sizeof(USettingsListEntry_Discrete_C) == 0x0002B0, "Wrong size on USettingsListEntry_Discrete_C");
static_assert(offsetof(USettingsListEntry_Discrete_C, UberGraphFrame) == 0x000278, "Member 'USettingsListEntry_Discrete_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USettingsListEntry_Discrete_C, OnHover) == 0x000280, "Member 'USettingsListEntry_Discrete_C::OnHover' has a wrong offset!");
static_assert(offsetof(USettingsListEntry_Discrete_C, Background) == 0x000288, "Member 'USettingsListEntry_Discrete_C::Background' has a wrong offset!");
static_assert(offsetof(USettingsListEntry_Discrete_C, Button_FirstOption) == 0x000290, "Member 'USettingsListEntry_Discrete_C::Button_FirstOption' has a wrong offset!");
static_assert(offsetof(USettingsListEntry_Discrete_C, Button_SecondOption) == 0x000298, "Member 'USettingsListEntry_Discrete_C::Button_SecondOption' has a wrong offset!");
static_assert(offsetof(USettingsListEntry_Discrete_C, OptionsSets) == 0x0002A0, "Member 'USettingsListEntry_Discrete_C::OptionsSets' has a wrong offset!");
static_assert(offsetof(USettingsListEntry_Discrete_C, Several_Options) == 0x0002A8, "Member 'USettingsListEntry_Discrete_C::Several_Options' has a wrong offset!");

}

