#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SettingsListEntry_Scalar

#include "Basic.hpp"


namespace SDK::Params
{

// Function SettingsListEntry_Scalar.SettingsListEntry_Scalar_C.GetPrimaryGamepadFocusWidget
// 0x0008 (0x0008 - 0x0000)
struct SettingsListEntry_Scalar_C_GetPrimaryGamepadFocusWidget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SettingsListEntry_Scalar_C_GetPrimaryGamepadFocusWidget) == 0x000008, "Wrong alignment on SettingsListEntry_Scalar_C_GetPrimaryGamepadFocusWidget");
static_assert(sizeof(SettingsListEntry_Scalar_C_GetPrimaryGamepadFocusWidget) == 0x000008, "Wrong size on SettingsListEntry_Scalar_C_GetPrimaryGamepadFocusWidget");
static_assert(offsetof(SettingsListEntry_Scalar_C_GetPrimaryGamepadFocusWidget, ReturnValue) == 0x000000, "Member 'SettingsListEntry_Scalar_C_GetPrimaryGamepadFocusWidget::ReturnValue' has a wrong offset!");

// Function SettingsListEntry_Scalar.SettingsListEntry_Scalar_C.OnValueChanged
// 0x0004 (0x0004 - 0x0000)
struct SettingsListEntry_Scalar_C_OnValueChanged final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SettingsListEntry_Scalar_C_OnValueChanged) == 0x000004, "Wrong alignment on SettingsListEntry_Scalar_C_OnValueChanged");
static_assert(sizeof(SettingsListEntry_Scalar_C_OnValueChanged) == 0x000004, "Wrong size on SettingsListEntry_Scalar_C_OnValueChanged");
static_assert(offsetof(SettingsListEntry_Scalar_C_OnValueChanged, Value) == 0x000000, "Member 'SettingsListEntry_Scalar_C_OnValueChanged::Value' has a wrong offset!");

// Function SettingsListEntry_Scalar.SettingsListEntry_Scalar_C.OnMouseEnteredChanged
// 0x0001 (0x0001 - 0x0000)
struct SettingsListEntry_Scalar_C_OnMouseEnteredChanged final
{
public:
	bool                                          IsEnterEvent;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SettingsListEntry_Scalar_C_OnMouseEnteredChanged) == 0x000001, "Wrong alignment on SettingsListEntry_Scalar_C_OnMouseEnteredChanged");
static_assert(sizeof(SettingsListEntry_Scalar_C_OnMouseEnteredChanged) == 0x000001, "Wrong size on SettingsListEntry_Scalar_C_OnMouseEnteredChanged");
static_assert(offsetof(SettingsListEntry_Scalar_C_OnMouseEnteredChanged, IsEnterEvent) == 0x000000, "Member 'SettingsListEntry_Scalar_C_OnMouseEnteredChanged::IsEnterEvent' has a wrong offset!");

// Function SettingsListEntry_Scalar.SettingsListEntry_Scalar_C.OnDefaultValueChanged
// 0x0004 (0x0004 - 0x0000)
struct SettingsListEntry_Scalar_C_OnDefaultValueChanged final
{
public:
	float                                         DefaultValue;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SettingsListEntry_Scalar_C_OnDefaultValueChanged) == 0x000004, "Wrong alignment on SettingsListEntry_Scalar_C_OnDefaultValueChanged");
static_assert(sizeof(SettingsListEntry_Scalar_C_OnDefaultValueChanged) == 0x000004, "Wrong size on SettingsListEntry_Scalar_C_OnDefaultValueChanged");
static_assert(offsetof(SettingsListEntry_Scalar_C_OnDefaultValueChanged, DefaultValue) == 0x000000, "Member 'SettingsListEntry_Scalar_C_OnDefaultValueChanged::DefaultValue' has a wrong offset!");

// Function SettingsListEntry_Scalar.SettingsListEntry_Scalar_C.ExecuteUbergraph_SettingsListEntry_Scalar
// 0x0038 (0x0038 - 0x0000)
struct SettingsListEntry_Scalar_C_ExecuteUbergraph_SettingsListEntry_Scalar final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DefaultValue;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Value;                                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool IsEnterEvent)>            K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_CustomEvent_IsEnterEvent;                   // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SettingsListEntry_Scalar_C_ExecuteUbergraph_SettingsListEntry_Scalar) == 0x000008, "Wrong alignment on SettingsListEntry_Scalar_C_ExecuteUbergraph_SettingsListEntry_Scalar");
static_assert(sizeof(SettingsListEntry_Scalar_C_ExecuteUbergraph_SettingsListEntry_Scalar) == 0x000038, "Wrong size on SettingsListEntry_Scalar_C_ExecuteUbergraph_SettingsListEntry_Scalar");
static_assert(offsetof(SettingsListEntry_Scalar_C_ExecuteUbergraph_SettingsListEntry_Scalar, EntryPoint) == 0x000000, "Member 'SettingsListEntry_Scalar_C_ExecuteUbergraph_SettingsListEntry_Scalar::EntryPoint' has a wrong offset!");
static_assert(offsetof(SettingsListEntry_Scalar_C_ExecuteUbergraph_SettingsListEntry_Scalar, K2Node_Event_DefaultValue) == 0x000004, "Member 'SettingsListEntry_Scalar_C_ExecuteUbergraph_SettingsListEntry_Scalar::K2Node_Event_DefaultValue' has a wrong offset!");
static_assert(offsetof(SettingsListEntry_Scalar_C_ExecuteUbergraph_SettingsListEntry_Scalar, K2Node_Event_Value) == 0x000008, "Member 'SettingsListEntry_Scalar_C_ExecuteUbergraph_SettingsListEntry_Scalar::K2Node_Event_Value' has a wrong offset!");
static_assert(offsetof(SettingsListEntry_Scalar_C_ExecuteUbergraph_SettingsListEntry_Scalar, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'SettingsListEntry_Scalar_C_ExecuteUbergraph_SettingsListEntry_Scalar::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(SettingsListEntry_Scalar_C_ExecuteUbergraph_SettingsListEntry_Scalar, K2Node_CustomEvent_IsEnterEvent) == 0x00001C, "Member 'SettingsListEntry_Scalar_C_ExecuteUbergraph_SettingsListEntry_Scalar::K2Node_CustomEvent_IsEnterEvent' has a wrong offset!");
static_assert(offsetof(SettingsListEntry_Scalar_C_ExecuteUbergraph_SettingsListEntry_Scalar, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000020, "Member 'SettingsListEntry_Scalar_C_ExecuteUbergraph_SettingsListEntry_Scalar::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsListEntry_Scalar_C_ExecuteUbergraph_SettingsListEntry_Scalar, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000028, "Member 'SettingsListEntry_Scalar_C_ExecuteUbergraph_SettingsListEntry_Scalar::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingsListEntry_Scalar_C_ExecuteUbergraph_SettingsListEntry_Scalar, CallFunc_PlayAnimationForward_ReturnValue) == 0x000030, "Member 'SettingsListEntry_Scalar_C_ExecuteUbergraph_SettingsListEntry_Scalar::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

}

