#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SettingsListEntry_Action

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SettingsListEntry_Action.SettingsListEntry_Action_C
// 0x0018 (0x0278 - 0x0260)
class USettingsListEntry_Action_C final : public UFortSettingsListEntrySetting_Action
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnHover;                                           // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class USettingEntryBackground_C*              Background;                                        // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void OnSettingAssigned(const class FText& ActionText);
	class UWidget* GetPrimaryGamepadFocusWidget();
	void Construct();
	void OnMouseEnteredChanged(bool IsEnterEvent);
	void ExecuteUbergraph_SettingsListEntry_Action(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SettingsListEntry_Action_C">();
	}
	static class USettingsListEntry_Action_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USettingsListEntry_Action_C>();
	}
};
static_assert(alignof(USettingsListEntry_Action_C) == 0x000008, "Wrong alignment on USettingsListEntry_Action_C");
static_assert(sizeof(USettingsListEntry_Action_C) == 0x000278, "Wrong size on USettingsListEntry_Action_C");
static_assert(offsetof(USettingsListEntry_Action_C, UberGraphFrame) == 0x000260, "Member 'USettingsListEntry_Action_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USettingsListEntry_Action_C, OnHover) == 0x000268, "Member 'USettingsListEntry_Action_C::OnHover' has a wrong offset!");
static_assert(offsetof(USettingsListEntry_Action_C, Background) == 0x000270, "Member 'USettingsListEntry_Action_C::Background' has a wrong offset!");

}

