#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StoreMain_MTXOffer_C

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass StoreMain_MTXOffer_C.StoreMain_MTXOffer_C_C
// 0x0158 (0x0CD8 - 0x0B80)
class UStoreMain_MTXOffer_C_C final : public UFortStoreFrontOfferWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B80(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hover_Linear;                                      // 0x0B88(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       UnhoverNew;                                        // 0x0B90(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HoverNew;                                          // 0x0B98(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x0BA0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnHover;                                           // 0x0BA8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UAthenaDirectAcquisitionOffer_SpecialBanner_C* AthenaDirectAcquisitionOffer_SpecialBanner;        // 0x0BB0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BaseColor;                                         // 0x0BB8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                BonusTag;                                          // 0x0BC0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       BonusText;                                         // 0x0BC8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_Footer;                                     // 0x0BD0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                BorderAll;                                         // 0x0BD8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       BundleTotalQuantity;                               // 0x0BE0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       BundleVBucksText;                                  // 0x0BE8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CurrencyTotalQuantity;                             // 0x0BF0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HoverBorder;                                       // 0x0BF8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 KeyArt;                                            // 0x0C00(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 OverlayGradient;                                   // 0x0C08(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               OverlaySalePrice;                                  // 0x0C10(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Plus;                                              // 0x0C18(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           RMTBundle;                                         // 0x0C20(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           RMTCurrency;                                       // 0x0C28(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        RMTTypeSwitcher;                                   // 0x0C30(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         RMTVBucksHB;                                       // 0x0C38(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              ScaleBoxKeyArt;                                    // 0x0C40(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextOfferDisplayPrice;                             // 0x0C48(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextOfferName;                                     // 0x0C50(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextOriginalPrice;                                 // 0x0C58(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               TileSize;                                          // 0x0C60(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       VBucksText;                                        // 0x0C68(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              AboutToShowDetails;                                // 0x0C70(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          LargeTile;                                         // 0x0C80(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C81[0x7];                                      // 0x0C81(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<int32, class UFortMtxOfferData*>         ABDataAssets;                                      // 0x0C88(0x0050)(Edit, BlueprintVisible, ZeroConstructor)

public:
	void GetNewVBuckAssetFromQuantity(int32 Quantity, class UFortMtxOfferData** NewParam);
	void SetTextOutlineColor(class UTextBlock* Text);
	void SetTileSize(EFortMtxOfferDisplaySize DisplaySize);
	void TriggerReset();
	void InitialReset();
	void TriggerIntro();
	void ShowDetails();
	void InitOffer();
	void BP_OnUnhovered();
	void BP_OnHovered();
	void OnClick(class UCommonButton* Button);
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void ExecuteUbergraph_StoreMain_MTXOffer_C(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"StoreMain_MTXOffer_C_C">();
	}
	static class UStoreMain_MTXOffer_C_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStoreMain_MTXOffer_C_C>();
	}
};
static_assert(alignof(UStoreMain_MTXOffer_C_C) == 0x000008, "Wrong alignment on UStoreMain_MTXOffer_C_C");
static_assert(sizeof(UStoreMain_MTXOffer_C_C) == 0x000CD8, "Wrong size on UStoreMain_MTXOffer_C_C");
static_assert(offsetof(UStoreMain_MTXOffer_C_C, UberGraphFrame) == 0x000B80, "Member 'UStoreMain_MTXOffer_C_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UStoreMain_MTXOffer_C_C, Hover_Linear) == 0x000B88, "Member 'UStoreMain_MTXOffer_C_C::Hover_Linear' has a wrong offset!");
static_assert(offsetof(UStoreMain_MTXOffer_C_C, UnhoverNew) == 0x000B90, "Member 'UStoreMain_MTXOffer_C_C::UnhoverNew' has a wrong offset!");
static_assert(offsetof(UStoreMain_MTXOffer_C_C, HoverNew) == 0x000B98, "Member 'UStoreMain_MTXOffer_C_C::HoverNew' has a wrong offset!");
static_assert(offsetof(UStoreMain_MTXOffer_C_C, Intro) == 0x000BA0, "Member 'UStoreMain_MTXOffer_C_C::Intro' has a wrong offset!");
static_assert(offsetof(UStoreMain_MTXOffer_C_C, OnHover) == 0x000BA8, "Member 'UStoreMain_MTXOffer_C_C::OnHover' has a wrong offset!");
static_assert(offsetof(UStoreMain_MTXOffer_C_C, AthenaDirectAcquisitionOffer_SpecialBanner) == 0x000BB0, "Member 'UStoreMain_MTXOffer_C_C::AthenaDirectAcquisitionOffer_SpecialBanner' has a wrong offset!");
static_assert(offsetof(UStoreMain_MTXOffer_C_C, BaseColor) == 0x000BB8, "Member 'UStoreMain_MTXOffer_C_C::BaseColor' has a wrong offset!");
static_assert(offsetof(UStoreMain_MTXOffer_C_C, BonusTag) == 0x000BC0, "Member 'UStoreMain_MTXOffer_C_C::BonusTag' has a wrong offset!");
static_assert(offsetof(UStoreMain_MTXOffer_C_C, BonusText) == 0x000BC8, "Member 'UStoreMain_MTXOffer_C_C::BonusText' has a wrong offset!");
static_assert(offsetof(UStoreMain_MTXOffer_C_C, Border_Footer) == 0x000BD0, "Member 'UStoreMain_MTXOffer_C_C::Border_Footer' has a wrong offset!");
static_assert(offsetof(UStoreMain_MTXOffer_C_C, BorderAll) == 0x000BD8, "Member 'UStoreMain_MTXOffer_C_C::BorderAll' has a wrong offset!");
static_assert(offsetof(UStoreMain_MTXOffer_C_C, BundleTotalQuantity) == 0x000BE0, "Member 'UStoreMain_MTXOffer_C_C::BundleTotalQuantity' has a wrong offset!");
static_assert(offsetof(UStoreMain_MTXOffer_C_C, BundleVBucksText) == 0x000BE8, "Member 'UStoreMain_MTXOffer_C_C::BundleVBucksText' has a wrong offset!");
static_assert(offsetof(UStoreMain_MTXOffer_C_C, CurrencyTotalQuantity) == 0x000BF0, "Member 'UStoreMain_MTXOffer_C_C::CurrencyTotalQuantity' has a wrong offset!");
static_assert(offsetof(UStoreMain_MTXOffer_C_C, HoverBorder) == 0x000BF8, "Member 'UStoreMain_MTXOffer_C_C::HoverBorder' has a wrong offset!");
static_assert(offsetof(UStoreMain_MTXOffer_C_C, KeyArt) == 0x000C00, "Member 'UStoreMain_MTXOffer_C_C::KeyArt' has a wrong offset!");
static_assert(offsetof(UStoreMain_MTXOffer_C_C, OverlayGradient) == 0x000C08, "Member 'UStoreMain_MTXOffer_C_C::OverlayGradient' has a wrong offset!");
static_assert(offsetof(UStoreMain_MTXOffer_C_C, OverlaySalePrice) == 0x000C10, "Member 'UStoreMain_MTXOffer_C_C::OverlaySalePrice' has a wrong offset!");
static_assert(offsetof(UStoreMain_MTXOffer_C_C, Plus) == 0x000C18, "Member 'UStoreMain_MTXOffer_C_C::Plus' has a wrong offset!");
static_assert(offsetof(UStoreMain_MTXOffer_C_C, RMTBundle) == 0x000C20, "Member 'UStoreMain_MTXOffer_C_C::RMTBundle' has a wrong offset!");
static_assert(offsetof(UStoreMain_MTXOffer_C_C, RMTCurrency) == 0x000C28, "Member 'UStoreMain_MTXOffer_C_C::RMTCurrency' has a wrong offset!");
static_assert(offsetof(UStoreMain_MTXOffer_C_C, RMTTypeSwitcher) == 0x000C30, "Member 'UStoreMain_MTXOffer_C_C::RMTTypeSwitcher' has a wrong offset!");
static_assert(offsetof(UStoreMain_MTXOffer_C_C, RMTVBucksHB) == 0x000C38, "Member 'UStoreMain_MTXOffer_C_C::RMTVBucksHB' has a wrong offset!");
static_assert(offsetof(UStoreMain_MTXOffer_C_C, ScaleBoxKeyArt) == 0x000C40, "Member 'UStoreMain_MTXOffer_C_C::ScaleBoxKeyArt' has a wrong offset!");
static_assert(offsetof(UStoreMain_MTXOffer_C_C, TextOfferDisplayPrice) == 0x000C48, "Member 'UStoreMain_MTXOffer_C_C::TextOfferDisplayPrice' has a wrong offset!");
static_assert(offsetof(UStoreMain_MTXOffer_C_C, TextOfferName) == 0x000C50, "Member 'UStoreMain_MTXOffer_C_C::TextOfferName' has a wrong offset!");
static_assert(offsetof(UStoreMain_MTXOffer_C_C, TextOriginalPrice) == 0x000C58, "Member 'UStoreMain_MTXOffer_C_C::TextOriginalPrice' has a wrong offset!");
static_assert(offsetof(UStoreMain_MTXOffer_C_C, TileSize) == 0x000C60, "Member 'UStoreMain_MTXOffer_C_C::TileSize' has a wrong offset!");
static_assert(offsetof(UStoreMain_MTXOffer_C_C, VBucksText) == 0x000C68, "Member 'UStoreMain_MTXOffer_C_C::VBucksText' has a wrong offset!");
static_assert(offsetof(UStoreMain_MTXOffer_C_C, AboutToShowDetails) == 0x000C70, "Member 'UStoreMain_MTXOffer_C_C::AboutToShowDetails' has a wrong offset!");
static_assert(offsetof(UStoreMain_MTXOffer_C_C, LargeTile) == 0x000C80, "Member 'UStoreMain_MTXOffer_C_C::LargeTile' has a wrong offset!");
static_assert(offsetof(UStoreMain_MTXOffer_C_C, ABDataAssets) == 0x000C88, "Member 'UStoreMain_MTXOffer_C_C::ABDataAssets' has a wrong offset!");

}

