#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StoreMain_MTXOffer_C

#include "Basic.hpp"

#include "FortniteUI_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function StoreMain_MTXOffer_C.StoreMain_MTXOffer_C_C.GetNewVBuckAssetFromQuantity
// 0x0020 (0x0020 - 0x0000)
struct StoreMain_MTXOffer_C_C_GetNewVBuckAssetFromQuantity final
{
public:
	int32                                         Quantity;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortMtxOfferData*                      NewParam;                                          // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortMtxOfferData*                      CallFunc_Map_Find_Value;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(StoreMain_MTXOffer_C_C_GetNewVBuckAssetFromQuantity) == 0x000008, "Wrong alignment on StoreMain_MTXOffer_C_C_GetNewVBuckAssetFromQuantity");
static_assert(sizeof(StoreMain_MTXOffer_C_C_GetNewVBuckAssetFromQuantity) == 0x000020, "Wrong size on StoreMain_MTXOffer_C_C_GetNewVBuckAssetFromQuantity");
static_assert(offsetof(StoreMain_MTXOffer_C_C_GetNewVBuckAssetFromQuantity, Quantity) == 0x000000, "Member 'StoreMain_MTXOffer_C_C_GetNewVBuckAssetFromQuantity::Quantity' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_GetNewVBuckAssetFromQuantity, NewParam) == 0x000008, "Member 'StoreMain_MTXOffer_C_C_GetNewVBuckAssetFromQuantity::NewParam' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_GetNewVBuckAssetFromQuantity, CallFunc_Map_Find_Value) == 0x000010, "Member 'StoreMain_MTXOffer_C_C_GetNewVBuckAssetFromQuantity::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_GetNewVBuckAssetFromQuantity, CallFunc_Map_Find_ReturnValue) == 0x000018, "Member 'StoreMain_MTXOffer_C_C_GetNewVBuckAssetFromQuantity::CallFunc_Map_Find_ReturnValue' has a wrong offset!");

// Function StoreMain_MTXOffer_C.StoreMain_MTXOffer_C_C.SetTextOutlineColor
// 0x0068 (0x0068 - 0x0000)
struct StoreMain_MTXOffer_C_C_SetTextOutlineColor final
{
public:
	class UTextBlock*                             Text;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortStoreFrontOfferInfo*               CallFunc_GetOfferInfo_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicOutlineMaterial_ReturnValue;    // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTotalQuantity_ReturnValue;             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortMtxOfferData*                      CallFunc_GetNewVBuckAssetFromQuantity_NewParam;    // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortMtxStoreOfferType                        CallFunc_GetFortStoreOfferType_ReturnValue;        // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B[0x5];                                       // 0x002B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortStoreContext*                      CallFunc_GetContext_ReturnValue;                   // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortStoreFrontOfferInfo*               CallFunc_GetOfferInfo_ReturnValue_1;               // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldShowNewVBuckColorsJuly2019_ReturnValue; // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortMtxGradient                       CallFunc_GetGradient_ReturnValue;                  // 0x0044(0x0020)(NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(StoreMain_MTXOffer_C_C_SetTextOutlineColor) == 0x000008, "Wrong alignment on StoreMain_MTXOffer_C_C_SetTextOutlineColor");
static_assert(sizeof(StoreMain_MTXOffer_C_C_SetTextOutlineColor) == 0x000068, "Wrong size on StoreMain_MTXOffer_C_C_SetTextOutlineColor");
static_assert(offsetof(StoreMain_MTXOffer_C_C_SetTextOutlineColor, Text) == 0x000000, "Member 'StoreMain_MTXOffer_C_C_SetTextOutlineColor::Text' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_SetTextOutlineColor, CallFunc_GetOfferInfo_ReturnValue) == 0x000008, "Member 'StoreMain_MTXOffer_C_C_SetTextOutlineColor::CallFunc_GetOfferInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_SetTextOutlineColor, CallFunc_GetDynamicOutlineMaterial_ReturnValue) == 0x000010, "Member 'StoreMain_MTXOffer_C_C_SetTextOutlineColor::CallFunc_GetDynamicOutlineMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_SetTextOutlineColor, CallFunc_GetTotalQuantity_ReturnValue) == 0x000018, "Member 'StoreMain_MTXOffer_C_C_SetTextOutlineColor::CallFunc_GetTotalQuantity_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_SetTextOutlineColor, CallFunc_IsValid_ReturnValue) == 0x00001C, "Member 'StoreMain_MTXOffer_C_C_SetTextOutlineColor::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_SetTextOutlineColor, CallFunc_GetNewVBuckAssetFromQuantity_NewParam) == 0x000020, "Member 'StoreMain_MTXOffer_C_C_SetTextOutlineColor::CallFunc_GetNewVBuckAssetFromQuantity_NewParam' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_SetTextOutlineColor, CallFunc_IsValid_ReturnValue_1) == 0x000028, "Member 'StoreMain_MTXOffer_C_C_SetTextOutlineColor::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_SetTextOutlineColor, CallFunc_GetFortStoreOfferType_ReturnValue) == 0x000029, "Member 'StoreMain_MTXOffer_C_C_SetTextOutlineColor::CallFunc_GetFortStoreOfferType_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_SetTextOutlineColor, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00002A, "Member 'StoreMain_MTXOffer_C_C_SetTextOutlineColor::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_SetTextOutlineColor, CallFunc_GetContext_ReturnValue) == 0x000030, "Member 'StoreMain_MTXOffer_C_C_SetTextOutlineColor::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_SetTextOutlineColor, CallFunc_GetOfferInfo_ReturnValue_1) == 0x000038, "Member 'StoreMain_MTXOffer_C_C_SetTextOutlineColor::CallFunc_GetOfferInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_SetTextOutlineColor, CallFunc_ShouldShowNewVBuckColorsJuly2019_ReturnValue) == 0x000040, "Member 'StoreMain_MTXOffer_C_C_SetTextOutlineColor::CallFunc_ShouldShowNewVBuckColorsJuly2019_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_SetTextOutlineColor, CallFunc_GetGradient_ReturnValue) == 0x000044, "Member 'StoreMain_MTXOffer_C_C_SetTextOutlineColor::CallFunc_GetGradient_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_SetTextOutlineColor, CallFunc_BooleanAND_ReturnValue) == 0x000064, "Member 'StoreMain_MTXOffer_C_C_SetTextOutlineColor::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function StoreMain_MTXOffer_C.StoreMain_MTXOffer_C_C.SetTileSize
// 0x0060 (0x0060 - 0x0000)
struct StoreMain_MTXOffer_C_C_SetTileSize final
{
public:
	EFortMtxOfferDisplaySize                      DisplaySize;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo;                   // 0x0008(0x0050)(HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(StoreMain_MTXOffer_C_C_SetTileSize) == 0x000008, "Wrong alignment on StoreMain_MTXOffer_C_C_SetTileSize");
static_assert(sizeof(StoreMain_MTXOffer_C_C_SetTileSize) == 0x000060, "Wrong size on StoreMain_MTXOffer_C_C_SetTileSize");
static_assert(offsetof(StoreMain_MTXOffer_C_C_SetTileSize, DisplaySize) == 0x000000, "Member 'StoreMain_MTXOffer_C_C_SetTileSize::DisplaySize' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_SetTileSize, K2Node_SwitchEnum_CmpSuccess) == 0x000001, "Member 'StoreMain_MTXOffer_C_C_SetTileSize::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_SetTileSize, K2Node_MakeStruct_SlateFontInfo) == 0x000008, "Member 'StoreMain_MTXOffer_C_C_SetTileSize::K2Node_MakeStruct_SlateFontInfo' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_SetTileSize, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000058, "Member 'StoreMain_MTXOffer_C_C_SetTileSize::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

// Function StoreMain_MTXOffer_C.StoreMain_MTXOffer_C_C.InitialReset
// 0x0008 (0x0008 - 0x0000)
struct StoreMain_MTXOffer_C_C_InitialReset final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(StoreMain_MTXOffer_C_C_InitialReset) == 0x000008, "Wrong alignment on StoreMain_MTXOffer_C_C_InitialReset");
static_assert(sizeof(StoreMain_MTXOffer_C_C_InitialReset) == 0x000008, "Wrong size on StoreMain_MTXOffer_C_C_InitialReset");
static_assert(offsetof(StoreMain_MTXOffer_C_C_InitialReset, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'StoreMain_MTXOffer_C_C_InitialReset::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function StoreMain_MTXOffer_C.StoreMain_MTXOffer_C_C.TriggerIntro
// 0x0008 (0x0008 - 0x0000)
struct StoreMain_MTXOffer_C_C_TriggerIntro final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(StoreMain_MTXOffer_C_C_TriggerIntro) == 0x000008, "Wrong alignment on StoreMain_MTXOffer_C_C_TriggerIntro");
static_assert(sizeof(StoreMain_MTXOffer_C_C_TriggerIntro) == 0x000008, "Wrong size on StoreMain_MTXOffer_C_C_TriggerIntro");
static_assert(offsetof(StoreMain_MTXOffer_C_C_TriggerIntro, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'StoreMain_MTXOffer_C_C_TriggerIntro::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function StoreMain_MTXOffer_C.StoreMain_MTXOffer_C_C.ShowDetails
// 0x0030 (0x0030 - 0x0000)
struct StoreMain_MTXOffer_C_C_ShowDetails final
{
public:
	class UStoreMain_OfferDetails_C*              StoreOfferDetailsWidget;                           // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortMtxStoreRootBase*                  CallFunc_GetStoreRoot_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortStoreFrontOfferInfo*               CallFunc_GetOfferInfo_ReturnValue;                 // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStoreMain_OfferDetails_C*              CallFunc_Create_ReturnValue;                       // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(StoreMain_MTXOffer_C_C_ShowDetails) == 0x000008, "Wrong alignment on StoreMain_MTXOffer_C_C_ShowDetails");
static_assert(sizeof(StoreMain_MTXOffer_C_C_ShowDetails) == 0x000030, "Wrong size on StoreMain_MTXOffer_C_C_ShowDetails");
static_assert(offsetof(StoreMain_MTXOffer_C_C_ShowDetails, StoreOfferDetailsWidget) == 0x000000, "Member 'StoreMain_MTXOffer_C_C_ShowDetails::StoreOfferDetailsWidget' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_ShowDetails, CallFunc_GetStoreRoot_ReturnValue) == 0x000008, "Member 'StoreMain_MTXOffer_C_C_ShowDetails::CallFunc_GetStoreRoot_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_ShowDetails, CallFunc_GetOfferInfo_ReturnValue) == 0x000010, "Member 'StoreMain_MTXOffer_C_C_ShowDetails::CallFunc_GetOfferInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_ShowDetails, CallFunc_IsMobileGame_ReturnValue) == 0x000018, "Member 'StoreMain_MTXOffer_C_C_ShowDetails::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_ShowDetails, CallFunc_GetOwningPlayer_ReturnValue) == 0x000020, "Member 'StoreMain_MTXOffer_C_C_ShowDetails::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_ShowDetails, CallFunc_Create_ReturnValue) == 0x000028, "Member 'StoreMain_MTXOffer_C_C_ShowDetails::CallFunc_Create_ReturnValue' has a wrong offset!");

// Function StoreMain_MTXOffer_C.StoreMain_MTXOffer_C_C.InitOffer
// 0x0460 (0x0460 - 0x0000)
struct StoreMain_MTXOffer_C_C_InitOffer final
{
public:
	class FText                                   BonusMTX;                                          // 0x0000(0x0018)(Edit, BlueprintVisible)
	class FText                                   BaseMtx;                                           // 0x0018(0x0018)(Edit, BlueprintVisible)
	class UMaterial*                              OfferMaterial;                                     // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E[0x2];                                       // 0x003E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortStoreContext*                      CallFunc_GetContext_ReturnValue;                   // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortStoreFrontOfferInfo*               CallFunc_GetOfferInfo_ReturnValue;                 // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldShowNewVBuckCoinAssetsJuly2019_ReturnValue; // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortMtxOfferDisplaySize                      CallFunc_GetOfferDisplaySize_ReturnValue;          // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortStoreFrontOfferInfo*               CallFunc_GetOfferInfo_ReturnValue_1;               // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortStoreFrontOfferInfo*               CallFunc_GetOfferInfo_ReturnValue_2;               // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTotalQuantity_ReturnValue;             // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortMtxStoreOfferType                        CallFunc_GetFortStoreOfferType_ReturnValue;        // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortMtxOfferData*                      CallFunc_GetNewVBuckAssetFromQuantity_NewParam;    // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_93[0x5];                                       // 0x0093(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortStoreFrontOfferInfo*               CallFunc_GetOfferInfo_ReturnValue_3;               // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_2;         // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTotalQuantity_ReturnValue_1;           // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortStoreFrontOfferInfo*               CallFunc_GetOfferInfo_ReturnValue_4;               // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortMtxOfferData*                      CallFunc_GetNewVBuckAssetFromQuantity_NewParam_1;  // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortMtxStoreOfferType                        CallFunc_GetFortStoreOfferType_ReturnValue_1;      // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x00C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00C3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             CallFunc_GetBrushResourceAsTexture2D_ReturnValue;  // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x00D0(0x0088)()
	bool                                          Temp_bool_Variable_2;                              // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortStoreContext*                      CallFunc_GetContext_ReturnValue_1;                 // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortStoreContext*                      CallFunc_GetContext_ReturnValue_2;                 // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldShowNewVBuckColorsJuly2019_ReturnValue; // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ShouldShowNewVBuckColorsJuly2019_ReturnValue_1; // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0172(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_173[0x5];                                      // 0x0173(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Temp_object_Variable;                              // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_1;                            // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortStoreFrontOfferInfo*               CallFunc_GetOfferInfo_ReturnValue_5;               // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortStoreFrontOfferInfo*               CallFunc_GetOfferInfo_ReturnValue_6;               // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetSalePrice_SalePrice;                   // 0x0198(0x0018)()
	bool                                          CallFunc_GetSalePrice_ReturnValue;                 // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetBannerOverrideTag_ReturnValue;         // 0x01B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UFortStoreFrontOfferInfo*               CallFunc_GetOfferInfo_ReturnValue_7;               // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D1[0x3];                                      // 0x01D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortMtxGradient                       CallFunc_GetGradient_ReturnValue;                  // 0x01D4(0x0020)(NoDestructor)
	struct FLinearColor                           CallFunc_GetBackground_ReturnValue;                // 0x01F4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_204[0x4];                                      // 0x0204(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            CallFunc_GetTileImage_ReturnValue;                 // 0x0208(0x0088)()
	class UFortStoreFrontOfferInfo*               CallFunc_GetOfferInfo_ReturnValue_8;               // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetNormalPrice_ReturnValue;               // 0x0298(0x0018)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_1;                    // 0x02B0(0x0088)()
	class UTexture2D*                             CallFunc_GetBrushResourceAsTexture2D_ReturnValue_1; // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortStoreFrontOfferInfo*               CallFunc_GetOfferInfo_ReturnValue_9;               // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortStoreFrontOfferInfo*               CallFunc_GetOfferInfo_ReturnValue_10;              // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTotalQuantity_ReturnValue_2;           // 0x0350(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortMtxStoreOfferType                        CallFunc_GetFortStoreOfferType_ReturnValue_2;      // 0x0354(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_355[0x3];                                      // 0x0355(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0358(0x0018)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_371[0x3];                                      // 0x0371(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetBaseQuantity_ReturnValue;              // 0x0374(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetName_ReturnValue;                      // 0x0378(0x0018)()
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0390(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetBonusQuantity_ReturnValue;             // 0x0394(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTotalQuantity_ReturnValue_3;           // 0x0398(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x039C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x03A0(0x0018)()
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x03B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x03BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3BD[0x3];                                      // 0x03BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x03C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x03C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x03C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C9[0x7];                                      // 0x03C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x03D0(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0410(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0420(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_421[0x7];                                      // 0x0421(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0428(0x0018)()
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0440(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0441(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_442[0x6];                                      // 0x0442(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     K2Node_Select_Default_3;                           // 0x0448(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_3;         // 0x0450(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_4;         // 0x0458(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(StoreMain_MTXOffer_C_C_InitOffer) == 0x000008, "Wrong alignment on StoreMain_MTXOffer_C_C_InitOffer");
static_assert(sizeof(StoreMain_MTXOffer_C_C_InitOffer) == 0x000460, "Wrong size on StoreMain_MTXOffer_C_C_InitOffer");
static_assert(offsetof(StoreMain_MTXOffer_C_C_InitOffer, BonusMTX) == 0x000000, "Member 'StoreMain_MTXOffer_C_C_InitOffer::BonusMTX' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_InitOffer, BaseMtx) == 0x000018, "Member 'StoreMain_MTXOffer_C_C_InitOffer::BaseMtx' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_InitOffer, OfferMaterial) == 0x000030, "Member 'StoreMain_MTXOffer_C_C_InitOffer::OfferMaterial' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_InitOffer, Temp_bool_Variable) == 0x000038, "Member 'StoreMain_MTXOffer_C_C_InitOffer::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_InitOffer, Temp_byte_Variable) == 0x000039, "Member 'StoreMain_MTXOffer_C_C_InitOffer::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_InitOffer, Temp_byte_Variable_1) == 0x00003A, "Member 'StoreMain_MTXOffer_C_C_InitOffer::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_InitOffer, Temp_bool_Variable_1) == 0x00003B, "Member 'StoreMain_MTXOffer_C_C_InitOffer::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_InitOffer, Temp_byte_Variable_2) == 0x00003C, "Member 'StoreMain_MTXOffer_C_C_InitOffer::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_InitOffer, Temp_byte_Variable_3) == 0x00003D, "Member 'StoreMain_MTXOffer_C_C_InitOffer::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_InitOffer, CallFunc_GetContext_ReturnValue) == 0x000040, "Member 'StoreMain_MTXOffer_C_C_InitOffer::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_InitOffer, CallFunc_GetOfferInfo_ReturnValue) == 0x000048, "Member 'StoreMain_MTXOffer_C_C_InitOffer::CallFunc_GetOfferInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_InitOffer, CallFunc_ShouldShowNewVBuckCoinAssetsJuly2019_ReturnValue) == 0x000050, "Member 'StoreMain_MTXOffer_C_C_InitOffer::CallFunc_ShouldShowNewVBuckCoinAssetsJuly2019_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_InitOffer, CallFunc_GetOfferDisplaySize_ReturnValue) == 0x000051, "Member 'StoreMain_MTXOffer_C_C_InitOffer::CallFunc_GetOfferDisplaySize_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_InitOffer, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000058, "Member 'StoreMain_MTXOffer_C_C_InitOffer::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_InitOffer, Temp_byte_Variable_4) == 0x000060, "Member 'StoreMain_MTXOffer_C_C_InitOffer::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_InitOffer, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000068, "Member 'StoreMain_MTXOffer_C_C_InitOffer::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_InitOffer, CallFunc_GetOfferInfo_ReturnValue_1) == 0x000070, "Member 'StoreMain_MTXOffer_C_C_InitOffer::CallFunc_GetOfferInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_InitOffer, CallFunc_GetOfferInfo_ReturnValue_2) == 0x000078, "Member 'StoreMain_MTXOffer_C_C_InitOffer::CallFunc_GetOfferInfo_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_InitOffer, CallFunc_GetTotalQuantity_ReturnValue) == 0x000080, "Member 'StoreMain_MTXOffer_C_C_InitOffer::CallFunc_GetTotalQuantity_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_InitOffer, CallFunc_GetFortStoreOfferType_ReturnValue) == 0x000084, "Member 'StoreMain_MTXOffer_C_C_InitOffer::CallFunc_GetFortStoreOfferType_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_InitOffer, CallFunc_GetNewVBuckAssetFromQuantity_NewParam) == 0x000088, "Member 'StoreMain_MTXOffer_C_C_InitOffer::CallFunc_GetNewVBuckAssetFromQuantity_NewParam' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_InitOffer, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000090, "Member 'StoreMain_MTXOffer_C_C_InitOffer::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_InitOffer, CallFunc_IsValid_ReturnValue) == 0x000091, "Member 'StoreMain_MTXOffer_C_C_InitOffer::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_InitOffer, Temp_byte_Variable_5) == 0x000092, "Member 'StoreMain_MTXOffer_C_C_InitOffer::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_InitOffer, CallFunc_GetOfferInfo_ReturnValue_3) == 0x000098, "Member 'StoreMain_MTXOffer_C_C_InitOffer::CallFunc_GetOfferInfo_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_InitOffer, CallFunc_GetDynamicMaterial_ReturnValue_2) == 0x0000A0, "Member 'StoreMain_MTXOffer_C_C_InitOffer::CallFunc_GetDynamicMaterial_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_InitOffer, CallFunc_GetTotalQuantity_ReturnValue_1) == 0x0000A8, "Member 'StoreMain_MTXOffer_C_C_InitOffer::CallFunc_GetTotalQuantity_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_InitOffer, CallFunc_GetOfferInfo_ReturnValue_4) == 0x0000B0, "Member 'StoreMain_MTXOffer_C_C_InitOffer::CallFunc_GetOfferInfo_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_InitOffer, CallFunc_GetNewVBuckAssetFromQuantity_NewParam_1) == 0x0000B8, "Member 'StoreMain_MTXOffer_C_C_InitOffer::CallFunc_GetNewVBuckAssetFromQuantity_NewParam_1' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_InitOffer, CallFunc_GetFortStoreOfferType_ReturnValue_1) == 0x0000C0, "Member 'StoreMain_MTXOffer_C_C_InitOffer::CallFunc_GetFortStoreOfferType_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_InitOffer, CallFunc_IsValid_ReturnValue_1) == 0x0000C1, "Member 'StoreMain_MTXOffer_C_C_InitOffer::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_InitOffer, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x0000C2, "Member 'StoreMain_MTXOffer_C_C_InitOffer::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_InitOffer, CallFunc_BooleanAND_ReturnValue) == 0x0000C3, "Member 'StoreMain_MTXOffer_C_C_InitOffer::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_InitOffer, CallFunc_GetBrushResourceAsTexture2D_ReturnValue) == 0x0000C8, "Member 'StoreMain_MTXOffer_C_C_InitOffer::CallFunc_GetBrushResourceAsTexture2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_InitOffer, K2Node_MakeStruct_SlateBrush) == 0x0000D0, "Member 'StoreMain_MTXOffer_C_C_InitOffer::K2Node_MakeStruct_SlateBrush' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_InitOffer, Temp_bool_Variable_2) == 0x000158, "Member 'StoreMain_MTXOffer_C_C_InitOffer::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_InitOffer, CallFunc_GetContext_ReturnValue_1) == 0x000160, "Member 'StoreMain_MTXOffer_C_C_InitOffer::CallFunc_GetContext_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_InitOffer, CallFunc_GetContext_ReturnValue_2) == 0x000168, "Member 'StoreMain_MTXOffer_C_C_InitOffer::CallFunc_GetContext_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_InitOffer, CallFunc_ShouldShowNewVBuckColorsJuly2019_ReturnValue) == 0x000170, "Member 'StoreMain_MTXOffer_C_C_InitOffer::CallFunc_ShouldShowNewVBuckColorsJuly2019_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_InitOffer, CallFunc_ShouldShowNewVBuckColorsJuly2019_ReturnValue_1) == 0x000171, "Member 'StoreMain_MTXOffer_C_C_InitOffer::CallFunc_ShouldShowNewVBuckColorsJuly2019_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_InitOffer, CallFunc_BooleanAND_ReturnValue_1) == 0x000172, "Member 'StoreMain_MTXOffer_C_C_InitOffer::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_InitOffer, Temp_object_Variable) == 0x000178, "Member 'StoreMain_MTXOffer_C_C_InitOffer::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_InitOffer, Temp_object_Variable_1) == 0x000180, "Member 'StoreMain_MTXOffer_C_C_InitOffer::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_InitOffer, CallFunc_GetOfferInfo_ReturnValue_5) == 0x000188, "Member 'StoreMain_MTXOffer_C_C_InitOffer::CallFunc_GetOfferInfo_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_InitOffer, CallFunc_GetOfferInfo_ReturnValue_6) == 0x000190, "Member 'StoreMain_MTXOffer_C_C_InitOffer::CallFunc_GetOfferInfo_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_InitOffer, CallFunc_GetSalePrice_SalePrice) == 0x000198, "Member 'StoreMain_MTXOffer_C_C_InitOffer::CallFunc_GetSalePrice_SalePrice' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_InitOffer, CallFunc_GetSalePrice_ReturnValue) == 0x0001B0, "Member 'StoreMain_MTXOffer_C_C_InitOffer::CallFunc_GetSalePrice_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_InitOffer, CallFunc_GetBannerOverrideTag_ReturnValue) == 0x0001B8, "Member 'StoreMain_MTXOffer_C_C_InitOffer::CallFunc_GetBannerOverrideTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_InitOffer, CallFunc_GetOfferInfo_ReturnValue_7) == 0x0001C8, "Member 'StoreMain_MTXOffer_C_C_InitOffer::CallFunc_GetOfferInfo_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_InitOffer, K2Node_Select_Default) == 0x0001D0, "Member 'StoreMain_MTXOffer_C_C_InitOffer::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_InitOffer, CallFunc_GetGradient_ReturnValue) == 0x0001D4, "Member 'StoreMain_MTXOffer_C_C_InitOffer::CallFunc_GetGradient_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_InitOffer, CallFunc_GetBackground_ReturnValue) == 0x0001F4, "Member 'StoreMain_MTXOffer_C_C_InitOffer::CallFunc_GetBackground_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_InitOffer, CallFunc_GetTileImage_ReturnValue) == 0x000208, "Member 'StoreMain_MTXOffer_C_C_InitOffer::CallFunc_GetTileImage_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_InitOffer, CallFunc_GetOfferInfo_ReturnValue_8) == 0x000290, "Member 'StoreMain_MTXOffer_C_C_InitOffer::CallFunc_GetOfferInfo_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_InitOffer, CallFunc_GetNormalPrice_ReturnValue) == 0x000298, "Member 'StoreMain_MTXOffer_C_C_InitOffer::CallFunc_GetNormalPrice_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_InitOffer, K2Node_MakeStruct_SlateBrush_1) == 0x0002B0, "Member 'StoreMain_MTXOffer_C_C_InitOffer::K2Node_MakeStruct_SlateBrush_1' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_InitOffer, CallFunc_GetBrushResourceAsTexture2D_ReturnValue_1) == 0x000338, "Member 'StoreMain_MTXOffer_C_C_InitOffer::CallFunc_GetBrushResourceAsTexture2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_InitOffer, CallFunc_GetOfferInfo_ReturnValue_9) == 0x000340, "Member 'StoreMain_MTXOffer_C_C_InitOffer::CallFunc_GetOfferInfo_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_InitOffer, CallFunc_GetOfferInfo_ReturnValue_10) == 0x000348, "Member 'StoreMain_MTXOffer_C_C_InitOffer::CallFunc_GetOfferInfo_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_InitOffer, CallFunc_GetTotalQuantity_ReturnValue_2) == 0x000350, "Member 'StoreMain_MTXOffer_C_C_InitOffer::CallFunc_GetTotalQuantity_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_InitOffer, CallFunc_GetFortStoreOfferType_ReturnValue_2) == 0x000354, "Member 'StoreMain_MTXOffer_C_C_InitOffer::CallFunc_GetFortStoreOfferType_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_InitOffer, CallFunc_Conv_IntToText_ReturnValue) == 0x000358, "Member 'StoreMain_MTXOffer_C_C_InitOffer::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_InitOffer, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x000370, "Member 'StoreMain_MTXOffer_C_C_InitOffer::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_InitOffer, CallFunc_GetBaseQuantity_ReturnValue) == 0x000374, "Member 'StoreMain_MTXOffer_C_C_InitOffer::CallFunc_GetBaseQuantity_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_InitOffer, CallFunc_GetName_ReturnValue) == 0x000378, "Member 'StoreMain_MTXOffer_C_C_InitOffer::CallFunc_GetName_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_InitOffer, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000390, "Member 'StoreMain_MTXOffer_C_C_InitOffer::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_InitOffer, CallFunc_GetBonusQuantity_ReturnValue) == 0x000394, "Member 'StoreMain_MTXOffer_C_C_InitOffer::CallFunc_GetBonusQuantity_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_InitOffer, CallFunc_GetTotalQuantity_ReturnValue_3) == 0x000398, "Member 'StoreMain_MTXOffer_C_C_InitOffer::CallFunc_GetTotalQuantity_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_InitOffer, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x00039C, "Member 'StoreMain_MTXOffer_C_C_InitOffer::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_InitOffer, CallFunc_Conv_IntToText_ReturnValue_1) == 0x0003A0, "Member 'StoreMain_MTXOffer_C_C_InitOffer::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_InitOffer, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0003B8, "Member 'StoreMain_MTXOffer_C_C_InitOffer::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_InitOffer, CallFunc_Greater_IntInt_ReturnValue) == 0x0003BC, "Member 'StoreMain_MTXOffer_C_C_InitOffer::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_InitOffer, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0003C0, "Member 'StoreMain_MTXOffer_C_C_InitOffer::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_InitOffer, CallFunc_FTrunc_ReturnValue) == 0x0003C4, "Member 'StoreMain_MTXOffer_C_C_InitOffer::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_InitOffer, K2Node_Select_Default_1) == 0x0003C8, "Member 'StoreMain_MTXOffer_C_C_InitOffer::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_InitOffer, K2Node_MakeStruct_FormatArgumentData) == 0x0003D0, "Member 'StoreMain_MTXOffer_C_C_InitOffer::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_InitOffer, K2Node_MakeArray_Array) == 0x000410, "Member 'StoreMain_MTXOffer_C_C_InitOffer::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_InitOffer, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000420, "Member 'StoreMain_MTXOffer_C_C_InitOffer::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_InitOffer, CallFunc_Format_ReturnValue) == 0x000428, "Member 'StoreMain_MTXOffer_C_C_InitOffer::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_InitOffer, K2Node_Select_Default_2) == 0x000440, "Member 'StoreMain_MTXOffer_C_C_InitOffer::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_InitOffer, Temp_bool_Variable_3) == 0x000441, "Member 'StoreMain_MTXOffer_C_C_InitOffer::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_InitOffer, K2Node_Select_Default_3) == 0x000448, "Member 'StoreMain_MTXOffer_C_C_InitOffer::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_InitOffer, CallFunc_GetDynamicMaterial_ReturnValue_3) == 0x000450, "Member 'StoreMain_MTXOffer_C_C_InitOffer::CallFunc_GetDynamicMaterial_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_InitOffer, CallFunc_GetDynamicMaterial_ReturnValue_4) == 0x000458, "Member 'StoreMain_MTXOffer_C_C_InitOffer::CallFunc_GetDynamicMaterial_ReturnValue_4' has a wrong offset!");

// Function StoreMain_MTXOffer_C.StoreMain_MTXOffer_C_C.OnClick
// 0x0008 (0x0008 - 0x0000)
struct StoreMain_MTXOffer_C_C_OnClick final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(StoreMain_MTXOffer_C_C_OnClick) == 0x000008, "Wrong alignment on StoreMain_MTXOffer_C_C_OnClick");
static_assert(sizeof(StoreMain_MTXOffer_C_C_OnClick) == 0x000008, "Wrong size on StoreMain_MTXOffer_C_C_OnClick");
static_assert(offsetof(StoreMain_MTXOffer_C_C_OnClick, Button) == 0x000000, "Member 'StoreMain_MTXOffer_C_C_OnClick::Button' has a wrong offset!");

// Function StoreMain_MTXOffer_C.StoreMain_MTXOffer_C_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct StoreMain_MTXOffer_C_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(StoreMain_MTXOffer_C_C_PreConstruct) == 0x000001, "Wrong alignment on StoreMain_MTXOffer_C_C_PreConstruct");
static_assert(sizeof(StoreMain_MTXOffer_C_C_PreConstruct) == 0x000001, "Wrong size on StoreMain_MTXOffer_C_C_PreConstruct");
static_assert(offsetof(StoreMain_MTXOffer_C_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'StoreMain_MTXOffer_C_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function StoreMain_MTXOffer_C.StoreMain_MTXOffer_C_C.ExecuteUbergraph_StoreMain_MTXOffer_C
// 0x0038 (0x0038 - 0x0000)
struct StoreMain_MTXOffer_C_C_ExecuteUbergraph_StoreMain_MTXOffer_C final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCommonButton* Button)>  K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_CustomEvent_Button;                         // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(StoreMain_MTXOffer_C_C_ExecuteUbergraph_StoreMain_MTXOffer_C) == 0x000008, "Wrong alignment on StoreMain_MTXOffer_C_C_ExecuteUbergraph_StoreMain_MTXOffer_C");
static_assert(sizeof(StoreMain_MTXOffer_C_C_ExecuteUbergraph_StoreMain_MTXOffer_C) == 0x000038, "Wrong size on StoreMain_MTXOffer_C_C_ExecuteUbergraph_StoreMain_MTXOffer_C");
static_assert(offsetof(StoreMain_MTXOffer_C_C_ExecuteUbergraph_StoreMain_MTXOffer_C, EntryPoint) == 0x000000, "Member 'StoreMain_MTXOffer_C_C_ExecuteUbergraph_StoreMain_MTXOffer_C::EntryPoint' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_C_ExecuteUbergraph_StoreMain_MTXOffer_C, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'StoreMain_MTXOffer_C_C_ExecuteUbergraph_StoreMain_MTXOffer_C::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
