#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SubgameOptionButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SubgameOptionButton.SubgameOptionButton_C
// 0x0110 (0x0C58 - 0x0B48)
class USubgameOptionButton_C final : public UFortSubGameTile
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B48(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       RevealCMSKeyArt;                                   // 0x0B50(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       UnFocused;                                         // 0x0B58(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FocusedSecondary;                                  // 0x0B60(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Focused;                                           // 0x0B68(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonBorder*                          Border_Message;                                    // 0x0B70(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          Border_SpecialMessage;                             // 0x0B78(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActionWidget*                    CommonActionWidget_75;                             // 0x0B80(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Content_Message;                                   // 0x0B88(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           Content_Selected;                                  // 0x0B90(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Content_SpecialMessage;                            // 0x0B98(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DisabledOverlay;                                   // 0x0BA0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Art;                                         // 0x0BA8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_ColorFill;                                   // 0x0BB0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_dropshadow;                                  // 0x0BB8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_FocusPulse;                                  // 0x0BC0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Gradient;                                    // 0x0BC8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPrimarySkewButton_C*                   PlayButton;                                        // 0x0BD0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Description;                                  // 0x0BD8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_SpecialMessage;                               // 0x0BE0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_StandardMessageLine1;                         // 0x0BE8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_StandardMessageLine2;                         // 0x0BF0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Title;                                        // 0x0BF8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnSubgameOptionSelected;                           // 0x0C00(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UMaterialInstance*                      TileGradientBrush;                                 // 0x0C10(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          isUnfocused;                                       // 0x0C18(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C19[0x7];                                      // 0x0C19(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               PulseMID;                                          // 0x0C20(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             DefaultImage;                                      // 0x0C28(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SubGame;                                           // 0x0C30(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<TSoftObjectPtr<class USoundBase>>      DisabledSounds;                                    // 0x0C38(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class FName>                           MaintenanceSections;                               // 0x0C48(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)

public:
	void RefreshTiledEnabledState();
	bool IsGameModeDisabled();
	void SetupTile(class UTexture2D* Key_Art, const struct FLinearColor& Color_Fill, const struct FLinearColor& Color_Gradient, const class FText& Title, const class FText& Description, const class FText& SpecialMessage, const struct FLinearColor& Message_BackgroundColor, const class FText& StandardMessageLine1, const class FText& StandardMessageLine2, class FName SubgameName);
	void OnLoaded_36AA1C0544076B91184923A14E861C80(class UObject* Loaded);
	void OnEventEnded_839970244B5E6542EF2C5BA55D07CDF5(const class FString& EventName, const struct FTimespan& TimeUntilEnd, const struct FTimespan& TimeSinceBegin, float TimespanRatio);
	void OnEventUpdated_839970244B5E6542EF2C5BA55D07CDF5(const class FString& EventName, const struct FTimespan& TimeUntilEnd, const struct FTimespan& TimeSinceBegin, float TimespanRatio);
	void OnEventActive_839970244B5E6542EF2C5BA55D07CDF5(const class FString& EventName, const struct FTimespan& TimeUntilEnd, const struct FTimespan& TimeSinceBegin, float TimespanRatio);
	void OnTileFocused();
	void OnTileUnfocused();
	void BndEvt__PlayButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void PreConstruct(bool IsDesignTime);
	void BP_OnClicked();
	void Construct();
	void EventOtherTileFocused();
	void RefreshSubGameDisplay(const struct FSubgameDisplayData& SubGame_0);
	void BndEvt__Image_KeyArt_K2Node_ComponentBoundEvent_1_onLoadingCompleted__DelegateSignature();
	void GoToSleep();
	void RockyRidge();
	void ExecuteUbergraph_SubgameOptionButton(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SubgameOptionButton_C">();
	}
	static class USubgameOptionButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USubgameOptionButton_C>();
	}
};
static_assert(alignof(USubgameOptionButton_C) == 0x000008, "Wrong alignment on USubgameOptionButton_C");
static_assert(sizeof(USubgameOptionButton_C) == 0x000C58, "Wrong size on USubgameOptionButton_C");
static_assert(offsetof(USubgameOptionButton_C, UberGraphFrame) == 0x000B48, "Member 'USubgameOptionButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USubgameOptionButton_C, RevealCMSKeyArt) == 0x000B50, "Member 'USubgameOptionButton_C::RevealCMSKeyArt' has a wrong offset!");
static_assert(offsetof(USubgameOptionButton_C, UnFocused) == 0x000B58, "Member 'USubgameOptionButton_C::UnFocused' has a wrong offset!");
static_assert(offsetof(USubgameOptionButton_C, FocusedSecondary) == 0x000B60, "Member 'USubgameOptionButton_C::FocusedSecondary' has a wrong offset!");
static_assert(offsetof(USubgameOptionButton_C, Focused) == 0x000B68, "Member 'USubgameOptionButton_C::Focused' has a wrong offset!");
static_assert(offsetof(USubgameOptionButton_C, Border_Message) == 0x000B70, "Member 'USubgameOptionButton_C::Border_Message' has a wrong offset!");
static_assert(offsetof(USubgameOptionButton_C, Border_SpecialMessage) == 0x000B78, "Member 'USubgameOptionButton_C::Border_SpecialMessage' has a wrong offset!");
static_assert(offsetof(USubgameOptionButton_C, CommonActionWidget_75) == 0x000B80, "Member 'USubgameOptionButton_C::CommonActionWidget_75' has a wrong offset!");
static_assert(offsetof(USubgameOptionButton_C, Content_Message) == 0x000B88, "Member 'USubgameOptionButton_C::Content_Message' has a wrong offset!");
static_assert(offsetof(USubgameOptionButton_C, Content_Selected) == 0x000B90, "Member 'USubgameOptionButton_C::Content_Selected' has a wrong offset!");
static_assert(offsetof(USubgameOptionButton_C, Content_SpecialMessage) == 0x000B98, "Member 'USubgameOptionButton_C::Content_SpecialMessage' has a wrong offset!");
static_assert(offsetof(USubgameOptionButton_C, DisabledOverlay) == 0x000BA0, "Member 'USubgameOptionButton_C::DisabledOverlay' has a wrong offset!");
static_assert(offsetof(USubgameOptionButton_C, Image_Art) == 0x000BA8, "Member 'USubgameOptionButton_C::Image_Art' has a wrong offset!");
static_assert(offsetof(USubgameOptionButton_C, Image_ColorFill) == 0x000BB0, "Member 'USubgameOptionButton_C::Image_ColorFill' has a wrong offset!");
static_assert(offsetof(USubgameOptionButton_C, Image_dropshadow) == 0x000BB8, "Member 'USubgameOptionButton_C::Image_dropshadow' has a wrong offset!");
static_assert(offsetof(USubgameOptionButton_C, Image_FocusPulse) == 0x000BC0, "Member 'USubgameOptionButton_C::Image_FocusPulse' has a wrong offset!");
static_assert(offsetof(USubgameOptionButton_C, Image_Gradient) == 0x000BC8, "Member 'USubgameOptionButton_C::Image_Gradient' has a wrong offset!");
static_assert(offsetof(USubgameOptionButton_C, PlayButton) == 0x000BD0, "Member 'USubgameOptionButton_C::PlayButton' has a wrong offset!");
static_assert(offsetof(USubgameOptionButton_C, Text_Description) == 0x000BD8, "Member 'USubgameOptionButton_C::Text_Description' has a wrong offset!");
static_assert(offsetof(USubgameOptionButton_C, Text_SpecialMessage) == 0x000BE0, "Member 'USubgameOptionButton_C::Text_SpecialMessage' has a wrong offset!");
static_assert(offsetof(USubgameOptionButton_C, Text_StandardMessageLine1) == 0x000BE8, "Member 'USubgameOptionButton_C::Text_StandardMessageLine1' has a wrong offset!");
static_assert(offsetof(USubgameOptionButton_C, Text_StandardMessageLine2) == 0x000BF0, "Member 'USubgameOptionButton_C::Text_StandardMessageLine2' has a wrong offset!");
static_assert(offsetof(USubgameOptionButton_C, Text_Title) == 0x000BF8, "Member 'USubgameOptionButton_C::Text_Title' has a wrong offset!");
static_assert(offsetof(USubgameOptionButton_C, OnSubgameOptionSelected) == 0x000C00, "Member 'USubgameOptionButton_C::OnSubgameOptionSelected' has a wrong offset!");
static_assert(offsetof(USubgameOptionButton_C, TileGradientBrush) == 0x000C10, "Member 'USubgameOptionButton_C::TileGradientBrush' has a wrong offset!");
static_assert(offsetof(USubgameOptionButton_C, isUnfocused) == 0x000C18, "Member 'USubgameOptionButton_C::isUnfocused' has a wrong offset!");
static_assert(offsetof(USubgameOptionButton_C, PulseMID) == 0x000C20, "Member 'USubgameOptionButton_C::PulseMID' has a wrong offset!");
static_assert(offsetof(USubgameOptionButton_C, DefaultImage) == 0x000C28, "Member 'USubgameOptionButton_C::DefaultImage' has a wrong offset!");
static_assert(offsetof(USubgameOptionButton_C, SubGame) == 0x000C30, "Member 'USubgameOptionButton_C::SubGame' has a wrong offset!");
static_assert(offsetof(USubgameOptionButton_C, DisabledSounds) == 0x000C38, "Member 'USubgameOptionButton_C::DisabledSounds' has a wrong offset!");
static_assert(offsetof(USubgameOptionButton_C, MaintenanceSections) == 0x000C48, "Member 'USubgameOptionButton_C::MaintenanceSections' has a wrong offset!");

}

