#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SubgameSelect_v2

#include "Basic.hpp"

#include "SubGameSelectRotatorItems_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function SubgameSelect_v2.SubgameSelect_v2_C.AnimShineDelay
// 0x0008 (0x0008 - 0x0000)
struct SubgameSelect_v2_C_AnimShineDelay final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SubgameSelect_v2_C_AnimShineDelay) == 0x000008, "Wrong alignment on SubgameSelect_v2_C_AnimShineDelay");
static_assert(sizeof(SubgameSelect_v2_C_AnimShineDelay) == 0x000008, "Wrong size on SubgameSelect_v2_C_AnimShineDelay");
static_assert(offsetof(SubgameSelect_v2_C_AnimShineDelay, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'SubgameSelect_v2_C_AnimShineDelay::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function SubgameSelect_v2.SubgameSelect_v2_C.AnimSaleDelay
// 0x0008 (0x0008 - 0x0000)
struct SubgameSelect_v2_C_AnimSaleDelay final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SubgameSelect_v2_C_AnimSaleDelay) == 0x000008, "Wrong alignment on SubgameSelect_v2_C_AnimSaleDelay");
static_assert(sizeof(SubgameSelect_v2_C_AnimSaleDelay) == 0x000008, "Wrong size on SubgameSelect_v2_C_AnimSaleDelay");
static_assert(offsetof(SubgameSelect_v2_C_AnimSaleDelay, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'SubgameSelect_v2_C_AnimSaleDelay::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function SubgameSelect_v2.SubgameSelect_v2_C.SetCMSTextureToKeyArt
// 0x0048 (0x0048 - 0x0000)
struct SubgameSelect_v2_C_SetCMSTextureToKeyArt final
{
public:
	EFortSubgameSelectOption                      Key;                                               // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortSubgameSelectOption                      Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_2;                              // 0x0014(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_3;                              // 0x001C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_4;                              // 0x0024(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Select_Default;                             // 0x002C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             CallFunc_Map_Find_Value;                           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SubgameSelect_v2_C_SetCMSTextureToKeyArt) == 0x000008, "Wrong alignment on SubgameSelect_v2_C_SetCMSTextureToKeyArt");
static_assert(sizeof(SubgameSelect_v2_C_SetCMSTextureToKeyArt) == 0x000048, "Wrong size on SubgameSelect_v2_C_SetCMSTextureToKeyArt");
static_assert(offsetof(SubgameSelect_v2_C_SetCMSTextureToKeyArt, Key) == 0x000000, "Member 'SubgameSelect_v2_C_SetCMSTextureToKeyArt::Key' has a wrong offset!");
static_assert(offsetof(SubgameSelect_v2_C_SetCMSTextureToKeyArt, Temp_byte_Variable) == 0x000001, "Member 'SubgameSelect_v2_C_SetCMSTextureToKeyArt::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(SubgameSelect_v2_C_SetCMSTextureToKeyArt, Temp_name_Variable) == 0x000004, "Member 'SubgameSelect_v2_C_SetCMSTextureToKeyArt::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(SubgameSelect_v2_C_SetCMSTextureToKeyArt, Temp_name_Variable_1) == 0x00000C, "Member 'SubgameSelect_v2_C_SetCMSTextureToKeyArt::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(SubgameSelect_v2_C_SetCMSTextureToKeyArt, Temp_name_Variable_2) == 0x000014, "Member 'SubgameSelect_v2_C_SetCMSTextureToKeyArt::Temp_name_Variable_2' has a wrong offset!");
static_assert(offsetof(SubgameSelect_v2_C_SetCMSTextureToKeyArt, Temp_name_Variable_3) == 0x00001C, "Member 'SubgameSelect_v2_C_SetCMSTextureToKeyArt::Temp_name_Variable_3' has a wrong offset!");
static_assert(offsetof(SubgameSelect_v2_C_SetCMSTextureToKeyArt, Temp_name_Variable_4) == 0x000024, "Member 'SubgameSelect_v2_C_SetCMSTextureToKeyArt::Temp_name_Variable_4' has a wrong offset!");
static_assert(offsetof(SubgameSelect_v2_C_SetCMSTextureToKeyArt, K2Node_Select_Default) == 0x00002C, "Member 'SubgameSelect_v2_C_SetCMSTextureToKeyArt::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(SubgameSelect_v2_C_SetCMSTextureToKeyArt, CallFunc_Map_Find_Value) == 0x000038, "Member 'SubgameSelect_v2_C_SetCMSTextureToKeyArt::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(SubgameSelect_v2_C_SetCMSTextureToKeyArt, CallFunc_Map_Find_ReturnValue) == 0x000040, "Member 'SubgameSelect_v2_C_SetCMSTextureToKeyArt::CallFunc_Map_Find_ReturnValue' has a wrong offset!");

// Function SubgameSelect_v2.SubgameSelect_v2_C.StartSubgameSelectMusic
// 0x0020 (0x0020 - 0x0000)
struct SubgameSelect_v2_C_StartSubgameSelectMusic final
{
public:
	TArray<class AFort_Entry_Music_Controller_BP_C*> CallFunc_GetAllActorsOfClass_OutActors;            // 0x0000(0x0010)(ZeroConstructor, ReferenceParm)
	class AFort_Entry_Music_Controller_BP_C*      CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SubgameSelect_v2_C_StartSubgameSelectMusic) == 0x000008, "Wrong alignment on SubgameSelect_v2_C_StartSubgameSelectMusic");
static_assert(sizeof(SubgameSelect_v2_C_StartSubgameSelectMusic) == 0x000020, "Wrong size on SubgameSelect_v2_C_StartSubgameSelectMusic");
static_assert(offsetof(SubgameSelect_v2_C_StartSubgameSelectMusic, CallFunc_GetAllActorsOfClass_OutActors) == 0x000000, "Member 'SubgameSelect_v2_C_StartSubgameSelectMusic::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(SubgameSelect_v2_C_StartSubgameSelectMusic, CallFunc_Array_Get_Item) == 0x000010, "Member 'SubgameSelect_v2_C_StartSubgameSelectMusic::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(SubgameSelect_v2_C_StartSubgameSelectMusic, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'SubgameSelect_v2_C_StartSubgameSelectMusic::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function SubgameSelect_v2.SubgameSelect_v2_C.IsMinorShutdownWarningEnabled
// 0x0018 (0x0018 - 0x0000)
struct SubgameSelect_v2_C_IsMinorShutdownWarningEnabled final
{
public:
	bool                                          Enabled;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortUIFeatureState                           CallFunc_GetFeatureState_OutFeatureState;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortUIFeatureStateReason                     CallFunc_GetFeatureState_OutReason;                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SubgameSelect_v2_C_IsMinorShutdownWarningEnabled) == 0x000008, "Wrong alignment on SubgameSelect_v2_C_IsMinorShutdownWarningEnabled");
static_assert(sizeof(SubgameSelect_v2_C_IsMinorShutdownWarningEnabled) == 0x000018, "Wrong size on SubgameSelect_v2_C_IsMinorShutdownWarningEnabled");
static_assert(offsetof(SubgameSelect_v2_C_IsMinorShutdownWarningEnabled, Enabled) == 0x000000, "Member 'SubgameSelect_v2_C_IsMinorShutdownWarningEnabled::Enabled' has a wrong offset!");
static_assert(offsetof(SubgameSelect_v2_C_IsMinorShutdownWarningEnabled, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'SubgameSelect_v2_C_IsMinorShutdownWarningEnabled::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(SubgameSelect_v2_C_IsMinorShutdownWarningEnabled, CallFunc_GetFeatureState_OutFeatureState) == 0x000010, "Member 'SubgameSelect_v2_C_IsMinorShutdownWarningEnabled::CallFunc_GetFeatureState_OutFeatureState' has a wrong offset!");
static_assert(offsetof(SubgameSelect_v2_C_IsMinorShutdownWarningEnabled, CallFunc_GetFeatureState_OutReason) == 0x000011, "Member 'SubgameSelect_v2_C_IsMinorShutdownWarningEnabled::CallFunc_GetFeatureState_OutReason' has a wrong offset!");
static_assert(offsetof(SubgameSelect_v2_C_IsMinorShutdownWarningEnabled, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000012, "Member 'SubgameSelect_v2_C_IsMinorShutdownWarningEnabled::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function SubgameSelect_v2.SubgameSelect_v2_C.ShowUpsell
// 0x0020 (0x0020 - 0x0000)
struct SubgameSelect_v2_C_ShowUpsell final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortUINavigationManager*               CallFunc_GetUINavigationManager_ReturnValue;       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SubgameSelect_v2_C_ShowUpsell) == 0x000008, "Wrong alignment on SubgameSelect_v2_C_ShowUpsell");
static_assert(sizeof(SubgameSelect_v2_C_ShowUpsell) == 0x000020, "Wrong size on SubgameSelect_v2_C_ShowUpsell");
static_assert(offsetof(SubgameSelect_v2_C_ShowUpsell, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'SubgameSelect_v2_C_ShowUpsell::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(SubgameSelect_v2_C_ShowUpsell, CallFunc_PlayAnimation_ReturnValue_1) == 0x000008, "Member 'SubgameSelect_v2_C_ShowUpsell::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SubgameSelect_v2_C_ShowUpsell, CallFunc_GetUINavigationManager_ReturnValue) == 0x000010, "Member 'SubgameSelect_v2_C_ShowUpsell::CallFunc_GetUINavigationManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(SubgameSelect_v2_C_ShowUpsell, CallFunc_PlayAnimation_ReturnValue_2) == 0x000018, "Member 'SubgameSelect_v2_C_ShowUpsell::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");

// Function SubgameSelect_v2.SubgameSelect_v2_C.InitializeRedeemButton
// 0x0020 (0x0020 - 0x0000)
struct SubgameSelect_v2_C_InitializeRedeemButton final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlatformName_ReturnValue;              // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_1;          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SubgameSelect_v2_C_InitializeRedeemButton) == 0x000008, "Wrong alignment on SubgameSelect_v2_C_InitializeRedeemButton");
static_assert(sizeof(SubgameSelect_v2_C_InitializeRedeemButton) == 0x000020, "Wrong size on SubgameSelect_v2_C_InitializeRedeemButton");
static_assert(offsetof(SubgameSelect_v2_C_InitializeRedeemButton, Temp_bool_Variable) == 0x000000, "Member 'SubgameSelect_v2_C_InitializeRedeemButton::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SubgameSelect_v2_C_InitializeRedeemButton, Temp_byte_Variable) == 0x000001, "Member 'SubgameSelect_v2_C_InitializeRedeemButton::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(SubgameSelect_v2_C_InitializeRedeemButton, Temp_byte_Variable_1) == 0x000002, "Member 'SubgameSelect_v2_C_InitializeRedeemButton::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(SubgameSelect_v2_C_InitializeRedeemButton, CallFunc_GetPlatformName_ReturnValue) == 0x000008, "Member 'SubgameSelect_v2_C_InitializeRedeemButton::CallFunc_GetPlatformName_ReturnValue' has a wrong offset!");
static_assert(offsetof(SubgameSelect_v2_C_InitializeRedeemButton, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000018, "Member 'SubgameSelect_v2_C_InitializeRedeemButton::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(SubgameSelect_v2_C_InitializeRedeemButton, CallFunc_EqualEqual_StrStr_ReturnValue_1) == 0x000019, "Member 'SubgameSelect_v2_C_InitializeRedeemButton::CallFunc_EqualEqual_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SubgameSelect_v2_C_InitializeRedeemButton, CallFunc_BooleanOR_ReturnValue) == 0x00001A, "Member 'SubgameSelect_v2_C_InitializeRedeemButton::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(SubgameSelect_v2_C_InitializeRedeemButton, K2Node_Select_Default) == 0x00001B, "Member 'SubgameSelect_v2_C_InitializeRedeemButton::K2Node_Select_Default' has a wrong offset!");

// Function SubgameSelect_v2.SubgameSelect_v2_C.InitializeShortDescriptions
// 0x0018 (0x0018 - 0x0000)
struct SubgameSelect_v2_C_InitializeShortDescriptions final
{
public:
	class FText                                   ShortDescription;                                  // 0x0000(0x0018)(Edit, BlueprintVisible)
};
static_assert(alignof(SubgameSelect_v2_C_InitializeShortDescriptions) == 0x000008, "Wrong alignment on SubgameSelect_v2_C_InitializeShortDescriptions");
static_assert(sizeof(SubgameSelect_v2_C_InitializeShortDescriptions) == 0x000018, "Wrong size on SubgameSelect_v2_C_InitializeShortDescriptions");
static_assert(offsetof(SubgameSelect_v2_C_InitializeShortDescriptions, ShortDescription) == 0x000000, "Member 'SubgameSelect_v2_C_InitializeShortDescriptions::ShortDescription' has a wrong offset!");

// Function SubgameSelect_v2.SubgameSelect_v2_C.IsBusyMatchmaking
// 0x0018 (0x0018 - 0x0000)
struct SubgameSelect_v2_C_IsBusyMatchmaking final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortMatchmakingContext*                CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMatchmakingLocal_ReturnValue;           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SubgameSelect_v2_C_IsBusyMatchmaking) == 0x000008, "Wrong alignment on SubgameSelect_v2_C_IsBusyMatchmaking");
static_assert(sizeof(SubgameSelect_v2_C_IsBusyMatchmaking) == 0x000018, "Wrong size on SubgameSelect_v2_C_IsBusyMatchmaking");
static_assert(offsetof(SubgameSelect_v2_C_IsBusyMatchmaking, ReturnValue) == 0x000000, "Member 'SubgameSelect_v2_C_IsBusyMatchmaking::ReturnValue' has a wrong offset!");
static_assert(offsetof(SubgameSelect_v2_C_IsBusyMatchmaking, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'SubgameSelect_v2_C_IsBusyMatchmaking::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(SubgameSelect_v2_C_IsBusyMatchmaking, CallFunc_IsMatchmakingLocal_ReturnValue) == 0x000010, "Member 'SubgameSelect_v2_C_IsBusyMatchmaking::CallFunc_IsMatchmakingLocal_ReturnValue' has a wrong offset!");

// Function SubgameSelect_v2.SubgameSelect_v2_C.Update
// 0x0010 (0x0010 - 0x0000)
struct SubgameSelect_v2_C_Update final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SubgameSelect_v2_C_Update) == 0x000008, "Wrong alignment on SubgameSelect_v2_C_Update");
static_assert(sizeof(SubgameSelect_v2_C_Update) == 0x000010, "Wrong size on SubgameSelect_v2_C_Update");
static_assert(offsetof(SubgameSelect_v2_C_Update, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'SubgameSelect_v2_C_Update::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(SubgameSelect_v2_C_Update, CallFunc_PlayAnimation_ReturnValue_1) == 0x000008, "Member 'SubgameSelect_v2_C_Update::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

// Function SubgameSelect_v2.SubgameSelect_v2_C.AdvanceRotator
// 0x0030 (0x0030 - 0x0000)
struct SubgameSelect_v2_C_AdvanceRotator final
{
public:
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSubGameSelectRotatorItems             CallFunc_Array_Get_Item;                           // 0x0008(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SubgameSelect_v2_C_AdvanceRotator) == 0x000008, "Wrong alignment on SubgameSelect_v2_C_AdvanceRotator");
static_assert(sizeof(SubgameSelect_v2_C_AdvanceRotator) == 0x000030, "Wrong size on SubgameSelect_v2_C_AdvanceRotator");
static_assert(offsetof(SubgameSelect_v2_C_AdvanceRotator, CallFunc_Array_Length_ReturnValue) == 0x000000, "Member 'SubgameSelect_v2_C_AdvanceRotator::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(SubgameSelect_v2_C_AdvanceRotator, CallFunc_Array_Get_Item) == 0x000008, "Member 'SubgameSelect_v2_C_AdvanceRotator::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(SubgameSelect_v2_C_AdvanceRotator, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000028, "Member 'SubgameSelect_v2_C_AdvanceRotator::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SubgameSelect_v2_C_AdvanceRotator, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'SubgameSelect_v2_C_AdvanceRotator::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function SubgameSelect_v2.SubgameSelect_v2_C.ResetKeyArtForMainMenu
// 0x0020 (0x0020 - 0x0000)
struct SubgameSelect_v2_C_ResetKeyArtForMainMenu final
{
public:
	struct FSubGameSelectRotatorItems             CallFunc_Array_Get_Item;                           // 0x0000(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SubgameSelect_v2_C_ResetKeyArtForMainMenu) == 0x000008, "Wrong alignment on SubgameSelect_v2_C_ResetKeyArtForMainMenu");
static_assert(sizeof(SubgameSelect_v2_C_ResetKeyArtForMainMenu) == 0x000020, "Wrong size on SubgameSelect_v2_C_ResetKeyArtForMainMenu");
static_assert(offsetof(SubgameSelect_v2_C_ResetKeyArtForMainMenu, CallFunc_Array_Get_Item) == 0x000000, "Member 'SubgameSelect_v2_C_ResetKeyArtForMainMenu::CallFunc_Array_Get_Item' has a wrong offset!");

// Function SubgameSelect_v2.SubgameSelect_v2_C.ToggleTimer
// 0x0020 (0x0020 - 0x0000)
struct SubgameSelect_v2_C_ToggleTimer final
{
public:
	bool                                          Enabled;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SubgameSelect_v2_C_ToggleTimer) == 0x000008, "Wrong alignment on SubgameSelect_v2_C_ToggleTimer");
static_assert(sizeof(SubgameSelect_v2_C_ToggleTimer) == 0x000020, "Wrong size on SubgameSelect_v2_C_ToggleTimer");
static_assert(offsetof(SubgameSelect_v2_C_ToggleTimer, Enabled) == 0x000000, "Member 'SubgameSelect_v2_C_ToggleTimer::Enabled' has a wrong offset!");
static_assert(offsetof(SubgameSelect_v2_C_ToggleTimer, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'SubgameSelect_v2_C_ToggleTimer::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(SubgameSelect_v2_C_ToggleTimer, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'SubgameSelect_v2_C_ToggleTimer::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");

// Function SubgameSelect_v2.SubgameSelect_v2_C.SafeSetSubGame
// 0x0038 (0x0038 - 0x0000)
struct SubgameSelect_v2_C_SafeSetSubGame final
{
public:
	ESubGame                                      SubGame;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_InstallAllOnDemandChunks_ReturnValue;     // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_CanPlay_DenialReason;                     // 0x0018(0x0018)()
	bool                                          CallFunc_CanPlay_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SubgameSelect_v2_C_SafeSetSubGame) == 0x000008, "Wrong alignment on SubgameSelect_v2_C_SafeSetSubGame");
static_assert(sizeof(SubgameSelect_v2_C_SafeSetSubGame) == 0x000038, "Wrong size on SubgameSelect_v2_C_SafeSetSubGame");
static_assert(offsetof(SubgameSelect_v2_C_SafeSetSubGame, SubGame) == 0x000000, "Member 'SubgameSelect_v2_C_SafeSetSubGame::SubGame' has a wrong offset!");
static_assert(offsetof(SubgameSelect_v2_C_SafeSetSubGame, CallFunc_InstallAllOnDemandChunks_ReturnValue) == 0x000001, "Member 'SubgameSelect_v2_C_SafeSetSubGame::CallFunc_InstallAllOnDemandChunks_ReturnValue' has a wrong offset!");
static_assert(offsetof(SubgameSelect_v2_C_SafeSetSubGame, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'SubgameSelect_v2_C_SafeSetSubGame::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(SubgameSelect_v2_C_SafeSetSubGame, CallFunc_MakeLiteralByte_ReturnValue) == 0x000010, "Member 'SubgameSelect_v2_C_SafeSetSubGame::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(SubgameSelect_v2_C_SafeSetSubGame, CallFunc_CanPlay_DenialReason) == 0x000018, "Member 'SubgameSelect_v2_C_SafeSetSubGame::CallFunc_CanPlay_DenialReason' has a wrong offset!");
static_assert(offsetof(SubgameSelect_v2_C_SafeSetSubGame, CallFunc_CanPlay_ReturnValue) == 0x000030, "Member 'SubgameSelect_v2_C_SafeSetSubGame::CallFunc_CanPlay_ReturnValue' has a wrong offset!");
static_assert(offsetof(SubgameSelect_v2_C_SafeSetSubGame, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000031, "Member 'SubgameSelect_v2_C_SafeSetSubGame::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function SubgameSelect_v2.SubgameSelect_v2_C.SetDescriptionForSubGame
// 0x0038 (0x0038 - 0x0000)
struct SubgameSelect_v2_C_SetDescriptionForSubGame final
{
public:
	EFortSubgameSelectOption                      SubGame;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESubGame                                      CallFunc_GetSubGameBySubGameSelectOption_ReturnValue; // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_CanPlay_DenialReason;                     // 0x0018(0x0018)()
	bool                                          CallFunc_CanPlay_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SubgameSelect_v2_C_SetDescriptionForSubGame) == 0x000008, "Wrong alignment on SubgameSelect_v2_C_SetDescriptionForSubGame");
static_assert(sizeof(SubgameSelect_v2_C_SetDescriptionForSubGame) == 0x000038, "Wrong size on SubgameSelect_v2_C_SetDescriptionForSubGame");
static_assert(offsetof(SubgameSelect_v2_C_SetDescriptionForSubGame, SubGame) == 0x000000, "Member 'SubgameSelect_v2_C_SetDescriptionForSubGame::SubGame' has a wrong offset!");
static_assert(offsetof(SubgameSelect_v2_C_SetDescriptionForSubGame, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'SubgameSelect_v2_C_SetDescriptionForSubGame::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(SubgameSelect_v2_C_SetDescriptionForSubGame, CallFunc_GetSubGameBySubGameSelectOption_ReturnValue) == 0x000010, "Member 'SubgameSelect_v2_C_SetDescriptionForSubGame::CallFunc_GetSubGameBySubGameSelectOption_ReturnValue' has a wrong offset!");
static_assert(offsetof(SubgameSelect_v2_C_SetDescriptionForSubGame, CallFunc_CanPlay_DenialReason) == 0x000018, "Member 'SubgameSelect_v2_C_SetDescriptionForSubGame::CallFunc_CanPlay_DenialReason' has a wrong offset!");
static_assert(offsetof(SubgameSelect_v2_C_SetDescriptionForSubGame, CallFunc_CanPlay_ReturnValue) == 0x000030, "Member 'SubgameSelect_v2_C_SetDescriptionForSubGame::CallFunc_CanPlay_ReturnValue' has a wrong offset!");
static_assert(offsetof(SubgameSelect_v2_C_SetDescriptionForSubGame, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000031, "Member 'SubgameSelect_v2_C_SetDescriptionForSubGame::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(SubgameSelect_v2_C_SetDescriptionForSubGame, CallFunc_BooleanOR_ReturnValue) == 0x000032, "Member 'SubgameSelect_v2_C_SetDescriptionForSubGame::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function SubgameSelect_v2.SubgameSelect_v2_C.DialogResult_7EC32B25493920B99C7CF79EFDA28EB7
// 0x000C (0x000C - 0x0000)
struct SubgameSelect_v2_C_DialogResult_7EC32B25493920B99C7CF79EFDA28EB7 final
{
public:
	EFortDialogResult                             Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ResultName;                                        // 0x0004(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SubgameSelect_v2_C_DialogResult_7EC32B25493920B99C7CF79EFDA28EB7) == 0x000004, "Wrong alignment on SubgameSelect_v2_C_DialogResult_7EC32B25493920B99C7CF79EFDA28EB7");
static_assert(sizeof(SubgameSelect_v2_C_DialogResult_7EC32B25493920B99C7CF79EFDA28EB7) == 0x00000C, "Wrong size on SubgameSelect_v2_C_DialogResult_7EC32B25493920B99C7CF79EFDA28EB7");
static_assert(offsetof(SubgameSelect_v2_C_DialogResult_7EC32B25493920B99C7CF79EFDA28EB7, Result) == 0x000000, "Member 'SubgameSelect_v2_C_DialogResult_7EC32B25493920B99C7CF79EFDA28EB7::Result' has a wrong offset!");
static_assert(offsetof(SubgameSelect_v2_C_DialogResult_7EC32B25493920B99C7CF79EFDA28EB7, ResultName) == 0x000004, "Member 'SubgameSelect_v2_C_DialogResult_7EC32B25493920B99C7CF79EFDA28EB7::ResultName' has a wrong offset!");

// Function SubgameSelect_v2.SubgameSelect_v2_C.DialogResult_332144D14BEB8E8CF33D23B1E41D9870
// 0x000C (0x000C - 0x0000)
struct SubgameSelect_v2_C_DialogResult_332144D14BEB8E8CF33D23B1E41D9870 final
{
public:
	EFortDialogResult                             Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ResultName;                                        // 0x0004(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SubgameSelect_v2_C_DialogResult_332144D14BEB8E8CF33D23B1E41D9870) == 0x000004, "Wrong alignment on SubgameSelect_v2_C_DialogResult_332144D14BEB8E8CF33D23B1E41D9870");
static_assert(sizeof(SubgameSelect_v2_C_DialogResult_332144D14BEB8E8CF33D23B1E41D9870) == 0x00000C, "Wrong size on SubgameSelect_v2_C_DialogResult_332144D14BEB8E8CF33D23B1E41D9870");
static_assert(offsetof(SubgameSelect_v2_C_DialogResult_332144D14BEB8E8CF33D23B1E41D9870, Result) == 0x000000, "Member 'SubgameSelect_v2_C_DialogResult_332144D14BEB8E8CF33D23B1E41D9870::Result' has a wrong offset!");
static_assert(offsetof(SubgameSelect_v2_C_DialogResult_332144D14BEB8E8CF33D23B1E41D9870, ResultName) == 0x000004, "Member 'SubgameSelect_v2_C_DialogResult_332144D14BEB8E8CF33D23B1E41D9870::ResultName' has a wrong offset!");

// Function SubgameSelect_v2.SubgameSelect_v2_C.DialogResult_1A2E7C4A4105C9DABC5FBA893C0E9939
// 0x000C (0x000C - 0x0000)
struct SubgameSelect_v2_C_DialogResult_1A2E7C4A4105C9DABC5FBA893C0E9939 final
{
public:
	EFortDialogResult                             Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ResultName;                                        // 0x0004(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SubgameSelect_v2_C_DialogResult_1A2E7C4A4105C9DABC5FBA893C0E9939) == 0x000004, "Wrong alignment on SubgameSelect_v2_C_DialogResult_1A2E7C4A4105C9DABC5FBA893C0E9939");
static_assert(sizeof(SubgameSelect_v2_C_DialogResult_1A2E7C4A4105C9DABC5FBA893C0E9939) == 0x00000C, "Wrong size on SubgameSelect_v2_C_DialogResult_1A2E7C4A4105C9DABC5FBA893C0E9939");
static_assert(offsetof(SubgameSelect_v2_C_DialogResult_1A2E7C4A4105C9DABC5FBA893C0E9939, Result) == 0x000000, "Member 'SubgameSelect_v2_C_DialogResult_1A2E7C4A4105C9DABC5FBA893C0E9939::Result' has a wrong offset!");
static_assert(offsetof(SubgameSelect_v2_C_DialogResult_1A2E7C4A4105C9DABC5FBA893C0E9939, ResultName) == 0x000004, "Member 'SubgameSelect_v2_C_DialogResult_1A2E7C4A4105C9DABC5FBA893C0E9939::ResultName' has a wrong offset!");

// Function SubgameSelect_v2.SubgameSelect_v2_C.DialogResult_60E26A51407B9D65CE40D19A874C53B1
// 0x000C (0x000C - 0x0000)
struct SubgameSelect_v2_C_DialogResult_60E26A51407B9D65CE40D19A874C53B1 final
{
public:
	EFortDialogResult                             Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ResultName;                                        // 0x0004(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SubgameSelect_v2_C_DialogResult_60E26A51407B9D65CE40D19A874C53B1) == 0x000004, "Wrong alignment on SubgameSelect_v2_C_DialogResult_60E26A51407B9D65CE40D19A874C53B1");
static_assert(sizeof(SubgameSelect_v2_C_DialogResult_60E26A51407B9D65CE40D19A874C53B1) == 0x00000C, "Wrong size on SubgameSelect_v2_C_DialogResult_60E26A51407B9D65CE40D19A874C53B1");
static_assert(offsetof(SubgameSelect_v2_C_DialogResult_60E26A51407B9D65CE40D19A874C53B1, Result) == 0x000000, "Member 'SubgameSelect_v2_C_DialogResult_60E26A51407B9D65CE40D19A874C53B1::Result' has a wrong offset!");
static_assert(offsetof(SubgameSelect_v2_C_DialogResult_60E26A51407B9D65CE40D19A874C53B1, ResultName) == 0x000004, "Member 'SubgameSelect_v2_C_DialogResult_60E26A51407B9D65CE40D19A874C53B1::ResultName' has a wrong offset!");

// Function SubgameSelect_v2.SubgameSelect_v2_C.OnRealMoneyPurchaseComleteHandler
// 0x0018 (0x0018 - 0x0000)
struct SubgameSelect_v2_C_OnRealMoneyPurchaseComleteHandler final
{
public:
	bool                                          bSuccess;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPurchasedItemInfo>             PurchasedItems;                                    // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
};
static_assert(alignof(SubgameSelect_v2_C_OnRealMoneyPurchaseComleteHandler) == 0x000008, "Wrong alignment on SubgameSelect_v2_C_OnRealMoneyPurchaseComleteHandler");
static_assert(sizeof(SubgameSelect_v2_C_OnRealMoneyPurchaseComleteHandler) == 0x000018, "Wrong size on SubgameSelect_v2_C_OnRealMoneyPurchaseComleteHandler");
static_assert(offsetof(SubgameSelect_v2_C_OnRealMoneyPurchaseComleteHandler, bSuccess) == 0x000000, "Member 'SubgameSelect_v2_C_OnRealMoneyPurchaseComleteHandler::bSuccess' has a wrong offset!");
static_assert(offsetof(SubgameSelect_v2_C_OnRealMoneyPurchaseComleteHandler, PurchasedItems) == 0x000008, "Member 'SubgameSelect_v2_C_OnRealMoneyPurchaseComleteHandler::PurchasedItems' has a wrong offset!");

// Function SubgameSelect_v2.SubgameSelect_v2_C.BndEvt__ButtonExit_K2Node_ComponentBoundEvent_193_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct SubgameSelect_v2_C_BndEvt__ButtonExit_K2Node_ComponentBoundEvent_193_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SubgameSelect_v2_C_BndEvt__ButtonExit_K2Node_ComponentBoundEvent_193_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on SubgameSelect_v2_C_BndEvt__ButtonExit_K2Node_ComponentBoundEvent_193_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(SubgameSelect_v2_C_BndEvt__ButtonExit_K2Node_ComponentBoundEvent_193_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on SubgameSelect_v2_C_BndEvt__ButtonExit_K2Node_ComponentBoundEvent_193_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(SubgameSelect_v2_C_BndEvt__ButtonExit_K2Node_ComponentBoundEvent_193_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'SubgameSelect_v2_C_BndEvt__ButtonExit_K2Node_ComponentBoundEvent_193_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function SubgameSelect_v2.SubgameSelect_v2_C.ShowMinorShutdownMessage
// 0x0001 (0x0001 - 0x0000)
struct SubgameSelect_v2_C_ShowMinorShutdownMessage final
{
public:
	bool                                          bIsCampaign;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SubgameSelect_v2_C_ShowMinorShutdownMessage) == 0x000001, "Wrong alignment on SubgameSelect_v2_C_ShowMinorShutdownMessage");
static_assert(sizeof(SubgameSelect_v2_C_ShowMinorShutdownMessage) == 0x000001, "Wrong size on SubgameSelect_v2_C_ShowMinorShutdownMessage");
static_assert(offsetof(SubgameSelect_v2_C_ShowMinorShutdownMessage, bIsCampaign) == 0x000000, "Member 'SubgameSelect_v2_C_ShowMinorShutdownMessage::bIsCampaign' has a wrong offset!");

// Function SubgameSelect_v2.SubgameSelect_v2_C.BndEvt__ButtonRedeem_K2Node_ComponentBoundEvent_68_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct SubgameSelect_v2_C_BndEvt__ButtonRedeem_K2Node_ComponentBoundEvent_68_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SubgameSelect_v2_C_BndEvt__ButtonRedeem_K2Node_ComponentBoundEvent_68_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on SubgameSelect_v2_C_BndEvt__ButtonRedeem_K2Node_ComponentBoundEvent_68_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(SubgameSelect_v2_C_BndEvt__ButtonRedeem_K2Node_ComponentBoundEvent_68_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on SubgameSelect_v2_C_BndEvt__ButtonRedeem_K2Node_ComponentBoundEvent_68_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(SubgameSelect_v2_C_BndEvt__ButtonRedeem_K2Node_ComponentBoundEvent_68_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'SubgameSelect_v2_C_BndEvt__ButtonRedeem_K2Node_ComponentBoundEvent_68_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function SubgameSelect_v2.SubgameSelect_v2_C.OnInputModeChanged
// 0x0001 (0x0001 - 0x0000)
struct SubgameSelect_v2_C_OnInputModeChanged final
{
public:
	bool                                          bUsingGamepad;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SubgameSelect_v2_C_OnInputModeChanged) == 0x000001, "Wrong alignment on SubgameSelect_v2_C_OnInputModeChanged");
static_assert(sizeof(SubgameSelect_v2_C_OnInputModeChanged) == 0x000001, "Wrong size on SubgameSelect_v2_C_OnInputModeChanged");
static_assert(offsetof(SubgameSelect_v2_C_OnInputModeChanged, bUsingGamepad) == 0x000000, "Member 'SubgameSelect_v2_C_OnInputModeChanged::bUsingGamepad' has a wrong offset!");

// Function SubgameSelect_v2.SubgameSelect_v2_C.OnSubGameImageLoadedFromCMS
// 0x0010 (0x0010 - 0x0000)
struct SubgameSelect_v2_C_OnSubGameImageLoadedFromCMS final
{
public:
	EFortSubgameSelectOption                      SubGameOption;                                     // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             Image;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SubgameSelect_v2_C_OnSubGameImageLoadedFromCMS) == 0x000008, "Wrong alignment on SubgameSelect_v2_C_OnSubGameImageLoadedFromCMS");
static_assert(sizeof(SubgameSelect_v2_C_OnSubGameImageLoadedFromCMS) == 0x000010, "Wrong size on SubgameSelect_v2_C_OnSubGameImageLoadedFromCMS");
static_assert(offsetof(SubgameSelect_v2_C_OnSubGameImageLoadedFromCMS, SubGameOption) == 0x000000, "Member 'SubgameSelect_v2_C_OnSubGameImageLoadedFromCMS::SubGameOption' has a wrong offset!");
static_assert(offsetof(SubgameSelect_v2_C_OnSubGameImageLoadedFromCMS, Image) == 0x000008, "Member 'SubgameSelect_v2_C_OnSubGameImageLoadedFromCMS::Image' has a wrong offset!");

// Function SubgameSelect_v2.SubgameSelect_v2_C.CustomEvent_0
// 0x0001 (0x0001 - 0x0000)
struct SubgameSelect_v2_C_CustomEvent_0 final
{
public:
	EMatchmakingCompleteResult                    Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SubgameSelect_v2_C_CustomEvent_0) == 0x000001, "Wrong alignment on SubgameSelect_v2_C_CustomEvent_0");
static_assert(sizeof(SubgameSelect_v2_C_CustomEvent_0) == 0x000001, "Wrong size on SubgameSelect_v2_C_CustomEvent_0");
static_assert(offsetof(SubgameSelect_v2_C_CustomEvent_0, Result) == 0x000000, "Member 'SubgameSelect_v2_C_CustomEvent_0::Result' has a wrong offset!");

// Function SubgameSelect_v2.SubgameSelect_v2_C.BndEvt__ButtonPurchase_K2Node_ComponentBoundEvent_39_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct SubgameSelect_v2_C_BndEvt__ButtonPurchase_K2Node_ComponentBoundEvent_39_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SubgameSelect_v2_C_BndEvt__ButtonPurchase_K2Node_ComponentBoundEvent_39_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on SubgameSelect_v2_C_BndEvt__ButtonPurchase_K2Node_ComponentBoundEvent_39_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(SubgameSelect_v2_C_BndEvt__ButtonPurchase_K2Node_ComponentBoundEvent_39_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on SubgameSelect_v2_C_BndEvt__ButtonPurchase_K2Node_ComponentBoundEvent_39_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(SubgameSelect_v2_C_BndEvt__ButtonPurchase_K2Node_ComponentBoundEvent_39_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'SubgameSelect_v2_C_BndEvt__ButtonPurchase_K2Node_ComponentBoundEvent_39_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function SubgameSelect_v2.SubgameSelect_v2_C.BndEvt__ButtonBack_K2Node_ComponentBoundEvent_128_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct SubgameSelect_v2_C_BndEvt__ButtonBack_K2Node_ComponentBoundEvent_128_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SubgameSelect_v2_C_BndEvt__ButtonBack_K2Node_ComponentBoundEvent_128_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on SubgameSelect_v2_C_BndEvt__ButtonBack_K2Node_ComponentBoundEvent_128_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(SubgameSelect_v2_C_BndEvt__ButtonBack_K2Node_ComponentBoundEvent_128_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on SubgameSelect_v2_C_BndEvt__ButtonBack_K2Node_ComponentBoundEvent_128_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(SubgameSelect_v2_C_BndEvt__ButtonBack_K2Node_ComponentBoundEvent_128_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'SubgameSelect_v2_C_BndEvt__ButtonBack_K2Node_ComponentBoundEvent_128_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function SubgameSelect_v2.SubgameSelect_v2_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct SubgameSelect_v2_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SubgameSelect_v2_C_PreConstruct) == 0x000001, "Wrong alignment on SubgameSelect_v2_C_PreConstruct");
static_assert(sizeof(SubgameSelect_v2_C_PreConstruct) == 0x000001, "Wrong size on SubgameSelect_v2_C_PreConstruct");
static_assert(offsetof(SubgameSelect_v2_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'SubgameSelect_v2_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function SubgameSelect_v2.SubgameSelect_v2_C.BndEvt__BattleRoyaleTile_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct SubgameSelect_v2_C_BndEvt__BattleRoyaleTile_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SubgameSelect_v2_C_BndEvt__BattleRoyaleTile_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on SubgameSelect_v2_C_BndEvt__BattleRoyaleTile_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(SubgameSelect_v2_C_BndEvt__BattleRoyaleTile_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on SubgameSelect_v2_C_BndEvt__BattleRoyaleTile_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(SubgameSelect_v2_C_BndEvt__BattleRoyaleTile_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'SubgameSelect_v2_C_BndEvt__BattleRoyaleTile_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function SubgameSelect_v2.SubgameSelect_v2_C.BndEvt__BattleRoyaleTile_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct SubgameSelect_v2_C_BndEvt__BattleRoyaleTile_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SubgameSelect_v2_C_BndEvt__BattleRoyaleTile_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on SubgameSelect_v2_C_BndEvt__BattleRoyaleTile_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(SubgameSelect_v2_C_BndEvt__BattleRoyaleTile_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on SubgameSelect_v2_C_BndEvt__BattleRoyaleTile_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(SubgameSelect_v2_C_BndEvt__BattleRoyaleTile_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'SubgameSelect_v2_C_BndEvt__BattleRoyaleTile_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function SubgameSelect_v2.SubgameSelect_v2_C.BndEvt__SaveTheWorldTile_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct SubgameSelect_v2_C_BndEvt__SaveTheWorldTile_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SubgameSelect_v2_C_BndEvt__SaveTheWorldTile_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on SubgameSelect_v2_C_BndEvt__SaveTheWorldTile_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(SubgameSelect_v2_C_BndEvt__SaveTheWorldTile_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on SubgameSelect_v2_C_BndEvt__SaveTheWorldTile_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(SubgameSelect_v2_C_BndEvt__SaveTheWorldTile_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'SubgameSelect_v2_C_BndEvt__SaveTheWorldTile_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function SubgameSelect_v2.SubgameSelect_v2_C.BndEvt__SaveTheWorldTile_K2Node_ComponentBoundEvent_6_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct SubgameSelect_v2_C_BndEvt__SaveTheWorldTile_K2Node_ComponentBoundEvent_6_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SubgameSelect_v2_C_BndEvt__SaveTheWorldTile_K2Node_ComponentBoundEvent_6_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on SubgameSelect_v2_C_BndEvt__SaveTheWorldTile_K2Node_ComponentBoundEvent_6_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(SubgameSelect_v2_C_BndEvt__SaveTheWorldTile_K2Node_ComponentBoundEvent_6_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on SubgameSelect_v2_C_BndEvt__SaveTheWorldTile_K2Node_ComponentBoundEvent_6_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(SubgameSelect_v2_C_BndEvt__SaveTheWorldTile_K2Node_ComponentBoundEvent_6_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'SubgameSelect_v2_C_BndEvt__SaveTheWorldTile_K2Node_ComponentBoundEvent_6_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function SubgameSelect_v2.SubgameSelect_v2_C.BndEvt__CreativeTile_K2Node_ComponentBoundEvent_7_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct SubgameSelect_v2_C_BndEvt__CreativeTile_K2Node_ComponentBoundEvent_7_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SubgameSelect_v2_C_BndEvt__CreativeTile_K2Node_ComponentBoundEvent_7_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on SubgameSelect_v2_C_BndEvt__CreativeTile_K2Node_ComponentBoundEvent_7_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(SubgameSelect_v2_C_BndEvt__CreativeTile_K2Node_ComponentBoundEvent_7_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on SubgameSelect_v2_C_BndEvt__CreativeTile_K2Node_ComponentBoundEvent_7_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(SubgameSelect_v2_C_BndEvt__CreativeTile_K2Node_ComponentBoundEvent_7_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'SubgameSelect_v2_C_BndEvt__CreativeTile_K2Node_ComponentBoundEvent_7_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function SubgameSelect_v2.SubgameSelect_v2_C.BndEvt__CreativeTile_K2Node_ComponentBoundEvent_8_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct SubgameSelect_v2_C_BndEvt__CreativeTile_K2Node_ComponentBoundEvent_8_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SubgameSelect_v2_C_BndEvt__CreativeTile_K2Node_ComponentBoundEvent_8_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on SubgameSelect_v2_C_BndEvt__CreativeTile_K2Node_ComponentBoundEvent_8_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(SubgameSelect_v2_C_BndEvt__CreativeTile_K2Node_ComponentBoundEvent_8_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on SubgameSelect_v2_C_BndEvt__CreativeTile_K2Node_ComponentBoundEvent_8_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(SubgameSelect_v2_C_BndEvt__CreativeTile_K2Node_ComponentBoundEvent_8_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'SubgameSelect_v2_C_BndEvt__CreativeTile_K2Node_ComponentBoundEvent_8_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function SubgameSelect_v2.SubgameSelect_v2_C.ExecuteUbergraph_SubgameSelect_v2
// 0x0670 (0x0670 - 0x0000)
struct SubgameSelect_v2_C_ExecuteUbergraph_SubgameSelect_v2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortDialogResult                             K2Node_CustomEvent_Result_3;                       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_ResultName_2;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EFortDialogResult Result, class FName ResultName)> K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
