#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TabAccount

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"


namespace SDK::Params
{

// Function TabAccount.TabAccount_C.InitPreviousValues
// 0x0010 (0x0010 - 0x0000)
struct TabAccount_C_InitPreviousValues final
{
public:
	class UFortSettingsContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetRotatorSettingValue_ReturnValue;       // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TabAccount_C_InitPreviousValues) == 0x000008, "Wrong alignment on TabAccount_C_InitPreviousValues");
static_assert(sizeof(TabAccount_C_InitPreviousValues) == 0x000010, "Wrong size on TabAccount_C_InitPreviousValues");
static_assert(offsetof(TabAccount_C_InitPreviousValues, CallFunc_GetContext_ReturnValue) == 0x000000, "Member 'TabAccount_C_InitPreviousValues::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccount_C_InitPreviousValues, CallFunc_GetRotatorSettingValue_ReturnValue) == 0x000008, "Member 'TabAccount_C_InitPreviousValues::CallFunc_GetRotatorSettingValue_ReturnValue' has a wrong offset!");

// Function TabAccount.TabAccount_C.UpdateSize
// 0x0150 (0x0150 - 0x0000)
struct TabAccount_C_UpdateSize final
{
public:
	struct FMargin                                TempPadding;                                       // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetDesiredSize_ReturnValue;               // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_Vector2DToVector_ReturnValue;        // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x005C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class URotatorSelector_C*>             K2Node_MakeArray_Array;                            // 0x0078(0x0010)(ZeroConstructor, ReferenceParm)
	class URotatorSelector_C*                     CallFunc_Array_Get_Item;                           // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USizeBoxSlot*                           K2Node_DynamicCast_AsSize_Box_Slot;                // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A2[0x2];                                       // 0x00A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x00A4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        K2Node_MakeArray_Array_1;                          // 0x00B8(0x0010)(ZeroConstructor, ReferenceParm)
	class UWidget*                                CallFunc_Array_Get_Item_1;                         // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_DynamicCast_AsCommon_Button;                // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x00E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E3[0x5];                                       // 0x00E3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UTextBlock*>                     K2Node_MakeArray_Array_2;                          // 0x00E8(0x0010)(ZeroConstructor, ReferenceParm)
	class UTextBlock*                             CallFunc_Array_Get_Item_2;                         // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_FindParentWidgetOfType_ReturnValue;       // 0x0108(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USizeBox*                               K2Node_DynamicCast_AsSize_Box;                     // 0x0118(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UCommonTextBlock*>               K2Node_MakeArray_Array_3;                          // 0x0128(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonTextBlock*                       CallFunc_Array_Get_Item_3;                         // 0x0140(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TabAccount_C_UpdateSize) == 0x000008, "Wrong alignment on TabAccount_C_UpdateSize");
static_assert(sizeof(TabAccount_C_UpdateSize) == 0x000150, "Wrong size on TabAccount_C_UpdateSize");
static_assert(offsetof(TabAccount_C_UpdateSize, TempPadding) == 0x000000, "Member 'TabAccount_C_UpdateSize::TempPadding' has a wrong offset!");
static_assert(offsetof(TabAccount_C_UpdateSize, Temp_int_Array_Index_Variable) == 0x000010, "Member 'TabAccount_C_UpdateSize::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(TabAccount_C_UpdateSize, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'TabAccount_C_UpdateSize::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(TabAccount_C_UpdateSize, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'TabAccount_C_UpdateSize::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccount_C_UpdateSize, Temp_int_Loop_Counter_Variable_1) == 0x00001C, "Member 'TabAccount_C_UpdateSize::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(TabAccount_C_UpdateSize, Temp_int_Loop_Counter_Variable_2) == 0x000020, "Member 'TabAccount_C_UpdateSize::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(TabAccount_C_UpdateSize, CallFunc_Add_IntInt_ReturnValue_1) == 0x000024, "Member 'TabAccount_C_UpdateSize::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TabAccount_C_UpdateSize, CallFunc_Add_IntInt_ReturnValue_2) == 0x000028, "Member 'TabAccount_C_UpdateSize::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(TabAccount_C_UpdateSize, Temp_int_Array_Index_Variable_1) == 0x00002C, "Member 'TabAccount_C_UpdateSize::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(TabAccount_C_UpdateSize, Temp_int_Array_Index_Variable_2) == 0x000030, "Member 'TabAccount_C_UpdateSize::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(TabAccount_C_UpdateSize, Temp_int_Loop_Counter_Variable_3) == 0x000034, "Member 'TabAccount_C_UpdateSize::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(TabAccount_C_UpdateSize, CallFunc_GetDesiredSize_ReturnValue) == 0x000038, "Member 'TabAccount_C_UpdateSize::CallFunc_GetDesiredSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccount_C_UpdateSize, CallFunc_Conv_Vector2DToVector_ReturnValue) == 0x000040, "Member 'TabAccount_C_UpdateSize::CallFunc_Conv_Vector2DToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccount_C_UpdateSize, CallFunc_Add_IntInt_ReturnValue_3) == 0x00004C, "Member 'TabAccount_C_UpdateSize::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(TabAccount_C_UpdateSize, CallFunc_BreakVector_X) == 0x000050, "Member 'TabAccount_C_UpdateSize::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(TabAccount_C_UpdateSize, CallFunc_BreakVector_Y) == 0x000054, "Member 'TabAccount_C_UpdateSize::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(TabAccount_C_UpdateSize, CallFunc_BreakVector_Z) == 0x000058, "Member 'TabAccount_C_UpdateSize::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(TabAccount_C_UpdateSize, CallFunc_MakeVector2D_ReturnValue) == 0x00005C, "Member 'TabAccount_C_UpdateSize::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccount_C_UpdateSize, CallFunc_BreakVector2D_X) == 0x000064, "Member 'TabAccount_C_UpdateSize::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(TabAccount_C_UpdateSize, CallFunc_BreakVector2D_Y) == 0x000068, "Member 'TabAccount_C_UpdateSize::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(TabAccount_C_UpdateSize, CallFunc_FTrunc_ReturnValue) == 0x00006C, "Member 'TabAccount_C_UpdateSize::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccount_C_UpdateSize, CallFunc_FTrunc_ReturnValue_1) == 0x000070, "Member 'TabAccount_C_UpdateSize::CallFunc_FTrunc_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TabAccount_C_UpdateSize, K2Node_MakeArray_Array) == 0x000078, "Member 'TabAccount_C_UpdateSize::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(TabAccount_C_UpdateSize, CallFunc_Array_Get_Item) == 0x000088, "Member 'TabAccount_C_UpdateSize::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(TabAccount_C_UpdateSize, CallFunc_Array_Length_ReturnValue) == 0x000090, "Member 'TabAccount_C_UpdateSize::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccount_C_UpdateSize, K2Node_DynamicCast_AsSize_Box_Slot) == 0x000098, "Member 'TabAccount_C_UpdateSize::K2Node_DynamicCast_AsSize_Box_Slot' has a wrong offset!");
static_assert(offsetof(TabAccount_C_UpdateSize, K2Node_DynamicCast_bSuccess) == 0x0000A0, "Member 'TabAccount_C_UpdateSize::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(TabAccount_C_UpdateSize, CallFunc_Less_IntInt_ReturnValue) == 0x0000A1, "Member 'TabAccount_C_UpdateSize::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccount_C_UpdateSize, K2Node_MakeStruct_Margin) == 0x0000A4, "Member 'TabAccount_C_UpdateSize::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(TabAccount_C_UpdateSize, Temp_int_Array_Index_Variable_3) == 0x0000B4, "Member 'TabAccount_C_UpdateSize::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(TabAccount_C_UpdateSize, K2Node_MakeArray_Array_1) == 0x0000B8, "Member 'TabAccount_C_UpdateSize::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(TabAccount_C_UpdateSize, CallFunc_Array_Get_Item_1) == 0x0000C8, "Member 'TabAccount_C_UpdateSize::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(TabAccount_C_UpdateSize, CallFunc_Array_Length_ReturnValue_1) == 0x0000D0, "Member 'TabAccount_C_UpdateSize::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TabAccount_C_UpdateSize, K2Node_DynamicCast_AsCommon_Button) == 0x0000D8, "Member 'TabAccount_C_UpdateSize::K2Node_DynamicCast_AsCommon_Button' has a wrong offset!");
static_assert(offsetof(TabAccount_C_UpdateSize, K2Node_DynamicCast_bSuccess_1) == 0x0000E0, "Member 'TabAccount_C_UpdateSize::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(TabAccount_C_UpdateSize, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000E1, "Member 'TabAccount_C_UpdateSize::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TabAccount_C_UpdateSize, CallFunc_IsMobileGame_ReturnValue) == 0x0000E2, "Member 'TabAccount_C_UpdateSize::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccount_C_UpdateSize, K2Node_MakeArray_Array_2) == 0x0000E8, "Member 'TabAccount_C_UpdateSize::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(TabAccount_C_UpdateSize, CallFunc_Array_Get_Item_2) == 0x0000F8, "Member 'TabAccount_C_UpdateSize::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(TabAccount_C_UpdateSize, CallFunc_Array_Length_ReturnValue_2) == 0x000100, "Member 'TabAccount_C_UpdateSize::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(TabAccount_C_UpdateSize, CallFunc_FindParentWidgetOfType_ReturnValue) == 0x000108, "Member 'TabAccount_C_UpdateSize::CallFunc_FindParentWidgetOfType_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccount_C_UpdateSize, CallFunc_Less_IntInt_ReturnValue_2) == 0x000110, "Member 'TabAccount_C_UpdateSize::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(TabAccount_C_UpdateSize, K2Node_DynamicCast_AsSize_Box) == 0x000118, "Member 'TabAccount_C_UpdateSize::K2Node_DynamicCast_AsSize_Box' has a wrong offset!");
static_assert(offsetof(TabAccount_C_UpdateSize, K2Node_DynamicCast_bSuccess_2) == 0x000120, "Member 'TabAccount_C_UpdateSize::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(TabAccount_C_UpdateSize, K2Node_MakeArray_Array_3) == 0x000128, "Member 'TabAccount_C_UpdateSize::K2Node_MakeArray_Array_3' has a wrong offset!");
static_assert(offsetof(TabAccount_C_UpdateSize, CallFunc_Array_Length_ReturnValue_3) == 0x000138, "Member 'TabAccount_C_UpdateSize::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(TabAccount_C_UpdateSize, CallFunc_Array_Get_Item_3) == 0x000140, "Member 'TabAccount_C_UpdateSize::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(TabAccount_C_UpdateSize, CallFunc_Less_IntInt_ReturnValue_3) == 0x000148, "Member 'TabAccount_C_UpdateSize::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");

// Function TabAccount.TabAccount_C.SetScrollBar
// 0x001C (0x001C - 0x0000)
struct TabAccount_C_SetScrollBar final
{
public:
	struct FVector2D                              DefaultSize;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              MobileSize;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              K2Node_Select_Default;                             // 0x0014(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TabAccount_C_SetScrollBar) == 0x000004, "Wrong alignment on TabAccount_C_SetScrollBar");
static_assert(sizeof(TabAccount_C_SetScrollBar) == 0x00001C, "Wrong size on TabAccount_C_SetScrollBar");
static_assert(offsetof(TabAccount_C_SetScrollBar, DefaultSize) == 0x000000, "Member 'TabAccount_C_SetScrollBar::DefaultSize' has a wrong offset!");
static_assert(offsetof(TabAccount_C_SetScrollBar, MobileSize) == 0x000008, "Member 'TabAccount_C_SetScrollBar::MobileSize' has a wrong offset!");
static_assert(offsetof(TabAccount_C_SetScrollBar, Temp_bool_Variable) == 0x000010, "Member 'TabAccount_C_SetScrollBar::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(TabAccount_C_SetScrollBar, CallFunc_IsMobileGame_ReturnValue) == 0x000011, "Member 'TabAccount_C_SetScrollBar::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccount_C_SetScrollBar, K2Node_Select_Default) == 0x000014, "Member 'TabAccount_C_SetScrollBar::K2Node_Select_Default' has a wrong offset!");

// Function TabAccount.TabAccount_C.SetFontSize
// 0x0068 (0x0068 - 0x0000)
struct TabAccount_C_SetFontSize final
{
public:
	class UCommonTextBlock*                       Text;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DefaultFontSize_0;                                 // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MobileFontSize_0;                                  // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateFontInfo                         TempFont;                                          // 0x0010(0x0050)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62[0x2];                                       // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TabAccount_C_SetFontSize) == 0x000008, "Wrong alignment on TabAccount_C_SetFontSize");
static_assert(sizeof(TabAccount_C_SetFontSize) == 0x000068, "Wrong size on TabAccount_C_SetFontSize");
static_assert(offsetof(TabAccount_C_SetFontSize, Text) == 0x000000, "Member 'TabAccount_C_SetFontSize::Text' has a wrong offset!");
static_assert(offsetof(TabAccount_C_SetFontSize, DefaultFontSize_0) == 0x000008, "Member 'TabAccount_C_SetFontSize::DefaultFontSize_0' has a wrong offset!");
static_assert(offsetof(TabAccount_C_SetFontSize, MobileFontSize_0) == 0x00000C, "Member 'TabAccount_C_SetFontSize::MobileFontSize_0' has a wrong offset!");
static_assert(offsetof(TabAccount_C_SetFontSize, TempFont) == 0x000010, "Member 'TabAccount_C_SetFontSize::TempFont' has a wrong offset!");
static_assert(offsetof(TabAccount_C_SetFontSize, Temp_bool_Variable) == 0x000060, "Member 'TabAccount_C_SetFontSize::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(TabAccount_C_SetFontSize, CallFunc_IsMobileGame_ReturnValue) == 0x000061, "Member 'TabAccount_C_SetFontSize::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccount_C_SetFontSize, K2Node_Select_Default) == 0x000064, "Member 'TabAccount_C_SetFontSize::K2Node_Select_Default' has a wrong offset!");

// Function TabAccount.TabAccount_C.CenterAppropriateWidget
// 0x0050 (0x0050 - 0x0000)
struct TabAccount_C_CenterAppropriateWidget final
{
public:
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortRuntimeOptions*                    CallFunc_GetRuntimeOptions_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldShowLeaderboardPrivacySettings_ReturnValue; // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortUINavigationManager*               CallFunc_GetUINavigationManager_ReturnValue;       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESubGame                                      CallFunc_GetSubGame_ReturnValue;                   // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDesktopPlatform_ReturnValue;            // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue_1;                 // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInZone_ReturnValue;                     // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortUINavigationManager*               CallFunc_GetUINavigationManager_ReturnValue_1;     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TabAccount_C_CenterAppropriateWidget) == 0x000008, "Wrong alignment on TabAccount_C_CenterAppropriateWidget");
static_assert(sizeof(TabAccount_C_CenterAppropriateWidget) == 0x000050, "Wrong size on TabAccount_C_CenterAppropriateWidget");
static_assert(offsetof(TabAccount_C_CenterAppropriateWidget, CallFunc_IsMobileGame_ReturnValue) == 0x000000, "Member 'TabAccount_C_CenterAppropriateWidget::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccount_C_CenterAppropriateWidget, CallFunc_GetRuntimeOptions_ReturnValue) == 0x000008, "Member 'TabAccount_C_CenterAppropriateWidget::CallFunc_GetRuntimeOptions_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccount_C_CenterAppropriateWidget, CallFunc_ShouldShowLeaderboardPrivacySettings_ReturnValue) == 0x000010, "Member 'TabAccount_C_CenterAppropriateWidget::CallFunc_ShouldShowLeaderboardPrivacySettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccount_C_CenterAppropriateWidget, CallFunc_GetUINavigationManager_ReturnValue) == 0x000018, "Member 'TabAccount_C_CenterAppropriateWidget::CallFunc_GetUINavigationManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccount_C_CenterAppropriateWidget, CallFunc_GetContext_ReturnValue) == 0x000020, "Member 'TabAccount_C_CenterAppropriateWidget::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccount_C_CenterAppropriateWidget, CallFunc_GetSubGame_ReturnValue) == 0x000028, "Member 'TabAccount_C_CenterAppropriateWidget::CallFunc_GetSubGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccount_C_CenterAppropriateWidget, CallFunc_IsDesktopPlatform_ReturnValue) == 0x000029, "Member 'TabAccount_C_CenterAppropriateWidget::CallFunc_IsDesktopPlatform_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccount_C_CenterAppropriateWidget, CallFunc_GetContext_ReturnValue_1) == 0x000030, "Member 'TabAccount_C_CenterAppropriateWidget::CallFunc_GetContext_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TabAccount_C_CenterAppropriateWidget, CallFunc_BooleanOR_ReturnValue) == 0x000038, "Member 'TabAccount_C_CenterAppropriateWidget::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccount_C_CenterAppropriateWidget, CallFunc_IsInZone_ReturnValue) == 0x000039, "Member 'TabAccount_C_CenterAppropriateWidget::CallFunc_IsInZone_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccount_C_CenterAppropriateWidget, CallFunc_Not_PreBool_ReturnValue) == 0x00003A, "Member 'TabAccount_C_CenterAppropriateWidget::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccount_C_CenterAppropriateWidget, CallFunc_MakeLiteralByte_ReturnValue) == 0x00003B, "Member 'TabAccount_C_CenterAppropriateWidget::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccount_C_CenterAppropriateWidget, CallFunc_GetUINavigationManager_ReturnValue_1) == 0x000040, "Member 'TabAccount_C_CenterAppropriateWidget::CallFunc_GetUINavigationManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TabAccount_C_CenterAppropriateWidget, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000048, "Member 'TabAccount_C_CenterAppropriateWidget::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccount_C_CenterAppropriateWidget, CallFunc_BooleanAND_ReturnValue) == 0x000049, "Member 'TabAccount_C_CenterAppropriateWidget::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function TabAccount.TabAccount_C.PrivacySettingsFromSelection
// 0x000C (0x000C - 0x0000)
struct TabAccount_C_PrivacySettingsFromSelection final
{
public:
	int32                                         A;                                                 // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMcpPrivacySettings                    McpPrivacySettings;                                // 0x0004(0x0002)(Parm, OutParm, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMcpPrivacySettings                    K2Node_MakeStruct_McpPrivacySettings;              // 0x0007(0x0002)(NoDestructor)
};
static_assert(alignof(TabAccount_C_PrivacySettingsFromSelection) == 0x000004, "Wrong alignment on TabAccount_C_PrivacySettingsFromSelection");
static_assert(sizeof(TabAccount_C_PrivacySettingsFromSelection) == 0x00000C, "Wrong size on TabAccount_C_PrivacySettingsFromSelection");
static_assert(offsetof(TabAccount_C_PrivacySettingsFromSelection, A) == 0x000000, "Member 'TabAccount_C_PrivacySettingsFromSelection::A' has a wrong offset!");
static_assert(offsetof(TabAccount_C_PrivacySettingsFromSelection, McpPrivacySettings) == 0x000004, "Member 'TabAccount_C_PrivacySettingsFromSelection::McpPrivacySettings' has a wrong offset!");
static_assert(offsetof(TabAccount_C_PrivacySettingsFromSelection, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000006, "Member 'TabAccount_C_PrivacySettingsFromSelection::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccount_C_PrivacySettingsFromSelection, K2Node_MakeStruct_McpPrivacySettings) == 0x000007, "Member 'TabAccount_C_PrivacySettingsFromSelection::K2Node_MakeStruct_McpPrivacySettings' has a wrong offset!");

// Function TabAccount.TabAccount_C.PrivacySettingsToSelection
// 0x0020 (0x0020 - 0x0000)
struct TabAccount_C_PrivacySettingsToSelection final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortMcpContext*                        CallFunc_GetContext_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TabAccount_C_PrivacySettingsToSelection) == 0x000008, "Wrong alignment on TabAccount_C_PrivacySettingsToSelection");
static_assert(sizeof(TabAccount_C_PrivacySettingsToSelection) == 0x000020, "Wrong size on TabAccount_C_PrivacySettingsToSelection");
static_assert(offsetof(TabAccount_C_PrivacySettingsToSelection, ReturnValue) == 0x000000, "Member 'TabAccount_C_PrivacySettingsToSelection::ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccount_C_PrivacySettingsToSelection, Temp_bool_Variable) == 0x000004, "Member 'TabAccount_C_PrivacySettingsToSelection::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(TabAccount_C_PrivacySettingsToSelection, Temp_int_Variable) == 0x000008, "Member 'TabAccount_C_PrivacySettingsToSelection::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(TabAccount_C_PrivacySettingsToSelection, Temp_int_Variable_1) == 0x00000C, "Member 'TabAccount_C_PrivacySettingsToSelection::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(TabAccount_C_PrivacySettingsToSelection, CallFunc_GetContext_ReturnValue) == 0x000010, "Member 'TabAccount_C_PrivacySettingsToSelection::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccount_C_PrivacySettingsToSelection, K2Node_Select_Default) == 0x000018, "Member 'TabAccount_C_PrivacySettingsToSelection::K2Node_Select_Default' has a wrong offset!");

// Function TabAccount.TabAccount_C.OnStWContentUninstalled
// 0x0004 (0x0004 - 0x0000)
struct TabAccount_C_OnStWContentUninstalled final
{
public:
	float                                         StWUninstallProgress;                              // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TabAccount_C_OnStWContentUninstalled) == 0x000004, "Wrong alignment on TabAccount_C_OnStWContentUninstalled");
static_assert(sizeof(TabAccount_C_OnStWContentUninstalled) == 0x000004, "Wrong size on TabAccount_C_OnStWContentUninstalled");
static_assert(offsetof(TabAccount_C_OnStWContentUninstalled, StWUninstallProgress) == 0x000000, "Member 'TabAccount_C_OnStWContentUninstalled::StWUninstallProgress' has a wrong offset!");

// Function TabAccount.TabAccount_C.GetTencentId
// 0x0048 (0x0048 - 0x0000)
struct TabAccount_C_GetTencentId final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	class UFortMcpContext*                        CallFunc_GetContext_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetTencentIdString_ReturnValue;           // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0030(0x0018)()
};
static_assert(alignof(TabAccount_C_GetTencentId) == 0x000008, "Wrong alignment on TabAccount_C_GetTencentId");
static_assert(sizeof(TabAccount_C_GetTencentId) == 0x000048, "Wrong size on TabAccount_C_GetTencentId");
static_assert(offsetof(TabAccount_C_GetTencentId, ReturnValue) == 0x000000, "Member 'TabAccount_C_GetTencentId::ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccount_C_GetTencentId, CallFunc_GetContext_ReturnValue) == 0x000018, "Member 'TabAccount_C_GetTencentId::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccount_C_GetTencentId, CallFunc_GetTencentIdString_ReturnValue) == 0x000020, "Member 'TabAccount_C_GetTencentId::CallFunc_GetTencentIdString_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccount_C_GetTencentId, CallFunc_Conv_StringToText_ReturnValue) == 0x000030, "Member 'TabAccount_C_GetTencentId::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function TabAccount.TabAccount_C.InitializeWebsiteConfiguration
// 0x0088 (0x0088 - 0x0000)
struct TabAccount_C_InitializeWebsiteConfiguration final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0020(0x0018)()
	bool                                          CallFunc_IsAccountLinkingUIURLButtonEnabled_ReturnValue; // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetAccountLinkingUIURL_ReturnValue;       // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0050(0x0018)()
	int32                                         CallFunc_Len_ReturnValue;                          // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortAccountLinkingUIConfig                   CallFunc_GetAccountLinkingUIConfig_ReturnValue;    // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x006E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x006F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Select_Default_1;                           // 0x0070(0x0018)()
};
static_assert(alignof(TabAccount_C_InitializeWebsiteConfiguration) == 0x000008, "Wrong alignment on TabAccount_C_InitializeWebsiteConfiguration");
static_assert(sizeof(TabAccount_C_InitializeWebsiteConfiguration) == 0x000088, "Wrong size on TabAccount_C_InitializeWebsiteConfiguration");
static_assert(offsetof(TabAccount_C_InitializeWebsiteConfiguration, Temp_bool_Variable) == 0x000000, "Member 'TabAccount_C_InitializeWebsiteConfiguration::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(TabAccount_C_InitializeWebsiteConfiguration, Temp_byte_Variable) == 0x000001, "Member 'TabAccount_C_InitializeWebsiteConfiguration::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(TabAccount_C_InitializeWebsiteConfiguration, Temp_byte_Variable_1) == 0x000002, "Member 'TabAccount_C_InitializeWebsiteConfiguration::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(TabAccount_C_InitializeWebsiteConfiguration, Temp_bool_Variable_1) == 0x000003, "Member 'TabAccount_C_InitializeWebsiteConfiguration::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(TabAccount_C_InitializeWebsiteConfiguration, Temp_text_Variable) == 0x000008, "Member 'TabAccount_C_InitializeWebsiteConfiguration::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(TabAccount_C_InitializeWebsiteConfiguration, Temp_text_Variable_1) == 0x000020, "Member 'TabAccount_C_InitializeWebsiteConfiguration::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(TabAccount_C_InitializeWebsiteConfiguration, CallFunc_IsAccountLinkingUIURLButtonEnabled_ReturnValue) == 0x000038, "Member 'TabAccount_C_InitializeWebsiteConfiguration::CallFunc_IsAccountLinkingUIURLButtonEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccount_C_InitializeWebsiteConfiguration, CallFunc_GetAccountLinkingUIURL_ReturnValue) == 0x000040, "Member 'TabAccount_C_InitializeWebsiteConfiguration::CallFunc_GetAccountLinkingUIURL_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccount_C_InitializeWebsiteConfiguration, CallFunc_Conv_StringToText_ReturnValue) == 0x000050, "Member 'TabAccount_C_InitializeWebsiteConfiguration::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccount_C_InitializeWebsiteConfiguration, CallFunc_Len_ReturnValue) == 0x000068, "Member 'TabAccount_C_InitializeWebsiteConfiguration::CallFunc_Len_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccount_C_InitializeWebsiteConfiguration, CallFunc_Greater_IntInt_ReturnValue) == 0x00006C, "Member 'TabAccount_C_InitializeWebsiteConfiguration::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccount_C_InitializeWebsiteConfiguration, CallFunc_GetAccountLinkingUIConfig_ReturnValue) == 0x00006D, "Member 'TabAccount_C_InitializeWebsiteConfiguration::CallFunc_GetAccountLinkingUIConfig_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccount_C_InitializeWebsiteConfiguration, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00006E, "Member 'TabAccount_C_InitializeWebsiteConfiguration::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccount_C_InitializeWebsiteConfiguration, K2Node_Select_Default) == 0x00006F, "Member 'TabAccount_C_InitializeWebsiteConfiguration::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(TabAccount_C_InitializeWebsiteConfiguration, K2Node_Select_Default_1) == 0x000070, "Member 'TabAccount_C_InitializeWebsiteConfiguration::K2Node_Select_Default_1' has a wrong offset!");

// Function TabAccount.TabAccount_C.Build Player Id Analytic Attribute
// 0x0090 (0x0090 - 0x0000)
struct TabAccount_C_Build_Player_Id_Analytic_Attribute final
{
public:
	struct FFortAnalyticsEventAttribute           ReturnValue;                                       // 0x0000(0x0020)(Parm, OutParm, ReturnParm)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  K2Node_DynamicCast_AsFort_Player_Controller;       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUniqueNetIdRepl                       CallFunc_GetGameAccountId_ReturnValue;             // 0x0038(0x0028)(HasGetValueTypeHash)
	class FString                                 CallFunc_GetDebugStringForUniqueId_ReturnValue;    // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FFortAnalyticsEventAttribute           CallFunc_ConstructAnalyticsAttribute_ReturnValue;  // 0x0070(0x0020)()
};
static_assert(alignof(TabAccount_C_Build_Player_Id_Analytic_Attribute) == 0x000008, "Wrong alignment on TabAccount_C_Build_Player_Id_Analytic_Attribute");
static_assert(sizeof(TabAccount_C_Build_Player_Id_Analytic_Attribute) == 0x000090, "Wrong size on TabAccount_C_Build_Player_Id_Analytic_Attribute");
static_assert(offsetof(TabAccount_C_Build_Player_Id_Analytic_Attribute, ReturnValue) == 0x000000, "Member 'TabAccount_C_Build_Player_Id_Analytic_Attribute::ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccount_C_Build_Player_Id_Analytic_Attribute, CallFunc_GetOwningPlayer_ReturnValue) == 0x000020, "Member 'TabAccount_C_Build_Player_Id_Analytic_Attribute::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccount_C_Build_Player_Id_Analytic_Attribute, K2Node_DynamicCast_AsFort_Player_Controller) == 0x000028, "Member 'TabAccount_C_Build_Player_Id_Analytic_Attribute::K2Node_DynamicCast_AsFort_Player_Controller' has a wrong offset!");
static_assert(offsetof(TabAccount_C_Build_Player_Id_Analytic_Attribute, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'TabAccount_C_Build_Player_Id_Analytic_Attribute::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(TabAccount_C_Build_Player_Id_Analytic_Attribute, CallFunc_GetGameAccountId_ReturnValue) == 0x000038, "Member 'TabAccount_C_Build_Player_Id_Analytic_Attribute::CallFunc_GetGameAccountId_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccount_C_Build_Player_Id_Analytic_Attribute, CallFunc_GetDebugStringForUniqueId_ReturnValue) == 0x000060, "Member 'TabAccount_C_Build_Player_Id_Analytic_Attribute::CallFunc_GetDebugStringForUniqueId_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccount_C_Build_Player_Id_Analytic_Attribute, CallFunc_ConstructAnalyticsAttribute_ReturnValue) == 0x000070, "Member 'TabAccount_C_Build_Player_Id_Analytic_Attribute::CallFunc_ConstructAnalyticsAttribute_ReturnValue' has a wrong offset!");

// Function TabAccount.TabAccount_C.Build Player Name Analytic Attribute
// 0x0098 (0x0098 - 0x0000)
struct TabAccount_C_Build_Player_Name_Analytic_Attribute final
{
public:
	struct FFortAnalyticsEventAttribute           ReturnValue;                                       // 0x0000(0x0020)(Parm, OutParm, ReturnParm)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  K2Node_DynamicCast_AsFort_Player_Controller;       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUniqueNetIdRepl                       CallFunc_GetGameAccountId_ReturnValue;             // 0x0038(0x0028)(HasGetValueTypeHash)
	class UFortRegisteredPlayerInfo*              CallFunc_GetPlayerInfoFromUniqueID_ReturnValue;    // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetPlayerName_ReturnValue;                // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FFortAnalyticsEventAttribute           CallFunc_ConstructAnalyticsAttribute_ReturnValue;  // 0x0078(0x0020)()
};
static_assert(alignof(TabAccount_C_Build_Player_Name_Analytic_Attribute) == 0x000008, "Wrong alignment on TabAccount_C_Build_Player_Name_Analytic_Attribute");
static_assert(sizeof(TabAccount_C_Build_Player_Name_Analytic_Attribute) == 0x000098, "Wrong size on TabAccount_C_Build_Player_Name_Analytic_Attribute");
static_assert(offsetof(TabAccount_C_Build_Player_Name_Analytic_Attribute, ReturnValue) == 0x000000, "Member 'TabAccount_C_Build_Player_Name_Analytic_Attribute::ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccount_C_Build_Player_Name_Analytic_Attribute, CallFunc_GetOwningPlayer_ReturnValue) == 0x000020, "Member 'TabAccount_C_Build_Player_Name_Analytic_Attribute::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccount_C_Build_Player_Name_Analytic_Attribute, K2Node_DynamicCast_AsFort_Player_Controller) == 0x000028, "Member 'TabAccount_C_Build_Player_Name_Analytic_Attribute::K2Node_DynamicCast_AsFort_Player_Controller' has a wrong offset!");
static_assert(offsetof(TabAccount_C_Build_Player_Name_Analytic_Attribute, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'TabAccount_C_Build_Player_Name_Analytic_Attribute::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(TabAccount_C_Build_Player_Name_Analytic_Attribute, CallFunc_GetGameAccountId_ReturnValue) == 0x000038, "Member 'TabAccount_C_Build_Player_Name_Analytic_Attribute::CallFunc_GetGameAccountId_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccount_C_Build_Player_Name_Analytic_Attribute, CallFunc_GetPlayerInfoFromUniqueID_ReturnValue) == 0x000060, "Member 'TabAccount_C_Build_Player_Name_Analytic_Attribute::CallFunc_GetPlayerInfoFromUniqueID_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccount_C_Build_Player_Name_Analytic_Attribute, CallFunc_GetPlayerName_ReturnValue) == 0x000068, "Member 'TabAccount_C_Build_Player_Name_Analytic_Attribute::CallFunc_GetPlayerName_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccount_C_Build_Player_Name_Analytic_Attribute, CallFunc_ConstructAnalyticsAttribute_ReturnValue) == 0x000078, "Member 'TabAccount_C_Build_Player_Name_Analytic_Attribute::CallFunc_ConstructAnalyticsAttribute_ReturnValue' has a wrong offset!");

// Function TabAccount.TabAccount_C.Initialize Data
// 0x0228 (0x0228 - 0x0000)
struct TabAccount_C_Initialize_Data final
{
public:
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortMcpContext*                        CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue_1;                 // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_CanPlay_DenialReason;                     // 0x0020(0x0018)()
	bool                                          CallFunc_CanPlay_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_6;                              // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue_2;                 // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortUIFeatureState                           CallFunc_GetFeatureState_OutFeatureState;          // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortUIFeatureStateReason                     CallFunc_GetFeatureState_OutReason;                // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_7;                              // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_8;                              // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E[0x2];                                       // 0x004E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue_3;                 // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDesktopPlatform_ReturnValue;            // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_9;                              // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_10;                             // 0x005B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_11;                             // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_12;                             // 0x005E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
