#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TabGameOptionsMain

#include "Basic.hpp"


namespace SDK::Params
{

// Function TabGameOptionsMain.TabGameOptionsMain_C.BndEvt__OptionsListView_K2Node_ComponentBoundEvent_5_OnListViewItemScrolledIntoView__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct TabGameOptionsMain_C_BndEvt__OptionsListView_K2Node_ComponentBoundEvent_5_OnListViewItemScrolledIntoView__DelegateSignature final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            Widget;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TabGameOptionsMain_C_BndEvt__OptionsListView_K2Node_ComponentBoundEvent_5_OnListViewItemScrolledIntoView__DelegateSignature) == 0x000008, "Wrong alignment on TabGameOptionsMain_C_BndEvt__OptionsListView_K2Node_ComponentBoundEvent_5_OnListViewItemScrolledIntoView__DelegateSignature");
static_assert(sizeof(TabGameOptionsMain_C_BndEvt__OptionsListView_K2Node_ComponentBoundEvent_5_OnListViewItemScrolledIntoView__DelegateSignature) == 0x000010, "Wrong size on TabGameOptionsMain_C_BndEvt__OptionsListView_K2Node_ComponentBoundEvent_5_OnListViewItemScrolledIntoView__DelegateSignature");
static_assert(offsetof(TabGameOptionsMain_C_BndEvt__OptionsListView_K2Node_ComponentBoundEvent_5_OnListViewItemScrolledIntoView__DelegateSignature, Item) == 0x000000, "Member 'TabGameOptionsMain_C_BndEvt__OptionsListView_K2Node_ComponentBoundEvent_5_OnListViewItemScrolledIntoView__DelegateSignature::Item' has a wrong offset!");
static_assert(offsetof(TabGameOptionsMain_C_BndEvt__OptionsListView_K2Node_ComponentBoundEvent_5_OnListViewItemScrolledIntoView__DelegateSignature, Widget) == 0x000008, "Member 'TabGameOptionsMain_C_BndEvt__OptionsListView_K2Node_ComponentBoundEvent_5_OnListViewItemScrolledIntoView__DelegateSignature::Widget' has a wrong offset!");

// Function TabGameOptionsMain.TabGameOptionsMain_C.BndEvt__OptionsListView_K2Node_ComponentBoundEvent_4_OnListViewItemWidgetCreated__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct TabGameOptionsMain_C_BndEvt__OptionsListView_K2Node_ComponentBoundEvent_4_OnListViewItemWidgetCreated__DelegateSignature final
{
public:
	class UUserWidget*                            Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TabGameOptionsMain_C_BndEvt__OptionsListView_K2Node_ComponentBoundEvent_4_OnListViewItemWidgetCreated__DelegateSignature) == 0x000008, "Wrong alignment on TabGameOptionsMain_C_BndEvt__OptionsListView_K2Node_ComponentBoundEvent_4_OnListViewItemWidgetCreated__DelegateSignature");
static_assert(sizeof(TabGameOptionsMain_C_BndEvt__OptionsListView_K2Node_ComponentBoundEvent_4_OnListViewItemWidgetCreated__DelegateSignature) == 0x000008, "Wrong size on TabGameOptionsMain_C_BndEvt__OptionsListView_K2Node_ComponentBoundEvent_4_OnListViewItemWidgetCreated__DelegateSignature");
static_assert(offsetof(TabGameOptionsMain_C_BndEvt__OptionsListView_K2Node_ComponentBoundEvent_4_OnListViewItemWidgetCreated__DelegateSignature, Widget) == 0x000000, "Member 'TabGameOptionsMain_C_BndEvt__OptionsListView_K2Node_ComponentBoundEvent_4_OnListViewItemWidgetCreated__DelegateSignature::Widget' has a wrong offset!");

// Function TabGameOptionsMain.TabGameOptionsMain_C.Setting Value Changed
// 0x0004 (0x0004 - 0x0000)
struct TabGameOptionsMain_C_Setting_Value_Changed final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TabGameOptionsMain_C_Setting_Value_Changed) == 0x000004, "Wrong alignment on TabGameOptionsMain_C_Setting_Value_Changed");
static_assert(sizeof(TabGameOptionsMain_C_Setting_Value_Changed) == 0x000004, "Wrong size on TabGameOptionsMain_C_Setting_Value_Changed");
static_assert(offsetof(TabGameOptionsMain_C_Setting_Value_Changed, Value) == 0x000000, "Member 'TabGameOptionsMain_C_Setting_Value_Changed::Value' has a wrong offset!");

// Function TabGameOptionsMain.TabGameOptionsMain_C.ExecuteUbergraph_TabGameOptionsMain
// 0x00C0 (0x00C0 - 0x0000)
struct TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(float Value)>                  K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            K2Node_ComponentBoundEvent_Widget_1;               // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortOptionsMenuSetting*                K2Node_DynamicCast_AsFort_Options_Menu_Setting;    // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_4;        // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x002F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_5;        // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_6;        // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_7;        // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_4;                  // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_8;        // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_5;                  // 0x0037(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_9;        // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_6;                  // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_7;                  // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B[0x5];                                       // 0x003B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_ComponentBoundEvent_Item;                   // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            K2Node_ComponentBoundEvent_Widget;                 // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortOptionsMenuSetting*                K2Node_DynamicCast_AsFort_Options_Menu_Setting_1;  // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_Value;                          // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0068(0x0018)()
	bool                                          CallFunc_AreParentalControlsEnabled_ReturnValue;   // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  K2Node_DynamicCast_AsFort_Player_Controller;       // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCrucibleControls_ReturnValue;           // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x00A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A3[0x5];                                       // 0x00A3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonTextBlock*                       Temp_object_Variable;                              // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonTextBlock*                       K2Node_Select_Default;                             // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain) == 0x000008, "Wrong alignment on TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain");
static_assert(sizeof(TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain) == 0x0000C0, "Wrong size on TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain");
static_assert(offsetof(TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain, EntryPoint) == 0x000000, "Member 'TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain::EntryPoint' has a wrong offset!");
static_assert(offsetof(TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain, K2Node_ComponentBoundEvent_Widget_1) == 0x000018, "Member 'TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain::K2Node_ComponentBoundEvent_Widget_1' has a wrong offset!");
static_assert(offsetof(TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain, K2Node_DynamicCast_AsFort_Options_Menu_Setting) == 0x000020, "Member 'TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain::K2Node_DynamicCast_AsFort_Options_Menu_Setting' has a wrong offset!");
static_assert(offsetof(TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000029, "Member 'TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x00002A, "Member 'TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x00002B, "Member 'TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain, CallFunc_EqualEqual_ByteByte_ReturnValue_3) == 0x00002C, "Member 'TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain::CallFunc_EqualEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain, CallFunc_BooleanOR_ReturnValue) == 0x00002D, "Member 'TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain, CallFunc_EqualEqual_ByteByte_ReturnValue_4) == 0x00002E, "Member 'TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain::CallFunc_EqualEqual_ByteByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain, CallFunc_BooleanOR_ReturnValue_1) == 0x00002F, "Member 'TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain, CallFunc_EqualEqual_ByteByte_ReturnValue_5) == 0x000030, "Member 'TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain::CallFunc_EqualEqual_ByteByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain, CallFunc_BooleanOR_ReturnValue_2) == 0x000031, "Member 'TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain, CallFunc_EqualEqual_ByteByte_ReturnValue_6) == 0x000032, "Member 'TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain::CallFunc_EqualEqual_ByteByte_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain, CallFunc_BooleanOR_ReturnValue_3) == 0x000033, "Member 'TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain::CallFunc_BooleanOR_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain, CallFunc_EqualEqual_ByteByte_ReturnValue_7) == 0x000034, "Member 'TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain::CallFunc_EqualEqual_ByteByte_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain, CallFunc_BooleanOR_ReturnValue_4) == 0x000035, "Member 'TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain::CallFunc_BooleanOR_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain, CallFunc_EqualEqual_ByteByte_ReturnValue_8) == 0x000036, "Member 'TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain::CallFunc_EqualEqual_ByteByte_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain, CallFunc_BooleanOR_ReturnValue_5) == 0x000037, "Member 'TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain::CallFunc_BooleanOR_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain, CallFunc_EqualEqual_ByteByte_ReturnValue_9) == 0x000038, "Member 'TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain::CallFunc_EqualEqual_ByteByte_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain, CallFunc_BooleanOR_ReturnValue_6) == 0x000039, "Member 'TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain::CallFunc_BooleanOR_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain, CallFunc_BooleanOR_ReturnValue_7) == 0x00003A, "Member 'TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain::CallFunc_BooleanOR_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain, K2Node_ComponentBoundEvent_Item) == 0x000040, "Member 'TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain::K2Node_ComponentBoundEvent_Item' has a wrong offset!");
static_assert(offsetof(TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain, K2Node_ComponentBoundEvent_Widget) == 0x000048, "Member 'TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain::K2Node_ComponentBoundEvent_Widget' has a wrong offset!");
static_assert(offsetof(TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain, K2Node_DynamicCast_AsFort_Options_Menu_Setting_1) == 0x000050, "Member 'TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain::K2Node_DynamicCast_AsFort_Options_Menu_Setting_1' has a wrong offset!");
static_assert(offsetof(TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain, K2Node_DynamicCast_bSuccess_1) == 0x000058, "Member 'TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain, K2Node_CustomEvent_Value) == 0x00005C, "Member 'TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain::K2Node_CustomEvent_Value' has a wrong offset!");
static_assert(offsetof(TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain, CallFunc_IsMobileGame_ReturnValue) == 0x000060, "Member 'TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain, CallFunc_MakeLiteralText_ReturnValue) == 0x000068, "Member 'TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain, CallFunc_AreParentalControlsEnabled_ReturnValue) == 0x000080, "Member 'TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain::CallFunc_AreParentalControlsEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain, CallFunc_GetOwningPlayer_ReturnValue) == 0x000088, "Member 'TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain, CallFunc_Not_PreBool_ReturnValue) == 0x000090, "Member 'TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain, K2Node_DynamicCast_AsFort_Player_Controller) == 0x000098, "Member 'TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain::K2Node_DynamicCast_AsFort_Player_Controller' has a wrong offset!");
static_assert(offsetof(TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain, K2Node_DynamicCast_bSuccess_2) == 0x0000A0, "Member 'TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain, CallFunc_IsCrucibleControls_ReturnValue) == 0x0000A1, "Member 'TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain::CallFunc_IsCrucibleControls_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain, CallFunc_Not_PreBool_ReturnValue_1) == 0x0000A2, "Member 'TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain, Temp_object_Variable) == 0x0000A8, "Member 'TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain, Temp_bool_Variable) == 0x0000B0, "Member 'TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain, K2Node_Select_Default) == 0x0000B8, "Member 'TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain::K2Node_Select_Default' has a wrong offset!");

}

