#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TabNewControllerNewSettings

#include "Basic.hpp"


namespace SDK::Params
{

// Function TabNewControllerNewSettings.TabNewControllerNewSettings_C.SettingValueChanged
// 0x0004 (0x0004 - 0x0000)
struct TabNewControllerNewSettings_C_SettingValueChanged final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TabNewControllerNewSettings_C_SettingValueChanged) == 0x000004, "Wrong alignment on TabNewControllerNewSettings_C_SettingValueChanged");
static_assert(sizeof(TabNewControllerNewSettings_C_SettingValueChanged) == 0x000004, "Wrong size on TabNewControllerNewSettings_C_SettingValueChanged");
static_assert(offsetof(TabNewControllerNewSettings_C_SettingValueChanged, Value) == 0x000000, "Member 'TabNewControllerNewSettings_C_SettingValueChanged::Value' has a wrong offset!");

// Function TabNewControllerNewSettings.TabNewControllerNewSettings_C.ExecuteUbergraph_TabNewControllerNewSettings
// 0x0018 (0x0018 - 0x0000)
struct TabNewControllerNewSettings_C_ExecuteUbergraph_TabNewControllerNewSettings final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortUINavigationManager*               CallFunc_GetUINavigationManager_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Value;                          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TabNewControllerNewSettings_C_ExecuteUbergraph_TabNewControllerNewSettings) == 0x000008, "Wrong alignment on TabNewControllerNewSettings_C_ExecuteUbergraph_TabNewControllerNewSettings");
static_assert(sizeof(TabNewControllerNewSettings_C_ExecuteUbergraph_TabNewControllerNewSettings) == 0x000018, "Wrong size on TabNewControllerNewSettings_C_ExecuteUbergraph_TabNewControllerNewSettings");
static_assert(offsetof(TabNewControllerNewSettings_C_ExecuteUbergraph_TabNewControllerNewSettings, EntryPoint) == 0x000000, "Member 'TabNewControllerNewSettings_C_ExecuteUbergraph_TabNewControllerNewSettings::EntryPoint' has a wrong offset!");
static_assert(offsetof(TabNewControllerNewSettings_C_ExecuteUbergraph_TabNewControllerNewSettings, CallFunc_GetUINavigationManager_ReturnValue) == 0x000008, "Member 'TabNewControllerNewSettings_C_ExecuteUbergraph_TabNewControllerNewSettings::CallFunc_GetUINavigationManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabNewControllerNewSettings_C_ExecuteUbergraph_TabNewControllerNewSettings, K2Node_CustomEvent_Value) == 0x000010, "Member 'TabNewControllerNewSettings_C_ExecuteUbergraph_TabNewControllerNewSettings::K2Node_CustomEvent_Value' has a wrong offset!");

}

