#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TabVideoOptions

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass TabVideoOptions.TabVideoOptions_C
// 0x0088 (0x0308 - 0x0280)
class UTabVideoOptions_C final : public UFortVideoOptions
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonTextBlock*                       TooltipDisplay;                                    // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(bool Accept_Input)> Enable_Overlay;                                    // 0x0290(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              Disable_Overlay;                                   // 0x02A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UFortOptionsMenuSetting*                DisplayResolutionSetting;                          // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<ESettingType, class UFortOptionsMenuSetting*> ForceUpdateSettings;                               // 0x02B8(0x0050)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)

public:
	void Update_Qualities();
	void Construct();
	void UpdateOptionsTab();
	void CenterOnTab();
	void OnGameUserSettingsUINeedsUpdate();
	void Destruct();
	void BndEvt__OptionsListView_K2Node_ComponentBoundEvent_4_OnListViewItemWidgetCreated__DelegateSignature(class UUserWidget* Widget);
	void BndEvt__OptionsListView_K2Node_ComponentBoundEvent_5_OnListViewItemScrolledIntoView__DelegateSignature(class UObject* Item, class UUserWidget* Widget);
	void Window_Mode_Changed(bool IsWindowedFullscreen);
	void Quality_Changed(float Value);
	void Setting_Value_Changed(float Value);
	void ExecuteUbergraph_TabVideoOptions(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TabVideoOptions_C">();
	}
	static class UTabVideoOptions_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTabVideoOptions_C>();
	}
};
static_assert(alignof(UTabVideoOptions_C) == 0x000008, "Wrong alignment on UTabVideoOptions_C");
static_assert(sizeof(UTabVideoOptions_C) == 0x000308, "Wrong size on UTabVideoOptions_C");
static_assert(offsetof(UTabVideoOptions_C, UberGraphFrame) == 0x000280, "Member 'UTabVideoOptions_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTabVideoOptions_C, TooltipDisplay) == 0x000288, "Member 'UTabVideoOptions_C::TooltipDisplay' has a wrong offset!");
static_assert(offsetof(UTabVideoOptions_C, Enable_Overlay) == 0x000290, "Member 'UTabVideoOptions_C::Enable_Overlay' has a wrong offset!");
static_assert(offsetof(UTabVideoOptions_C, Disable_Overlay) == 0x0002A0, "Member 'UTabVideoOptions_C::Disable_Overlay' has a wrong offset!");
static_assert(offsetof(UTabVideoOptions_C, DisplayResolutionSetting) == 0x0002B0, "Member 'UTabVideoOptions_C::DisplayResolutionSetting' has a wrong offset!");
static_assert(offsetof(UTabVideoOptions_C, ForceUpdateSettings) == 0x0002B8, "Member 'UTabVideoOptions_C::ForceUpdateSettings' has a wrong offset!");

}

