#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TournamentModal

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass TournamentModal.TournamentModal_C
// 0x0018 (0x0378 - 0x0360)
class UTournamentModal_C final : public UFortTournamentModal
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Intro;                                             // 0x0368(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_BG;                                          // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void OnTournamentSet(const struct FLinearColor& LeftColor, const struct FLinearColor& RightColor);
	void OnActivated();
	void ExecuteUbergraph_TournamentModal(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TournamentModal_C">();
	}
	static class UTournamentModal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTournamentModal_C>();
	}
};
static_assert(alignof(UTournamentModal_C) == 0x000008, "Wrong alignment on UTournamentModal_C");
static_assert(sizeof(UTournamentModal_C) == 0x000378, "Wrong size on UTournamentModal_C");
static_assert(offsetof(UTournamentModal_C, UberGraphFrame) == 0x000360, "Member 'UTournamentModal_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTournamentModal_C, Intro) == 0x000368, "Member 'UTournamentModal_C::Intro' has a wrong offset!");
static_assert(offsetof(UTournamentModal_C, Image_BG) == 0x000370, "Member 'UTournamentModal_C::Image_BG' has a wrong offset!");

}

