#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ToyOptionsComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass ToyOptionsComponent.ToyOptionsComponent_C
// 0x00A8 (0x0290 - 0x01E8)
class UToyOptionsComponent_C final : public UFortActorOptionsComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x01E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TSoftClassPtr<class UClass>                   OptionsWidgetClass;                                // 0x01F0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   MyIslandTabList;                                   // 0x0218(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          IsMachine;                                         // 0x0240(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_241[0x7];                                      // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  InteractingPlayer;                                 // 0x0248(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortMatchmakingKnobsModal*             outModalWidget;                                    // 0x0250(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInteractSuccess;                                  // 0x0258(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_259[0x7];                                      // 0x0259(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 ClassToLoad;                                       // 0x0260(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   PropertyEditorWidgetClass;                         // 0x0268(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ToyOptionsComponent(int32 EntryPoint);
	void DisplayOptions(class APlayerController* InteractingPlayer_0, TSoftClassPtr<class UClass> WidgetClass);
	void OnLoaded_E8F4D2FB4AB5542DE83E50B51A402D27(class UClass* Loaded);
	bool BlueprintOnLocalInteract(class AFortPlayerPawn* InteractingPawn);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ToyOptionsComponent_C">();
	}
	static class UToyOptionsComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UToyOptionsComponent_C>();
	}
};
static_assert(alignof(UToyOptionsComponent_C) == 0x000008, "Wrong alignment on UToyOptionsComponent_C");
static_assert(sizeof(UToyOptionsComponent_C) == 0x000290, "Wrong size on UToyOptionsComponent_C");
static_assert(offsetof(UToyOptionsComponent_C, UberGraphFrame) == 0x0001E8, "Member 'UToyOptionsComponent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UToyOptionsComponent_C, OptionsWidgetClass) == 0x0001F0, "Member 'UToyOptionsComponent_C::OptionsWidgetClass' has a wrong offset!");
static_assert(offsetof(UToyOptionsComponent_C, MyIslandTabList) == 0x000218, "Member 'UToyOptionsComponent_C::MyIslandTabList' has a wrong offset!");
static_assert(offsetof(UToyOptionsComponent_C, IsMachine) == 0x000240, "Member 'UToyOptionsComponent_C::IsMachine' has a wrong offset!");
static_assert(offsetof(UToyOptionsComponent_C, InteractingPlayer) == 0x000248, "Member 'UToyOptionsComponent_C::InteractingPlayer' has a wrong offset!");
static_assert(offsetof(UToyOptionsComponent_C, outModalWidget) == 0x000250, "Member 'UToyOptionsComponent_C::outModalWidget' has a wrong offset!");
static_assert(offsetof(UToyOptionsComponent_C, bInteractSuccess) == 0x000258, "Member 'UToyOptionsComponent_C::bInteractSuccess' has a wrong offset!");
static_assert(offsetof(UToyOptionsComponent_C, ClassToLoad) == 0x000260, "Member 'UToyOptionsComponent_C::ClassToLoad' has a wrong offset!");
static_assert(offsetof(UToyOptionsComponent_C, PropertyEditorWidgetClass) == 0x000268, "Member 'UToyOptionsComponent_C::PropertyEditorWidgetClass' has a wrong offset!");

}

