#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Trap_Athena_Spikes

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Trap_Athena_Spikes.Trap_Athena_Spikes_C
// 0x00C0 (0x0D40 - 0x0C80)
class ATrap_Athena_Spikes_C : public ABuildingTrap
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0C80(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Spike_Mesh;                                        // 0x0C88(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Trigger;                                           // 0x0C90(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Root;                                              // 0x0C98(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         ResetSpikes_LERP_D054F7574E7A1041A552A5805E6C81D1; // 0x0CA0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ResetSpikes__Direction_D054F7574E7A1041A552A5805E6C81D1; // 0x0CA4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CA5[0x3];                                      // 0x0CA5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     ResetSpikes;                                       // 0x0CA8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Retract_LERP_714CAEE5449A32850D6231AEDA918B58;     // 0x0CB0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Retract__Direction_714CAEE5449A32850D6231AEDA918B58; // 0x0CB4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CB5[0x3];                                      // 0x0CB5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Retract;                                           // 0x0CB8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Fire_LERP_630B749B437E5CB83CB49287CC92E385;        // 0x0CC0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Fire__Direction_630B749B437E5CB83CB49287CC92E385;  // 0x0CC4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC5[0x3];                                      // 0x0CC5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Fire;                                              // 0x0CC8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              Place_Trap_Sound;                                  // 0x0CD0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              Trap_Active_Sound;                                 // 0x0CD8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              Reload_Sound;                                      // 0x0CE0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              Trap_Explode_Sound;                                // 0x0CE8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              Trap_Fire_Sound;                                   // 0x0CF0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SpikeRestingScale;                                 // 0x0CF8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SpikeActiveScale;                                  // 0x0CFC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SpikeHoldOnFireLength;                             // 0x0D00(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D04[0x4];                                      // 0x0D04(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               SpikesMID;                                         // 0x0D08(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SweepExponent;                                     // 0x0D10(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           SweepColor;                                        // 0x0D14(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SweepSpeed;                                        // 0x0D24(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     FriendlyTrapMaterial;                              // 0x0D28(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     NormalSpikeMaterial;                               // 0x0D30(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bPlayFewerSounds;                                  // 0x0D38(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_Trap_Athena_Spikes(int32 EntryPoint);
	void OnInitTeam();
	void OnWorldReady();
	void OnOutOfDurability();
	void GameplayCue_Abilities_Activation_Traps_ActivateTrap(EGameplayCueEvent EventType, const struct FGameplayCueParameters& Parameters);
	void OnFinishedBuilding();
	void OnPlaced();
	void OnReloadEnd();
	void ResetSpikes__UpdateFunc();
	void ResetSpikes__FinishedFunc();
	void Retract__Sounds__EventFunc();
	void Retract__UpdateFunc();
	void Retract__FinishedFunc();
	void Fire__UpdateFunc();
	void Fire__FinishedFunc();
	void UserConstructionScript();
	void SetSpikePosition(float NewSpikePosition);
	void MaterialSweepOnSpikes(float SweepSpeed_0, const struct FLinearColor& SweepColor_0, float SweepExponent_0);
	void _ChangeToFriendlyMaterial();
	void ChangeToNormalMaterial();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Trap_Athena_Spikes_C">();
	}
	static class ATrap_Athena_Spikes_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATrap_Athena_Spikes_C>();
	}
};
static_assert(alignof(ATrap_Athena_Spikes_C) == 0x000008, "Wrong alignment on ATrap_Athena_Spikes_C");
static_assert(sizeof(ATrap_Athena_Spikes_C) == 0x000D40, "Wrong size on ATrap_Athena_Spikes_C");
static_assert(offsetof(ATrap_Athena_Spikes_C, UberGraphFrame) == 0x000C80, "Member 'ATrap_Athena_Spikes_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ATrap_Athena_Spikes_C, Spike_Mesh) == 0x000C88, "Member 'ATrap_Athena_Spikes_C::Spike_Mesh' has a wrong offset!");
static_assert(offsetof(ATrap_Athena_Spikes_C, Trigger) == 0x000C90, "Member 'ATrap_Athena_Spikes_C::Trigger' has a wrong offset!");
static_assert(offsetof(ATrap_Athena_Spikes_C, Root) == 0x000C98, "Member 'ATrap_Athena_Spikes_C::Root' has a wrong offset!");
static_assert(offsetof(ATrap_Athena_Spikes_C, ResetSpikes_LERP_D054F7574E7A1041A552A5805E6C81D1) == 0x000CA0, "Member 'ATrap_Athena_Spikes_C::ResetSpikes_LERP_D054F7574E7A1041A552A5805E6C81D1' has a wrong offset!");
static_assert(offsetof(ATrap_Athena_Spikes_C, ResetSpikes__Direction_D054F7574E7A1041A552A5805E6C81D1) == 0x000CA4, "Member 'ATrap_Athena_Spikes_C::ResetSpikes__Direction_D054F7574E7A1041A552A5805E6C81D1' has a wrong offset!");
static_assert(offsetof(ATrap_Athena_Spikes_C, ResetSpikes) == 0x000CA8, "Member 'ATrap_Athena_Spikes_C::ResetSpikes' has a wrong offset!");
static_assert(offsetof(ATrap_Athena_Spikes_C, Retract_LERP_714CAEE5449A32850D6231AEDA918B58) == 0x000CB0, "Member 'ATrap_Athena_Spikes_C::Retract_LERP_714CAEE5449A32850D6231AEDA918B58' has a wrong offset!");
static_assert(offsetof(ATrap_Athena_Spikes_C, Retract__Direction_714CAEE5449A32850D6231AEDA918B58) == 0x000CB4, "Member 'ATrap_Athena_Spikes_C::Retract__Direction_714CAEE5449A32850D6231AEDA918B58' has a wrong offset!");
static_assert(offsetof(ATrap_Athena_Spikes_C, Retract) == 0x000CB8, "Member 'ATrap_Athena_Spikes_C::Retract' has a wrong offset!");
static_assert(offsetof(ATrap_Athena_Spikes_C, Fire_LERP_630B749B437E5CB83CB49287CC92E385) == 0x000CC0, "Member 'ATrap_Athena_Spikes_C::Fire_LERP_630B749B437E5CB83CB49287CC92E385' has a wrong offset!");
static_assert(offsetof(ATrap_Athena_Spikes_C, Fire__Direction_630B749B437E5CB83CB49287CC92E385) == 0x000CC4, "Member 'ATrap_Athena_Spikes_C::Fire__Direction_630B749B437E5CB83CB49287CC92E385' has a wrong offset!");
static_assert(offsetof(ATrap_Athena_Spikes_C, Fire) == 0x000CC8, "Member 'ATrap_Athena_Spikes_C::Fire' has a wrong offset!");
static_assert(offsetof(ATrap_Athena_Spikes_C, Place_Trap_Sound) == 0x000CD0, "Member 'ATrap_Athena_Spikes_C::Place_Trap_Sound' has a wrong offset!");
static_assert(offsetof(ATrap_Athena_Spikes_C, Trap_Active_Sound) == 0x000CD8, "Member 'ATrap_Athena_Spikes_C::Trap_Active_Sound' has a wrong offset!");
static_assert(offsetof(ATrap_Athena_Spikes_C, Reload_Sound) == 0x000CE0, "Member 'ATrap_Athena_Spikes_C::Reload_Sound' has a wrong offset!");
static_assert(offsetof(ATrap_Athena_Spikes_C, Trap_Explode_Sound) == 0x000CE8, "Member 'ATrap_Athena_Spikes_C::Trap_Explode_Sound' has a wrong offset!");
static_assert(offsetof(ATrap_Athena_Spikes_C, Trap_Fire_Sound) == 0x000CF0, "Member 'ATrap_Athena_Spikes_C::Trap_Fire_Sound' has a wrong offset!");
static_assert(offsetof(ATrap_Athena_Spikes_C, SpikeRestingScale) == 0x000CF8, "Member 'ATrap_Athena_Spikes_C::SpikeRestingScale' has a wrong offset!");
static_assert(offsetof(ATrap_Athena_Spikes_C, SpikeActiveScale) == 0x000CFC, "Member 'ATrap_Athena_Spikes_C::SpikeActiveScale' has a wrong offset!");
static_assert(offsetof(ATrap_Athena_Spikes_C, SpikeHoldOnFireLength) == 0x000D00, "Member 'ATrap_Athena_Spikes_C::SpikeHoldOnFireLength' has a wrong offset!");
static_assert(offsetof(ATrap_Athena_Spikes_C, SpikesMID) == 0x000D08, "Member 'ATrap_Athena_Spikes_C::SpikesMID' has a wrong offset!");
static_assert(offsetof(ATrap_Athena_Spikes_C, SweepExponent) == 0x000D10, "Member 'ATrap_Athena_Spikes_C::SweepExponent' has a wrong offset!");
static_assert(offsetof(ATrap_Athena_Spikes_C, SweepColor) == 0x000D14, "Member 'ATrap_Athena_Spikes_C::SweepColor' has a wrong offset!");
static_assert(offsetof(ATrap_Athena_Spikes_C, SweepSpeed) == 0x000D24, "Member 'ATrap_Athena_Spikes_C::SweepSpeed' has a wrong offset!");
static_assert(offsetof(ATrap_Athena_Spikes_C, FriendlyTrapMaterial) == 0x000D28, "Member 'ATrap_Athena_Spikes_C::FriendlyTrapMaterial' has a wrong offset!");
static_assert(offsetof(ATrap_Athena_Spikes_C, NormalSpikeMaterial) == 0x000D30, "Member 'ATrap_Athena_Spikes_C::NormalSpikeMaterial' has a wrong offset!");
static_assert(offsetof(ATrap_Athena_Spikes_C, bPlayFewerSounds) == 0x000D38, "Member 'ATrap_Athena_Spikes_C::bPlayFewerSounds' has a wrong offset!");

}

