#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Trap_Floor_Player_Campfire

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Trap_Floor_Player_Campfire.Trap_Floor_Player_Campfire_C.ExecuteUbergraph_Trap_Floor_Player_Campfire
// 0x0790 (0x0790 - 0x0000)
struct Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam;                // 0x0010(0x0080)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A8[0x8];                                       // 0x00A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam_1;              // 0x00B0(0x0080)(IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0138(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0144(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_2;      // 0x0150(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_3;      // 0x015C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_168[0x8];                                      // 0x0168(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam_2;              // 0x0170(0x0080)(IsPlainOldData, NoDestructor)
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam_3;              // 0x01F0(0x0080)(IsPlainOldData, NoDestructor)
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam_4;              // 0x0270(0x0080)(IsPlainOldData, NoDestructor)
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam_5;              // 0x02F0(0x0080)(IsPlainOldData, NoDestructor)
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam_6;              // 0x0370(0x0080)(IsPlainOldData, NoDestructor)
	TArray<struct FParticleSysParam>              K2Node_MakeArray_Array;                            // 0x03F0(0x0010)(ZeroConstructor, ReferenceParm)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0400(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x0404(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0410(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_411[0x3];                                      // 0x0411(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0414(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0420(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x042C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x0438(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x043C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x043D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_43E[0x2];                                      // 0x043E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x0440(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_4;        // 0x044C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0458(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0460(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_46C[0x4];                                      // 0x046C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0470(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0478(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0480(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_481[0x3];                                      // 0x0481(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetCameraLocation_ReturnValue;            // 0x0484(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameplayCueEvent                             K2Node_GameplayCueEvent_EventType_1;               // 0x0490(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_491[0x7];                                      // 0x0491(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 K2Node_GameplayCueEvent_Parameters_1;              // 0x0498(0x00B8)(ContainsInstancedReference)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0550(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EGameplayCueEvent                             K2Node_GameplayCueEvent_EventType;                 // 0x0551(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_552[0x6];                                      // 0x0552(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 K2Node_GameplayCueEvent_Parameters;                // 0x0558(0x00B8)(ContainsInstancedReference)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0610(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0611(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_612[0x2];                                      // 0x0612(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0614(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x0620(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_2;    // 0x0628(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0634(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0640(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_644[0x4];                                      // 0x0644(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawnAthena*                  K2Node_Event_Pawn;                                 // 0x0648(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0650(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_1;            // 0x0654(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0658(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x065C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_2;            // 0x0660(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_664[0x4];                                      // 0x0664(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0668(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0670(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_671[0x3];                                      // 0x0671(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueAtLevel_ReturnValue_3;            // 0x0674(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_4;            // 0x0678(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x067C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0680(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Damage;                               // 0x0684(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_Event_DamageTags;                           // 0x0688(0x0020)(ConstParm)
	struct FVector                                K2Node_Event_Momentum;                             // 0x06A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitInfo;                              // 0x06B4(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_73C[0x4];                                      // 0x073C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              K2Node_Event_InstigatedBy;                         // 0x0740(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser;                         // 0x0748(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext;                        // 0x0750(0x0018)()
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_5;        // 0x0768(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_774[0x4];                                      // 0x0774(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EFortTeamAffiliation>                  K2Node_MakeArray_Array_1;                          // 0x0778(0x0010)(ZeroConstructor, ReferenceParm)
	uint8                                         CallFunc_GetActorTeam_ReturnValue;                 // 0x0788(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire) == 0x000010, "Wrong alignment on Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire");
static_assert(sizeof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire) == 0x000790, "Wrong size on Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, EntryPoint) == 0x000000, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::EntryPoint' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000004, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, K2Node_MakeStruct_ParticleSysParam) == 0x000010, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::K2Node_MakeStruct_ParticleSysParam' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_Multiply_VectorVector_ReturnValue_1) == 0x000090, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_Multiply_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_BreakVector_X) == 0x00009C, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_BreakVector_Y) == 0x0000A0, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_BreakVector_Z) == 0x0000A4, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, K2Node_MakeStruct_ParticleSysParam_1) == 0x0000B0, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::K2Node_MakeStruct_ParticleSysParam_1' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000130, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000134, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_MakeVector_ReturnValue) == 0x000138, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_MakeVector_ReturnValue_1) == 0x000144, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_Multiply_VectorVector_ReturnValue_2) == 0x000150, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_Multiply_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_Multiply_VectorVector_ReturnValue_3) == 0x00015C, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_Multiply_VectorVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, K2Node_MakeStruct_ParticleSysParam_2) == 0x000170, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::K2Node_MakeStruct_ParticleSysParam_2' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, K2Node_MakeStruct_ParticleSysParam_3) == 0x0001F0, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::K2Node_MakeStruct_ParticleSysParam_3' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, K2Node_MakeStruct_ParticleSysParam_4) == 0x000270, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::K2Node_MakeStruct_ParticleSysParam_4' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, K2Node_MakeStruct_ParticleSysParam_5) == 0x0002F0, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::K2Node_MakeStruct_ParticleSysParam_5' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, K2Node_MakeStruct_ParticleSysParam_6) == 0x000370, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::K2Node_MakeStruct_ParticleSysParam_6' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, K2Node_MakeArray_Array) == 0x0003F0, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_Lerp_ReturnValue) == 0x000400, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_VLerp_ReturnValue) == 0x000404, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_HasAuthority_ReturnValue) == 0x000410, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000414, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000420, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x00042C, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, Temp_float_Variable) == 0x000438, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_IsDedicatedServer_ReturnValue) == 0x00043C, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x00043D, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_K2_GetActorLocation_ReturnValue_3) == 0x000440, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_K2_GetActorLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_K2_GetActorLocation_ReturnValue_4) == 0x00044C, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_K2_GetActorLocation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000458, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000460, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000470, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000478, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_IsValid_ReturnValue) == 0x000480, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_GetCameraLocation_ReturnValue) == 0x000484, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_GetCameraLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, K2Node_GameplayCueEvent_EventType_1) == 0x000490, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::K2Node_GameplayCueEvent_EventType_1' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, K2Node_GameplayCueEvent_Parameters_1) == 0x000498, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::K2Node_GameplayCueEvent_Parameters_1' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, K2Node_SwitchEnum_CmpSuccess) == 0x000550, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, K2Node_GameplayCueEvent_EventType) == 0x000551, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::K2Node_GameplayCueEvent_EventType' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, K2Node_GameplayCueEvent_Parameters) == 0x000558, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::K2Node_GameplayCueEvent_Parameters' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, K2Node_SwitchEnum_CmpSuccess_1) == 0x000610, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_IsValid_ReturnValue_1) == 0x000611, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x000614, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x000620, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_K2_GetComponentLocation_ReturnValue_2) == 0x000628, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_K2_GetComponentLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000634, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_VSize_ReturnValue) == 0x000640, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, K2Node_Event_Pawn) == 0x000648, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::K2Node_Event_Pawn' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_GetValueAtLevel_ReturnValue) == 0x000650, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_GetValueAtLevel_ReturnValue_1) == 0x000654, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_GetValueAtLevel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_FTrunc_ReturnValue) == 0x000658, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00065C, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_GetValueAtLevel_ReturnValue_2) == 0x000660, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_GetValueAtLevel_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_K2_SetTimer_ReturnValue) == 0x000668, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_IsValid_ReturnValue_2) == 0x000670, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_GetValueAtLevel_ReturnValue_3) == 0x000674, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_GetValueAtLevel_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_GetValueAtLevel_ReturnValue_4) == 0x000678, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_GetValueAtLevel_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x00067C, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000680, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, K2Node_Event_Damage) == 0x000684, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::K2Node_Event_Damage' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, K2Node_Event_DamageTags) == 0x000688, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::K2Node_Event_DamageTags' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, K2Node_Event_Momentum) == 0x0006A8, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::K2Node_Event_Momentum' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, K2Node_Event_HitInfo) == 0x0006B4, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::K2Node_Event_HitInfo' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, K2Node_Event_InstigatedBy) == 0x000740, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::K2Node_Event_InstigatedBy' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, K2Node_Event_DamageCauser) == 0x000748, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::K2Node_Event_DamageCauser' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, K2Node_Event_EffectContext) == 0x000750, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::K2Node_Event_EffectContext' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_K2_GetActorLocation_ReturnValue_5) == 0x000768, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_K2_GetActorLocation_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, K2Node_MakeArray_Array_1) == 0x000778, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire, CallFunc_GetActorTeam_ReturnValue) == 0x000788, "Member 'Trap_Floor_Player_Campfire_C_ExecuteUbergraph_Trap_Floor_Player_Campfire::CallFunc_GetActorTeam_ReturnValue' has a wrong offset!");

// Function Trap_Floor_Player_Campfire.Trap_Floor_Player_Campfire_C.OnDeathPlayEffects
// 0x00E8 (0x00E8 - 0x0000)
struct Trap_Floor_Player_Campfire_C_OnDeathPlayEffects final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  DamageTags;                                        // 0x0008(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FVector                                Momentum;                                          // 0x0028(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             HitInfo;                                           // 0x0034(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              InstigatedBy;                                      // 0x00C0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x00C8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           EffectContext;                                     // 0x00D0(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(Trap_Floor_Player_Campfire_C_OnDeathPlayEffects) == 0x000008, "Wrong alignment on Trap_Floor_Player_Campfire_C_OnDeathPlayEffects");
static_assert(sizeof(Trap_Floor_Player_Campfire_C_OnDeathPlayEffects) == 0x0000E8, "Wrong size on Trap_Floor_Player_Campfire_C_OnDeathPlayEffects");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_OnDeathPlayEffects, Damage) == 0x000000, "Member 'Trap_Floor_Player_Campfire_C_OnDeathPlayEffects::Damage' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_OnDeathPlayEffects, DamageTags) == 0x000008, "Member 'Trap_Floor_Player_Campfire_C_OnDeathPlayEffects::DamageTags' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_OnDeathPlayEffects, Momentum) == 0x000028, "Member 'Trap_Floor_Player_Campfire_C_OnDeathPlayEffects::Momentum' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_OnDeathPlayEffects, HitInfo) == 0x000034, "Member 'Trap_Floor_Player_Campfire_C_OnDeathPlayEffects::HitInfo' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_OnDeathPlayEffects, InstigatedBy) == 0x0000C0, "Member 'Trap_Floor_Player_Campfire_C_OnDeathPlayEffects::InstigatedBy' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_OnDeathPlayEffects, DamageCauser) == 0x0000C8, "Member 'Trap_Floor_Player_Campfire_C_OnDeathPlayEffects::DamageCauser' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_OnDeathPlayEffects, EffectContext) == 0x0000D0, "Member 'Trap_Floor_Player_Campfire_C_OnDeathPlayEffects::EffectContext' has a wrong offset!");

// Function Trap_Floor_Player_Campfire.Trap_Floor_Player_Campfire_C.TriggerLaunchEffects
// 0x0008 (0x0008 - 0x0000)
struct Trap_Floor_Player_Campfire_C_TriggerLaunchEffects final
{
public:
	class AFortPlayerPawnAthena*                  Pawn;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Trap_Floor_Player_Campfire_C_TriggerLaunchEffects) == 0x000008, "Wrong alignment on Trap_Floor_Player_Campfire_C_TriggerLaunchEffects");
static_assert(sizeof(Trap_Floor_Player_Campfire_C_TriggerLaunchEffects) == 0x000008, "Wrong size on Trap_Floor_Player_Campfire_C_TriggerLaunchEffects");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_TriggerLaunchEffects, Pawn) == 0x000000, "Member 'Trap_Floor_Player_Campfire_C_TriggerLaunchEffects::Pawn' has a wrong offset!");

// Function Trap_Floor_Player_Campfire.Trap_Floor_Player_Campfire_C.GameplayCue.Abilities.Activation.Traps.ActivateTrap
// 0x00C0 (0x00C0 - 0x0000)
struct Trap_Floor_Player_Campfire_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap final
{
public:
	EGameplayCueEvent                             EventType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
};
static_assert(alignof(Trap_Floor_Player_Campfire_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap) == 0x000008, "Wrong alignment on Trap_Floor_Player_Campfire_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap");
static_assert(sizeof(Trap_Floor_Player_Campfire_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap) == 0x0000C0, "Wrong size on Trap_Floor_Player_Campfire_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap, EventType) == 0x000000, "Member 'Trap_Floor_Player_Campfire_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap::EventType' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap, Parameters) == 0x000008, "Member 'Trap_Floor_Player_Campfire_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap::Parameters' has a wrong offset!");

// Function Trap_Floor_Player_Campfire.Trap_Floor_Player_Campfire_C.GameplayCue.Abilities.Activation.Traps.ReloadBegin
// 0x00C0 (0x00C0 - 0x0000)
struct Trap_Floor_Player_Campfire_C_GameplayCue_Abilities_Activation_Traps_ReloadBegin final
{
public:
	EGameplayCueEvent                             EventType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
};
static_assert(alignof(Trap_Floor_Player_Campfire_C_GameplayCue_Abilities_Activation_Traps_ReloadBegin) == 0x000008, "Wrong alignment on Trap_Floor_Player_Campfire_C_GameplayCue_Abilities_Activation_Traps_ReloadBegin");
static_assert(sizeof(Trap_Floor_Player_Campfire_C_GameplayCue_Abilities_Activation_Traps_ReloadBegin) == 0x0000C0, "Wrong size on Trap_Floor_Player_Campfire_C_GameplayCue_Abilities_Activation_Traps_ReloadBegin");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_GameplayCue_Abilities_Activation_Traps_ReloadBegin, EventType) == 0x000000, "Member 'Trap_Floor_Player_Campfire_C_GameplayCue_Abilities_Activation_Traps_ReloadBegin::EventType' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_GameplayCue_Abilities_Activation_Traps_ReloadBegin, Parameters) == 0x000008, "Member 'Trap_Floor_Player_Campfire_C_GameplayCue_Abilities_Activation_Traps_ReloadBegin::Parameters' has a wrong offset!");

// Function Trap_Floor_Player_Campfire.Trap_Floor_Player_Campfire_C.HealTicks
// 0x0140 (0x0140 - 0x0000)
struct Trap_Floor_Player_Campfire_C_HealTicks final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue;               // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0010(0x0030)(IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_1;            // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue_1;             // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0058(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	uint8                                         Pad_68[0x8];                                       // 0x0068(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue_1;     // 0x0070(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x00A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_BoxOverlapActors_OutActors;               // 0x00B0(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_BoxOverlapActors_ReturnValue;             // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_ApplyGlobalEnvironmentGameplayEffectToActor_ReturnValue; // 0x00D8(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x00E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IFortVehicleInterface> K2Node_DynamicCast_AsFort_Vehicle_Interface;       // 0x00F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPointInBoxWithTransform_ReturnValue;    // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_102[0x6];                                      // 0x0102(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawnAthena*                  K2Node_DynamicCast_AsFort_Player_Pawn_Athena;      // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x3];                                      // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_ApplyGlobalEnvironmentGameplayEffectToActor_ReturnValue_1; // 0x0114(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDead_ReturnValue;                       // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11D[0x3];                                      // 0x011D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_2;    // 0x0120(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPointInBoxWithTransform_ReturnValue_1;  // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12D[0x3];                                      // 0x012D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0135(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Trap_Floor_Player_Campfire_C_HealTicks) == 0x000010, "Wrong alignment on Trap_Floor_Player_Campfire_C_HealTicks");
static_assert(sizeof(Trap_Floor_Player_Campfire_C_HealTicks) == 0x000140, "Wrong size on Trap_Floor_Player_Campfire_C_HealTicks");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_HealTicks, Temp_int_Array_Index_Variable) == 0x000000, "Member 'Trap_Floor_Player_Campfire_C_HealTicks::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_HealTicks, CallFunc_GetValueAtLevel_ReturnValue) == 0x000004, "Member 'Trap_Floor_Player_Campfire_C_HealTicks::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_HealTicks, CallFunc_FTrunc_ReturnValue) == 0x000008, "Member 'Trap_Floor_Player_Campfire_C_HealTicks::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_HealTicks, CallFunc_Conv_IntToBool_ReturnValue) == 0x00000C, "Member 'Trap_Floor_Player_Campfire_C_HealTicks::CallFunc_Conv_IntToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_HealTicks, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000010, "Member 'Trap_Floor_Player_Campfire_C_HealTicks::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_HealTicks, Temp_int_Loop_Counter_Variable) == 0x000040, "Member 'Trap_Floor_Player_Campfire_C_HealTicks::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_HealTicks, CallFunc_GetValueAtLevel_ReturnValue_1) == 0x000044, "Member 'Trap_Floor_Player_Campfire_C_HealTicks::CallFunc_GetValueAtLevel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_HealTicks, CallFunc_FTrunc_ReturnValue_1) == 0x000048, "Member 'Trap_Floor_Player_Campfire_C_HealTicks::CallFunc_FTrunc_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_HealTicks, CallFunc_Add_IntInt_ReturnValue) == 0x00004C, "Member 'Trap_Floor_Player_Campfire_C_HealTicks::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_HealTicks, CallFunc_Conv_IntToBool_ReturnValue_1) == 0x000050, "Member 'Trap_Floor_Player_Campfire_C_HealTicks::CallFunc_Conv_IntToBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_HealTicks, CallFunc_HasAuthority_ReturnValue) == 0x000051, "Member 'Trap_Floor_Player_Campfire_C_HealTicks::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_HealTicks, Temp_object_Variable) == 0x000058, "Member 'Trap_Floor_Player_Campfire_C_HealTicks::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_HealTicks, CallFunc_K2_GetComponentToWorld_ReturnValue_1) == 0x000070, "Member 'Trap_Floor_Player_Campfire_C_HealTicks::CallFunc_K2_GetComponentToWorld_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_HealTicks, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0000A0, "Member 'Trap_Floor_Player_Campfire_C_HealTicks::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_HealTicks, CallFunc_BoxOverlapActors_OutActors) == 0x0000B0, "Member 'Trap_Floor_Player_Campfire_C_HealTicks::CallFunc_BoxOverlapActors_OutActors' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_HealTicks, CallFunc_BoxOverlapActors_ReturnValue) == 0x0000C0, "Member 'Trap_Floor_Player_Campfire_C_HealTicks::CallFunc_BoxOverlapActors_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_HealTicks, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000C4, "Member 'Trap_Floor_Player_Campfire_C_HealTicks::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_HealTicks, CallFunc_Array_Get_Item) == 0x0000C8, "Member 'Trap_Floor_Player_Campfire_C_HealTicks::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_HealTicks, CallFunc_K2_GetRootComponent_ReturnValue) == 0x0000D0, "Member 'Trap_Floor_Player_Campfire_C_HealTicks::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_HealTicks, CallFunc_ApplyGlobalEnvironmentGameplayEffectToActor_ReturnValue) == 0x0000D8, "Member 'Trap_Floor_Player_Campfire_C_HealTicks::CallFunc_ApplyGlobalEnvironmentGameplayEffectToActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_HealTicks, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x0000E0, "Member 'Trap_Floor_Player_Campfire_C_HealTicks::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_HealTicks, K2Node_DynamicCast_AsFort_Vehicle_Interface) == 0x0000F0, "Member 'Trap_Floor_Player_Campfire_C_HealTicks::K2Node_DynamicCast_AsFort_Vehicle_Interface' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_HealTicks, K2Node_DynamicCast_bSuccess) == 0x000100, "Member 'Trap_Floor_Player_Campfire_C_HealTicks::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_HealTicks, CallFunc_IsPointInBoxWithTransform_ReturnValue) == 0x000101, "Member 'Trap_Floor_Player_Campfire_C_HealTicks::CallFunc_IsPointInBoxWithTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_HealTicks, K2Node_DynamicCast_AsFort_Player_Pawn_Athena) == 0x000108, "Member 'Trap_Floor_Player_Campfire_C_HealTicks::K2Node_DynamicCast_AsFort_Player_Pawn_Athena' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_HealTicks, K2Node_DynamicCast_bSuccess_1) == 0x000110, "Member 'Trap_Floor_Player_Campfire_C_HealTicks::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_HealTicks, CallFunc_ApplyGlobalEnvironmentGameplayEffectToActor_ReturnValue_1) == 0x000114, "Member 'Trap_Floor_Player_Campfire_C_HealTicks::CallFunc_ApplyGlobalEnvironmentGameplayEffectToActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_HealTicks, CallFunc_IsDead_ReturnValue) == 0x00011C, "Member 'Trap_Floor_Player_Campfire_C_HealTicks::CallFunc_IsDead_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_HealTicks, CallFunc_K2_GetComponentLocation_ReturnValue_2) == 0x000120, "Member 'Trap_Floor_Player_Campfire_C_HealTicks::CallFunc_K2_GetComponentLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_HealTicks, CallFunc_IsPointInBoxWithTransform_ReturnValue_1) == 0x00012C, "Member 'Trap_Floor_Player_Campfire_C_HealTicks::CallFunc_IsPointInBoxWithTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_HealTicks, CallFunc_Array_Length_ReturnValue) == 0x000130, "Member 'Trap_Floor_Player_Campfire_C_HealTicks::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_HealTicks, CallFunc_Less_IntInt_ReturnValue) == 0x000134, "Member 'Trap_Floor_Player_Campfire_C_HealTicks::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Floor_Player_Campfire_C_HealTicks, CallFunc_Less_IntInt_ReturnValue_1) == 0x000135, "Member 'Trap_Floor_Player_Campfire_C_HealTicks::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

// Function Trap_Floor_Player_Campfire.Trap_Floor_Player_Campfire_C.InitCampfireEffects
// 0x0030 (0x0030 - 0x0000)
struct Trap_Floor_Player_Campfire_C_InitCampfireEffects final
{
public:
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
