#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Trap_Wall_BouncePad

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Trap_Wall_BouncePad.Trap_Wall_BouncePad_C.ExecuteUbergraph_Trap_Wall_BouncePad
// 0x05A0 (0x05A0 - 0x0000)
struct Trap_Wall_BouncePad_C_ExecuteUbergraph_Trap_Wall_BouncePad final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam;                // 0x0050(0x0080)(IsPlainOldData, NoDestructor)
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam_1;              // 0x00D0(0x0080)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_2;      // 0x0150(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_3;      // 0x015C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_168[0x8];                                      // 0x0168(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam_2;              // 0x0170(0x0080)(IsPlainOldData, NoDestructor)
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam_3;              // 0x01F0(0x0080)(IsPlainOldData, NoDestructor)
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam_4;              // 0x0270(0x0080)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F1[0xF];                                      // 0x02F1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam_5;              // 0x0300(0x0080)(IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0380(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0381(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_382[0xE];                                      // 0x0382(0x000E)(Fixing Size After Last Property [ Dumper-7 ])
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam_6;              // 0x0390(0x0080)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x0410(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_411[0x7];                                      // 0x0411(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FParticleSysParam>              K2Node_MakeArray_Array;                            // 0x0418(0x0010)(ZeroConstructor, ReferenceParm)
	float                                         Temp_float_Variable;                               // 0x0428(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x042C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x042D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42E[0x2];                                      // 0x042E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0430(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x043C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0448(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_449[0x7];                                      // 0x0449(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x0450(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0458(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameplayCueEvent                             K2Node_GameplayCueEvent_EventType;                 // 0x0464(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_465[0x3];                                      // 0x0465(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 K2Node_GameplayCueEvent_Parameters;                // 0x0468(0x00B8)(ContainsInstancedReference)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0520(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x052C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52D[0x3];                                      // 0x052D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x0530(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53C[0x4];                                      // 0x053C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0540(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0548(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_549[0x3];                                      // 0x0549(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetCameraLocation_ReturnValue;            // 0x054C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0558(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_564[0x4];                                      // 0x0564(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortAthenaSKVehicle*                   K2Node_DynamicCast_AsFort_Athena_SKVehicle;        // 0x0568(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0570(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_571[0x3];                                      // 0x0571(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0574(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue_1;       // 0x0578(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawnAthena*                  K2Node_DynamicCast_AsFort_Player_Pawn_Athena;      // 0x0580(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0588(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_589[0x3];                                      // 0x0589(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x058C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0590(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Trap_Wall_BouncePad_C_ExecuteUbergraph_Trap_Wall_BouncePad) == 0x000010, "Wrong alignment on Trap_Wall_BouncePad_C_ExecuteUbergraph_Trap_Wall_BouncePad");
static_assert(sizeof(Trap_Wall_BouncePad_C_ExecuteUbergraph_Trap_Wall_BouncePad) == 0x0005A0, "Wrong size on Trap_Wall_BouncePad_C_ExecuteUbergraph_Trap_Wall_BouncePad");
static_assert(offsetof(Trap_Wall_BouncePad_C_ExecuteUbergraph_Trap_Wall_BouncePad, EntryPoint) == 0x000000, "Member 'Trap_Wall_BouncePad_C_ExecuteUbergraph_Trap_Wall_BouncePad::EntryPoint' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_ExecuteUbergraph_Trap_Wall_BouncePad, CallFunc_BreakVector_X) == 0x000004, "Member 'Trap_Wall_BouncePad_C_ExecuteUbergraph_Trap_Wall_BouncePad::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_ExecuteUbergraph_Trap_Wall_BouncePad, CallFunc_BreakVector_Y) == 0x000008, "Member 'Trap_Wall_BouncePad_C_ExecuteUbergraph_Trap_Wall_BouncePad::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_ExecuteUbergraph_Trap_Wall_BouncePad, CallFunc_BreakVector_Z) == 0x00000C, "Member 'Trap_Wall_BouncePad_C_ExecuteUbergraph_Trap_Wall_BouncePad::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_ExecuteUbergraph_Trap_Wall_BouncePad, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000010, "Member 'Trap_Wall_BouncePad_C_ExecuteUbergraph_Trap_Wall_BouncePad::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_ExecuteUbergraph_Trap_Wall_BouncePad, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000014, "Member 'Trap_Wall_BouncePad_C_ExecuteUbergraph_Trap_Wall_BouncePad::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_ExecuteUbergraph_Trap_Wall_BouncePad, CallFunc_MakeVector_ReturnValue) == 0x000018, "Member 'Trap_Wall_BouncePad_C_ExecuteUbergraph_Trap_Wall_BouncePad::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_ExecuteUbergraph_Trap_Wall_BouncePad, CallFunc_MakeVector_ReturnValue_1) == 0x000024, "Member 'Trap_Wall_BouncePad_C_ExecuteUbergraph_Trap_Wall_BouncePad::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_ExecuteUbergraph_Trap_Wall_BouncePad, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000030, "Member 'Trap_Wall_BouncePad_C_ExecuteUbergraph_Trap_Wall_BouncePad::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_ExecuteUbergraph_Trap_Wall_BouncePad, CallFunc_Multiply_VectorVector_ReturnValue_1) == 0x00003C, "Member 'Trap_Wall_BouncePad_C_ExecuteUbergraph_Trap_Wall_BouncePad::CallFunc_Multiply_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_ExecuteUbergraph_Trap_Wall_BouncePad, K2Node_MakeStruct_ParticleSysParam) == 0x000050, "Member 'Trap_Wall_BouncePad_C_ExecuteUbergraph_Trap_Wall_BouncePad::K2Node_MakeStruct_ParticleSysParam' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_ExecuteUbergraph_Trap_Wall_BouncePad, K2Node_MakeStruct_ParticleSysParam_1) == 0x0000D0, "Member 'Trap_Wall_BouncePad_C_ExecuteUbergraph_Trap_Wall_BouncePad::K2Node_MakeStruct_ParticleSysParam_1' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_ExecuteUbergraph_Trap_Wall_BouncePad, CallFunc_Multiply_VectorVector_ReturnValue_2) == 0x000150, "Member 'Trap_Wall_BouncePad_C_ExecuteUbergraph_Trap_Wall_BouncePad::CallFunc_Multiply_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_ExecuteUbergraph_Trap_Wall_BouncePad, CallFunc_Multiply_VectorVector_ReturnValue_3) == 0x00015C, "Member 'Trap_Wall_BouncePad_C_ExecuteUbergraph_Trap_Wall_BouncePad::CallFunc_Multiply_VectorVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_ExecuteUbergraph_Trap_Wall_BouncePad, K2Node_MakeStruct_ParticleSysParam_2) == 0x000170, "Member 'Trap_Wall_BouncePad_C_ExecuteUbergraph_Trap_Wall_BouncePad::K2Node_MakeStruct_ParticleSysParam_2' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_ExecuteUbergraph_Trap_Wall_BouncePad, K2Node_MakeStruct_ParticleSysParam_3) == 0x0001F0, "Member 'Trap_Wall_BouncePad_C_ExecuteUbergraph_Trap_Wall_BouncePad::K2Node_MakeStruct_ParticleSysParam_3' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_ExecuteUbergraph_Trap_Wall_BouncePad, K2Node_MakeStruct_ParticleSysParam_4) == 0x000270, "Member 'Trap_Wall_BouncePad_C_ExecuteUbergraph_Trap_Wall_BouncePad::K2Node_MakeStruct_ParticleSysParam_4' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_ExecuteUbergraph_Trap_Wall_BouncePad, CallFunc_IsValid_ReturnValue) == 0x0002F0, "Member 'Trap_Wall_BouncePad_C_ExecuteUbergraph_Trap_Wall_BouncePad::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_ExecuteUbergraph_Trap_Wall_BouncePad, K2Node_MakeStruct_ParticleSysParam_5) == 0x000300, "Member 'Trap_Wall_BouncePad_C_ExecuteUbergraph_Trap_Wall_BouncePad::K2Node_MakeStruct_ParticleSysParam_5' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_ExecuteUbergraph_Trap_Wall_BouncePad, Temp_bool_IsClosed_Variable) == 0x000380, "Member 'Trap_Wall_BouncePad_C_ExecuteUbergraph_Trap_Wall_BouncePad::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_ExecuteUbergraph_Trap_Wall_BouncePad, CallFunc_IsDedicatedServer_ReturnValue) == 0x000381, "Member 'Trap_Wall_BouncePad_C_ExecuteUbergraph_Trap_Wall_BouncePad::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_ExecuteUbergraph_Trap_Wall_BouncePad, K2Node_MakeStruct_ParticleSysParam_6) == 0x000390, "Member 'Trap_Wall_BouncePad_C_ExecuteUbergraph_Trap_Wall_BouncePad::K2Node_MakeStruct_ParticleSysParam_6' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_ExecuteUbergraph_Trap_Wall_BouncePad, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x000410, "Member 'Trap_Wall_BouncePad_C_ExecuteUbergraph_Trap_Wall_BouncePad::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_ExecuteUbergraph_Trap_Wall_BouncePad, K2Node_MakeArray_Array) == 0x000418, "Member 'Trap_Wall_BouncePad_C_ExecuteUbergraph_Trap_Wall_BouncePad::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_ExecuteUbergraph_Trap_Wall_BouncePad, Temp_float_Variable) == 0x000428, "Member 'Trap_Wall_BouncePad_C_ExecuteUbergraph_Trap_Wall_BouncePad::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_ExecuteUbergraph_Trap_Wall_BouncePad, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x00042C, "Member 'Trap_Wall_BouncePad_C_ExecuteUbergraph_Trap_Wall_BouncePad::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_ExecuteUbergraph_Trap_Wall_BouncePad, Temp_bool_Has_Been_Initd_Variable) == 0x00042D, "Member 'Trap_Wall_BouncePad_C_ExecuteUbergraph_Trap_Wall_BouncePad::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_ExecuteUbergraph_Trap_Wall_BouncePad, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000430, "Member 'Trap_Wall_BouncePad_C_ExecuteUbergraph_Trap_Wall_BouncePad::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_ExecuteUbergraph_Trap_Wall_BouncePad, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x00043C, "Member 'Trap_Wall_BouncePad_C_ExecuteUbergraph_Trap_Wall_BouncePad::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_ExecuteUbergraph_Trap_Wall_BouncePad, CallFunc_IsValid_ReturnValue_1) == 0x000448, "Member 'Trap_Wall_BouncePad_C_ExecuteUbergraph_Trap_Wall_BouncePad::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_ExecuteUbergraph_Trap_Wall_BouncePad, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x000450, "Member 'Trap_Wall_BouncePad_C_ExecuteUbergraph_Trap_Wall_BouncePad::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_ExecuteUbergraph_Trap_Wall_BouncePad, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000458, "Member 'Trap_Wall_BouncePad_C_ExecuteUbergraph_Trap_Wall_BouncePad::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_ExecuteUbergraph_Trap_Wall_BouncePad, K2Node_GameplayCueEvent_EventType) == 0x000464, "Member 'Trap_Wall_BouncePad_C_ExecuteUbergraph_Trap_Wall_BouncePad::K2Node_GameplayCueEvent_EventType' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_ExecuteUbergraph_Trap_Wall_BouncePad, K2Node_GameplayCueEvent_Parameters) == 0x000468, "Member 'Trap_Wall_BouncePad_C_ExecuteUbergraph_Trap_Wall_BouncePad::K2Node_GameplayCueEvent_Parameters' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_ExecuteUbergraph_Trap_Wall_BouncePad, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x000520, "Member 'Trap_Wall_BouncePad_C_ExecuteUbergraph_Trap_Wall_BouncePad::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_ExecuteUbergraph_Trap_Wall_BouncePad, K2Node_SwitchEnum_CmpSuccess) == 0x00052C, "Member 'Trap_Wall_BouncePad_C_ExecuteUbergraph_Trap_Wall_BouncePad::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_ExecuteUbergraph_Trap_Wall_BouncePad, CallFunc_K2_GetActorLocation_ReturnValue_3) == 0x000530, "Member 'Trap_Wall_BouncePad_C_ExecuteUbergraph_Trap_Wall_BouncePad::CallFunc_K2_GetActorLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_ExecuteUbergraph_Trap_Wall_BouncePad, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000540, "Member 'Trap_Wall_BouncePad_C_ExecuteUbergraph_Trap_Wall_BouncePad::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_ExecuteUbergraph_Trap_Wall_BouncePad, CallFunc_IsValid_ReturnValue_2) == 0x000548, "Member 'Trap_Wall_BouncePad_C_ExecuteUbergraph_Trap_Wall_BouncePad::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_ExecuteUbergraph_Trap_Wall_BouncePad, CallFunc_GetCameraLocation_ReturnValue) == 0x00054C, "Member 'Trap_Wall_BouncePad_C_ExecuteUbergraph_Trap_Wall_BouncePad::CallFunc_GetCameraLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_ExecuteUbergraph_Trap_Wall_BouncePad, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000558, "Member 'Trap_Wall_BouncePad_C_ExecuteUbergraph_Trap_Wall_BouncePad::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_ExecuteUbergraph_Trap_Wall_BouncePad, K2Node_DynamicCast_AsFort_Athena_SKVehicle) == 0x000568, "Member 'Trap_Wall_BouncePad_C_ExecuteUbergraph_Trap_Wall_BouncePad::K2Node_DynamicCast_AsFort_Athena_SKVehicle' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_ExecuteUbergraph_Trap_Wall_BouncePad, K2Node_DynamicCast_bSuccess) == 0x000570, "Member 'Trap_Wall_BouncePad_C_ExecuteUbergraph_Trap_Wall_BouncePad::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_ExecuteUbergraph_Trap_Wall_BouncePad, CallFunc_VSize_ReturnValue) == 0x000574, "Member 'Trap_Wall_BouncePad_C_ExecuteUbergraph_Trap_Wall_BouncePad::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_ExecuteUbergraph_Trap_Wall_BouncePad, CallFunc_SpawnEmitterAttached_ReturnValue_1) == 0x000578, "Member 'Trap_Wall_BouncePad_C_ExecuteUbergraph_Trap_Wall_BouncePad::CallFunc_SpawnEmitterAttached_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_ExecuteUbergraph_Trap_Wall_BouncePad, K2Node_DynamicCast_AsFort_Player_Pawn_Athena) == 0x000580, "Member 'Trap_Wall_BouncePad_C_ExecuteUbergraph_Trap_Wall_BouncePad::K2Node_DynamicCast_AsFort_Player_Pawn_Athena' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_ExecuteUbergraph_Trap_Wall_BouncePad, K2Node_DynamicCast_bSuccess_1) == 0x000588, "Member 'Trap_Wall_BouncePad_C_ExecuteUbergraph_Trap_Wall_BouncePad::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_ExecuteUbergraph_Trap_Wall_BouncePad, CallFunc_GetValueAtLevel_ReturnValue) == 0x00058C, "Member 'Trap_Wall_BouncePad_C_ExecuteUbergraph_Trap_Wall_BouncePad::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_ExecuteUbergraph_Trap_Wall_BouncePad, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000590, "Member 'Trap_Wall_BouncePad_C_ExecuteUbergraph_Trap_Wall_BouncePad::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");

// Function Trap_Wall_BouncePad.Trap_Wall_BouncePad_C.GameplayCue.Abilities.Activation.Traps.ActivateTrap
// 0x00C0 (0x00C0 - 0x0000)
struct Trap_Wall_BouncePad_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap final
{
public:
	EGameplayCueEvent                             EventType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
};
static_assert(alignof(Trap_Wall_BouncePad_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap) == 0x000008, "Wrong alignment on Trap_Wall_BouncePad_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap");
static_assert(sizeof(Trap_Wall_BouncePad_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap) == 0x0000C0, "Wrong size on Trap_Wall_BouncePad_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap");
static_assert(offsetof(Trap_Wall_BouncePad_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap, EventType) == 0x000000, "Member 'Trap_Wall_BouncePad_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap::EventType' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap, Parameters) == 0x000008, "Member 'Trap_Wall_BouncePad_C_GameplayCue_Abilities_Activation_Traps_ActivateTrap::Parameters' has a wrong offset!");

// Function Trap_Wall_BouncePad.Trap_Wall_BouncePad_C.PlayerLaunch
// 0x00B0 (0x00B0 - 0x0000)
struct Trap_Wall_BouncePad_C_PlayerLaunch final
{
public:
	class AFortPlayerPawn*                        FortPlayerPawn;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                InVec;                                             // 0x0008(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_1;            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_2;            // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_3;            // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_4;            // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_5;            // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_ClampVectorSize_ReturnValue;              // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_6;            // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0088(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0094(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Trap_Wall_BouncePad_C_PlayerLaunch) == 0x000008, "Wrong alignment on Trap_Wall_BouncePad_C_PlayerLaunch");
static_assert(sizeof(Trap_Wall_BouncePad_C_PlayerLaunch) == 0x0000B0, "Wrong size on Trap_Wall_BouncePad_C_PlayerLaunch");
static_assert(offsetof(Trap_Wall_BouncePad_C_PlayerLaunch, FortPlayerPawn) == 0x000000, "Member 'Trap_Wall_BouncePad_C_PlayerLaunch::FortPlayerPawn' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_PlayerLaunch, InVec) == 0x000008, "Member 'Trap_Wall_BouncePad_C_PlayerLaunch::InVec' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_PlayerLaunch, CallFunc_GetValueAtLevel_ReturnValue) == 0x000014, "Member 'Trap_Wall_BouncePad_C_PlayerLaunch::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_PlayerLaunch, CallFunc_GetValueAtLevel_ReturnValue_1) == 0x000018, "Member 'Trap_Wall_BouncePad_C_PlayerLaunch::CallFunc_GetValueAtLevel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_PlayerLaunch, CallFunc_GetValueAtLevel_ReturnValue_2) == 0x00001C, "Member 'Trap_Wall_BouncePad_C_PlayerLaunch::CallFunc_GetValueAtLevel_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_PlayerLaunch, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000020, "Member 'Trap_Wall_BouncePad_C_PlayerLaunch::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_PlayerLaunch, CallFunc_GetValueAtLevel_ReturnValue_3) == 0x00002C, "Member 'Trap_Wall_BouncePad_C_PlayerLaunch::CallFunc_GetValueAtLevel_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_PlayerLaunch, CallFunc_BreakVector_X) == 0x000030, "Member 'Trap_Wall_BouncePad_C_PlayerLaunch::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_PlayerLaunch, CallFunc_BreakVector_Y) == 0x000034, "Member 'Trap_Wall_BouncePad_C_PlayerLaunch::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_PlayerLaunch, CallFunc_BreakVector_Z) == 0x000038, "Member 'Trap_Wall_BouncePad_C_PlayerLaunch::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_PlayerLaunch, CallFunc_MakeVector_ReturnValue) == 0x00003C, "Member 'Trap_Wall_BouncePad_C_PlayerLaunch::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_PlayerLaunch, CallFunc_GetValueAtLevel_ReturnValue_4) == 0x000048, "Member 'Trap_Wall_BouncePad_C_PlayerLaunch::CallFunc_GetValueAtLevel_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_PlayerLaunch, CallFunc_GetValueAtLevel_ReturnValue_5) == 0x00004C, "Member 'Trap_Wall_BouncePad_C_PlayerLaunch::CallFunc_GetValueAtLevel_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_PlayerLaunch, CallFunc_FClamp_ReturnValue) == 0x000050, "Member 'Trap_Wall_BouncePad_C_PlayerLaunch::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_PlayerLaunch, CallFunc_ClampVectorSize_ReturnValue) == 0x000054, "Member 'Trap_Wall_BouncePad_C_PlayerLaunch::CallFunc_ClampVectorSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_PlayerLaunch, CallFunc_BreakVector_X_1) == 0x000060, "Member 'Trap_Wall_BouncePad_C_PlayerLaunch::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_PlayerLaunch, CallFunc_BreakVector_Y_1) == 0x000064, "Member 'Trap_Wall_BouncePad_C_PlayerLaunch::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_PlayerLaunch, CallFunc_BreakVector_Z_1) == 0x000068, "Member 'Trap_Wall_BouncePad_C_PlayerLaunch::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_PlayerLaunch, CallFunc_GetValueAtLevel_ReturnValue_6) == 0x00006C, "Member 'Trap_Wall_BouncePad_C_PlayerLaunch::CallFunc_GetValueAtLevel_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_PlayerLaunch, CallFunc_MakeVector_ReturnValue_1) == 0x000070, "Member 'Trap_Wall_BouncePad_C_PlayerLaunch::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_PlayerLaunch, CallFunc_Add_FloatFloat_ReturnValue) == 0x00007C, "Member 'Trap_Wall_BouncePad_C_PlayerLaunch::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_PlayerLaunch, CallFunc_VSize_ReturnValue) == 0x000080, "Member 'Trap_Wall_BouncePad_C_PlayerLaunch::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_PlayerLaunch, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000084, "Member 'Trap_Wall_BouncePad_C_PlayerLaunch::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_PlayerLaunch, CallFunc_GetForwardVector_ReturnValue) == 0x000088, "Member 'Trap_Wall_BouncePad_C_PlayerLaunch::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_PlayerLaunch, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x000094, "Member 'Trap_Wall_BouncePad_C_PlayerLaunch::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_PlayerLaunch, CallFunc_Add_VectorVector_ReturnValue) == 0x0000A0, "Member 'Trap_Wall_BouncePad_C_PlayerLaunch::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");

// Function Trap_Wall_BouncePad.Trap_Wall_BouncePad_C.VehicleLaunch
// 0x0108 (0x0108 - 0x0000)
struct Trap_Wall_BouncePad_C_VehicleLaunch final
{
public:
	TScriptInterface<class IFortVehicleInterface> VehicleInterface;                                  // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AFortPlayerPawn*>                CallFunc_GetAllPassengers_ReturnValue;             // 0x0018(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetVehicleVelocity_ReturnValue;           // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetVehicleActorPtr_ReturnValue;           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        CallFunc_Array_Get_Item;                           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 K2Node_DynamicCast_AsSkeletal_Mesh_Component;      // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetMass_ReturnValue;                      // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0078(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue_1;           // 0x0084(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MirrorVectorByNormal_ReturnValue;         // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_1;            // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_2;            // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x00A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_3;            // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x00BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x00EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_ClampVectorSize_ReturnValue;              // 0x00F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Trap_Wall_BouncePad_C_VehicleLaunch) == 0x000008, "Wrong alignment on Trap_Wall_BouncePad_C_VehicleLaunch");
static_assert(sizeof(Trap_Wall_BouncePad_C_VehicleLaunch) == 0x000108, "Wrong size on Trap_Wall_BouncePad_C_VehicleLaunch");
static_assert(offsetof(Trap_Wall_BouncePad_C_VehicleLaunch, VehicleInterface) == 0x000000, "Member 'Trap_Wall_BouncePad_C_VehicleLaunch::VehicleInterface' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_VehicleLaunch, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'Trap_Wall_BouncePad_C_VehicleLaunch::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_VehicleLaunch, CallFunc_GetAllPassengers_ReturnValue) == 0x000018, "Member 'Trap_Wall_BouncePad_C_VehicleLaunch::CallFunc_GetAllPassengers_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_VehicleLaunch, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'Trap_Wall_BouncePad_C_VehicleLaunch::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_VehicleLaunch, CallFunc_Array_Length_ReturnValue) == 0x00002C, "Member 'Trap_Wall_BouncePad_C_VehicleLaunch::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_VehicleLaunch, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'Trap_Wall_BouncePad_C_VehicleLaunch::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_VehicleLaunch, CallFunc_GetVehicleVelocity_ReturnValue) == 0x000034, "Member 'Trap_Wall_BouncePad_C_VehicleLaunch::CallFunc_GetVehicleVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_VehicleLaunch, CallFunc_GetVehicleActorPtr_ReturnValue) == 0x000040, "Member 'Trap_Wall_BouncePad_C_VehicleLaunch::CallFunc_GetVehicleActorPtr_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_VehicleLaunch, Temp_int_Array_Index_Variable) == 0x000048, "Member 'Trap_Wall_BouncePad_C_VehicleLaunch::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_VehicleLaunch, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000050, "Member 'Trap_Wall_BouncePad_C_VehicleLaunch::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_VehicleLaunch, CallFunc_Array_Get_Item) == 0x000058, "Member 'Trap_Wall_BouncePad_C_VehicleLaunch::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_VehicleLaunch, K2Node_DynamicCast_AsSkeletal_Mesh_Component) == 0x000060, "Member 'Trap_Wall_BouncePad_C_VehicleLaunch::K2Node_DynamicCast_AsSkeletal_Mesh_Component' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_VehicleLaunch, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'Trap_Wall_BouncePad_C_VehicleLaunch::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_VehicleLaunch, CallFunc_GetMass_ReturnValue) == 0x00006C, "Member 'Trap_Wall_BouncePad_C_VehicleLaunch::CallFunc_GetMass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_VehicleLaunch, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x000070, "Member 'Trap_Wall_BouncePad_C_VehicleLaunch::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_VehicleLaunch, CallFunc_GetForwardVector_ReturnValue) == 0x000078, "Member 'Trap_Wall_BouncePad_C_VehicleLaunch::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_VehicleLaunch, CallFunc_GetForwardVector_ReturnValue_1) == 0x000084, "Member 'Trap_Wall_BouncePad_C_VehicleLaunch::CallFunc_GetForwardVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_VehicleLaunch, CallFunc_MirrorVectorByNormal_ReturnValue) == 0x000090, "Member 'Trap_Wall_BouncePad_C_VehicleLaunch::CallFunc_MirrorVectorByNormal_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_VehicleLaunch, CallFunc_GetValueAtLevel_ReturnValue) == 0x00009C, "Member 'Trap_Wall_BouncePad_C_VehicleLaunch::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_VehicleLaunch, CallFunc_GetValueAtLevel_ReturnValue_1) == 0x0000A0, "Member 'Trap_Wall_BouncePad_C_VehicleLaunch::CallFunc_GetValueAtLevel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_VehicleLaunch, CallFunc_GetValueAtLevel_ReturnValue_2) == 0x0000A4, "Member 'Trap_Wall_BouncePad_C_VehicleLaunch::CallFunc_GetValueAtLevel_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_VehicleLaunch, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0000A8, "Member 'Trap_Wall_BouncePad_C_VehicleLaunch::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_VehicleLaunch, CallFunc_GetValueAtLevel_ReturnValue_3) == 0x0000B4, "Member 'Trap_Wall_BouncePad_C_VehicleLaunch::CallFunc_GetValueAtLevel_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_VehicleLaunch, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000B8, "Member 'Trap_Wall_BouncePad_C_VehicleLaunch::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_VehicleLaunch, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x0000BC, "Member 'Trap_Wall_BouncePad_C_VehicleLaunch::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_VehicleLaunch, CallFunc_Add_VectorVector_ReturnValue) == 0x0000C8, "Member 'Trap_Wall_BouncePad_C_VehicleLaunch::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_VehicleLaunch, CallFunc_BreakVector_X) == 0x0000D4, "Member 'Trap_Wall_BouncePad_C_VehicleLaunch::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_VehicleLaunch, CallFunc_BreakVector_Y) == 0x0000D8, "Member 'Trap_Wall_BouncePad_C_VehicleLaunch::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_VehicleLaunch, CallFunc_BreakVector_Z) == 0x0000DC, "Member 'Trap_Wall_BouncePad_C_VehicleLaunch::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_VehicleLaunch, CallFunc_MakeVector_ReturnValue) == 0x0000E0, "Member 'Trap_Wall_BouncePad_C_VehicleLaunch::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_VehicleLaunch, CallFunc_Add_VectorVector_ReturnValue_1) == 0x0000EC, "Member 'Trap_Wall_BouncePad_C_VehicleLaunch::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_VehicleLaunch, CallFunc_ClampVectorSize_ReturnValue) == 0x0000F8, "Member 'Trap_Wall_BouncePad_C_VehicleLaunch::CallFunc_ClampVectorSize_ReturnValue' has a wrong offset!");

// Function Trap_Wall_BouncePad.Trap_Wall_BouncePad_C.PlayerApplyGameplayEffects
// 0x0038 (0x0038 - 0x0000)
struct Trap_Wall_BouncePad_C_PlayerApplyGameplayEffects final
{
public:
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_1;  // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue_1; // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue_2; // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue_3; // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue_4; // 0x0030(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Trap_Wall_BouncePad_C_PlayerApplyGameplayEffects) == 0x000008, "Wrong alignment on Trap_Wall_BouncePad_C_PlayerApplyGameplayEffects");
static_assert(sizeof(Trap_Wall_BouncePad_C_PlayerApplyGameplayEffects) == 0x000038, "Wrong size on Trap_Wall_BouncePad_C_PlayerApplyGameplayEffects");
static_assert(offsetof(Trap_Wall_BouncePad_C_PlayerApplyGameplayEffects, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000000, "Member 'Trap_Wall_BouncePad_C_PlayerApplyGameplayEffects::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_PlayerApplyGameplayEffects, CallFunc_GetAbilitySystemComponent_ReturnValue_1) == 0x000008, "Member 'Trap_Wall_BouncePad_C_PlayerApplyGameplayEffects::CallFunc_GetAbilitySystemComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_PlayerApplyGameplayEffects, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x000010, "Member 'Trap_Wall_BouncePad_C_PlayerApplyGameplayEffects::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_PlayerApplyGameplayEffects, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue_1) == 0x000018, "Member 'Trap_Wall_BouncePad_C_PlayerApplyGameplayEffects::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_PlayerApplyGameplayEffects, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue_2) == 0x000020, "Member 'Trap_Wall_BouncePad_C_PlayerApplyGameplayEffects::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_PlayerApplyGameplayEffects, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue_3) == 0x000028, "Member 'Trap_Wall_BouncePad_C_PlayerApplyGameplayEffects::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_PlayerApplyGameplayEffects, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue_4) == 0x000030, "Member 'Trap_Wall_BouncePad_C_PlayerApplyGameplayEffects::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue_4' has a wrong offset!");

// Function Trap_Wall_BouncePad.Trap_Wall_BouncePad_C.DeimosLaunch
// 0x00A0 (0x00A0 - 0x0000)
struct Trap_Wall_BouncePad_C_DeimosLaunch final
{
public:
	class AEnemyPawn_Parent_C*                    DeimosPawn_0;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_1;            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_2;            // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_3;            // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue_1;           // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MirrorVectorByNormal_ReturnValue;         // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0078(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0084(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_ClampVectorSize_ReturnValue;              // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Trap_Wall_BouncePad_C_DeimosLaunch) == 0x000008, "Wrong alignment on Trap_Wall_BouncePad_C_DeimosLaunch");
static_assert(sizeof(Trap_Wall_BouncePad_C_DeimosLaunch) == 0x0000A0, "Wrong size on Trap_Wall_BouncePad_C_DeimosLaunch");
static_assert(offsetof(Trap_Wall_BouncePad_C_DeimosLaunch, DeimosPawn_0) == 0x000000, "Member 'Trap_Wall_BouncePad_C_DeimosLaunch::DeimosPawn_0' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_DeimosLaunch, CallFunc_GetVelocity_ReturnValue) == 0x000008, "Member 'Trap_Wall_BouncePad_C_DeimosLaunch::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_DeimosLaunch, CallFunc_GetValueAtLevel_ReturnValue) == 0x000014, "Member 'Trap_Wall_BouncePad_C_DeimosLaunch::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_DeimosLaunch, CallFunc_GetValueAtLevel_ReturnValue_1) == 0x000018, "Member 'Trap_Wall_BouncePad_C_DeimosLaunch::CallFunc_GetValueAtLevel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_DeimosLaunch, CallFunc_GetValueAtLevel_ReturnValue_2) == 0x00001C, "Member 'Trap_Wall_BouncePad_C_DeimosLaunch::CallFunc_GetValueAtLevel_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_DeimosLaunch, CallFunc_GetValueAtLevel_ReturnValue_3) == 0x000020, "Member 'Trap_Wall_BouncePad_C_DeimosLaunch::CallFunc_GetValueAtLevel_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_DeimosLaunch, CallFunc_GetForwardVector_ReturnValue) == 0x000024, "Member 'Trap_Wall_BouncePad_C_DeimosLaunch::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_DeimosLaunch, CallFunc_GetForwardVector_ReturnValue_1) == 0x000030, "Member 'Trap_Wall_BouncePad_C_DeimosLaunch::CallFunc_GetForwardVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Trap_Wall_BouncePad_C_DeimosLaunch, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x00003C, "Member 'Trap_Wall_BouncePad_C_DeimosLaunch::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
