#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Trap_Ceiling_BouncePad

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Trap_Ceiling_BouncePad.Trap_Ceiling_BouncePad_C
// 0x0198 (0x0E18 - 0x0C80)
class ATrap_Ceiling_BouncePad_C final : public ABuildingTrapCeiling
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0C80(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UArrowComponent*                        Arrow;                                             // 0x0C88(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               BouncePadFX;                                       // 0x0C90(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Trigger;                                           // 0x0C98(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Root;                                              // 0x0CA0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              Trap_Active_Sound;                                 // 0x0CA8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              Trap_Fire_Sound;                                   // 0x0CB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              Reload_Sound;                                      // 0x0CB8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              Trap_Explode_Sound;                                // 0x0CC0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              Place_Trap_Sound;                                  // 0x0CC8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              Trap_Destroyed_Sound;                              // 0x0CD0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OverlappedActor;                                   // 0x0CD8(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	float                                         Player_DestructionRange;                           // 0x0CE0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           BouncePadTagMaxCount;                              // 0x0CE4(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CEC[0x4];                                      // 0x0CEC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawnAthena*                  LaunchedPlayer;                                    // 0x0CF0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IFortVehicleInterface> LaunchedVehicleInterface;                          // 0x0CF8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UClass*                                 GE_LowGravity;                                     // 0x0D08(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GE_BounceTracker1;                                 // 0x0D10(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GE_BounceTracker2;                                 // 0x0D18(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         VehicleVelocityMultiplier;                         // 0x0D20(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         VehicleMinLateralVelocity;                         // 0x0D40(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         VehicleMaxVelocity;                                // 0x0D60(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         PlayerMaxLateralVelocity;                          // 0x0D80(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         PlayerMaxDownwardVelocity;                         // 0x0DA0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         PlayerMaxVelocity;                                 // 0x0DC0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          IgnoreFallDamage;                                  // 0x0DE0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DE1[0x7];                                      // 0x0DE1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 GE_LowGravityNoFX;                                 // 0x0DE8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GE_LowGravityWithHopRocks;                         // 0x0DF0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         SetIgnoreFallDamage;                               // 0x0DF8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_Trap_Ceiling_BouncePad(int32 EntryPoint);
	void ReceiveDestroyed();
	void GameplayCue_Abilities_Activation_Traps_ActivateTrap(EGameplayCueEvent EventType, const struct FGameplayCueParameters& Parameters);
	void BndEvt__Trigger_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void OnFinishedBuilding();
	void OnPlaced();
	void UserConstructionScript();
	void VehicleLaunch(TScriptInterface<class IFortVehicleInterface> Vehicle);
	void PlayerLaunch(class AFortPlayerPawnAthena* Player);
	void ApplyGameplayEffects();
	void OnRep_Overlappedactor();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Trap_Ceiling_BouncePad_C">();
	}
	static class ATrap_Ceiling_BouncePad_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATrap_Ceiling_BouncePad_C>();
	}
};
static_assert(alignof(ATrap_Ceiling_BouncePad_C) == 0x000008, "Wrong alignment on ATrap_Ceiling_BouncePad_C");
static_assert(sizeof(ATrap_Ceiling_BouncePad_C) == 0x000E18, "Wrong size on ATrap_Ceiling_BouncePad_C");
static_assert(offsetof(ATrap_Ceiling_BouncePad_C, UberGraphFrame) == 0x000C80, "Member 'ATrap_Ceiling_BouncePad_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ATrap_Ceiling_BouncePad_C, Arrow) == 0x000C88, "Member 'ATrap_Ceiling_BouncePad_C::Arrow' has a wrong offset!");
static_assert(offsetof(ATrap_Ceiling_BouncePad_C, BouncePadFX) == 0x000C90, "Member 'ATrap_Ceiling_BouncePad_C::BouncePadFX' has a wrong offset!");
static_assert(offsetof(ATrap_Ceiling_BouncePad_C, Trigger) == 0x000C98, "Member 'ATrap_Ceiling_BouncePad_C::Trigger' has a wrong offset!");
static_assert(offsetof(ATrap_Ceiling_BouncePad_C, Root) == 0x000CA0, "Member 'ATrap_Ceiling_BouncePad_C::Root' has a wrong offset!");
static_assert(offsetof(ATrap_Ceiling_BouncePad_C, Trap_Active_Sound) == 0x000CA8, "Member 'ATrap_Ceiling_BouncePad_C::Trap_Active_Sound' has a wrong offset!");
static_assert(offsetof(ATrap_Ceiling_BouncePad_C, Trap_Fire_Sound) == 0x000CB0, "Member 'ATrap_Ceiling_BouncePad_C::Trap_Fire_Sound' has a wrong offset!");
static_assert(offsetof(ATrap_Ceiling_BouncePad_C, Reload_Sound) == 0x000CB8, "Member 'ATrap_Ceiling_BouncePad_C::Reload_Sound' has a wrong offset!");
static_assert(offsetof(ATrap_Ceiling_BouncePad_C, Trap_Explode_Sound) == 0x000CC0, "Member 'ATrap_Ceiling_BouncePad_C::Trap_Explode_Sound' has a wrong offset!");
static_assert(offsetof(ATrap_Ceiling_BouncePad_C, Place_Trap_Sound) == 0x000CC8, "Member 'ATrap_Ceiling_BouncePad_C::Place_Trap_Sound' has a wrong offset!");
static_assert(offsetof(ATrap_Ceiling_BouncePad_C, Trap_Destroyed_Sound) == 0x000CD0, "Member 'ATrap_Ceiling_BouncePad_C::Trap_Destroyed_Sound' has a wrong offset!");
static_assert(offsetof(ATrap_Ceiling_BouncePad_C, OverlappedActor) == 0x000CD8, "Member 'ATrap_Ceiling_BouncePad_C::OverlappedActor' has a wrong offset!");
static_assert(offsetof(ATrap_Ceiling_BouncePad_C, Player_DestructionRange) == 0x000CE0, "Member 'ATrap_Ceiling_BouncePad_C::Player_DestructionRange' has a wrong offset!");
static_assert(offsetof(ATrap_Ceiling_BouncePad_C, BouncePadTagMaxCount) == 0x000CE4, "Member 'ATrap_Ceiling_BouncePad_C::BouncePadTagMaxCount' has a wrong offset!");
static_assert(offsetof(ATrap_Ceiling_BouncePad_C, LaunchedPlayer) == 0x000CF0, "Member 'ATrap_Ceiling_BouncePad_C::LaunchedPlayer' has a wrong offset!");
static_assert(offsetof(ATrap_Ceiling_BouncePad_C, LaunchedVehicleInterface) == 0x000CF8, "Member 'ATrap_Ceiling_BouncePad_C::LaunchedVehicleInterface' has a wrong offset!");
static_assert(offsetof(ATrap_Ceiling_BouncePad_C, GE_LowGravity) == 0x000D08, "Member 'ATrap_Ceiling_BouncePad_C::GE_LowGravity' has a wrong offset!");
static_assert(offsetof(ATrap_Ceiling_BouncePad_C, GE_BounceTracker1) == 0x000D10, "Member 'ATrap_Ceiling_BouncePad_C::GE_BounceTracker1' has a wrong offset!");
static_assert(offsetof(ATrap_Ceiling_BouncePad_C, GE_BounceTracker2) == 0x000D18, "Member 'ATrap_Ceiling_BouncePad_C::GE_BounceTracker2' has a wrong offset!");
static_assert(offsetof(ATrap_Ceiling_BouncePad_C, VehicleVelocityMultiplier) == 0x000D20, "Member 'ATrap_Ceiling_BouncePad_C::VehicleVelocityMultiplier' has a wrong offset!");
static_assert(offsetof(ATrap_Ceiling_BouncePad_C, VehicleMinLateralVelocity) == 0x000D40, "Member 'ATrap_Ceiling_BouncePad_C::VehicleMinLateralVelocity' has a wrong offset!");
static_assert(offsetof(ATrap_Ceiling_BouncePad_C, VehicleMaxVelocity) == 0x000D60, "Member 'ATrap_Ceiling_BouncePad_C::VehicleMaxVelocity' has a wrong offset!");
static_assert(offsetof(ATrap_Ceiling_BouncePad_C, PlayerMaxLateralVelocity) == 0x000D80, "Member 'ATrap_Ceiling_BouncePad_C::PlayerMaxLateralVelocity' has a wrong offset!");
static_assert(offsetof(ATrap_Ceiling_BouncePad_C, PlayerMaxDownwardVelocity) == 0x000DA0, "Member 'ATrap_Ceiling_BouncePad_C::PlayerMaxDownwardVelocity' has a wrong offset!");
static_assert(offsetof(ATrap_Ceiling_BouncePad_C, PlayerMaxVelocity) == 0x000DC0, "Member 'ATrap_Ceiling_BouncePad_C::PlayerMaxVelocity' has a wrong offset!");
static_assert(offsetof(ATrap_Ceiling_BouncePad_C, IgnoreFallDamage) == 0x000DE0, "Member 'ATrap_Ceiling_BouncePad_C::IgnoreFallDamage' has a wrong offset!");
static_assert(offsetof(ATrap_Ceiling_BouncePad_C, GE_LowGravityNoFX) == 0x000DE8, "Member 'ATrap_Ceiling_BouncePad_C::GE_LowGravityNoFX' has a wrong offset!");
static_assert(offsetof(ATrap_Ceiling_BouncePad_C, GE_LowGravityWithHopRocks) == 0x000DF0, "Member 'ATrap_Ceiling_BouncePad_C::GE_LowGravityWithHopRocks' has a wrong offset!");
static_assert(offsetof(ATrap_Ceiling_BouncePad_C, SetIgnoreFallDamage) == 0x000DF8, "Member 'ATrap_Ceiling_BouncePad_C::SetIgnoreFallDamage' has a wrong offset!");

}

