#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIManager

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UIManager.UIManager_C
// 0x00E0 (0x04D8 - 0x03F8)
class UUIManager_C final : public UFortUIManagerWidget_NUI
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNamedSlot*                             Confirmation_Layer;                                // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             ControllerDisconnectedLayer;                       // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             Error_Layer;                                       // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             PlayerSurveyLayer;                                 // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UQuestTalkingHeadWidget_C*              QuestTalkingHeadWidget;                            // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             TalkingHeadLayer;                                  // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UToastDisplayArea_C*                    ToastDisplayArea;                                  // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             ToastDisplayLayer;                                 // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             Tutorial_Layer;                                    // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTutorialOverlay_C*                     TutorialOverlay;                                   // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActivatablePanel*                Deprecated_CurrentModalWidget;                     // 0x0450(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UCommonActivatablePanel*>        Deprecated_ModalQueue_0;                           // 0x0458(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FFortDialogDescription_NUI>     ConfirmationQueue;                                 // 0x0468(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference)
	class UConfirmationWindow_C*                  ConfirmationWindow;                                // 0x0478(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UErrorWindow_C*                         ErrorWindow;                                       // 0x0480(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWebPurchase_C*                         WebPurchaseWindow;                                 // 0x0488(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProgressModalWidget_C*                 ControllerDisconnectedModal;                       // 0x0490(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bClosingConfirmation;                              // 0x0498(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bClosingErrorDialog;                               // 0x0499(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bShouldTriggerCameraModeOnClose;                   // 0x049A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49B[0x5];                                      // 0x049B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   QuitTitle;                                         // 0x04A0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   QuitMessage;                                       // 0x04B8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UFortPlayerSurveyDispatcher*            SurveyDispatcher;                                  // 0x04D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UIManager(int32 EntryPoint);
	void KillConfirmation();
	void OnModalQueueEmptied();
	void OnStateStarted();
	void OnGameWindowCloseButtonClicked();
	void Destruct();
	void CloseErrorWindow();
	void CloseConfirmationWindow();
	void OnStateEnded();
	void UpdateStateWidgetContent(class UFortUIStateWidget_NUI* StateWidget);
	void Construct();
	void OnShowConfirmation_NUI(const struct FFortDialogDescription_NUI& Description);
	void DisplayErrorDialog(const struct FFortErrorInfo& Info);
	void DialogResult_5E02A44647A3EA099FA7CEB9FA976CBB(EFortDialogResult Result, class FName ResultName);
	void ClearLayers();
	void Deprecated_PopCurrentModal();
	void Deprecated_QueueModalPanel(class UCommonActivatablePanel* ActivatablePanel);
	void Deprecated_ShowNextModalWidget();
	void BindDelegates();
	void HandleDeactivatedPanelConfirmationLayer(class UCommonActivatablePanel* DeactivatedPanel);
	void ShowNextConfirmation();
	void QueueConfirmation(const struct FFortDialogDescription_NUI& ConfirmationDescription);
	void Initialize();
	void AddActivatablePanelToModalLayer(class UCommonActivatablePanel* ActivatablePanel);
	void HandleDeactivatedPanelModalLayer(class UCommonActivatablePanel* DeactivatedPanel);
	void ShowErrorInErrorWindow(const struct FFortErrorInfo& ErrorInfo);
	void HandleDeactivatedErrorWindow(class UCommonActivatablePanel* DeactivatedPanel);
	void DisplayWebPurchase(class UWidget* WebWidget, const class FString& OfferId);
	void DismissWebPurchase();
	bool IsConsole();
	void OnEndLatentWaitForConfirmationDialog(struct FFortDialogExternalLatentActionHandle& WaitingDialogHandle);
	void HandleControllerConnectionChanged(bool bConnected);
	void HandleStateContentUpdated(class UFortUIStateWidget_NUI* NewStateWidget);
	void Deprecated_PopModalPanel(class UCommonActivatablePanel* ActivatablePanel);
	void Deprecated_RemoveModalPanel(class UCommonActivatablePanel* Panel);
	void ClearConfirmationLayer();
	void SafeTriggerCameraMode();
	void SafeTriggerCursorMode();
	bool IsShowingModalsConfirmationsErrors();
	void InitSurveyDispatcher();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UIManager_C">();
	}
	static class UUIManager_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIManager_C>();
	}
};
static_assert(alignof(UUIManager_C) == 0x000008, "Wrong alignment on UUIManager_C");
static_assert(sizeof(UUIManager_C) == 0x0004D8, "Wrong size on UUIManager_C");
static_assert(offsetof(UUIManager_C, UberGraphFrame) == 0x0003F8, "Member 'UUIManager_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUIManager_C, Confirmation_Layer) == 0x000400, "Member 'UUIManager_C::Confirmation_Layer' has a wrong offset!");
static_assert(offsetof(UUIManager_C, ControllerDisconnectedLayer) == 0x000408, "Member 'UUIManager_C::ControllerDisconnectedLayer' has a wrong offset!");
static_assert(offsetof(UUIManager_C, Error_Layer) == 0x000410, "Member 'UUIManager_C::Error_Layer' has a wrong offset!");
static_assert(offsetof(UUIManager_C, PlayerSurveyLayer) == 0x000418, "Member 'UUIManager_C::PlayerSurveyLayer' has a wrong offset!");
static_assert(offsetof(UUIManager_C, QuestTalkingHeadWidget) == 0x000420, "Member 'UUIManager_C::QuestTalkingHeadWidget' has a wrong offset!");
static_assert(offsetof(UUIManager_C, TalkingHeadLayer) == 0x000428, "Member 'UUIManager_C::TalkingHeadLayer' has a wrong offset!");
static_assert(offsetof(UUIManager_C, ToastDisplayArea) == 0x000430, "Member 'UUIManager_C::ToastDisplayArea' has a wrong offset!");
static_assert(offsetof(UUIManager_C, ToastDisplayLayer) == 0x000438, "Member 'UUIManager_C::ToastDisplayLayer' has a wrong offset!");
static_assert(offsetof(UUIManager_C, Tutorial_Layer) == 0x000440, "Member 'UUIManager_C::Tutorial_Layer' has a wrong offset!");
static_assert(offsetof(UUIManager_C, TutorialOverlay) == 0x000448, "Member 'UUIManager_C::TutorialOverlay' has a wrong offset!");
static_assert(offsetof(UUIManager_C, Deprecated_CurrentModalWidget) == 0x000450, "Member 'UUIManager_C::Deprecated_CurrentModalWidget' has a wrong offset!");
static_assert(offsetof(UUIManager_C, Deprecated_ModalQueue_0) == 0x000458, "Member 'UUIManager_C::Deprecated_ModalQueue_0' has a wrong offset!");
static_assert(offsetof(UUIManager_C, ConfirmationQueue) == 0x000468, "Member 'UUIManager_C::ConfirmationQueue' has a wrong offset!");
static_assert(offsetof(UUIManager_C, ConfirmationWindow) == 0x000478, "Member 'UUIManager_C::ConfirmationWindow' has a wrong offset!");
static_assert(offsetof(UUIManager_C, ErrorWindow) == 0x000480, "Member 'UUIManager_C::ErrorWindow' has a wrong offset!");
static_assert(offsetof(UUIManager_C, WebPurchaseWindow) == 0x000488, "Member 'UUIManager_C::WebPurchaseWindow' has a wrong offset!");
static_assert(offsetof(UUIManager_C, ControllerDisconnectedModal) == 0x000490, "Member 'UUIManager_C::ControllerDisconnectedModal' has a wrong offset!");
static_assert(offsetof(UUIManager_C, bClosingConfirmation) == 0x000498, "Member 'UUIManager_C::bClosingConfirmation' has a wrong offset!");
static_assert(offsetof(UUIManager_C, bClosingErrorDialog) == 0x000499, "Member 'UUIManager_C::bClosingErrorDialog' has a wrong offset!");
static_assert(offsetof(UUIManager_C, bShouldTriggerCameraModeOnClose) == 0x00049A, "Member 'UUIManager_C::bShouldTriggerCameraModeOnClose' has a wrong offset!");
static_assert(offsetof(UUIManager_C, QuitTitle) == 0x0004A0, "Member 'UUIManager_C::QuitTitle' has a wrong offset!");
static_assert(offsetof(UUIManager_C, QuitMessage) == 0x0004B8, "Member 'UUIManager_C::QuitMessage' has a wrong offset!");
static_assert(offsetof(UUIManager_C, SurveyDispatcher) == 0x0004D0, "Member 'UUIManager_C::SurveyDispatcher' has a wrong offset!");

}

