#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VaultCamera_Blueprint

#include "Basic.hpp"


namespace SDK::Params
{

// Function VaultCamera_Blueprint.VaultCamera_Blueprint_C.ExecuteUbergraph_VaultCamera_Blueprint
// 0x0048 (0x0048 - 0x0000)
struct VaultCamera_Blueprint_C_ExecuteUbergraph_VaultCamera_Blueprint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ATVPostProcessBP_C*>             CallFunc_GetAllActorsOfClass_OutActors;            // 0x0018(0x0010)(ZeroConstructor, ReferenceParm)
	class AFortTimeOfDayManager*                  CallFunc_GetTimeOfDayManagerFromContext_ReturnValue; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATVPostProcessBP_C*                     CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(VaultCamera_Blueprint_C_ExecuteUbergraph_VaultCamera_Blueprint) == 0x000008, "Wrong alignment on VaultCamera_Blueprint_C_ExecuteUbergraph_VaultCamera_Blueprint");
static_assert(sizeof(VaultCamera_Blueprint_C_ExecuteUbergraph_VaultCamera_Blueprint) == 0x000048, "Wrong size on VaultCamera_Blueprint_C_ExecuteUbergraph_VaultCamera_Blueprint");
static_assert(offsetof(VaultCamera_Blueprint_C_ExecuteUbergraph_VaultCamera_Blueprint, EntryPoint) == 0x000000, "Member 'VaultCamera_Blueprint_C_ExecuteUbergraph_VaultCamera_Blueprint::EntryPoint' has a wrong offset!");
static_assert(offsetof(VaultCamera_Blueprint_C_ExecuteUbergraph_VaultCamera_Blueprint, Temp_int_Array_Index_Variable) == 0x000004, "Member 'VaultCamera_Blueprint_C_ExecuteUbergraph_VaultCamera_Blueprint::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(VaultCamera_Blueprint_C_ExecuteUbergraph_VaultCamera_Blueprint, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'VaultCamera_Blueprint_C_ExecuteUbergraph_VaultCamera_Blueprint::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(VaultCamera_Blueprint_C_ExecuteUbergraph_VaultCamera_Blueprint, CallFunc_GetPlayerController_ReturnValue_1) == 0x000010, "Member 'VaultCamera_Blueprint_C_ExecuteUbergraph_VaultCamera_Blueprint::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(VaultCamera_Blueprint_C_ExecuteUbergraph_VaultCamera_Blueprint, CallFunc_GetAllActorsOfClass_OutActors) == 0x000018, "Member 'VaultCamera_Blueprint_C_ExecuteUbergraph_VaultCamera_Blueprint::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(VaultCamera_Blueprint_C_ExecuteUbergraph_VaultCamera_Blueprint, CallFunc_GetTimeOfDayManagerFromContext_ReturnValue) == 0x000028, "Member 'VaultCamera_Blueprint_C_ExecuteUbergraph_VaultCamera_Blueprint::CallFunc_GetTimeOfDayManagerFromContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(VaultCamera_Blueprint_C_ExecuteUbergraph_VaultCamera_Blueprint, CallFunc_Array_Get_Item) == 0x000030, "Member 'VaultCamera_Blueprint_C_ExecuteUbergraph_VaultCamera_Blueprint::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(VaultCamera_Blueprint_C_ExecuteUbergraph_VaultCamera_Blueprint, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'VaultCamera_Blueprint_C_ExecuteUbergraph_VaultCamera_Blueprint::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(VaultCamera_Blueprint_C_ExecuteUbergraph_VaultCamera_Blueprint, Temp_int_Loop_Counter_Variable) == 0x00003C, "Member 'VaultCamera_Blueprint_C_ExecuteUbergraph_VaultCamera_Blueprint::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(VaultCamera_Blueprint_C_ExecuteUbergraph_VaultCamera_Blueprint, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'VaultCamera_Blueprint_C_ExecuteUbergraph_VaultCamera_Blueprint::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(VaultCamera_Blueprint_C_ExecuteUbergraph_VaultCamera_Blueprint, CallFunc_Add_IntInt_ReturnValue) == 0x000044, "Member 'VaultCamera_Blueprint_C_ExecuteUbergraph_VaultCamera_Blueprint::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

}

