#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Violator_ActivityInfo

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Violator_ActivityInfo.Violator_ActivityInfo_C
// 0x0078 (0x0330 - 0x02B8)
class UViolator_ActivityInfo_C final : public UAthenaChallengeCountdownDisplay
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Clock;                                             // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_TimerText;                           // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         PaddingHB;                                         // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RedBoxBorder;                                      // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Clock_Icon;                                // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_CalloutTag;                                   // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_TimeRemainingTag;                             // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              TextScale;                                         // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               TransformOvr;                                      // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 White;                                             // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsLargeDisplay;                                    // 0x0310(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsTextCallout;                                     // 0x0311(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_312[0x6];                                      // 0x0312(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               MID_TextBackPlate;                                 // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MID_TimerBackPlate;                                // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MID_ClockBacking;                                  // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Create_Backplate_MIDs();
	void HandleStyling_TextCallout(bool Is_Large_Display);
	void HandleStyling_Timer(bool Is_Large_Display);
	void Construct();
	void OnChallengeSet(const struct FTimerDisplayData& DisplayStyle);
	void PreConstruct(bool IsDesignTime);
	void ExecuteUbergraph_Violator_ActivityInfo(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Violator_ActivityInfo_C">();
	}
	static class UViolator_ActivityInfo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UViolator_ActivityInfo_C>();
	}
};
static_assert(alignof(UViolator_ActivityInfo_C) == 0x000008, "Wrong alignment on UViolator_ActivityInfo_C");
static_assert(sizeof(UViolator_ActivityInfo_C) == 0x000330, "Wrong size on UViolator_ActivityInfo_C");
static_assert(offsetof(UViolator_ActivityInfo_C, UberGraphFrame) == 0x0002B8, "Member 'UViolator_ActivityInfo_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UViolator_ActivityInfo_C, Clock) == 0x0002C0, "Member 'UViolator_ActivityInfo_C::Clock' has a wrong offset!");
static_assert(offsetof(UViolator_ActivityInfo_C, HorizontalBox_TimerText) == 0x0002C8, "Member 'UViolator_ActivityInfo_C::HorizontalBox_TimerText' has a wrong offset!");
static_assert(offsetof(UViolator_ActivityInfo_C, PaddingHB) == 0x0002D0, "Member 'UViolator_ActivityInfo_C::PaddingHB' has a wrong offset!");
static_assert(offsetof(UViolator_ActivityInfo_C, RedBoxBorder) == 0x0002D8, "Member 'UViolator_ActivityInfo_C::RedBoxBorder' has a wrong offset!");
static_assert(offsetof(UViolator_ActivityInfo_C, SizeBox_Clock_Icon) == 0x0002E0, "Member 'UViolator_ActivityInfo_C::SizeBox_Clock_Icon' has a wrong offset!");
static_assert(offsetof(UViolator_ActivityInfo_C, Text_CalloutTag) == 0x0002E8, "Member 'UViolator_ActivityInfo_C::Text_CalloutTag' has a wrong offset!");
static_assert(offsetof(UViolator_ActivityInfo_C, Text_TimeRemainingTag) == 0x0002F0, "Member 'UViolator_ActivityInfo_C::Text_TimeRemainingTag' has a wrong offset!");
static_assert(offsetof(UViolator_ActivityInfo_C, TextScale) == 0x0002F8, "Member 'UViolator_ActivityInfo_C::TextScale' has a wrong offset!");
static_assert(offsetof(UViolator_ActivityInfo_C, TransformOvr) == 0x000300, "Member 'UViolator_ActivityInfo_C::TransformOvr' has a wrong offset!");
static_assert(offsetof(UViolator_ActivityInfo_C, White) == 0x000308, "Member 'UViolator_ActivityInfo_C::White' has a wrong offset!");
static_assert(offsetof(UViolator_ActivityInfo_C, IsLargeDisplay) == 0x000310, "Member 'UViolator_ActivityInfo_C::IsLargeDisplay' has a wrong offset!");
static_assert(offsetof(UViolator_ActivityInfo_C, IsTextCallout) == 0x000311, "Member 'UViolator_ActivityInfo_C::IsTextCallout' has a wrong offset!");
static_assert(offsetof(UViolator_ActivityInfo_C, MID_TextBackPlate) == 0x000318, "Member 'UViolator_ActivityInfo_C::MID_TextBackPlate' has a wrong offset!");
static_assert(offsetof(UViolator_ActivityInfo_C, MID_TimerBackPlate) == 0x000320, "Member 'UViolator_ActivityInfo_C::MID_TimerBackPlate' has a wrong offset!");
static_assert(offsetof(UViolator_ActivityInfo_C, MID_ClockBacking) == 0x000328, "Member 'UViolator_ActivityInfo_C::MID_ClockBacking' has a wrong offset!");

}

