#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Violator_ActiveFriends

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Violator_ActiveFriends.Violator_ActiveFriends_C
// 0x0068 (0x0290 - 0x0228)
class UViolator_ActiveFriends_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0228(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Reset_Off;                                         // 0x0230(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Update_Down;                                       // 0x0238(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Update_Up;                                         // 0x0240(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x0248(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_UpdateFlare;                                 // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SocialIcon;                                        // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_ActivePlayerCount;                            // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_DeltaChange;                                  // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 YellowBox;                                         // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Text_PlayerCount;                                  // 0x0278(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void UpdateData();
	void CallOut_Surface();
	void CallOut_Hide();
	void PreConstruct(bool IsDesignTime);
	void Construct();
	void ExecuteUbergraph_Violator_ActiveFriends(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Violator_ActiveFriends_C">();
	}
	static class UViolator_ActiveFriends_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UViolator_ActiveFriends_C>();
	}
};
static_assert(alignof(UViolator_ActiveFriends_C) == 0x000008, "Wrong alignment on UViolator_ActiveFriends_C");
static_assert(sizeof(UViolator_ActiveFriends_C) == 0x000290, "Wrong size on UViolator_ActiveFriends_C");
static_assert(offsetof(UViolator_ActiveFriends_C, UberGraphFrame) == 0x000228, "Member 'UViolator_ActiveFriends_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UViolator_ActiveFriends_C, Reset_Off) == 0x000230, "Member 'UViolator_ActiveFriends_C::Reset_Off' has a wrong offset!");
static_assert(offsetof(UViolator_ActiveFriends_C, Update_Down) == 0x000238, "Member 'UViolator_ActiveFriends_C::Update_Down' has a wrong offset!");
static_assert(offsetof(UViolator_ActiveFriends_C, Update_Up) == 0x000240, "Member 'UViolator_ActiveFriends_C::Update_Up' has a wrong offset!");
static_assert(offsetof(UViolator_ActiveFriends_C, Intro) == 0x000248, "Member 'UViolator_ActiveFriends_C::Intro' has a wrong offset!");
static_assert(offsetof(UViolator_ActiveFriends_C, Image_UpdateFlare) == 0x000250, "Member 'UViolator_ActiveFriends_C::Image_UpdateFlare' has a wrong offset!");
static_assert(offsetof(UViolator_ActiveFriends_C, SocialIcon) == 0x000258, "Member 'UViolator_ActiveFriends_C::SocialIcon' has a wrong offset!");
static_assert(offsetof(UViolator_ActiveFriends_C, Text_ActivePlayerCount) == 0x000260, "Member 'UViolator_ActiveFriends_C::Text_ActivePlayerCount' has a wrong offset!");
static_assert(offsetof(UViolator_ActiveFriends_C, Text_DeltaChange) == 0x000268, "Member 'UViolator_ActiveFriends_C::Text_DeltaChange' has a wrong offset!");
static_assert(offsetof(UViolator_ActiveFriends_C, YellowBox) == 0x000270, "Member 'UViolator_ActiveFriends_C::YellowBox' has a wrong offset!");
static_assert(offsetof(UViolator_ActiveFriends_C, Text_PlayerCount) == 0x000278, "Member 'UViolator_ActiveFriends_C::Text_PlayerCount' has a wrong offset!");

}

