#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VoiceChannelChangePopup

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass VoiceChannelChangePopup.VoiceChannelChangePopup_C
// 0x0060 (0x0360 - 0x0300)
class UVoiceChannelChangePopup_C final : public UFortVoiceChannelChangePopup
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0300(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       AmbientIconPulse;                                  // 0x0308(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_Mic;                                         // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MicPulse;                                          // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FName                                   M_Param_ColorA;                                    // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   M_Param_ColorB;                                    // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   M_Param_Progress;                                  // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ColorB;                                            // 0x0338(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ColorA;                                            // 0x0348(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CollapseOnAnimationFinish;                         // 0x0358(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_VoiceChannelChangePopup(int32 EntryPoint);
	void OnPlayCloseAnimation();
	void OnPlayOpenAnimation();
	void Popup_Animation_Finished();
	void PreConstruct(bool IsDesignTime);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"VoiceChannelChangePopup_C">();
	}
	static class UVoiceChannelChangePopup_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoiceChannelChangePopup_C>();
	}
};
static_assert(alignof(UVoiceChannelChangePopup_C) == 0x000008, "Wrong alignment on UVoiceChannelChangePopup_C");
static_assert(sizeof(UVoiceChannelChangePopup_C) == 0x000360, "Wrong size on UVoiceChannelChangePopup_C");
static_assert(offsetof(UVoiceChannelChangePopup_C, UberGraphFrame) == 0x000300, "Member 'UVoiceChannelChangePopup_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UVoiceChannelChangePopup_C, AmbientIconPulse) == 0x000308, "Member 'UVoiceChannelChangePopup_C::AmbientIconPulse' has a wrong offset!");
static_assert(offsetof(UVoiceChannelChangePopup_C, Image_Mic) == 0x000310, "Member 'UVoiceChannelChangePopup_C::Image_Mic' has a wrong offset!");
static_assert(offsetof(UVoiceChannelChangePopup_C, MicPulse) == 0x000318, "Member 'UVoiceChannelChangePopup_C::MicPulse' has a wrong offset!");
static_assert(offsetof(UVoiceChannelChangePopup_C, M_Param_ColorA) == 0x000320, "Member 'UVoiceChannelChangePopup_C::M_Param_ColorA' has a wrong offset!");
static_assert(offsetof(UVoiceChannelChangePopup_C, M_Param_ColorB) == 0x000328, "Member 'UVoiceChannelChangePopup_C::M_Param_ColorB' has a wrong offset!");
static_assert(offsetof(UVoiceChannelChangePopup_C, M_Param_Progress) == 0x000330, "Member 'UVoiceChannelChangePopup_C::M_Param_Progress' has a wrong offset!");
static_assert(offsetof(UVoiceChannelChangePopup_C, ColorB) == 0x000338, "Member 'UVoiceChannelChangePopup_C::ColorB' has a wrong offset!");
static_assert(offsetof(UVoiceChannelChangePopup_C, ColorA) == 0x000348, "Member 'UVoiceChannelChangePopup_C::ColorA' has a wrong offset!");
static_assert(offsetof(UVoiceChannelChangePopup_C, CollapseOnAnimationFinish) == 0x000358, "Member 'UVoiceChannelChangePopup_C::CollapseOnAnimationFinish' has a wrong offset!");

}

